{"6986":{"abstract":"The automatic and efficient recognition of genes in DNA sequences is now widely recognized as a central problem in computational molecular biology. This research project uses the gene recognition problem in databases of gene sequence data as a driver for research in machine learning. It builds on several promising recent results, investigating decision tree methods, memory-based reasoning, and hidden Markov models. Each of these approaches has particular strengths. Recent research by the PI has found that decision trees can achieve consistently higher accuracy that any previous methods for finding protein coding regions in very short DNA subsequences. Embedding of the decision tree approach in a dynamic programming algorithm can be used to produce a more general system. The techniques discovered to be most effective will be incorporated into a complete gene finding system that can identify genes with high accuracy, augmented with a user-friendly interface, and made freely available to the biology and computer science research communities.","title":"Finding Genes in DNA using Machine Learning Algorithms","awardID":"9530462","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["538208"],"PO":["565227"]},"7426":{"abstract":"The research focuses on developing millimeter-scale robotic tools with force feedback and tele-taction for performing tissue manipulation for minimally invasive remote surgery. Key elements of the project are: (1) prototyping of millimeter-scale robotic hands for teleoperation in minimally invasive procedures; (2) modeling and manipulation of compliant tissue; and (3) millimeter scale teletaction. The research program will be carried out on a telesurgical workstation incorporating millimeter-scale robots equipped with force and tactile sensing, larger positioning robots for holding the instruments, and a surgical interface including a bi-manual surgical master with tactile displays and force feedback . For the purposes of training and procedure rehearsal, the surgeon will be able to try out his\/her actions on the surgical master using the simulator before implementation. In the first year of the project, surgical procedures like blunt dissection, catheterization, suturing and anastomosis will be explored. In the second year the system prototypes will be tested on procedures such as dissection of the peritoneum and suturing of ex-vivo stomach tissue. In the third year, a complex procedure, known as Nissen undoplication to control stomach reflux, will be tried as proof of the entire system.","title":"Millirobotics for Tissue Manipulation in Minimally Invasive Telesurgery","awardID":"9531837","effectiveDate":"1996-08-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["420868","526900"],"PO":["179262"]},"7316":{"abstract":"This is an interinstitutional collaborative project. Combinatorial data consisting of sequences, trees, and graphs arise in many scientific disciplines. For example, the primary structure of proteins is a sequence, whereas the tertiary structure is a graph. Comparing such data to find similarities entails the use of a \"distance metric\" that mea sures the difference between two data items. Numerous distance metrics are possible. This work consists primarily of (i) inventing efficient ways to compute known distance metrics; (ii) developing a data structure to decide which of a set of data items is \"closest\" (according to a given distance metric) to a new data item; (iii) techniques and s oftware for discovering patterns with minimum or near-minimum distance to a given set of data items with respect to a given distance metric; and (iv) software to solve such discovery problems on networks of occasionally idle workstations. This work will help every field in which approximate matching is important. Significant applications are expe cted to molecular biology and rational drug design, as well as to finding patterns in linguistic strings.","title":"Pattern Discovery in Combinatorial Databases: Algorithms, Applications, and Software for the Scientific Community","awardID":"9531554","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["563679"],"PO":["563751"]},"12909":{"abstract":"IRI-9616131 Nandhakumar, N. University of Virginia $49,996 - 12 mos SGER: Discovery Driven Manipulation of NonRigid Objects: Representation, Sensing and Planning This award, in the SGER mode, funds an initial exploration of machine discovery of motor coordination skills through sensory input. Recent psychophysical studies have revealed that humans can discover proper motor coordination skills through sensory input for tasks in which they have had no previous experience. The PIs are currently developing a spatial Jacobian-based framework for the design of robotic, nonrigid object manipulation strategies which emulate this human ability. Unlike existing algorithms, the strategies derived using this framework do not require the use of a priori deformation models since the necessary object parameters are learned during the process. Since the spatial Jacobians of an object are spatially dependent,the critical obstacle in the framework's continued development is determining the amount of information which must be recovered in the learning or discovery phase of the algorithms for accurate reconfiguration. For general flexible objects, the spatial Jacobian sets will be quite large and not efficiently learnable. Thus, in this preliminary research we will determine what subsets of spatial Jacobians must be obtained by the process to move the object from an initial state to a final state within an acceptable positional error. An experimental investigation will also determine the possibility of creating a set of canonical shapes to reduce the configuration space size as well.","title":"SGER: Discovery Driven Manipulation of NonRigid Objects: Representation, Sensing and Planning","awardID":"9616131","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[32722,"301560",32724],"PO":["125480"]},"6602":{"abstract":"9529145 Sidhu Telenix Corporation - \"Simulation and Analysis of Mobile-IP Protocol\" This award supports a one year project to conduct simulations of mobile-IP and present the results through the Internet Engineering Task Force to designers of mobile-IP software. The purpose is to provide data to assist in understanding the mobile-IP environment to guide implementations now in preparation. It is aimed primarily at IPv4, though the results will be useful for IPv6 as well.","title":"Simulation and Analysis of Mobile-IP Protocol","awardID":"9529145","effectiveDate":"1996-08-15","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[16194],"PO":["57343"]},"6603":{"abstract":"","title":"Engineering Research Center for Integrated Media Systems Center","awardID":"9529152","effectiveDate":"1996-08-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1480","name":"ENGINEERING RESEARCH CENTERS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}}],"PIcoPI":["293075","169805","551900","233683"],"PO":["564949"]},"5437":{"abstract":"Coming Broadband Integrated Services Digital Networks (B-ISDNs) will be required to carry a broad range of traffic classes ranging from bursty, variable-rate sources, such as voice and variable-rate coded video, to smooth constant bit rate sources. Moreover, these networks will have to do so while providing a guaranteed quality-of-service (QoS) to these traffic classes. The problem of characterizing the performance of such networks is thus particularly important since this must be done, not only during the network design (in an off-line manner) but also for on-line control purposes such as call admission control. In this proposal we describe a novel technique for evaluating network performance based on the use of Global Rational Approximations (GRA) which has the potential of providing accurate estimates for a variety of performance measures such as packet loss probability in a wide variety of network settings. We outline research on GRAs whose aim is to develop a solid theoretical foundation on which the proposed algorithms can rest and to develop practical techniques for estimating network performance both during the design phase and in a real-time setting. Specifically, we propose to develop a complete theoretical foundation on which to develop algorithms for obtaining accurate global rational approximations for a variety of quality-of-service (QoS) metrics such as packet loss probability and probability that packet delay exceeds a particular value and to develop practical algorithms which can be used to evaluate large B ISDNs.","title":"A Rational Approximation Method for Efficient Calculation of QoS measures in High Speed Networks","awardID":"9523807","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["545655","526867"],"PO":["150490"]},"9925":{"abstract":"*** 9600400 Goldberg Support will continue for a broad-ranging research program at the Santa Fe Institute. The focus of the research is the study of complex adaptive systems in different areas of science, ranging over the biological, social, physical, mathematical, and computational sciences. Researcher from a number of institutions and areas of study will conduct collaborative research both at the Santa Fe Institute and at their home institutions. In addition, partial support will be provided for the annual Complex Systems Summer School. ***","title":"A Broad Research Program in the Sciences of Complexity","awardID":"9600400","effectiveDate":"1996-08-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1320","name":"ECONOMICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1333","name":"METHOD, MEASURE & STATS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["429234","224067","124550",24883],"PO":["125898"]},"4899":{"abstract":"9521790 Schwartz This project connects the Institute of American Indian Arts to the Internet over a 56Kbps line. Faculty and students at the Institute benefit from access to the resources of the Internet, including libraries and art collections. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of artistic and educational projects. The award provides partial support of the project for two years.","title":"The Institute of American Indian Arts Internet Connection","awardID":"9521790","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11959],"PO":["121202"]},"6538":{"abstract":"This research investigates the generation of manufacturing tests for highly sequential VLSI circuits. The approach is based on combining the best features of deterministic and simulation based techniques. Deterministic techniques are mainly used to (1) identify untestable and redundant faults and (2) to correct the direction of the simulation based search. Simulation based test vector generation examines a set of test vectors to determine a new test sequence to detect some faults. This process, while accurate and fast, generates longer than necessary test vectors. The technique being explored is detecting and correcting the genetic search, using deterministic ATPG. This process involves an intricate exploration of the power of a switch-level logic and fault simulator in an combination with a genetic algorithm and the deterministic ATPG during the test generation process. The technique is being applied to design problems such as, circuit partitioning, initial test set finding, and circuit initialization- structure to determine performance and quality of generated test sets.","title":"An Adaptive Approach to Automatic Test Pattern Generation","awardID":"9528931","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[16046],"PO":["321058"]},"17181":{"abstract":"Advances in multimedia computing technologies offer new approaches to the support of computer-assisted education and training within many application domains. Novel interactive presentation tools can be built to enhance traditional teaching methods with more active learning. Since a variety of user interaction styles are possible, research must address the incorporation of such human interaction factors into presentation tools. Under this Research Planning Grant (RPG), the principal investigator conducts preliminary research into the impact of various quality-of-service (QoS) parameters on the various presentation tools that support interactivity functions necessary within digital libraries intended for education or training. The project explores and compares the benefits of various techniques designed to support such functions. The research activities include: (1) the identification of QoS parameters critical to the support of interactive learning and training activities; (2) preliminary experimentation with these parameters and candidate multimedia presentation methods; and (3) the construction of prototype applications to demonstrate the interactive capabilities of learning and tutoring tools. A successful completion of these activities can lead to a more ambitious research plan to investigate interactive techniques for supporting on-line education- and training-oriented digital libraries.","title":"ROW: Developing Interactive Presentation Tools for Educational Digital Libraries","awardID":"9632394","effectiveDate":"1996-08-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["518277"],"PO":["563751"]},"6935":{"abstract":"This project explores two aspects of discrete search:(a) The search for the majority in the set of objects;(b) The search for critical points in an unknown function.In both cases the main tools are detailed analyses of binary decision trees and Kraft's inequality. The goals of the project include the design of, analysis of and the proof of lower bounds for search algorithms. ***","title":"Decision Trees and Discrete Search Problems","awardID":"9530297","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[17022],"PO":["150516"]},"16270":{"abstract":"A structured methodology for validating and verifying behavioral models is being explored. The methodology is adapted from a set of software test and validation criteria, which are based on control and data flow properties of the behavioral model under test. The test criteria are measured by a set of coverage metrics which indicates the types and the locations of untested portions in the model. The methodology includes an adaptive test data generation technique using neural networks. Given the untested portions in the model, effective test data are generated and identified by neural networks to exercise the untested portions. Tools which will provide designers with a quantitative confidence index at the end of their testing and verification efforts are being developed.","title":"Behavioral Level Design Verifications Using Software Testing Techniques and Neural Networks","awardID":"9628770","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["554621","502875","549818"],"PO":["321058"]},"16182":{"abstract":"9628513 Farhat The University of Colorado at Boulder will host the Tenth International Conference on Domain Decomposition Methods in Sciences and Engineering. The Conference is scheduled to be held in summer 1997 on the Campus of the University of Colorado at Boulder. The conference organizers are Professor Charbel Farhat from the Department of Aerospace Engineering Science at the University of Colorado Boulder, Professor Xiao Chuan Cai from the Department of Computer Science at the University of Colorado at Boulder, and Professor Jan Mandel from the Department of Mathematics at the University of Colorado at Denver. The profile of the organizers corresponds to the diverse constituencies of the Domain Decomposition field. The conference is designed to promote the interaction between mathematicians, numerical analysts, physical scientists, engineers, and computer scientists. For this tenth meeting, the focus theme will be High Performance Computing. The conference organizers plan to devote a significant amount of effort on attracting the participation scientists not only from academia and government research laboratories, but also from the computing, simulation software, and key engineering industries. Support will be provided for the active participation of graduate students who will benefit from exposing their research to a diversified audience of potential employers, and from keeping up-to-date with the latest developments in this field.***","title":"10th International Conference on Domain Decomposition Methods in Sciences and Engineering. To be Held at the University of Colorado at Boulder, in the Summer of 1997","awardID":"9628513","effectiveDate":"1996-08-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["292489","517075","517181"],"PO":["44646"]},"12091":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for a DS-3 connection to the Very High Performance Backbone Network Service (vBNS) for Iowa State University and the University of Iowa for two years. Among the applications are nondestructive evaluation modeling, computational fluid dynamics, atmospheric sciences, virtual environments, scalable computing, nuclear magnetic resonance microimaging, and distributed adaptive search systems. Collaborating sites could include the Cornell Theory Center, Maui High Performance Computing Center, NASA Lewis and Langley Research Centers, and the Department of Defense High Performance Computing Center.","title":"High Performance Connections for Research and Education","awardID":"9613871","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["116742","121252",30724,30725],"PO":["121202"]},"15061":{"abstract":"Lambda Calculus is both a mathematical theory of functions and a model of computation. As such it is part of the interface of applied logic and theoretical computer science. As a theory, simply typed Lambda Calculus is part of Church's theory of functions of higher type. Higher type theorem proving reduces questions of validity of sentences to unification and conversion, which are purely equational questions of Lambda Calculus. Lambda Calculus also enters implicitly into the proof theory of type theory via the well known Curry-Howard isomorphism. As a formal model of computation Lambda Calculus contributes to understanding of higher-type and type-free programming constructs. Denotational semantics reduces questions of program synthesis and correctness to finding and verifying solutions to certain combinatory functional equations. Lambda Calculus also enters explicitly into the syntactic foundations of applicative programming languages as a paradigm of sequential computation. In short, Lambda Calculus enters both explicitly and implicitly into the theory of highertype theorem proving and the theory of programming languages. Lambda Calculus is the study of certain computation rules, programs, or algorithms. This research singles out those rules whose execution depends only on the fact that some of the data are themselves computation rules of the same sort. It is not immediately obvious that there are any non-trivial examples of such rules. The rich deep structure of the Lambda Calculus had to be diacovered by Church, Bernays, Curry, Kleene, and those who followed them. The research focuses on the deep structure of pure Lambda Calculus with at most algebraic types, to address a number of open questions in Lambda Calculus. These include: (1) Is it decidable whether a given finite set of proper combinators forms a basis? (2) Is there a recursive one-step Church Rosser strategy? (3) Is there a uniform universal generator? (4) Is the word problem for all proper com binators of order < 3 decidable? (5) Is the matching problem for the pure simply typed lambda calculus decidable? ***","title":"Lambda Calculus","awardID":"9624681","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[38120],"PO":["561889"]},"12092":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to connect five schools and the school district's administration building to the Internet through a bi-directional fiber optic CATV cable plant using current technology radio frequency cable modems.","title":"Ruidoso Municipal School District Connection to The Internet","awardID":"9613873","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[30727],"PO":["121202"]},"15392":{"abstract":"Reasoning tasks in spatial, temporal, and physical domains often involve quantities at vastly different scales. A cross country trip of three thousand miles begins by backing up the car six feet; the 150 foot Challenger rocket exploded because of a 1\/200 inch gap in the O-rings; the shining of the sun is explained in terms of the interaction of nuclear particles. Automating such reasoning raises issues of representations and inference techniques that do not arise in reasoning at a fixed scale, particularly in cases where the level of detail and the precision of information available varies widely across different components of a single system. A number of different aspects of this problem are under study, including calculi for order of magnitude reasoning; the use of dimensional and structural hierarchies; and the composition of physical theories of different granularity. The result of this research will be a body of tools and techniques for reasoning across multiple scales that can be used in automated physical reasoners over many different domains.","title":"Physical and Spatial Reasoning Across Multiple Scales","awardID":"9625859","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["289878"],"PO":["565227"]},"17482":{"abstract":"9633299 Hiromoto, Robert Boppana, Rajendra University of Texas - San Antonio CISE Minority Institutions Infrastructure: Building an Academic Pipeline for Minority Scholars This project builds a pipeline of minority students, focusing on the retention of qualified undergraduate and graduate students by appropriate financial support and mentoring activities. The goal is to involve students directly in ongoing faculty research projects and thus prepare them for graduate studies and research programs. Graduate minority students involved in the program will help faculty in mentoring undergraduates, in addition to their own studies and research obligations. The project encompasses two main thrust designed to improve the pipeline of minority students prepared for graduate programs. The first goal is to aggressively recruit and develop minority students interested in computer science by providing preparatory training, tutoring, and mentoring at the pre-college and lower-division undergraduate levels. The second goal is to provide upper-division and graduate students with funding support and increased involvement in faculty research in order to improve minority retention and graduate enrollment. Students will be involved in faculty research within five important areas: 1) parallel and distributed algorithm design for applications in high-performance scientific computing 2) software visualization, and program execution monitoring; 3) parallel compiler technology; 4) network routing and scheduling algorithms; 5) parallel and distributed simulation techniques.","title":"CISE Minority Institutions Infrastructure: Building an Academic Pipeline for Miniority Scholars","awardID":"9633299","effectiveDate":"1996-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["297663","525789","164962","297892","563568"],"PO":["297837"]},"18000":{"abstract":"Application software for 100 TeraOps machines be based on the increasing use of component software (libraries, GUIs, problem solving environments) and extensive use of interoperability frameworks (CORBA, OLE, SOM, etc.), producing applications which are complex conglomerates of variegated programs. To support these applications, the machine must present a programmable interface (i.e. efficient shared address spaces and data movement) and scaleable high performance. This project will study a flexible machine architecture that recognizes these technological realities and not only supports advanced software structures, but exploits them to configure its programmable hardware, adapting itself to the application. The programming flexibility can provide a wide range of convenient interfaces, ranging from uniform cache-coherent shared memory, to clusters of smaller shared memory systems, to fully distributed memory. In addition to a range of interfaces, this flexible machine can customize both operations and protocols, exploiting appropriate mechanisms and policies to minimize the critical performance aspect--communication--at all levels of the system. This machine design leverages the wealth of research into optimal architectural mechanisms, customizable cache-coherence, as well as technological advances in interprocedural analysis, programmable hardware, and hardware synthesis technology, to achieve general-purpose high performance.","title":"PDS: A Flexible Architecture for Executing Component Software at 100 Teraops","awardID":"9634947","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Z665","name":"ARPA-NEW MILLENIUM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["556381","457653"],"PO":["179296"]},"15096":{"abstract":"Mobile computing is emerging as an important new paradigm which has the potential to reshape thinking about distributed computing. Mobility has far-reaching implications for what designers and users can assume about communication patterns, resource availability, and application behaviors. Components move from one location to another, joining or leaving groups of other components in their vicinity. New distributed algorithms are expected to be required as the nature of applications shifts with the emergence of this new kind of computing environment. Formal methods have an important role to play in the midst of these developments, both in terms of helping the research community better understand fundamental issues germane to mobile computing and in providing practical solutions to new design problems. Ad-hoc wireless networks (AWNs) supporting context-aware applications are studied in this research. Such networks have practical signifcance for crisis management, communication for small enterprises, and organization of transient collaborations. The somewhat extreme characteristics of AWNs provide a challenging testbed for studying mobile computing. This research examines whether existing models of concurrency can be extended to mobile computing and thus provide appropriate means for the specification, design and verification of mobile systems. It also considers related support system software, such as communication protocols. To accomplish this, the notion of location must play a more central role in the treatment of concurrency, even in cases where the ultimate goal is location-transparency. New forms of modular interaction are investigated in this research. Of particular interest are techniques to gain the advantages of formal methods without the costs of developing formal proofs. Design schemas and patterns with desirable properties are verified once and reused in many applications. ***","title":"Reasoning About Program Interactions in the Presence of Mobility","awardID":"9624815","effectiveDate":"1996-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["384032"],"PO":["150697"]},"19111":{"abstract":"","title":"Parallel Algorithms for Synthesis and Test","awardID":"9696164","effectiveDate":"1996-08-15","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["295247"],"PO":["321058"]},"2869":{"abstract":"The objective of this project is to develop an object-based framework for synchronization and interprocess communication in real-time computer systems. This framework will integrate work on scheduling theory with work on delay-resilient shared objects. The term ``scheduling'' refers to the problem of sequencing tasks on a shared execution unit such that it is possible to determine a priori if the timing requirements of tasks are respected. A variety of scheduling policies will be considered in this project, spanning the spectrum from hard to soft real-time systems. By focusing on delay-resilient shared objects, this project represents a significant point of departure from past work on real-time synchronization. Delay-resilient objects are distinguished by the fact that they are not locked. The notion of a delay-resilient shared object builds upon recent promising work on wait-free and lock-free synchronization in shared-memory multiprocessors. Although such work has been ongoing for several years, this project represents the first comprehensive effort to integrate such objects within an object-sharing framework for real-time computing. From a real-time perspective, the key advantage of delay-resilient objects is that they do not give rise to priority inversions. Traditional object-sharing approaches for real-time systems rely on significant operating system support to deal with this problem. The proposed approach does not require such support, and thus entails lower synchronization overhead than traditional approaches. Another advantage of the proposed approach is that it can be applied across a variety of diverse platforms. Target platforms for this project include uniprocessors, shared-memory and message-passing multiprocessors, and workstation clusters. ***","title":"Object-Sharing Technology for Real-Time Systems","awardID":"9510156","effectiveDate":"1996-08-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["554765","31436"],"PO":["250083"]},"15361":{"abstract":"DMS 9625777 Doksum This research addresses the question of how intuitive and concise linear model concepts and techniques can be extended to nonparametric settings. Nonparametric counterparts of such commonly used linear model ideas as regression coefficients, correlation coefficients, coefficient of determination, and principal components are considered. The research also studies nonparametric techniques for model diagnostics that can be used for dimensionality reduction and to address the question of adequacy of particular models. Both asymptotic and finite sample properties are studied, and the problem of developing reliable data-based methods for smoothing parameter selection for functionals and curves is addressed. %%% With the advent of computer data bases of unprecedented size and complexity and with the dramatic increase in computer power, it has become increasingly more desirable and possible to develop more flexible models, concepts, and procedures that can be used to study relationships between variables and to construct models without relying on rigid global assumptions. Much of the recent work in statistics have addressed this need for more general and flexible methods. This research further extends this work with a special focus on procedures that are counterparts of many commonly used linear model concepts and that expose important features in the data using intuitive and familiar ideas. ***","title":"Mathematical Sciences: Topics in Nonparametric Analysis and Model Building","awardID":"9625777","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["303688"],"PO":["331535"]},"17462":{"abstract":"9633177 Larason, Katherine S Navajo Community College CISE Minority Institutions Infrastructure: Computer Information Systems Programs for The Navajo Nation The goal of the project is to update and expand two-year computing curricula and courses for Navajo students based on regional employment needs, students' educational experience, and recommendations of the Association for Computing Machinery (ACM). Governmental, educational, health services, and private employers in the Four Corners region will be surveyed to assess current and projected needs for information science employees. Survey results will be presented to high school and college information science educators and employers at a Tsaile meeting. The CS and CIS programs at Navajo Community College will be modified and expanded - based on survey findings, recommendations from the meeting, and ACM suggested curricula for two-year programs in computing - to better prepare Navajo students for further education or to find employment in the information industry. The project is significant for several reasons, such as: - including the first survey of information science employment ever done in this area; - establishing communications among high school and college computing educators, and employers that do not currently exist; and - enhancing students' educational and employment prospects","title":"CISE Minority Institutions Infrastructure: Computer Information Systems Programs for The Navajo Nation","awardID":"9633177","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["155008","92590",43910],"PO":["565272"]},"17583":{"abstract":"Rapid prototyping environments provide high-level operations that allow users rapidly to create and modify interactive applications, such as graphical interfaces, scientific and program visualizations, and simulations (i.e., quickly program the Obig pictureO). These environments often sacrifice speed and storage for increased flexibility. Researchers have proposed optimizations that can reduce storage and improve performance. However, the programmer must manually apply these optimizations, which impedes rapid, iterative development of applications. The objective of this project is to develop adaptive, profile-based compilation techniques that automatically apply these optimizations so that the programmer can make use of rapid prototyping techniques while still retaining excellent time and storage performance. Constraints and structured graphics are targeted by this research since studies show that these two techniques facilitate the rapid, iterative development of graphical user interfaces. This project is developing techniques whereby: (1) a profiler monitors operations as they execute and extracts information about constraint evaluation and variable access, and (2) an adaptive compiler uses this information to dynamically implement various performance and storage optimizations. ***","title":"Adaptive, Profile-Based Compilation of Highly Interactive, Graphical Applications by Demonstration","awardID":"9633624","effectiveDate":"1996-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["113018"],"PO":["150697"]},"16285":{"abstract":"This multi-disciplinary SGER project involves collaborative research in the areas of biochemistry, surface chemistry, and algorithm design. The main goal of the project is to develop an approach to computation and information storage, using DNA sequences. Although this approach is both ``novel'' and ``high- risk'', there is a high potential that this new DNA\/biomolecular computing approach will yield ``solutions'' to intractable\/NP-complete problems. To this end, the project concentrates on: (1) Developing and characterizing complex mixtures of DNA molecules attached to surfaces, by characterizing, for the absorbed DNA molecules,(a) the attachment chemistry, (b) the hybridization chemistry, and (c)the enzymatic activity, using a variety of spectroscopic and biochemical methods; (2) Optimizing the use of the manipulations of DNA sequences in developing molecular computing strategies for solving NP-complete problems; (3)Developing new algorithms for solving the NP-complete problems; and (4) Investigating surface-based methods for high density storage and retrieval of information by DNA hybridization chemistry.","title":"DNA Computing and Surface-Based Chemistry","awardID":"9628814","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Z699","name":"ARPA-DNA COMP & SURFACE BASED"}}],"PIcoPI":["545133","471123","369365","183023"],"PO":["150516"]},"17385":{"abstract":"This award is to support the Allerton Conference\/Institute on the uses of digital libraries. The study of how the new resources, tools and services that fall under the rubric of digital libraries are in fact being used is critical to help assure that digital libraries are suitable for the tasks they are meant to support. The objectives for this conference are to increase understanding of digital library needs and uses, to improve participants skills in the conduct of formative and summative digital library evaluations, to share results of digital library use and usability studies, and to provide an opportunity for digital library researchers to meet and lay the foundations for future interactions. These objectives will be met by convening an interdisciplinary group of experts in information system design and evaluation with others currently involved in a wide range of digital library projects. A specific aim is to connect the current Digital Library Initiative projects with similar work conducted around the world. The participants will present and discuss results of their digital library use studies, hold small group working sessions, and demonstrate new user interfaces and online data collection techniques, and conduct roundtable discussions of key research issues.","title":"Conference on Digital Library Use","awardID":"9632939","effectiveDate":"1996-08-15","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[43711],"PO":["503214"]},"17881":{"abstract":"The search for efficient algorithms to produce primes is motivated largely by the needs of cryptologists and number theorists. Many open problems in these areas rely on very large tables of primes for their solution. The Sieve of Erathosthenes is a well known method for generating tables of primes up to a given natural number, N. Significant work has been published that improves on the original sieve to generate primes, some in sublinear time. This project will investigate six variations on the sieve to generate large tables of primes efficiently using parallel architectures. Initial testing and implementation of the algorithms will be based on selected mapping and communication structures that are determined to be optimal. The most effective architecture will be identified for each algorithm. Preliminary data will give insight into the scope of memory limitations that must be addressed in order to generate primes to N = 10^18. Break even points between the various algorithms will be provided because it is important to determine how feasible it is to reach a certain point given a particular algorithm. ***","title":"Parallel Algorithms for Generating Large Tables of Primes","awardID":"9634559","effectiveDate":"1996-08-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[44946],"PO":["187585"]},"16583":{"abstract":"The main objective of this proposal is to develop an integrated approach for increasing the dependability of parallel computers. For detection and diagnosis of hardware faults at the local (node) level, this approach will combine off-line built-in self testing, on-line concurrent checking, and software techniques implementing path and algorithmic-based checks. The aim of this proposal is to develop a systematic method for generating and placing checks into the implementation of an application. For automating the verification process and placement of checks in programs, an interactive tool, VERIFY, will be developed. For estimating the coverage factor provided by these techniques, a software fault-injection tool will be created. Efficient and fast reconfiguration algorithms will be developed for avoiding single and multiple faulty nodes and links. A user transparent software layer will be created for implementing the proposed algorithms. This will be written on top of the existing system software that residents in every node of parallel computing systems. The Software Object-Oriented Fault-Injection Tool (SOFIT) will be ported on the nCUBE and Tandem SeverNet. The recovery time overhead will be estimated in the presence of single and multiple faults injected by SOFIT into the nodes and links of the nCUBE and SeverNet when programs are being executed. A dependability evaluation study will be performed. The objective of this research is to show that this integrated approach can be used successfully for improving the reliability of the nCUBE and SeverNet by an order of magnitude.","title":"Software Implemented Fault Tolerance in Multicomputers","awardID":"9630096","effectiveDate":"1996-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[41727,"130670"],"PO":["197478"]},"15142":{"abstract":"This CAREER proposal addresses new paradigms for exploiting and teaching instruction-level parallelism (ILP). Statically-scheduled microarchitectures achieve high performance by relegating to the compiler the responsibility for detecting and scheduling ILP. Drawbacks to this approach include a lack of object code compatibility between generations, the reliance on program profiles, and the erosion of the individual compilation model. This research will develop new paradigms for ILP that remove the draw-backs by enlisting the OS, the linker, the assembler, the instruction encoding and the microarchitecture. The educational plan will introduce the compiler's role in the undergraduate curriculum as the sophomore and senior levels by developing two courses: \"Introduction to Machine Language Programming\" will be modified to include an awareness of performance issues and the role of the compiler; and a senior level course will be developed to teach back-end ILP compiler optimization. An important feature of this proposal is the training of graduate students in a fundamentally and technologically significant area of ILP. The research and educational activities will use the TINKER Instruction Set Architecture that has been constructed by the principal investigator and his students.","title":"New Paradigms for Instruction-Level Parallel Processors","awardID":"9625007","effectiveDate":"1996-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["517778"],"PO":["197478"]},"16154":{"abstract":"This project focuses on the verification aspect in the development of reliable, fault-tolerant, distributed protocols. High-performance computing technology, such as distributed real- time systems, high-performance memory systems, wide-band I\/O systems, modular operating systems, high-speed network interfaces, commodity workstation clusters, and the like, is reliant on an underlying layer of distributed software (often implemented in hardware), which consists of suites of protocols for check-pointing, communication, coordination, data distribution, recovery, and synchronization of distributed components. These protocols provide a critical software layer for high-performance computing systems. Having such a standardized layer is crucial to interoperability, portability,scalability, and reusability of existing software. Unfortunately, developing reliable software for distributed environments is a notoriously difficult task. Here reliability refers to pre-committed real-time performance, dynamic reconfigurability, security, robustness, and high assurance. The difficulty in producing reliable distributed software is twofold. First, designing reliable distributed software is extremely challenging. Not only does the software have to be free from programming errors, but it also has to be resilient against hardware and software faults. Second, because of the nondeterministic behavior of distributed environment, it is very difficult to verify that the software meets its desired specification. The focus of this project is on the study of algorithms and data structures applicable to the verification of programs. It draws upon ideas and results from logic, graph theory, and automata theory, combining both theoretical and experimental aspects. ***","title":"Development of Reliable Distributed Protocols","awardID":"9628400","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["565263"],"PO":["250083"]},"15693":{"abstract":"This project focuses on developing algorithms for a variety of problems in the theory and practice of scheduling and resource allocation. The project concentrates on: (i) developing improved approximation algorithms for problems in combinatorial scheduling theory; (ii) developing on-line algorithms for resource allocation; and (iii) implementing and testing these algorithms. In particular, the first goal of the project is to develop general techniques for the design of approximation algorithms for NP-hard scheduling problems. These techniques are based on several classes of integer programming formulations, and they have already been applied to yield approximation algorithms for average weighted completion time for a number of constrained scheduling problems. The second goal in this area is to better understand, from the prospective of worst-case analysis, the strengths of these general techniques. The third goal is to investigate approximation algorithms for multi-criteria scheduling problems. The fourth goal is to study on-line scheduling and resource allocation questions, focusing initially on algorithms that provide good average service to a stream of jobs, of different types and priorities, that arrive over time. The outcome of this study is expected to be: (a) a better theoretical understanding of a number of models and optimality criteria and (b) algorithms for a network of workstations and modern parallel computers (such as the IBM SP2).***","title":"Off-Line and On-Line Techniques for Scheduling and Resource Allocation","awardID":"9626831","effectiveDate":"1996-08-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["512465"],"PO":["150516"]},"15352":{"abstract":"The proposed study is concerned with a one-step direct process to fabricate three-dimensional parts using a laser beam. This process is referred to as the Laser-Aided Direct Rapid Prototyping (LADRP). Laser light can melt and\/or vaporize virtually any material and laser tooling leads to the unification of various conventional tools because a laser beam can be used to carry out many different machining operations such as cutting, drilling, welding and milling. Such process integration is very important for the rapid production of three- dimensional parts directly in near net shape. The success of the proposed rapid prototyping process depends on the development of systematic design methodologies and developing suitable digital interfaces between design and manufacturing. The proposed research will carry out experimental studies and develop mathematical models for the LADRP process, and will develop design rule characterization of the LADRP process so that lower- level CAD tools for process planning simulation and verification may be implemented. A layered description language will be developed that can generate the slices of 2.5 D layers for the part from an input file specified in some higher level description language such as the STL or ACIS format.","title":"Design Methodology for Laser-Aided Direct Rapid Prototyping (LADRP)","awardID":"9625752","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[38775,"33013"],"PO":["321058"]},"17596":{"abstract":"The research aims at developing an integrated set of ontological conventions that addresses the needs of experimental sciences. In the researchersO earlier work in developing knowledge models for experimental biology, it was discovered that there were several important areas where the knowledge to be represented poses fundamental challenges to standard ontological frameworks. For example: 1) the traditional part-of hierarchy is ill-suited to model the complex substances and mixtures described in scientific experiments; 2) the primacy of categorization in knowledge representation, which fundamentally defines entities in terms of category membership, is at odds with the need to represent events (such as biochemical reactions) that convert one substance into another. The proposed research will improve the likelihood that ongoing artificial intelligence in knowledge sharing technology will be of benefit to researchers in experimental sciences.","title":"Ontological Foundations for Experimental Science Knowledge Bases","awardID":"9633661","effectiveDate":"1996-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[44248],"PO":["565227"]},"17520":{"abstract":"This research project seeks to demonstrate that fundamental operating system services and resources can and should be represented directly in the natural linguistic structures of advanced programming languages. A component of this effort is to develop aggressive optimisation strategies making this modelling practical and efficient. The central question underlying the research is: how can the benefits of advanced programming languages be brought to bear upon current systems-programming practice? Modern computer applications are most commonly written in C, a language well- known for its lack of support for writing modular, robust programs. C has no module system, allows dangerous \"casting\" of data types, violates abstraction barriers, provides no garbage- collection support for automatic storage management, has no concurrency operators, and generally exposes the details of the underlying machine to the programmer. It is not defined in terms of a mathematically sound underlying semantics. As a result, modern software is fragile, error-prone, and difficult to build, maintain or reuse. Modern programming languages, such as the ML family of languages, provide much more support to the programmer for writing large, robust programs. Unfortunately, these languages are not yet practical tools for implementing real-world systems software. In practice, programs written in these languages are slow, use large amounts of memory, and have awkward interfaces to OS services. Providing access from programs written in these languages to the machine resources, in ways that are natural to the language, should help to address these shortcomings. This research enables new optimisations and makes available new models to the programmer, allowing systems programs to be written that exploit the expressive power of advanced programming languages. A service kernel provides access to the underlying machine resources in a way that is tightly integrated, both in architecture and in implem entation, with advanced languages. The research issue is to investigate the architecture of an operating system that is symbiotic, not with C, but with a modern programming language, and to develop technologies for exploiting the tight integration of the OS and the compiler to provide efficient, high-level services. The kernel is being developed in ML, on two hardware platforms: a bare Intel PC system, and a wireless, mobile \"personal digital assistant\" with limited on-board resources. ***","title":"Programming-Language Structures for Representing and Optimizing Operating-System Resources","awardID":"9633438","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["362708","485691"],"PO":["150697"]},"15111":{"abstract":"Optimization methods based on ideas from statistical physics have been developed to tackle a diverse set of hard problems including image segmentation, data clustering, and graph partitioning. These problems involve the assignment of elements viewed as ``data'' to one of a set of classes, so as to minimize the resulting cost. This project develops a novel extension of physics-based approaches to tackle the important, challenging sub-class of structurally-constrained data association problems, wherein assignments are constrained to agree with a parameterized classification rule such as that of a neural network or decision tree model. Central to the project is supervised learning, including statistical classification and regression\/function approximation. Physics-based learning approaches have the potential to address fundamental learning problems such as convergence to non-global optima, parsimonious modelling, and generalization. Preliminary classification work already suggests that there is great promise for these new methods in outperforming existing learning algorithms. The specific project objectives are of both practical and theoretical significance, as they include development of learning algorithms for widely used classifier structures, investigating parsimonious modelling in part via phase transition analysis, tackling application areas such as speech recognition and condition-based maintenance, and extending the methods to address regression\/function approximation and missing data problems.","title":"CAREER: Supervised Learning by Statistical Physics","awardID":"9624870","effectiveDate":"1996-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["556038"],"PO":["565227"]},"17553":{"abstract":"A critical issue for large-scale systems design and evolution is the choice of an architectural style that permits the integration of separately-developed components into larger systems. Familiar styles include those based on remote procedure call, shared variables, asynchronous message passing, etc. One increasingly important architectural style for system composition is implicit invocation (II). However, there is no established basis for reasoning about II systems. In particular it is difficult to answer questions like: What will be the effect of announcing a given event? Have enough event bindings been declared? Does a given component announce the sufficient events to permit effective integration? If I add a new component to an existing system, will it break the existing system? The goal of this project is to provide such a basis for reasoning about systems designed using the II architectural style. Two central benefits are expected. The first benefit is a step towards being able to reason fully about systems constructed in this style. The second and probably more important benefit is to replace current ad hoc reasoning approaches used by practitioners who use the II style with a collection of sound ideas that allow better informal reasoning about such systems. ***","title":"Foundations for Reasoning About (Practical) Implicit Invocation Systems","awardID":"9633532","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["485947"],"PO":["150697"]},"17564":{"abstract":"This Small Grant for Exploratory Research (SGER), jointly funded by the Theory of Computing (TOC) Program, CCR and by the Informations Technologies Office, DARPA, addresses problems in the new area of Biomolecular\/DNA Based Computation; in particular, in the area of parallel molecular computation (PMC), massively parallel computation at the molecular scale. The goals of this SGER project include:(1) Exploring possible implementations of PMC;(2) Assessing the feasibility of the PMC implementations; (3) Empirically determining the parameters of performance (e.g., time, volume, etc.) of PMC for some set of applications;(4) Doing trial recombinant DNA implementations of such key operations as: (a) parallel memory read and write, and (b) parallel arithmetic on small integers;(5) Planning a study of the implementation of a biological application of PMC with small or at most moderate I\/O and volume requirements. In addition, one of the goals of this SGER award is to foster to facilitate a multidisciplinary effort between the Computer Science Department, the Duke Center for Molecular Diversity and the Microbiology Department of Duke University.***","title":"An Exploratory Study of Parallel Molecular Computation","awardID":"9633567","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Z695","name":"ARPA-STUDY OF PARALLEL MOLECUL"}}],"PIcoPI":["550822"],"PO":["150516"]},"17114":{"abstract":"This project develops methods to scale data mining tasks to large, inherently distributed databases. Meta-learning computes base classifiers by applying learning programs in parallel to database partitions, and then integrates them by another learning process outputting a `meta-classifier`. Meta-learning the correlations of the base classifiers boosts overall predictive accuracy. Efficiency is achieved by parallel processing and reduced serial time per learning process. Meta-learning is scalable by data reduction and parallel processing in hierarchical organizations. We explore, analyze and validate a number of approaches to meta-learning, and deliver demonstrable systems allowing other researchers to directly utilize our results. We develop field tests of the resultant technology by launching `learning agents` over the internet and combine their collective knowledge by `meta-learning agents`. Many defense and commercial applications will benefit from learning new knowledge by integrating and analyzing very large amounts of widely distributed data. One organization working collaboratively on this project is the Financial Services Technology Consortium. The FSTC has defined a realistic application amenable to meta-learning techniques and are providing real datasets and learning tasks. The project participants will demonstrate the efficacy of the proposed approach for fraud detection of electronic transactions in electronic commerce applications of the internet.","title":"Scalable Data Mining by Meta-Learning","awardID":"9632225","effectiveDate":"1996-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["431190"],"PO":["565227"]},"12110":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for a DS-3 ATM connection to the Very High Performance Backbone Network Service (vBNS) for the research institutions in the State of Ohio for two years. It also upgrades an existing OC-3 network between these institutions to OC-12. Among the applications are PhAROh Meta Center Regional Alliance projects, polar-global atmospheric interaction studies, Regional Training Center for Parallel Processing activities, and ATM testbed research. Collaborating sites could include the Cornell Theory Center, National Center for Atmospheric Research and North Carolina State University.","title":"Connection Program","awardID":"9613909","effectiveDate":"1996-08-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[30778,30779,"561947","532762",30782],"PO":["121202"]},"14893":{"abstract":"The focus of this Career Development plan is the development of a new broad-based program in the design of integrated analog systems at Northeastern University. The research component of this plan involves the development of analog processing circuits to be used in integrated circuits containing arrays of sensors or display elements. The main focus of this research is on applications related to electronic imaging. The two main thrusts are; (1) to develop high quality imaging arrays with CMOS technology and (2) to devise focal-plane computational imagers for extracting useful information from the image data. The functions performed by the focal plane processors, which include temporal and spatial differencing and spatial filtering, will have applications in fields ranging from image compression and enhancement to machine vision problems such as tracking and inspection. The educational component of this plan addresses the need to interest and train more engineers in the field of analog design. The major initiatives of this plan include developing an extended analog design project for second and third year undergraduates; incorporating more undergraduates into on-going research; creating a seminar series bringing outside speakers on campus to increase students' awareness of the importance of analog design in real world systems; and developing an advanced graduate course in analog systems aimed both at our graduate research students as well as at engineers in industry who need to deepen their understanding of design principles and techniques.","title":"CAREER: Development of a New Program in Integrated Analog Systems Design at Northeastern University","awardID":"9623907","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[37744],"PO":["564898"]},"16763":{"abstract":"This research will investigate a novel VLSI arithmetic design approach using reconfigurable architectures with shift switching, aimed at achieving an innovative design methodology which could lead to a substantial improvement on both speeds and areas for several arithmetic devices including parallel counters, parallel compressors, parallel multipliers, precharged CMOS adders\/comparators, prefix parallel counters, as well as elementary function evaluations. The proposed technique will employ enhanced reconfigurable buses, i.e., buses containing shift switches with buffers properly inserted. It possesses the following new features. First, when specified digital signals are propagating through shift switching buses, the desired modulo operations can be performed directly, which simplifies the traditional model of this basic arithmetic computation. Second, after passing through each shift switch, the state signals are inverted alternatively in two mutually inverted forms (n and p), which minimizes the load of transistors and maximizes the speed of circuits. The research will focus on the development of enhanced reconfigurable bus-based VLSI schemes for important arithmetic operations. The goals are to investigate: 1. shift switching parallel compressors and conditional compressors; 2. efficient partial product reduction schemes; 3. application-specific array processors for realization of some optimal arithmetic algorithms; 4. various shift switching parallel counter schemes and their applications; 5. shift switching with precharge CMOS domino logic and its applications in designing arithmetic devices and asynchronous arithmetic devices.","title":"Reconfigurable Architectures with Shift Switching for Novel Parallel Arithmetic Schemes","awardID":"9630870","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["134347"],"PO":[42159]},"17764":{"abstract":"Prior research on multiprocessor interconnection networks has primarily focused on the network topology, switching mechanism, and message routing algorithm to maximize network performance. Very little work has been done to study the impact of the communication properties of parallel applications. Communication pattern, message generation frequency, and message size are the three attributes to quantify any communication. The proposed research is aimed at characterizing these communication workloads and analyzing their impact on multiprocessor performance. The research has two major phases. In the first phase, traffic profiling of a wide range of parallel applications will be conducted by collecting execution traces from parallel machines and also from an execution-driven simulator. The communication traces will be analyzed to determine different types of traffic patterns, rate of communication, and volume of communication. The second phase of the project will use these realistic traffic properties for the performance analysis of interconnection networks via simulation and analytic models. In-depth simulation of known unicast and collective routing algorithms on various topologies will be performed with these workloads. Analytical models capturing wormhole switching, virtual channel flow control, routing mechanism and the realistic workloads will be developed. The main contribution of the project is characterizing application workloads to be used for different architectural and algorithmic research. For example, evaluation with these workloads will quantify the actual performance advantages of adaptive routing algorithms, will identify the potential bottlenecks of existing communication mechanisms, and will provide insight for developing application-specific routing algorithms. Next, the new mathematical tools will be more accurate in predicting the realistic communication traffic. The techniques and tools developed in this research can be used in understandi ng and evaluating the interplay between parallel architectures and algorithms to maximize the performance of existing machines and to design better machines in the future.","title":"Application-Driven Network Performance Evaluation","awardID":"9634197","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550859"],"PO":[44638]},"17456":{"abstract":"9633155 Karant, Yasha J. Lin, Frank California State University - San Bernadino (CSUSB) CISE Minority Institutions Infrastructure: Infrastructure Improvement to Increase Access for Minorities to CISE Career The purpose of this NSF CISE MII planning grant proposal is to provide minority students enrolled in the CISE disciplines of Computer and Information Science at California State University, San Bernadino (CSUSB), with facilities to pursue careers in the CISE fields. To achieve this goal, this planning grant will develop an NSF MII proposal and integrate the NSF funding with existing and newly developed funding sources necessary for the proposed quality instruction and improved minority opportunities. These funding sources involve vendor participation and support, including minority owned small business vendors. A number of specific strategic program areas have been identified : -improved minority recruitment and retention into the CISE disciplines, using both the pool of students at CSUSB and recruitment of otherwise unsupported minority students; -upgrades and innovations in curriculum to produce minority graduates with both an industrial and an advanced degree path open to them; -establishment of facilities to teach modern data communications; measures to address the problems faced by minority students with physical disabilities; -means to improve minority student access to facilities from remote (home) sites; and -upgrades to general infrastructure in terms of computers and communications to support these programs","title":"CISE Minority Institutions Infrastructure: Infrastructure Improvements to Increase Access for Minorities to CISE Career Paths","awardID":"9633155","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["82878","235075",43892,"211597",43894],"PO":["557609"]},"17357":{"abstract":"In today's highly interconnected networks there is an increasing need to communicate among databases located at different sites and built using different data models. The interoperability problem is made more difficult by the fact that in many data models there is often an unclear relationship between the actual representations and the abstract meanings of the databases. Hence it is unwieldy to interoperate directly among pairs of those models. However, a clear relationship exists between representation and meaning in constraint databases, which are actually a set of data models parameterized by the types of constraints allowed in the language. This project demonstrates how to express most of the practical temporal and spatial data models using constraint databases and how to solve in this context the interoperability problem. Translations between different data models are expressed as queries in constraint query languages. In addition, constraint query languages serve as a convenient intermediate layer for query translation between different query languages. This project explores the theoretical foundations of constraint-based database interoperability and its practical applications. It will facilitate data sharing and query reuse among different temporal and spatial database applications.","title":"Constraint-Based Database Interoperability","awardID":"9632870","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["214520"],"PO":["563751"]},"17137":{"abstract":"The project adapts and extends an existing block-by-block main-memory garbage collection scheme, called Mature Object Space, for use in collecting persistent object stores. The scheme will locate and reclaim database memory containing no longer accessible data. This will relieve programmers of the burdensome and error-prone task of indicating which memory can be reused, thus allowing better programming styles. The algorithm is the first to work block by block (important for integrating nicely with databases) and to guarantee to find all inaccessible memory. It can also help reorganize (recluster) data and thus improve store performance. The algorithm is incremental, with a coarse granularity (collecting one block at a time). A significant contribution of the research is the algorithm itself. Perhaps more significant will be the implementation and measurement of the algorithm, and investigation of how to incorporate reclustering. The resulting storage management techniques will be suitable for incorporation into practical database management systems, guaranteeing that storage is not `lost` but eventually `found` and `recycled` for further use. The techniques will be substantially independent of storage management policy, allowing policy to be chosen by database implementors and application builders to best suit their needs.","title":"Object Store Garbage Collection","awardID":"9632284","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550864"],"PO":["563751"]},"17159":{"abstract":"It is proposed to develop a simple and clear language for use as a digital interface in Solid Free-Form Fabrication. This language is called \"SIF\" for \"Solid Interchange Format\" inspired by CIF, the Caltech Intermediate Form for LSI layout description. The role of SIF would be to describe the ideal solid part desired, in a fabrication-process-independent way. It is further proposed to create a foundation for some of the key tools needed with such an exchange language, in particular, a robust slicing tool to create 2.5D layers needed for process planning, as well as checker programs that will verify that the shape specified in the SIF file is indeed a closed solid, has the required topological and geometric properties, and specifies only realizable features containing certain minimum feature sizes and separations. Finally, it is proposed to develop test structures of various kinds that will test the robustness of analysis and conversion tools working from SIF input for different SFF fabrication processes and to monitor the quality of individual production runs.","title":"Rapid Prototyping Interface for 3D Solid Parts","awardID":"9632345","effectiveDate":"1996-08-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["457562","504279"],"PO":["321058"]},"15972":{"abstract":"The goal of this research is to develop improved quantization and encoding methods, with direct application to image and video coding. The three main topics of study are i) exploiting interband dependence in subband coding, ii) joint source\/channel coding with applications to image and video transmission over networks, and iii) lossy coding of motion vectors in video coding. Advanced image and video coding methods will be developed to quantize and encode across subbands, with the goal of providing granular gain, classification gain, and entropy gain. Joint source\/channel image and video coding methods will be developed for wireless and packet-switched network applications, with the goal of providing graceful image degradation as the channel bit error rate or the network packet loss rate become large. Methods will be developed for the lossy encoding of the motion compensation vectors used in video coding, with the goal of determining a theory and practical algorithms for the optimum joint lossy coding of the motion compensation vectors and the prediction error.","title":"Advanced Compression Methods for Images and Video","awardID":"9627815","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["328114"],"PO":["150411"]},"12111":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an OC-3 ATM connection to the Very High Performance Backbone Network Service (vBNS). Applications include a Grand Challenge project, \"A Numerical Laboratory for Multi-model, Multi-domain Computational Methods in Aerodynamics and Acoustics;\" Chesapeake Bay Virtual Environment visual model; Interactive Remote Instruction Project; and the Distributed Object Computational Testbed. Collaborating institutions include Argonne National Laboratory, National Center for Supercomputer Applications, University of California-Berkeley, University of Illinois-Chicago, San Diego Supercomputer Center, Cal Tech, and Cray Research, as well as several other Virginia schools.","title":"The Establishment of a High Performance Connection to the vBNS for Old Dominion University","awardID":"9613910","effectiveDate":"1996-08-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["95139","95140"],"PO":["198445"]},"16731":{"abstract":"This project develops and tests new probabilistic approaches to text retrieval. Using the statistical technique of logistic regression, documents are ranked in order of estimated probability of relevance with respect to a query. The methods are subjected to rigorous performance experiments with the collections of documents and queries of the TREC (Text REtrieval Conference) series of conferences sponsored by NIST (National Institute of Standards and Technology) and DARPA (Defense Advanced Research Projects Agency). Specifically the project investigates logistic regression retrieval in the following areas: (1) comparison of different logistic regression retrieval models; (2) new theoretical models which combine intelligent Boolean filtering with logistic regression; and (3) application of the models to Chinese and Spanish language retrieval. This project will advance the progress in modern text and document retrieval by developing sound theoretical models of the retrieval process, models which achieve high performance in experimental tests on millions of documents. The research will contribute to understanding of themechanisms of multilingual retrieval by applying its methodologies to queries and document collections in Chinese and Spanish.","title":"Probabilistic Retrieval of Full-Text Document Collections Using Logistic Regression","awardID":"9630765","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["497618"],"PO":["563751"]},"12045":{"abstract":"IRI-9613737 University of Illinois-Champaign Hutchinson, Seth (Jointly funded with the Office of Cross Disciplinary Activities $50,025 - 36 mos Total award--$100,025) CONACyT: Visual Servo Control of Robotic Systems This award, under the NSF-CONACyT initiative, funds a collaboration with researchers at the Centro de Investigacion Cientifica y de Educacion Superior de Ensenada (CICESE) in Ensenada, Mexico. The goal of the collaboration is to combine expanded research in visual servo control of robotic manipulators at the University of Illinois with research on dynamics and control at CICSE. This should enable consideration of robot dynamics in the design and evaluation of visual servo controllers, thereby yielding active visual systems of more robust design. The research, which has previously focused on geometric aspects, will be expanded to include the system dynamics. The research at CICSE will develop a framework for evaluating a class of visual servo controllers and will also yield a basis for performing rigorous stability analyses. This should lead to new capabilities for engineering robotic systems in which the camera placement and the robot configuration for manipulability can be optimized simultaneously. That could expand the range of potential applications of visual servoing, especially to situations involving moving obstacles and target objects that are moving in the scene.","title":"CONACyT: Visual Servo Control of Robotic Systems","awardID":"9613737","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["421048"],"PO":["475621"]},"15323":{"abstract":"This project explores a new approach to sequencing by hybridization (SBH), which uses interaction to dramatically reduce the number of oligonucleotides for de novo sequencing of large DNA fragments, while preserving the parallelism which is the primary advantage of SBH. The goals of the project include: (1) Development of efficient algorithms for the interactive design of sequencing chips; and (2) Utilization of simulation results to establish that 64kb fragments can be sequenced (obtained using approximately ten rounds of standard-sized 64k oligonucleotide arrays). The project includes the following theoretical and laboratory research in interactive SBH: (a) In a collaborative effort with biochemists at Oxford University, England, algorithmic issues in the design and manufacture SBH arrays, under a variety of fabrication technologies, are examined; (b) Algorithmic issues inherent in reconstructing DNA sequences from hybridization data, under complications such as non-classical chip designs and hybridization errors, are studied; and (c) Algorithmic issues inherent in other novel variations of SBH, particularly photolithography-based interactive SBH and positional SBH, are investigated. This project is jointly funded with the Computational Biological Activity.***","title":"Interactive Sequencing by Hybridization","awardID":"9625669","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["472850"],"PO":["150516"]},"16302":{"abstract":"Paraconsistent information is information that may be incomplete and\/or inconsistent. The goals of this project are to develop data models for representing and manipulating two kinds of paraconsistent information, namely temporal and quantitative. The first is for paraconsistent information that evolves with time, and the second for information involving belief and doubt factors. As part of the project, a declarative programming language based on paraconsistent data objects is developed and implemented. Also, the new data models are applied to existing and newly identified application domains. This project will construct a formal framework and tools for handling information that may have contradictions in it, thereby laying the basis for information systems in diverse areas, such as medical, scientific, business and military applications.","title":"Data Models for Paraconsistent Information","awardID":"9628866","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[41078],"PO":["563751"]},"15004":{"abstract":"The research component of this CAREER grant aims to uncover and develop principles for cooperative information systems (CIS). CIS are multi-agent information systems in which search, enterprise integration, and reactive system approaches are employed, and which are geared toward open information environments. The research goal of this project is to uncover principles of CIS and to realize them in primitives that can be used for building applications in open information environments. Using formal languages for inter-resource constraints, communication and activity behaviors of agents, and classes of CIS computations for applications of interest, a CIS agent toolkit will be built. The educational component of this CAREER grant focuses on the development of courses and supporting technologies based on CIS techniques and principles.","title":"Cooperative Information Systems","awardID":"9624425","effectiveDate":"1996-08-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["565158"],"PO":["495796"]},"17556":{"abstract":"Real-time systems are becoming increasingly important to everyday life. Examples include command and control systems, process control systems, telecommunication systems, patient monitoring systems, flight control systems, robotics, avionics systems, and so on. With increasing computing power and high demand for multimedia applications, larger and more complex real-time systems are being continuously developed. However, the development of real-time systems is difficult and takes longer time than the development of a system without real-time constraints, and a significant portion of the entire effort remains devoted to the maintenance activities of the software life cycle. The concept of software architecture has recently emerged as a new way to improve our ability to effectively construct large- scale software systems. In spite of many attempts to develop architecture specification languages, this area still lacks a solid formal foundation. Without a solid foundation, it is difficult to develop and apply rigorous analysis methods to assure the correctness of real-time software systems as well as to analyze the impacts of changes on various system properties such as safety, consistency, and reliability. This research seeks to develop a formal foundation for an architecture specification language using the integration of non-monotonic logic and temporal logic. The syntax of the language is based on the concepts of object, frames and production rules. This allows developers to easily describe the attributes and constraints of each software component, and also the hierarchical relations among the software components in the software architecture. The goal is to localize changes to software components in the low- level architecture specification and avoid modifying the high- level architecture specification. The semantics of multiple inheritance and exception handling will be established using a non-monotonic logic. Based on the formal foundation of the architec ture specification language, it is expected that new possiblities will exist for analyzing software properties such as liveness, safety, consistency, and temporal constraints. This foundation is also expected to provide a basis for analyzing the impact of changes to a real-time software system. ***","title":"A Formal Approach for a Specification-Based Software Architecture of Real-Time Systems","awardID":"9633536","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Z616","name":"ARPA-EVOLUTIONARY DESIGN COMPL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550555","124951"],"PO":["150697"]},"17446":{"abstract":"Reflection has been explored in an interpreted framework and has tended to assume the availability of particular pieces of the state of a program's interpretation, even the current source code expression. Instead of programs, this research emphasizes computations as the primary elements of reflection. The research has two facets. The first is to formalize and continue the theoretical development of a system for computational reflection that is free from interpreter-based constraints. This system supports the introduction of multiple user-defined reflective properties that can be designed independently and combined in arbitrary fashion. Furthermore, new reflective properties can be introduced after the programs in which they are to be used have already been compiled. The second facet is to explore the many uses of such a system. In addition to the simple, but powerful, uses already explored, the system is expected to be useful for rapid prototyping of language features, collaborative software development, and static analysis of programs for intense optimization. Prior research in programming with first-class contexts has investigated the meaning and use of static meta-level contextual information. The word static here is intended to refer to that information available in the text of a program, without running it. The current research extends the previous work by exploring the meaning and use of dynamic meta-level contextual information, which is that information available in the meta-level of a running process. As in the previous work, this project emphasizes modularity, allowing many different kinds of meta-level knowledge to be utilized simultaneously. ***","title":"Dynamically Extensible Computational Reflection","awardID":"9633109","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y063","name":"DARPA-DYNAMICALLY EXTEN COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y217","name":"DARPA-DYNAMICALLY EXT COMPUTAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Z616","name":"ARPA-EVOLUTIONARY DESIGN COMPL"}}],"PIcoPI":["537808"],"PO":["150697"]},"15268":{"abstract":"The method of Least Squares has been employed successfully to solve problems in many scientific disciplines, including signal processing. The class of fast Recursive Least Squares Algorithms was introduced in order to address certain desirable performance traits, such as computational complexity, tracking, and misadjustment. Although these algorithms have evolved over many years and are widely used in signal processing, a common approach addressing the issue of algorithmic stability has been lacking. This research provides an analysis that fills this critical void in the research and development of these algorithms. Descriptive definitions of stability are being examined which are consistent with current and previous algorithmic analyses. The effects of the forgetting factor - the extent to which prior information is weighted - with respect to matrix perturbation theory and the control and propagation of arithmetic roundoff errors are being studied. This research is also providing useful and insightful gains in the important areas of filter misadjustment, filter tracking, the conditioning of the auto-correlation matrix, and the usefulness of the filter output. This research program joins the science of Numerical Analysis with the science of Signal Processing, providing tools by which algorithms for signal processing can be better designed and used, so that they will give more accurate results.","title":"Stability of Algorithms in Signal Processing","awardID":"9625482","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[38573],"PO":["564898"]},"17358":{"abstract":"In today's highly interconnected networks there is an increasing need to communicate among databases located at different sites and built using different data models. The interoperability problem is made more difficult by the fact that in many data models there is often an unclear relationship between the actual representations and the abstract meanings of the databases. Hence it is unwieldy to interoperate directly among pairs of those models. However, a clear relationship exists between representation and meaning in constraint databases, which are actually a set of data models parameterized by the types of constraints allowed in the language. This project demonstrates how to express most of the practical temporal and spatial data models using constraint databases and how to solve in this context the interoperability problem. Translations between different data models are expressed as queries in constraint query languages. In addition, constraint query languages serve as a convenient intermediate layer for query translation between different query languages. This project explores the theoretical foundations of constraint-based database interoperability and its practical applications. It will facilitate data sharing and query reuse among different temporal and spatial database applications.","title":"Constraint-Based Database Interoperability","awardID":"9632871","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["147262"],"PO":["563751"]},"17248":{"abstract":"Many large corporations find themselves with a massive legacy database problem. Their data is distributed across many semantically related databases that are physically and logically disjoint. Until now, there have been two primary approaches for interconnecting heterogeneous database systems: (a) point solutions, in which software systems supporting focused interconnections between databases are constructed on an as-needed and ad hoc basis; and (b) global solutions, in which a common, logical database is created that encompasses a very large number of databases. (A variation of the latter is the federated approach, which involves a global federation manager that controls all interaction between the component databases.) The Diplomat project chooses a middle ground between these two extremes, and provides technology to support multiple loose database interconnections called `alliances`. The framework also provides mechanisms to enforce consistency between individual databases, and across alliances. The project draws on existing research on view specification, inter-database constraints, and information flow. This research serves as a proof of concept that maintainers of large business applications (such as banking, insurance, and telecommunications) can integrate multiple, heterogeneous, legacy database systems in a cost-effective, evolvable fashion.","title":"Diplomat: A System for Building and Maintaining Heterogeneous Database Alliances","awardID":"9632595","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["389214","164147","263691","79756"],"PO":["563751"]},"11781":{"abstract":"IRI-9612357 This award, in the SGER mode, funds a 24 month exploration of the potential uses of an electronic \"bridle\" mounted on an insect to control its locomotion. The investigation combines research in robotic control and sensing, neurobiology, and microelectromechanical systems engineering, to instrument large insects in such a fashion that signals analogous to those of a laboratory robot may be sensed and commanded at will. The research in this exploration period involves a study of the control strategies used in regulating locomotion, including neural correlates to the locomotion control. Using a combination of empirically and theoretically derived models, the investigators will attempt to \"reverse engineer\" the working behavior of the insect, a Madagascar cockroach, to the point of proposing automatic control strategies that can be implemented on the animal via external stimulus, so that the animal's path and gait can be guided and controlled by human or machine command.","title":"SGER: Micro Instrumentation of Insects for the Study and Possible Control of Gait Regulation","awardID":"9612357","effectiveDate":"1996-08-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1162","name":"COMPUTATIONAL NEUROSCIENCE"}}],"PIcoPI":["542346","527916",29971],"PO":["475621"]},"12134":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years for a T1 wireless connection between the Potsdam Central School and SUNY's residence halls. This arrangement allows them to share a T1 link to the Internet, taking advantage of the high school's use of the link during the day and the university residence halls' use of it during the evenings and nights.","title":"Timesharing T1 Internet Access Through Wireless Technology","awardID":"9613959","effectiveDate":"1996-08-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[30851,30852],"PO":["121202"]},"16512":{"abstract":"This project connects the Iowa Valley Community College District to the Internet over a T1 line. The district consists of two community colleges. Faculty and students at the schools benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Internet Connection Project","awardID":"9629865","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[41559],"PO":["121202"]},"17854":{"abstract":"9634462 Vemuri, Ranganadha Carter, Harold University of Cincinnati Innovation in VLSI Systems Education: Integration of High Level Synthesis, Analysis and Test Generation Research Results into Undergraduate Minor Curriculum in VLSI Systems Engineering This CISE Educational Innovation award supports the integration of research in high-level VLSI synthesis, performance analysis and test vector generation into the undergraduate curriculum in VLSI systems engineering. The model curriculum will contain topics on the development of high-level functional and behavioral modeling of VLSI designs, use of high-level VLSI synthesis techniques and tools, developing and using performance models throughout the design process, and generation of design verification tests. Curriculum support material will include mini-books on these topics, term project modules, and, most importantly, free software tools for high-level synthesis, performance analysis and test generation. All of the curriculum material will disseminated through the Internet and the World-Wide-Web.","title":"Innovation in VLSI Systems Education: Integration of High Level Synthesis, Analysis and Test Generation Research Results into Undergrad Minor Curriculum in VLSI Systems Engineering","awardID":"9634462","effectiveDate":"1996-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0601","name":"Division of edDATA NOT AVAILABLE","abbr":"EDNE"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["67009","258304"],"PO":["565090"]},"17414":{"abstract":"The focus of this research is on interprocedural program analysis; the specific goal of this project is to quantify the tradeoffs between precision and compilation speed for a number of interprocedural analyses. The initial work on this project has focused on implementing a flow-sensitive interprocedural pointer alias analysis. The current activities on this project are aimed in the following three directions. (1) A flow-insensitive interprocedural pointer alias algorithm will be implemented. The tradeoffs in precision and efficiency between this algorithm and the flow- sensitive variant will be quantified. (2) A sparse representation of alias information will be developed that avoids storing redundant information at the cost of retrieving it during an alias query. (3) Experiments will be conducted to demonstrate the effectiveness of this representation. A natural extension of a flow-sensitive pointer alias analysis for C++ type analysis will be implemented. Experiments will be conducted to demonstrate its effectiveness and compare it to previous work. ***","title":"New Paltz Interprocedural Compiler","awardID":"9633010","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[43785],"PO":["150697"]},"15247":{"abstract":"The goal of this project is to develop a domain-independent method to search multimedia databases by content, e.g., to find video clips that are similar to a news broadcasting session in a collection of video clips. The approach extracts N numerical features from each object, effectively mapping the object into a point in N-dimensional space. Then, highly fine-tuned, off-the-shelf, spatial access methods (like R-trees) are used to cluster the data and to search very quickly for similar objects, that is, nearby points in the N-d space. This approach is generic and can be used for any database of multimedia objects, as long as appropriate features can be derived. The specific applications in this project are: (a) natural and medical images, with state-of-the-art signal processing methods, like wavelets and morphology, and (b) voice and related time sequences that include time-warping and Hidden Markov Models (HMM). Applications of such a system are numerous, including computer aided medical diagnosis and teaching (by using similarity search on older, expertly diagnosed medical images), queries on video by content (in art, entertainment, or journalism applications), and similarity searching in financial and scientific time sequences (for data mining, decision support, and forecasting).","title":"Fast Searching of Multimedia Objects by Content","awardID":"9625428","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["548220"],"PO":["563751"]},"17557":{"abstract":"The objective of this project is to provide a flexible framework for supporting multiple time granularities. The targeted use of the framework is for automatic evaluation of user queries and for discovering temporal patterns (i.e., data mining) in an environment where either the user queries or temporal patterns involve granularities that do not match the granularity of the stored data. The basic idea is to add the necessary functionalities so that the database system is able to understand and reason about information involving multiple time granularities. Algorithms for efficiently evaluating user queries and discovering temporal patterns will also be investigated, and an experimental prototype will be built. The impact of this research should be twofold: Firstly, the proposed framework should provide the basic tools for database systems to support flexible user queries, which would free users from the unnecessary tasks of writing complex queries or changing their pattern descriptions to fit the specific granularity used to store temporal data in the database. Secondly, the optimization techniques explored should provide strategies and algorithms for efficient evaluations of queries and discovery of temporal patterns. The proposed experimental work should provide insights into the subject and into the practicality of the proposed theory as well as methods.","title":"Supporting Multiple Time Granularities in Query Evaluation and Data Mining","awardID":"9633541","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["540637","427499"],"PO":["563751"]},"15842":{"abstract":"This projects explores problems in the area of approximation algorithms, with emphasis on two themes: (1) Primal-dual schema based on approximation algorithms; and (2) Approximation algorithms for problems in network design. First, several problems are investigated that appear to have ``optimal'' approximate solutions using primal-dual schema, including generalized Steiner network problem, integral multicommodity flow and multicut in trees, the set cover problem, and the k-minimal Steiner tree problem. The second goal of the project is to provide ``good'' approximate solutions to problems, identified by AT&T Bell Labs and Bellcore, in the area of implementation and maintenance of low-cost broadband networks.***","title":"Two Themes in Approximation Algorithms: Use of the Primal- Dual Schema, and Problems in Network Design","awardID":"9627308","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["516928"],"PO":["150516"]},"15402":{"abstract":"9625880 Mills Kellogg Community College requests support from NSF for connection to the MichNet. MichNet, a midlevel network in the in the Michigan area, will provide operations management and information services and it will give the campus access to the Internet, a collection of interoperable networks connecting most research and education organizations in the United States. The campus needs the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Kellogg Community College as well as the community in general.","title":"Connection of Kellogg Community College to MichNet and NSFNET","awardID":"9625880","effectiveDate":"1996-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[38901,38902],"PO":["57343"]},"12388":{"abstract":"Today, all areas of technology use signal processing. The applications range from adaptive coding of speech signals, to analysis of medical images, to echo- canceling in cellular telephones. The successful implementation of signal processing algorithms in both software and hardware is a result of research into various aspects of signal processing, including analysis, modeling, synthesis, algorithm development, tool development, and implementation. This workshop in intended to bring together a distinguished group of research scientists and educators to explore the expanding role of signal processing within applications that include the telecommunications infrastructure and the expanding information highway. The workshop will meet for 3 1\/2 days to assess and document recent advances and current and future research directions in signal processing. During this time we expect to prepare recommendations for research activities and to initiate a debate on the future directions of the field from among the research community. Participants will be drawn from academia, industry, and companies whose products include significant signal processing components. The goal of the meeting will be to develop a vision statement for the field and determine areas which have the potential for high payoff in terms of application areas. The participants will also discuss ways of integrating signal processing research results and applications into the undergraduate engineering curricula - \"the integration of research and education.\" Another important topic will be the discussion of ways to promote public awareness of the pervasive role of signal processing.","title":"Workshop on Future Research Directions for Signal Processing Research, August, 1996, Durango, CO","awardID":"9614719","effectiveDate":"1996-08-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[31477],"PO":["564898"]},"17833":{"abstract":"This is a 12 month Research Planning Grant award under the Research Planning Grants and Career Advancement Awards for Women Scientists and Engineers Program. The goal of this planning grant is to perform preliminary investigations and experiments into the integration of multiple autonomous agents in solving resource-constrained project scheduling problems, with the aim of developing a competitive NSF proposal. The core problem is how to effectively build a schedule for a project comprising a number of activities that are linked by precedence relations and multiple resource restrictions. When cash flows exist in the form of initiation expenses and progress payments, the development of schedules that maximize the net present value of the project is of considerable practical importance. This research explores the potential for integrating a probabilistic combination model and a meta-heuristic search control strategy in solving the practical problem of project scheduling with cash flows. It also investigates the potential for researching how multiple intelligent agents interact in a decision support environment for combinatorially difficult problems.","title":"PLANNING GRANT: Improving Net Present Values of Projects with Agents Integration","awardID":"9634383","effectiveDate":"1996-08-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["503360"],"PO":["495796"]},"14687":{"abstract":"This awards supports the research of Professor M. Stillman to continue the development of Macaulay 2. This system will enable large scale research computing projects dealing with systems of polynomial equations in many variables. He also hopes to work on the relationship of syzygies of a projective variety to the geometry of the variety. This research is in the field of algebraic geometry, one of the oldest parts of modern mathematics, but one which blossomed to the point where it has, in the past 10 years, solved problems that have stood for centuries. Originally, it treated figures defined in the plane by the simplest of equations, namely polynomials. Today, the field uses methods not only from algebra, but also from analysis and topology, and conversely it is extensively used in those fields. Moreover it has proved itself useful in fields as diverse as physics, theoretical computer science, cryptography, coding theory and robotics. The software being developed here will make many previously difficult or impossible computations in this field possible.","title":"Mathematical Sciences: A Software System for Algebraic Geometry Research","awardID":"9623232","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["442849"],"PO":["256494"]},"17855":{"abstract":"9634470 Ranka, Sanjay, Ritter, Gerhard University of Florida CISE Educational Innovation: Mainstreaming Parallel and Distributed Computing in the Computer Science Undergraduate Curriculum This CISE Educational Innovation project incorporates the latest research in parallel and distributed computing into core courses in the undergraduate computer science curriculum. It introduces students to important concepts in these areas and demonstrates both theoretically and practically their usefulness in a wide variety of application areas. The basic parallel and distributed computing concepts are integrated into several existing courses including those on simulation, computer vision, operating systems, numerical analysis and databases. Investigators from Research Centers at the University, including the centers on Database Systems, Computer Vision and Visualization, Software Engineering, and Parallel Computing are involved in this Educational Innovation Project.","title":"CISE Educational Innovation Program: Mainstreaming Parallel and Distributed Computing in the Computer Science Undergraduate Curriculum","awardID":"9634470","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["485106","96026","530024","559638",44883],"PO":["297837"]},"15204":{"abstract":"This project investigates basic research in computational geometry that is well-motivated by applications in geometric computing. Specific focus is given to the construction and maintenance of geometric structures, as well as methods for efficiently searching in such structures, with principle motivating applications coming from computational metrology, computational graph drawing, and geometric information retrieval. Emphasis is placed upon the design of algorithms for single processors as well as methods for exploiting coarse-grain parallelism such as exists in systems with parallel disk arrays or clusters of workstations. ***","title":"Application-Motivated Geometric Algorithm Design","awardID":"9625289","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["521484"],"PO":["187585"]},"12520":{"abstract":"*** 9615071 Perona The project is an investigation of social reactivity, intention, and relationship in close-coupled interaction of people and computer-based, biologically-motivated agents. It will result in the creation of a virtual social environment of social agents, with visualization and with real-time human-computer interaction. An agent model, whose parallel and modular structure is based on the architecture of the primate brain, will be implemented to function interactively and in real-time. An interface to human participants will be implemented consisting of real-time visualization and real time input devices including an advanced, six-degree-of freedom tracker ball. Social agents will react to each other socially, with their intentions observed and their affiliative relations assessed by the other social agents. Observed behaviors and subjective experiences of human participants will be reported. Although the fundamentally social nature of people is well known, the effects and results of this social nature in cooperating with computers and multiple automated agents are little understood. Affiliation, group-belonging, a sense of social solidarity, and the attribution of intention are key in facilitating cooperation and learning in multi-agent activity with human participants. This project makes important first steps toward understanding, modeling, and providing experimental infrastructure for the study of these phenomena. ***","title":"A Real-Time Human-Coupled Maultiagent System with Reactive Social Organization, Based on Biological Principles","awardID":"9615071","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["517415"],"PO":["503214"]},"14852":{"abstract":"The project is to pursue ongoing investigations into core areas of computational geometry, in particular, cell decomposition, mesh generation, multidimensional searching, and geometric optimization. The research will span the spectrum from the theoretical (e.g., lower bounds, geometric sampling techniques, derandomization) to the practical (implementation and distribution of geometric software). Progress in the field has been hampered by the difficulty in testing out new geometric ideas on a computer. As a result, experimentation has often taken a backseat to theoretical research. Essential to this project is the building of software tools (e.g., algorithm animation, visual debugging, test data generation) that facilitate and encourage the use of experimentation. ***","title":"Design and Experimentation in Geometric Computing","awardID":"9623768","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["450650","213809"],"PO":["187585"]},"17603":{"abstract":"9633675 Narang, Hira Letton, Alan Tuskegee University CISE Minority Institutions Infrastructure: The Establishment of Infrastructure for High Performance Computing Program (HPCP) for Teaching and Research at Tuskegee This minority institution infrastructure grant proposes to establish research infrastructure in High Performance Computing (HPC) involving students and faculty of Tuskegee University with scientists and researchers of Oak Ridge and Argonne National Laboratories. To sustain and invigorate the proposed research infrastructure, three supportive components are proposed: - Computing Facilities Component - Education and Training Component, and - Summer Programs Component The computing facilities component proposes to provide the high performance computing facilities consisting of workstations and high-end PCs, as well as necessary software tools, to support both applicative and fundamental research in high performance computing. The Education and Training component proposes to develop students and faculty interests and skills in high performance computing methodology through structured courses, seminars, workshops, and hands-on training in the usage of high performance computing machinery at national laboratories. The Summer Programs Components envisages bringing high school students, from 9th through 12th grade levels in varying periods of summer, and train them in problem solving as well as internet access and multi-media applications. The additional objective of this component is to intensively involve undergraduate\/graduate students and faculty in high performance computing research through summer programs at national labs. ***","title":"CISE Miniority Institutions Infrastructure: The Establishment of Infrastructure for High Performance Computing Program(HPCP)for Teaching and Research at Tuskegee","awardID":"9633675","effectiveDate":"1996-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["361062","266984"],"PO":["146304"]},"15304":{"abstract":"Three research projects in nonlinear optimization will be undertaken; they range from theoretical studies of constrained optimization algorithms to the development of a network-based optimization system capable of solving problems automatically over the Internet. The first project is devoted to the design of limited memory approaches for large-scale nonlinear programming. Limited memory methods have proved to be quite useful for solving many classes of large unconstrained problems, but their economy and simplicity have not been fully exploited in the nonlinearly constrained case. The basic guiding principle in this work is to employ only algorithms with modest computational requirements and to represent limited memory matrices in compact form, so that the overall cost of the iteration is only a fraction of that required by the standard Sequential Quadratic Programming iteration. The new algorithms will allow the user to choose between direct and iterative methods for solving the linear subproblems arising in the iteration. The second project is devoted to the design and analysis of interior-point methods for nonlinearly constrained (non-convex) optimization problems. This is a long term research effort that first aims at identifying the crucial ingredients of the algorithms, such as the choice of model, the function, and the numerical techniques for solving the (ill-conditioned) subproblems. The new methods will be formulated in a trust region framework, which allows a uniform treatment of the convex and non-convex cases. The research will be guided by a combination of numerical testing and convergence analysis. An Internet-based optimization system called NEOS has recently been developed by a group of investigators at Northwestern and Argonne. One of the objectives of NEOS is to allow users to solve optimization problems remotely and with minimal effort using modern web browsers. The third project in this proposal considers extending the capabilities of NEOS so that it can interact with modern modeling languages. A new constrained optimization server will also be developed. ***","title":"Nonlinear Optimization","awardID":"9625613","effectiveDate":"1996-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["517236"],"PO":["187585"]},"16404":{"abstract":"This research is on a data structure, Pseudo-Symmetric Binary Decision Diagrams (PSBDDs), for completely specified Boolean functions. It is based on Ordered Binary Decision Diagrams (OBDDs) and symmetric networks. The structure of an OBDD for a totally symmetric function is used as a model for PSBDDs. The Shannon expansion is used to generate the vertices of PSBDDs. There is a join operation which combines two adjacent vertices such that the function is represented as a pseudo-symmetric network instead of a binary tree. The research consists of: a) developing a PSBDD package with four types of symmetry; b) investigating the best heuristic for variable ordering, and ordering sets of symmetric variables; c) comparing mapping results for large functions between PSBDDs and BDDs; d) developing strategies for efficient generation of PSBDDs for incompletely specified functions; e) developing diagrams using Davio I and Davio II expansions; and f) suggesting new architectures for Cellular-Architecture type FPGAs which are design-automation friendly.","title":"Pseudo-Symmetric Binary Decision Diagrams (PSBDDs)","awardID":"9629419","effectiveDate":"1996-08-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["125027"],"PO":["321058"]},"17504":{"abstract":"9633385 Klein, Gould and Brower This is a new award which is funded jointly by the Office of Multidisciplinary Activities\/MPS, and the Divisions of Materials Research, Mathematical Sciences and Advanced Scientific Computing. An integrated theoretical and computational investigation will be made of the structural properties of fragile glass-forming liquids and the relation of this structure to the mechanisms of relaxation. Glasses have become an increasingly important class of materials in several new technologies. They possess advantages such as light weight and ease of processing, but suffer from degradation through creep, fatigue, and embrittlement. To understand these mechanisms, it is necessary to understand the structure of glasses and how they relax. At present, experiments can provide information about relaxation processes in glasses, but do not yield much information about their structure or relation of this structure to the relaxation mechanisms. In contrast, computer simulations can provide information about structure, but only on relatively short time and length scales. Moreover, theoretical understanding of glasses is in a relatively crude state. In this research, a sequence of models will be studied beginning with a mean-field model of a glass-forming liquid and proceeding via various approximation methods to include non-mean-field effects. Several parallel computer architectures will be used to extend the size and the time scale of the systems simulated. The simulations will be based on an efficient message passing molecular dynamics program, and by more speculative methods based on Fourier acceleration algorithms and on cellular automata models. The results of the theoretical investigations and computer simulations, in conjunction with ongoing laboratory experiments at Boston University and other locations, will facilitate an understanding of the relation between the relaxation observed experimentally in deeply supercooled liqui ds and glasses and the existence of structures seen in computer simulations. Understanding of this relation will make it possible to use the structure of glasses to predict their temporal evolution. The research will be done in collaboration with colleagues at Boston University in the Departments of Physics and Electrical, Computer and Systems Engineering, and the Center for Computational Science. In addition, colleagues in the Physics Departments at Clark and Brandeis Universities, the Center for Computational Materials at NIST, and at Thinking Machines Corporation will participate. Graduate students will also participate through the NSF-sponsored Graduate Research Training Program at the Center for Computational Science at Boston University. Computer platforms include Boston University's 38-processor SGI Power Challenge array, a work station cluster and several CAM-8 machines. A workstation cluster at Clark University and the NIST Cray YMP will also be used. %%% This is a new award which is funded jointly by the Office of Multidisciplinary Activities\/MPS, and the Divisions of Materials Research, Mathematical Sciences and Advanced Scientific Computing. The research combines aspects of NSF programs on Advanced Materials and Processing and on High Performance Computing and Communications. An integrated theoretical and computational investigation will be made of the structural properties of fragile glass-forming liquids and the relation of this structure to the mechanisms of relaxation. Glasses have become an increasingly important class of materials in several new technologies. They possess advantages such as light weight and ease of processing, but suffer from degradation through creep, fatigue, and embrittlement. To understand these mechanisms, it is necessary to understand the structure of glasses and how they relax. At present, experiments can provide information about relaxation processes in glasses, but do not yield much information about t heir structure or relation of this structure to the relaxation mechanisms. In contrast, computer simulations can provide information about structure, but only on relatively short time and length scales. Moreover, theoretical understanding of glasses is in a relatively crude state. The results of the theoretical investigations and computer simulations, in conjunction with ongoing laboratory experiments at Boston University and other locations, will facilitate an understanding of the relation between the relaxation observed experimentally in deeply supercooled liquids and glasses and the existence of structures seen in computer simulations. Understanding of this relation will make it possible to use the structure of glasses to predict their temporal evolution. The research will be done in collaboration with colleagues at Boston University in the Departments of Physics and Electrical, Computer and Systems Engineering, and the Center for Computational Science. In addition, colleagues in the Physics Departments at Clark and Brandei","title":"Theoretical and Computational Studies of Glasses and the Glass Transition","awardID":"9633385","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["416476","263869","521525"],"PO":["145396"]},"17515":{"abstract":"The objective of this research is to develop a semantic foundation for semantic composition and interoperation of heterogeneous components of open systems. Composition and interoperation occur at many levels (requirements, specification, code, executables) and along multiple dimensions (functionality, reliability, security, availability). Relations among the various levels and dimensions must be preserved. Existing work on composition and interoperation has largely focused on syntactic structure. It is essential to develop a semantic basis in order to provide for safe, secure, and meaningful combinations. Semantic structuring of complex systems should provide a firm basis for determining what parts are interchangeable under given conditions, and to predict effects of changes: of components on the whole, and of system requirements on requirements for the parts. There is a wide range of applications where such a semantic foundation for interoperation can be of value. It is especially important in applications that combine components from diverse domains such as: data bases, spread sheets, knowledge bases, multi-media, mobile-agents, control theory, or event-based simulations. Metalogical methods from the theory of general logics, and associated techniques of mappings in and across formalisms, are used to achieve formalism-independent semantics for system composition. This supports the multi-dimensionality of a system's levels of description and formalization. Techniques from the theory of Open Mechanized Reasoning Systems (OMRS) as well as work on the formal semantics of actor systems are used to study interoperation aspects. Reflective techniques, particularly reflective logics and multi-model systems are employed extensively. This research is expected to lead to a new technology for composition, interoperation and dynamic evolution of software systems. It seeks to treat interoperability at many levels and along many dimensions: components, languages, speci fications, formalisms\/logics, and tools. This provides the capacity to move in a mathematically rigorous way across the different formalizations of a system, and to use the different tools supporting these formalizations in a rigorously integrated way. The research is based on two key technical ideas: module calculi (for integration) and open multi-model systems (for interoperation). The module calculus is formalism-independent, and is intended to have powerful new operations such as generalization. Open multi-model systems formalize the multidimensional aspects of independent interoperating parts. ***","title":"Semantic Foundations for Composition and Interoperation of Open Systems","awardID":"9633419","effectiveDate":"1996-08-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y583","name":"DARPA-SEMANTIC INTEROPERATION"}}],"PIcoPI":["551949","550115"],"PO":["150697"]},"17757":{"abstract":"9634182 Harrington, James Bennett, Jerome NASA Goddard Space Flight Center Special Project: 6th Annual MU-SPIN Conference (1996) and Supplemental Support for on-campus Regional Training Workshop This interagency transfer purpose is to partially support a large conference and supplemental smaller workshops on high performance computing and communications and infrastructure development for minority institutions. NASA, through its National Space Science Data Center, has developed a program called the Minority University Space Interdisciplinary Network (MU-Spin). The program constitutes a major networking and education initiative for minority institutions, and other universities with large minority student enrollments. Connecting these institutions with the NASA Science Network, and promoting the activities such connections provide serve as primary goal of the program. ***","title":"Special Project: 6th Annual MU-SPIN Conference (1996) and Supplemental Support for on-campus Regional Training Workshop","awardID":"9634182","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[44622,"16158"],"PO":["297837"]},"17999":{"abstract":"To investigate coordinated information gathering. The vast amount of information available today on the National Information Infrastructure has a great potential to improve the quality of decisions and the productivity of consumers of this information. Rapid expansion of the amount of available information and the number of sources is expected over the next 5-10 years. Improved information retrieval and information extraction technologies will become available. The large number of information sources that are currently emerging and their different levels of accessibility, reliability, and associated costs present a complex information gathering coordination problem that a human decisionmaker cannot possibly solve without high-level filtering of information. To be able to exploit the great potential of the NII we propose to develop the next logical step in automation of information gathering tasks: to organize information gathering activity based on its marginal contribution to the quality of the user's decision or task. This approach emphasizes the fact that information gathering is an intermediate step of a decisionmaking process. This research will provide a system with an explicit representation of the user's decision model, so that information gathering activity can be organized on the basis of its effect on the quality of the decision. To automate the information gathering planning task, the research will investigate an innovative extension to the standard value-of-information theory, that addresses the problems of information reliability, retrieval costs, real-time operation, and uncertainty. When operating under resource constraints (related to the cost of communication and database access, limited computation power, and limited amount of time) this approach should achieve a significant performance improvement over current techniques","title":"Intelligent Information Gathering Using Decision Models","awardID":"9634938","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["485994","485591"],"PO":["495796"]},"17526":{"abstract":"A critical issue for large-scale systems design and evolution is the choice of an architectural style that permits the integration of separately-developed components into larger systems. Familiar styles include those based on remote procedure call, shared variables, asynchronous message passing, etc. One increasingly important architectural style for system composition is implicit invocation (II). However, there is no established basis for reasoning about II systems. In particular it is difficult to answer questions like: What will be the effect of announcing a given event? Have enough event bindings been declared? Does a given component announce the sufficient events to permit effective integration? If I add a new component to an existing system, will it break the existing system? The goal of this project is to provide such a basis for reasoning about systems designed using the II architectural style. Two central benefits are expected. The first benefit is a step towards being able to reason fully about systems constructed in this style. The second and probably more important benefit is to replace current ad hoc reasoning approaches used by practitioners who use the II style with a collection of sound ideas that allow better informal reasoning about such systems. ***","title":"Foundations for Reasoning About Implicit Invocation Systems","awardID":"9633462","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["450771"],"PO":["150697"]},"17548":{"abstract":"9633519 Adjouadi, Malek Florida International University CISE Minority Institutions Infrastructure: Multidimensional and Multispectral Information Processing and Computational Aspects This grant provides support for graduate students to continue their research with a center serving a strong graduate minority population, the NSF funded Center for Advanced Technology and Education (NSF-CATE). The research areas include real-time applications of computer vision, neural networks, and mulitidimensional and multispectral signal analysis and modeling, all under a highly distributed and parallel platform. This support provides a strong basis for the development of visual\/sensing techniques in a multi-dimensional and multispectral framework to address various dynamic and static phenomena viewed either through real-time confocal microscopy, flow cytometry, or a high-speed motion analyzer. Modeling of dynamic phenomena which integrate time with the three spatial dimensions; real-time image analysis and interpretation; application of the fundamentals of the wavelet theory; and implementations of the functional principles of the hypercolumn theory of the visual cortex constitute key research endeavors under this proposal. The important concepts of parallelism, data compression and high-speed data communication play a significant role in the aforementioned research goals. The existing NSF-CATE infrastructure and the support of this grant allows for a significant impact to be made not only in enhancing the theoretical foundation of the outlined research goals, but in carrying-out key applications with our industrial partners, especially in biomedical diagnostics. ***","title":"CISE Minority Institutions Infrastructure: Multidimensional and Multispectral Information Processing and Computational Aspects","awardID":"9633519","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["558105"],"PO":["297837"]},"11663":{"abstract":"The project will refine and evaluate a design for a 100 Teraops multiprocessor system organized as a hierarchy of processors-and-memory system subsystem (HPAM) by carefully considering its technological feasibility along with the usability of the programming environment, in the context of important representative applications. A programming environment capable of supporting a combination of automatic translation of standard programs, user-specified machine specific programs or optimizations, and library-based programming is to be investigated. Two classes of applications will be considered: time-constrained, fixed-size problems and large-scale, complex problems. The first consists of scientific simulations used with interactive immersive visualization systems. The second includes the recently introduced SPEChpc96 benchmarks and 2D\/3D finite-element modeling applications.","title":"PDS: Hierarchical Processors-and-Memory Architecture for High Performance Computing","awardID":"9612023","effectiveDate":"1996-08-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Z665","name":"ARPA-NEW MILLENIUM"}}],"PIcoPI":["541641"],"PO":["179296"]},"15602":{"abstract":"Computing increasingly involves interactions between autonomous and heterogeneous agents distributed throughout a network, agents that have been designed separately, by different people, with little, if any, knowledge of each other. For such disparate agents to work safely and harmoniously together, they must be able to trust each other to observe certain unifying principles and protocols. Unfortunately, in such an open system one cannot expect universal voluntary compliance with any given principle. If required, such a principle must be imposed on all components of a given system. A flexible, scalable, and fault tolerant mechanism for imposing such principles and protocols over open groups of distributed agents is being developed under this project. This mechanism, implemented as a toolkit called Moses, is based on the concept of law-governed interaction (LGI), under which all messages exchanged between the members of a given group of agents are governed by an explicit, declarative, and locally enforced set of rules, called the law of this group. Some of the the potential applications of LGI are being explored. ***","title":"Law-Governed Coordination and Access Control in Distributed Systems","awardID":"9626577","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["406322"],"PO":["250083"]},"10872":{"abstract":"Description: This project supports a collaborative research project by V.S. Manoranjan with two scientists from Sri Lanka, Dr. K. Tennakone, Department of Physical and Chemical Sciences, and Dr. E.I.L. Silva, Department of Environmental Studies, at The Institute of Fundamental Studies in Kandy, Sri Lanka. They plan to conduct an exploratory study of the problem of groundwater and surface water contamination, especially with nitrate and phosphorus pollution, from chemical fertilizers. The study will employ mathematical models in conjunction with laboratory measurements and field observations. The models will be constructed to describe the movement of contaminants in soil and water bodies, and will be validated using laboratory and field experimental data that will be obtained in Sri Lanka. These models will be employed in predicting phosphate\/nitrate leaching, especially where measurements are difficult to conduct. Scope: This project supports collaboration of a U.S. applied mathematician with physical and environmental scientists in Sri Lanka, to develop and test a model for an environmental problem that impacts many of the developing countries as well as the United States. The pollution of ground water by leaching of fertilizers affects many of the water supply sources and leads to serious environmental deterioration as well as to human health problems. The collaboration helps scientists in the United States by having access to data collected in field studies in foreign countries by the foreign scientists, and helps the Sri Lankan scientists by having access to advanced analytical modeling techniques and to high computing facilities in the United States. It is being funded jointly by INT and the Division of Mathematical Sciences.","title":"U.S.-Sri Lanka Cooperative Research: Mathematical Modellingof Fertilizer Pollution of Ground\/Surface Water","awardID":"9603139","effectiveDate":"1996-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["178824"],"PO":["540599"]},"14931":{"abstract":"Many software developers view evaluation as a burden both because it currently takes significant effort and because most programmers are not trained in it. In the context of the PI's area of expertise (planning and agent design in Artificial Intelligence), the purpose of this project is to address two gaps in current methodology and pedagogy: the dearth of evaluation methods for AI software agents and the absence of empirical and evaluation methods in the undergraduate and graduate computer science curricula. Towards these ends, the research component creates new methods for evaluation that support AI agent design and development in the context of two agent projects: a simulated robot and an information gathering agent for the WWW. The teaching component integrates evaluation methods into the undergraduate and graduate CS curriculum by incorporating modules into existing courses where possible and designing new courses where necessary. Each component exploits existing and new research projects for exploring issues of evaluation in motivating design. The expected results are not only new software evaluation methods, documented examples of their use and two thoroughly evaluated software agents, but also experienced, new practitioners.","title":"CAREER: Evaluation as the Basis for AI Agent Design","awardID":"9624058","effectiveDate":"1996-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["424402"],"PO":["565227"]},"15317":{"abstract":"The goals of this project are to advance the state-of-the- art in language-based tools for software engineering. There are three related aspects to the research: (1) extending dependence-graph-based tools, (2) carrying out theoretical and practical studies of pointer analysis, and (3) quantifying trade-offs in dataflow analysis. The work builds on the prior research in two areas: the design and implementation of software engineering tools, and the design, implementation and evaluation of algorithms for dataflow analysis. The first part of the work includes the continuation of previous NSF-supported research extending underlying theory to permit graph-based tools to be used for a wider range of languages than is currently possible, and improving existing graph based tools. It also includes new directions: the design and implementation of new tools using a hybrid approach that combines text or syntax-based tools with semantic checks. The research on pointer analysis and dataflow analysis tradeoffs is complementary to the work on dependence graphs, since the results are expected to improve the graph-based tools. They are also expected to be useful to other researchers and practitioners concerned with applications that rely on the results of static analysis. ***","title":"Program Dependence Graphs and Dataflow Analysis","awardID":"9625656","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["331999"],"PO":["150697"]},"12721":{"abstract":"9615690 Khoshnevis This award funds investigation of the concept of a single centralized station to provide supervision, sensing, control, intelligence, and perhaps power to a colony of robots, organized for the performance of specific tasks. The consequence of such an approach is that each robot can be made much simpler, smaller, and less expensive, since requirements for on-board sensing, control, and intelligence are reduced or even eliminated. Human capability for supervising and controlling multiple robots may also be augmented by this approach. The issues to be studied concern tradeoffs in control (bandwidth, accuracy, and channel capacity); relations between numbers of controllable robots and task suitability; and representation for control.","title":"SGER: Centralized Sensing and Control of Multiple Mobile Agents","awardID":"9615690","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["560305","362108"],"PO":["475621"]},"15922":{"abstract":"This is a 3-year standard award. The need to merge different versions of an object to a common state arises in collaborative computing for several reasons, including optimistic concurrency control, non-WYSIWIS coupling, absence of access control, latecomers, and mobile computing. Current systems either support restricted forms of merging, or require programmers to completely implement merge procedures. The hypothesis of this research is that it is possible to automatically generate a large variety of merge procedures from high level specifications of these procedures. The project will investigate several issues that must be resolved to establish this hypothesis, including simultaneous merging of an arbitrary number of objects, merging of user-defined objects, realtime merging of user-interface objects, merging in a mobile environment, abstractions for specifying merge procedures, and the relationship between merging and other collaboration functions such as concurrency control. It is uses an experimental method wherein the new concepts are implemented and used in validation experiments. If successful, it will allow merging to become a common operation in a collaborative environment without requiring significant application-specific programming.","title":"Merging in a Collaborative Environment","awardID":"9627619","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["533215"],"PO":["495796"]},"15823":{"abstract":"This research involves foundational research on algorithms for NP- hard problems. The primary research area is DNA computing. A careful study of models and algorithms for DNA computation provides a basis for assessing whether DNA computing is viable. This research will provide new, massively parallel algorithms for NP- hard problems that may be useful on other computing models. Another contribution will be analysis of error-prone computation. Research will also be carried out in the area of approximation algorithms. The goal is to extend the range of applicability of the semidefinite programming relaxation method of Goemans and Williamson to an NP-hard timetabling problem that typically arises in high schools. The interactive activities to be undertaken include: teaching a senior-level undergraduate course in theoretical computer science, giving several research presentations in departmental seminars, doing collaborative research with faculty in Computer Science and Engineering and Molecular Biotechnology, and serving as an advisor for an NSF-funded project on development of mentor training packages.","title":"VPW: DNA Algorithms and Approximation Algorithms for NP-Hard Problems","awardID":"9627241","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["183023"],"PO":["180153"]},"17507":{"abstract":"The first goal of this investigation is a software development strategy in which ultra-modular executable specifications are the starting point of systems design. By ultra-modular is meant a set of specific technologies that allow one to anticipate and realize change, including the use of domain-specific embedded languages to capture high- level, domain-specific semantics, and modular monadic interpreters on which to realize the semantics and associated software tools. Using these techniques a level of modularity in software is obtained that has not been achieved before: namely, modularity at the meta-level of abstract semantics. Second, the research seeks a notion of type-based modularity to capture software architecture. There is a misconception that type systems are contrary to the goals of \"dynamic languages,\" which in turn are viewed as good candidates for building evolvable systems. This research contests this claim. In fact it is expected that modern typed languages such as ML and Haskell can offer even greater support for constructing reliable and efficient evolutionary software. In particular, the design and use of a higher-order module language is studied to capture systems architecture. Finally, a methodology is investigated that supports the notion of incremental derivations. In this methodology, some executable specifications are refined for improved performance, whether by formal methods (program transformation, partial evaluation, etc.) or by informal methods (such as rewriting inner loops in a lower-level language). The key point is that the derivations themselves can be modularized, thus making them suitable candidates for smooth evolution. When formal methods are employed, this also yields a technique for constructing modular proofs of program correctness; yet another innovative aspect of this approach. These three ideas form the cornerstone of the research effort. To evaluate them, the investigation includes the design of a prototype extens ible operating system. ***","title":"Building Evolutionary Software Through Modular Executable Specifications and Incremental Derivations","awardID":"9633390","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y062","name":"BLDG EVOL SOFTWARE THRU MOD EX"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y174","name":"DARPA-BLDG EVOL SFTWR THRU MOD"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y635","name":"DARPA-BLDG EVOL SOFTWARE THROU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Z616","name":"ARPA-EVOLUTIONARY DESIGN COMPL"}}],"PIcoPI":["541946","550517"],"PO":["150697"]},"11699":{"abstract":"The project will refine and evaluate a design for a 100 Teraops multiprocessor system organized as a hierarchy of processors-and-memory system subsystem (HPAM) by carefully considering its technological feasibility along with the usability of the programming environment, in the context of important representative applications. A programming environment capable of supporting a combination of automatic translation of standard programs, user-specified machine specific programs or optimizations, and library-based programming is to be investigated. Two classes of applications will be considered: time-constrained, fixed-size problems and large-scale, complex problems. The first consists of scientific simulations used with interactive immersive visualization systems. The second includes the recently introduced SPEChpc96 benchmarks and 2D\/3D finite-element modeling applications.","title":"PDS: Hierarchical Processors-and-Memory Architecture for High Performance Computing","awardID":"9612133","effectiveDate":"1996-08-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Z665","name":"ARPA-NEW MILLENIUM"}}],"PIcoPI":["540130","558595"],"PO":["179296"]},"12459":{"abstract":"This Minority Research Planning Grant initiates research leading to a novel approach in ATM network bandwidth allocation and call admission. The key contribution of the proposed work is the use of indices of dispersion (in addition to traditional parameters) and low-pass filtering to characterize ATM network traffic. The resource allocation schemes will be implemented on existing ATM testbeds.","title":"Dynamic Bandwidth Allocation for ATM Networks","awardID":"9614909","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["488240"],"PO":["409909"]},"12129":{"abstract":"The College of the Redwoods requests support from NSF to connect its Mendocino Coast Center in Fort Bragg, California to the Internet. This grant will be used to help the institution get access to the Internet. Pacific Internet, a local service provider, will provided the the lines used to access to the Internet. The Mendocino Coast Center needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general.","title":"The Redwood Connection","awardID":"9613950","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[30836,30837,30838],"PO":["57343"]},"15407":{"abstract":"The proposed project completes the implementation, already underway, of the ViC* compiler and run-time system. The compiler translates the data-parallel language C* with some data explicitly declared to be \"out of core.\" Out-of-core data reside on a parallel disk system. The compiler produces C for a distributed-memory multiprocessor. It adds I\/O and library calls to access data on disk, and it also produces virtual processing loops to allow each physical processor to be shared by multiple parallel-variable elements. A ViC* program will run significantly faster than one run with traditional sequential virtual memory on the individual nodes of a MIMD machine. Unlike demand paging, ViC* will take advantage of aggregate data-parallel operations by optimizing away many I\/O calls. Moreover, the ViC* run-time library will execute optimal parallel-disk algorithms that have appeared in the literature recently. There are two major components to ViC*: a compiler and a run time library. Both are designed to minimize the number of parallel disk accesses made by the executing program. The runtime library will implement the entire C* library for both incore and out-of-core parallel variables. It will run on any platform that supports PVM and any of the following filesystem interfaces: Scotch, Galley, Scalable I\/O Initiative API, and UFS for multiple disks. ***","title":"ViC*: A Compiler and Runtime System for Out-of-Core C*","awardID":"9625894","effectiveDate":"1996-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["511581"],"PO":["250083"]},"14439":{"abstract":"This is an investigation into the application of asynchronous circuit design tools to a large, realistic example. The project is being carried out in conjunction with the Avalanche parallel architecture project at the University of Utah. The Cache and Communication Control Unit (CCCU) of the Avalanche multiprocessor, which is designed as a synchronous system, is being implemented as a self-timed system using the original specification for the Avalanche CCCU. To do this, problems in self-timed circuit design are being deeply investigated, with a particular focus on automating the design of high-performance self-timed systems. Chips embodying the designs are being fabricated through MOSIS, tested and evaluated.","title":"Application-Driven Advancement of Asynchronous Design Methods","awardID":"9622587","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["542053","561775","451272"],"PO":["321058"]},"17849":{"abstract":"9634425 Long, Tim Sitaraman, Murali Ohio State University\/West Virginia University CISE Educational Innovation: Development and Dissemination of a New Undergraduate Course Sequence in Software Design and Development This CISE Educational Innovation award supports the integration of research into the undergraduate curriculum through the development and dissemination of a new sequence in software design and development. The project is a joint effort between Ohio State University and West Virginia University, with OSU as the lead institution. The project involves the design, development, installation, and evaluation of an innovative three-quarter sequence in software design and development. The sequence is integrated and unified in its philosophical and technical bases. A major part of the effort includes the development of a software composition workbench consisting of an integrated set of software tools. The workbench will be capable of guiding students and software developers in their application of the methodologies taught in the course sequence and it will instill in software developers a particular mental model of software and how to construct it. Dissemination will be facilitated through training workshops for visiting faculty from a number of other institutions. The total project is supported in part also by the Fund for Improvement of Secondary Education (FIPSE) in the Department of Education.","title":"CISE Educational Innovation Program: Development and Dissemination of a New Undergraduate Course Sequence in Software Design and Development","awardID":"9634425","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["508443","502515"],"PO":["297837"]},"12976":{"abstract":"The Visual Programming Challenge (VPC) is a competition designed to test the effectiveness of visual\/multimodal programming languages at programming certain problems. The objective of the challenge is to focus research efforts on visual\/multimodal programming approaches that offer the greatest potential of allowing `ordinary` people to `program` tasks. One of the problems of unfocused research is that the emphasis tends towards novel, rather than effective. The intent of the VPC is to promote research that leads to effective solutions. The particular problem domain of the competition requires real-time control of an intelligent robot vehicle within an unknown system of roads composed of standard Lego road tiles. The solution to this problem requires managing a representation for a 2D data structure (of unknown dimensions), constructing closures over dynamic data structures (to determine if all paths connect), planning (to find the best route to an incomplete path needing further exploration), and real-time control (many of the robot interactions must occur between specific operation states). The results of visual\/multimodal programming have already had an impact on a number of related fields, including scientific visualization and human-computer interfaces. This impact will grow as emphasis is increased on bringing more people into daily use of computers for both business and personal interests. This challenge serves to help focus research in visual\/multimodal programming languages and thereby to improve the effectiveness of this technology for everyday use.","title":"SGER: Visual Programming Challenge","awardID":"9616242","effectiveDate":"1996-08-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["168988"],"PO":["183208"]},"6493":{"abstract":"Valencia Community College requests support from NSF for connection to ICI. This grant will be used to help six campuses get access to the Internet. The six sites are East Branch Campus, Osceola Branch Campus, West (Main) Campus, Downtown Center, McCoy Center, and West Park Campus. ICI, a midlevel network in Florida, will provide operations management and information services and it will give the college access to the Internet, a collection of interoperable networks connecting most research and education organizations in the United States. The Valencia Community College campuses need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Valencia Community College system as well as the community in general.","title":"Request for Connectivity to NSFNET","awardID":"9528812","effectiveDate":"1996-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[15947,15948,15949,15950],"PO":["121202"]},"11767":{"abstract":"Robust micromanipulation strategies are needed in order to overcome a potential technology barrier to the commercial development of complex microelectromechanical (MEMS) devics. Development of robust strategies requires an investigation into two critical issues not applicable to the traditional macro manipulation domain. These issues include the much higher relative positioning accuracy required, and the vastly different mechanics of manipulation. Both of these differences highlight the need for micromanipulation strategies that are guided by realtime sensor feedback. Initial experimental results indicate that feedback from high resolution optical systems with controllable intrinsic and extrinsic parameters in useful for manipulation over a broad range of micromanipulation tasks. This research theoretically and experimentally investigates sensor-based micromanipulation strategies that account for the different mechanics that govern object interactions on a micron scale. A critical aspect of the approach entails the use of realtime vision feedback from active optical systems to correct for micromanipulation mechanics that are often difficult to model precisely. In addition, various micro- grippers will be designed and analyzed, and promising designs will be micromachined and tested. This research will result in experimental and theoretical analyses that will illuminate the similarities and differences between sensor-based manipulation in macro and micro domains. The realization of successful micromanipulation strategies will aid in the development of automatic assembly machines for assembling and packaging future MEMS devices that require increasingly complex assembly strategies.","title":"An Investigation of Visually Guided Micromanipulation Using Active Optical Systems","awardID":"9612329","effectiveDate":"1996-08-01","expirationDate":"1998-11-10","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["125601","507075","196704"],"PO":["475621"]},"12109":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an OC-3 connection to the Chicago NAP and to Fermilab for two years. Among the numerous applications are those involving distributed high performance computing, remote visualization, gigabit imaging, network-based collaboration, simulations and modeling in astronomy and astrophysics, and advanced digital video. Collaborating sites include Argonne National Laboratory and Fermi National Accelerator Laboratory.","title":"University of Chicago Proposal to Support Science Through Enhanced Networking","awardID":"9613908","effectiveDate":"1996-08-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[30774,"495795",30776],"PO":["121202"]},"4470":{"abstract":"The choice of primitive coordination operations, whether reading and writing a shared memory, message-passing, or more complex operations, has become a crucial design issue. To make such choices, one must analyze the behavior of multi- process executions, reasoning about the multitude of possible combinations of concurrent operations. This is an unusually delicate and laborious task. The goal of this research is to replace this need to argue about concurrent executions with combinatorial conditions on the geometric representation of problems. This should allow researchers and designers, instead of analyzing behaviors, to apply powerful mathematical tools to recognize when certain protocols are impossible, to evaluate the power of alternative synchronization primitives, or to make explicit the assumptions needed to make a given problem solvable. This project pursues the problem of characterizing and classifying the power of synchronization primitives in different models. Prior research has developed powerful new tools based on classical topology for analyzing fault- tolerant concurrent alogrithms and data structures in a variety of models and architectures. This research has shown that a large class of synchronization problems can be associated with a high-dimensional geometric structure called a simplicial complex, and that the computational complexity of solving the problem using a given underlying architecture is captured by certain topological properties of the complex. These properties have been used to give a complete characterization of the synchronization problems solvable in asynchronous read\/write memory, and to provide impossiblity results and lower bounds for several known open problems in both the asynchronous model and in the synchronous message-passing model. These techniques are being applied toward a comprehensive theory of multiprocessor synchronization. ***","title":"The Topological Approach to Asynchronous Computability","awardID":"9520298","effectiveDate":"1996-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["517826","541744"],"PO":["150697"]},"5460":{"abstract":"Code Division Multiple Access (CDMA) communications systems are limited by multiple access interference (MAI). Multiuser detection accomplishes MAI cancellation by exploiting the knowledge of all users' signatures. Due to the complexity of the optimum multiuser detector, various sub-optimum detector structures have been considered. In this study a novel structure termed DC^3 for adaptive multiuser detection of asynchronous users, which is simple in that it does not require duplication of the hardware, as optimum detectors require. To handle errors in relative delay estimation, a special adaptive decorrelator called the 'bootstrap decorrelator' is utilized. Performance of the bootstrap decorrelator under different fading environments with different unknown delays is analyzed and convergence and stability questions are treated. Performance of the DC^3 receiver as a whole is also studied, in a realistic communications environment.","title":"Adaptive Interference Cancellation & Signal Separation in Multi-User CDMA Communication System","awardID":"9523954","effectiveDate":"1996-08-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["316235","316236"],"PO":["150411"]},"12615":{"abstract":"Key contributors to research and education networking are being invited to participate in this strategic workshop. This will be the third in a series and will build on the FARNET\/NTTF joint meeting on April 15 and16 in Washington, DC as well as the Monterey workshop on the NII and Higher Education in Sept. 1995. The earlier meetings convened members of leading higher education, research and supporting organizations to better understand the needs and requirements of higher education for advanced networking. The participants at the Monterey conference in September of 1995, were in general agreement that 1) the requirements for communications for tomorrow1s university are not clearly articulated and 2) leadership, and perhaps services exclusively from the private sector are not likely to provide the solution. These conclusions spawned a number activities addressing both issues. A number of draft strategy documents addressing the fulfillment of those needs and requirements were presented at the April 15-16 Washington, DC meeting. Our objectives at the Colorado Springs-Cheyenne Mountain Resort workshop will be to further develop and evaluate those models, discuss and evaluate critical technical issues, and discuss alliances and organizational structure to implement the strategy.","title":"A Workshop for the Future of Networking for Research and Education; August, 1996; Colorado Springs, Colorado","awardID":"9615351","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["547713"],"PO":["57343"]},"17907":{"abstract":"The most natural means of human communication is multimodal, involving a mixture of speech, hand and body movement, facial expression, and eye motion. A multimodal framework is developed where several interaction modes are explored as a means of manipulating a 3D virtual display. The main focus of this project is exploring the use of free hand gestures for manipulating virtual objects in an effort to advance the goal of developing the fundamental theory behind hand gestures as a way of manipulating graphical objects together with speech, gaze direction, scene content, and graphical feedback. Existing multi-user virtual reality setups are used as experimental testbeds for validating the usefulness of methodologies for building useful multimodal human-computer interfaces for virtual reality. Since the development of natural human-computer interaction techniques are perceived to be a major hurdle in a greater impact of the information revolution, the results of this projects have wide-reaching potential applications.","title":"Vision-Based Hand Gesture Analysis in a Multimodal Interface for Controlling Virtual Environments","awardID":"9634618","effectiveDate":"1996-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["550184","254458"],"PO":["565227"]},"11857":{"abstract":"Much AI work in planning uses deduction to draw conclusions about the future, so that the inferences work forwards in time from preconditions to consequences of actions. This project is developing an alternative approach in which the direction of reasoning is independent of temporal direction, so that information may have onsequences in the past or in the futre. It is based on an ontological framework of pieces of space-time with 'natural' boundaries. The role of inference is also somewhat different; its purpose here is to provide an efficient source of explanations' for apparent anomalies in tentative partial plans. Planning - even if only of a simple kind - is of central importance in many AI applications, but has suffered from some stubborn theoretical difficulties; this lternative approach seems to provide a solution to the 'frame problem' and the 'prediction problem', both of which can be seen to arise from identifying temporal direction with direction of inference.","title":"An Alternative Approach to Action Planning and Temporal Reasoning","awardID":"9612572","effectiveDate":"1996-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["355184"],"PO":["54008"]},"16929":{"abstract":"Databases for spatial graph management are very important for a large number of applications including transportation, utilities (e.g. gas, electricity) and urban management. This project addresses the needs of spatial graph management in the areas of physical database design and query processing. The main objective is to develop, evaluate and implement a novel spatial graph storage and access method, called Connectivity-Clustered Access Method (CCAM), based on graph-connectivity. CCAM assigns the nodes of a graphs to disk pages via the graph partitioning approach to maximize the Connectivity Residue Ratio, i.e., the chances that a pair of connected nodes are allocated to a common page of the file. Another objective is to develop scalable spatial graph-clustering algorithms as well as incremental reorganization strategies to enhance CCAM. This project also explores strategies to enhance existing geometric access methods for managing connectivity properties along with proximity properties. The techniques developed in the project are evaluated with benchmark graphs from Advanced Traveler Information System applications","title":"Databases for Spatial Graph Management","awardID":"9631539","effectiveDate":"1996-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["550903"],"PO":["563751"]},"11916":{"abstract":"IRI-9612769 This award funds a research workshop on foundations of information and decision fusion, with applications to engineering problems. The workshop is jointly supported by a number of Federal agencies. The NSF support is intended to support participation of researchers from the computer vision community to encourage coupling with the data fusion research community leading to innovative explorations. The workshop will be held in the Washington DC area in August 1996. Publications will include a workshop proceedings, a volume of overview papers, and a special issue of the Journal of the Franklin Institute containing reviewed papers on state of the art in the various related domains.","title":"A Joint DOE NSF and DOD Workshop on Foundation of Information\/Decision Fusion with Applications to Engineering Problems","awardID":"9612769","effectiveDate":"1996-08-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["231050",30290],"PO":["125480"]},"12719":{"abstract":"9615688 Raviv Supports initial exploration of an analog VLSI design for a novel, reduced-complexity task specific visual retina. The proposed retina generates specific quantitative information about imminent threat of collision in real time, which can be used as a powerful sensory feedback signal in closed-loop control for autonomous navigation (e.g., collision avoidance) as well as other tasks. When dealing with a moving camera-based autonomous navigation system, a huge amount of rapidly varying visual data is captured. Processing all these data in real time is a difficult task. There is a need to reduce the rapidly varying video-rate images to a few signals that are relevant to the tasks at hand. The PI's ongoing research has resulted in identification of several relevant visual motion cues, one of which is the Visual Threat Cue (VTC). This cue can be viewed as a mechanism to reduce the vast rapidly changing visual data to one slowly-changing signal. The proposed retina extracts the VTC in a singlestage parallel operation. It employs raw gray level data directly to extract the VTC, i.e., without the need for pre processing such as edge detection, segmentation, feature tracking, optical flow, etc. Potential applications include realtime autonomous navigation, aid to visually-impaired people, behavior-based robotics, and multi-eye agents.","title":"SGER: Task-Specific Retina","awardID":"9615688","effectiveDate":"1996-08-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}}],"PIcoPI":[32296],"PO":["475621"]},"6940":{"abstract":"This project's goal is the study of approximations for Steiner minimum trees (SMTs) and related problems. This study extends the PI's research, supported under CCR-92- 08913, on the analysis and the designs of polynomial-time approximations for SMTs. The project includes finding new techniques to solve or make significant progress in both the analysis and construction\/implementation of the following problems in the area of SMTs: (1) Open problems on the Steiner ratio (such as, Chung-Gilbert's conjecture, Graham- Hwang's conjecture, and Smith's sausage conjecture); (2) Determination of the performance ratios for various approximations (such as, Chang's approximations, Smith-Lee- Liebman's approximation, and Kahng-Robin's approximation); (3) New approximation algorithms using the variable metric method; (4) Investigation of a conjecture about SMTs approximations and hardness of finding approximate SMTs; (5) Establishment of significant lower bounds for the performance ratio of polynomial-time approximations; (6) Improvement of the analysis of approximations of Zelikovsk's; and (7) Construction of good approximation algorithms for related problems.***","title":"Approximation of Steiner Minimum Trees and Applications","awardID":"9530306","effectiveDate":"1996-08-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["382009"],"PO":["150516"]},"6566":{"abstract":"The efficient use of bandwidth for multimedia information transmission depends on the efficient use of imperfect channels, such as coaxial cables and optical fibers. This means redundant information must be removed and what remains must be coded for reliable transmission. This research is addressing the problems of redundancy removal (source coding) from the point of view of multichannel filterbanks; it is also addressing the problem of efficiently implementing filterbanks in digital electronics. Specifically, we are studying applications of undersampling operators, oversampling operators, and tight frames to source coding, channel coding and halftoning. The aim of this research is to develop efficient state variable realizations for tight frames and related maps, and to determine the computational complexity and performance characteristics of these realizations. Of particular interest are sum of all-pass realizations for multichannel filterbanks. The results will produce insights and design rules for implementing source coders and channel coders in state variable filterbanks that have good numerical properties.","title":"Statistical Signal Processing and Communication Within Subbands","awardID":"9529050","effectiveDate":"1996-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[16106,"523725"],"PO":["564898"]},"5367":{"abstract":"This project is concerned with the allocation of network resources, specifically buffer and bandwidth, to users and to virtual paths in an Asynchronous Transfer Mode network. The research concentrates on developing a framework for analysis of this resource allocation probelm. Users are assumed to receive benefit as a function of their quality of service. measured by cell loss probability and completion time for real-time services. Network usage is measured using effective bandwidth and buffer occupancy. The paradigm of price and demand is used to represent the minimal required information transfer between user and network. These prices are considered purely as internal network indicators for the purpose of resource allocation; what users are actually charged by their service provider is a separate issue not considered here. The goal is to allocate bandwidth and buffer so as to make as many users happy as possible, and to do so efficiently. Furthermore, it is desirable that any such mechanism be distributed both hierarchically and geographically. The P.I. proposes to develop this framework to jointly allocate buffer and bandwidth, to study the use of priorities to replace explicit reservation of resources, and to analyze the resulting network dynamics.","title":"Buffer and Bandwidth Allocation in ATM Networks","awardID":"9523580","effectiveDate":"1996-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["516930"],"PO":["150490"]},"7314":{"abstract":"This is an interinstitutional collaborative project. Combinatorial data consisting of sequences, trees, and graphs arise in many scientific disciplines. For example, the primary structure of proteins is a sequence, whereas the tertiary structure is a graph. Comparing such data to find similarities entails the use of a \"distance metric\" that mea sures the difference between two data items. Numerous distance metrics are possible. This work consists primarily of (i) inventing efficient ways to compute known distance metrics; (ii) developing a data structure to decide which of a set of data items is \"closest\" (according to a given distance metric) to a new data item; (iii) techniques and s oftware for discovering patterns with minimum or near-minimum distance to a given set of data items with respect to a given distance metric; and (iv) software to solve such discovery problems on networks of occasionally idle workstations. This work will help every field in which approximate matching is important. Significant applications are expe cted to molecular biology and rational drug design, as well as to finding patterns in linguistic strings.","title":"Pattern Discovery in Combinatorial Databases: Algorithms, Applications, and Software for the Scientific Community","awardID":"9531548","effectiveDate":"1996-08-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["335170"],"PO":["563751"]}}