{"109505":{"abstract":"Proposal 0534858<br\/>\"Statistical Models of the Primate Neocortex: Implementation and Application\"<br\/>PI: Thomas L. Dean<br\/>Brown University<br\/><br\/>ABSTRACT<br\/><br\/>Theoretical accounts of the primate cerebral cortex (neocortex) are sufficiently rich in their predictive power and detailed in their specification that they warrant a concerted effort to implement and subject to computational experiment. This project applies recent work in theoretical neuroscience to develop statistical models and related learning and inference algorithms that capture the structure, scale and power of the neocortex for applications requiring robust associative recall, sensor fusion, pattern completion and sequence prediction. The cortical models and algorithms are implemented on moderate-sized computing clusters by distributing the computations among a large number of weakly coupled processes, each of which is capable of reproducing the aggregate behavior of a columnar cortical structure consisting of several thousand neurons. These simulated cortical columns are organized hierarchically much as they are in the primate neocortex. In addition to providing insight into the structure and function of the neocortex, the resulting algorithms and statistical models will enable researchers to combine lessons learned from biology with state-of-the-art graphical-model and machine-learning techniques to design hybrid systems that combine the best of biological and traditional computing approaches.","title":"Statistical Models of the Primate Neocortex: Implementation and Application","awardID":"0534858","effectiveDate":"2005-11-15","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[289903,"498150","389974"],"PO":["564318"]},"109868":{"abstract":"Design-based science pedagogy presents students with a design challenge that requires them to use targeted science content to design and build a working artifact. It can be an especially effective method to help learners develop mental models of how things work, understand scientific concepts, and develop scientific reasoning. This project focuses on identifying software design principles and instructional principles for supporting science concept learning through design-based exercises. Two technologies for promoting science learning will be integrated into design-based learning environments: simulation and modeling software, and software to support construction of explanations and predictions. The pedagogical focus of this project is the science of force and motion at the middle school level.<br\/><br\/>Software design research issues of this project include understanding (i) the functions simulation and modeling software should have when integrated with physical design activities so as to promote more effective concept learning from design activities, (ii) needed functionality in software that supports explanation and prediction construction in such an environment, (iii) design guidelines for integrating these two kinds of software, and (iv) guidelines for designing interactions between learners and the software to promote easy use, personal connections, and curiosity.<br\/><br\/>Pedagogical research issues include identifying practices for (i) interweaving design and testing in the physical world with simulation and modeling and (ii) interweaving prediction and explanation with designing and modeling, such that students learn targeted science concepts deeply, including the ability to use them for prediction and explanation of real-world phenomena.","title":"Integrating Simulation and Modeling with Design and Testing to Promote Deep Concept Learning in Design-Based Learning Environments","awardID":"0537257","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1707","name":"ADVANCED LEARNING TECHNOLOGIES"}}],"PIcoPI":["562669"],"PO":["564318"]},"109439":{"abstract":"This project explores the nature of computer systems to support the building of high-quality community-maintained artifacts of lasting value (CALVs). CALVs are distinguished from ephemeral activities of communities through three key properties: (1) The community must be focused around a valuable persistent computer artifact; (2) the artifact must be maintained over time; and (3) the quality of the artifact must be important to the community. The artifact must be valued by its maintaining community; it may in addition also be of value to a larger community who does not participate in maintenance. CALVs are of special importance on the Internet because they represent powerful free resources that can be created by volunteer communities. They have the potential to revolutionize access to many types of information, opening free access to millions of people. In much the same way that open source software frees software, CALVs free repositories of information.<br\/><br\/>But, just as most open source software projects fail, most CALVs fail. Their creators get busy or bored, and they fail to attract a community that is interested enough to do the essential work of maintaining the artifact for future users. In many cases, failure may be appropriate. Perhaps the artifact just is not valuable enough to be worth maintaining. In many other cases, however, important resources are lost because a community disbands through disillusionment, conflict, or ineffective organization. This project is an investigation of principles and computer tools that embody those principles to improve the success rate for valuable CALVs, making it possible for people everywhere to create and maintain valuable resources on the Internet.<br\/><br\/>This project seeks tools in three areas: (1) Eliciting Valuable Contributions. Computer tools to help users find work a) they are able to do, b) will find interesting, and c) that will develop the artifact in ways that are valuable to the community. (2) Maintaining the Health of the CALV and its Community. Computer tools to measure the local and global health of the CALV to help users make decisions that are in the best interests of the community. (3) Providing Value to Community Members. Recommender tools to help a user find specific items he or she values from among the many parts of a CALV.<br\/><br\/>This research will involve three communities: MovieLens, a distributed, anonymous, recreational community of thousands of active members; Galactic Gopher, a geographically co-located, pseudonymous, small graduate student community; and the Bioethics of Stem Cell Research repository, a distributed, identified, professional and academic community. For each of these communities the project will develop computer tools that embody the best practices for enhancing the ability of the community to maintain its artifact without external support. In each of these communities, researchers will conduct controlled, random-assignment experiments with subgroups of the community and develop tools to computationally assess the overall health of the community, and the contribution of each member.<br\/><br\/>This project will develop principles to enable people to create and maintain valuable CALVs for communities that can use them. Based on the principles, the project will develop practical computer tools for CALVs. These computer tools will be created under open source licenses and distributed to people who wish to use them everywhere. To increase the impact, the research will: (1) work with multiple communities (MovieLens, Galactic Gopher, Bioethics) to apply the principles; (2) work with communities independent of the research group on pressing problems of society (the bioethics of stem cell research); and (3) develop a cadre of graduate students with research experience, interest and ability in strengthening Community-maintained Artifacts of Lasting Value.","title":"Helping Hands: Computer Support for Community-Maintained Artifacts of Lasting Value","awardID":"0534420","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["483488","550380",289723],"PO":["564456"]},"114159":{"abstract":"The workshop took place November 18-19, 2005 at the University of Pennsylvania. It served as the 15th in the ongoing series of Fall Workshops on Computational Geometry, which originated at Stony Brook in 1991. The workshop on computational geometry is a forum for reporting ongoing state-of-the art research in many areas of theoretical and applied computational geometry. The focus of this particular workshop is on tools and methods for modeling and visualization, areas that lie on the interface between core theoretical methods and application areas like medical informatics, graphics, geographic information systems, and scientific data visualization.<br\/><br\/>The results of the workshop are being widely disseminated by means of the internet, with talk abstracts and a detailed list of open problems raised. Also a special journal issue that publishes a select sample of the research presented at the workshop.","title":"Workshop on Computational Geometry and Visualization","awardID":"0602527","effectiveDate":"2005-11-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["471875","542076"],"PO":["321058"]},"122398":{"abstract":"Xiaodong, Zhang<br\/>0405909<br\/><br\/>High performance computing in multiprocessors and clusters has been mainly characterized for performance evaluation and guided for performance optimization by communication-oriented models, such as the LogP model, which considers the communication latency as the dominant factor contributing the performance degradation. With the rapid development and advances of commodity processors and network technologies, a modern cluster is equipped with fast interconnection networks, where each node has a high capacity with increasingly fast CPUs and larger memory. Unfortunately, the speed gaps between the CPU and the memory and the I\/O storage continue to grow, seriously limiting the cluster computing efficiency. Since the dominant bottleneck concerns have been dramatically changed from communication bandwidths to memory bandwidths, there are several limits of using a LopP-like model. First, balancing and well-utilizing the CPU, memory and storage resources in clusters is a serious issue to be addressed because this is a major source limiting the sustained performance. Second, one common phenomenon due to the large CPU and memory speed gap is that CPU cycles are over-supplied while the memory and I\/O bandwidths are highly demanded and not sufficient.<br\/><br\/>The research in this project will address the growing concern of unbalanced resource demand and supply in cluster computing, we propose several related research projects. The first objective is to develop memory hierarchy oriented analytical performance models and experimental tools to quantitatively provide the insights into the resource demand and supply in high performance cluster computing, which guide users and computer architects to optimize their system designs and program implementations. This will be a general model covering both communication and memory effects. The second objective is to concentrate our efforts on two critical issues to improve the sustained performance: (1) locality exploitation and (2) latency reduction beyond the on-chip cache level by proposing two novel and cost-effective memory system designs and their implementations.<br\/><br\/>The project will design and build a structured PSP scheme and its implementation in the cluster to decentralize the resource management. These methods will be tested on three types of large real-world and data intensive applications: the CFD computation, a direct numerical simulation of turbulence, and Internet multimedia data delivery.","title":"Modeling and System Support to Balance the Resource Demand and Supply in High Performance Computing","awardID":"0643640","effectiveDate":"2005-11-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["551992"],"PO":["551712"]},"109509":{"abstract":"This project investigates machine learning that takes into account dependencies among examples. In contrast, most machine learning methods assume that all examples are independent and identically distributed (\"i.i.d.\"). Domains where this assumption does not hold are widespread -- from the WWW, where the relevance of a page affects the relevance of linked pages, to molecular biology, where a protein's properties determine its role in metabolic networks. By lifting the i.i.d. assumption, this project will develop learning algorithms that can exploit the information each example carries about the others. This has the potential to improve predictive performance and broaden the range of phenomena that can be effectively modeled. However, it also greatly increases the complexity of learning. This project focuses on developing techniques to make non-i.i.d. learning practical, including: (1) feature search guided by known relations among examples; (2) aggregation of variable quantities of relevant information back into examples of fixed length; (3) increasing the efficiency of learning and inference by performing them at multiple levels of abstraction; and (4) using relational domain knowledge to constrain the search space and combat overfitting. The project will apply the resulting algorithms to modeling the WWW and scientific citation networks. The broader impact of this project includes extension of machine learning to domains, within and beyond computer science, where interdependencies among examples cannot be ignored (e.g., the WWW, social networks, ubiquitous computing). It will also create a publicly available repository of data sets with interdependent examples. The project involves undergraduates, particularly those from underrepresented groups.","title":"Learning from Interdependent Examples","awardID":"0534881","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["365926"],"PO":["387198"]},"112930":{"abstract":"The PI's long-standing hypothesis is that through the collective development and application of knowledge there exists an important prospect for large segments of our society to increase significantly their collective ability to understand complex, dynamic, and critical problems. In this project the PI aims to develop an early stage of a new tool he calls a HyperScope, a lightly modified web browser supported by an \"Intermediary Processor\" (IP) that operates between the browser and the files or databases holding the existing working knowledge of a collaborative community, and which is designed with the goal of augmenting society's learning capability by allowing people to interact with knowledge in a more dynamic, multi-faceted, and integrated means as well as on a broader scale. The HyperScope is not an editor. Rather, the HyperScope user will be able to follow links into and between \"legacy\" files in a manner similar to using a browser with web-based HTML files. Although there will be numerous new capabilities and features that will give a HyperScope user considerably more flexibility and working power than users limited to standard browsers and \"legacy\" editors, the key attribute of the tool is that people working at successive future stages of the bootstrapping process it supports (as in \"to lift one's self by one's own bootstraps\") can continuously apply the results of all earlier stages to increase their own capability to do their next bit, thereby steadily improving our capability to improve our capability! The PI intends to strategically cultivate application of the HyperScope within selected scientific communities. In particular, he envisages that some of the scientific communities served by NSF could become early users and \"bootstrapping contributors\" who then could help orient and stimulate other communities, then other government agencies, which could lead to other countries participating in \"world-wide bootstrapping.\" Thus, this project represents the beginning of a journey, by the PI who invented the mouse and the basic workings of our present-day computer interface at a time when the personal computer was an impossible dream, whose purpose is to take human-computer interaction to the next level.<br\/><br\/>Broader Impacts: The PI sees the HyperScope as affording an enhancement to society's infrastructure for research and education, by providing people with a tool that increases their knowledge development and application capabilities. If his views prove to be correct, this work will ultimately lead to a significant increase in the \"Collective IQ\" of problem solving communities of every size, which will translate, for instance, into much more effective future educational systems.","title":"SGER: First Stages of Exploratory Development of HyperScope","awardID":"0553202","effectiveDate":"2005-11-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":[298971],"PO":["565227"]},"112963":{"abstract":"This project is supporting the NSF Wireless Networking PI meeting in December 2005. The meeting will be rich in new, exciting results in several areas of the wireless networks field. Important contributions are expected from the projects related to spectrum sharing, agile radio usage, and efficiency. In the past few years the wireless industry has become acutely aware of the spectrum limitations that have bounded communication system to a specific frequency band with a pre-selected modulation scheme. Progress in emerging technologies like Software Definable Radios (SDRs) and Cognitive Radios (CRs) will be reported by the PIs. Other significant breakthroughs will be likely announced in mesh and ad hoc architectures, cooperative wireless networking, and other areas.","title":"Workshop: Networking Technology & Systems PI Meeting - Los Angeles, CA. (7-9 December 2005)","awardID":"0553353","effectiveDate":"2005-11-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["558959","508494"],"PO":["7594"]},"112028":{"abstract":"This is funding to support a doctoral research symposium (workshop) of approximately 8 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2005 Symposium on User Interface Software and Technology (UIST 2005), to be held October 22-27 in Seattle, and sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI). The UIST conference is the premiere forum for presenting research results and innovations in the software and technology of human computer interaction. It brings together researchers and practitioners from diverse areas that include traditional graphical user interfaces, virtual and augmented reality, multimedia, new input and output devices, CSCW, ubiquitous computing and others. UIST is a long-standing annual conference, which will be meeting for the 18th time in October, but this workshop will be just the third doctoral research symposium associated with the conference. The three goals of the workshop are to increase the exposure and visibility of the participants' work within the community, to help establish a sense of community among this next generation of researchers, and to help foster their research efforts by providing substantive feedback and guidance from a group of senior researchers in the area in a supportive and interactive environment. Student participants will make formal presentations of their work during the workshop, and will receive feedback from a faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student position papers will be published in the UIST Conference Companion, and the students will also present posters relating to their work at a special session the first night of the conference.<br\/><br\/>Broader Impacts: The doctoral symposium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"WORKSHOP: UIST 2005 Doctoral Symposium","awardID":"0549354","effectiveDate":"2005-11-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["518043"],"PO":["565227"]},"101546":{"abstract":"This project addresses the provision of system support for applications that are forced or may benefit from use of alternate resources during their execution. The objective is to provide the application user as much of a sense of continuity as possible across reorganization of the application, including significant remodularization of the application. This project is an SGER that investigates and provides a proof of concept of two key problems: semantic reconfiguration and semantic checkpointing. Semantic reconfiguration is the process of reorganizing and remodularizing an application, based on alternate resources, while retaining the overall semantics of the application. Semantic checkpointing is the process of capturing and restoring state at the semantic level of the application itself, in contrast with capturing the state of the underlying hardware or operating system. To this end, the project is based on a distributed database application with specific consistency requirements, moving among combinations of low and high capacity servers and networks. The initial, handcrafted system includes: specification of the application and state to be checkpointed, component composition, conversion of checkpointing state, and the checkpointing itself. The contributions of this work are to 1) design and build the key algorithms to achieve semantic reconfiguration and semantic checkpointing, 2) understanding a path toward generalization and automation of these two tasks, and 3) identify and frame other key components required for complete automated transitions. As mobile applications become more prevalent, such a systematic approach will become increasing critical.","title":"SGER: Demonstrating the Feasibility of Semantic Reconfiguration and Semantic Checkpointing","awardID":"0451238","effectiveDate":"2005-11-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["125800"],"PO":["309350"]},"109491":{"abstract":"This is a project to understand essential issues related to rapid transfer of information and responsibilities in mission critical domains such as medical intensive care units, and to further our understanding of embedded technology as part of collaborative systems. Mission critical domains usually require continuous, high reliability operations in environments that are inherently unpredictable and sensitive to external events and threats. Examples of such domains include disaster responses, space missions, air transportation, military operations, industrial processing plants, financial institutions and hospitals. In such domains, information transfer always has implications for responsibility due to reliability and accountability requirements. <br\/><br\/>Workers often convene under extreme time pressure with the need to communicate often-complicated, yet safety-critical information in a short period of time with maximum reliability and efficiency. Interactions during such convening are \"critical discourses.\" Information technology plays an increasingly important role in supporting collaborative work. Designing next generation technology-embedded environments as part of collaborative systems depends upon our understanding of how rapid transfer of information and responsibility is achieved and how it might be enhanced, particularly during critical moments. The research will examine the phenomenon of critical discourses through field studies and field experimentation in one type of high stakes domain: intensive care units. The field studies are focused on essential issues related to rapid transfer of information and responsibilities, and the field experimentation is to further our understanding of embedded technology as part of collaborative systems.<br\/><br\/>Critical discourses are carried out through and are shaped by the information arena. Field studies will delineate the roles of information objects, which are often created by workers themselves through adaptation of information technology and are part of joint cognitive environments created by workers. This phase of the research will investigate and contrast three different types of hospital rounds (walking-rounds, sit-down rounds, and discharge rounds), and extend the findings to information transfer during cardiac surgery. Ethnographic methodologies as well as analysis of video records of hospital rounds will be used to develop a conceptual model of how participants in critical discourses create and interact through the information arena to achieve information transfer and to negotiate common interpretation of information. The model will describe structures of extreme discourses and main shaping factors of structures, such as preparatory activities, time pressure, and barriers to timely access to information. It will also depict stages and modalities of information transfer. The field experimentation will interject a large computer display to enhance the information arena. Analysis of interaction patterns with the display will further develop the conceptual model of critical discourses. <br\/><br\/>Information technology tools (e.g., large computerized displays and group decision-support systems) have typically been designed for tasks that are highly structured, with minimal time pressure and stable collaborators. Understanding critical discourses would provide insights for new generations of supporting tools that are likely to be used in mission critical domains. This research will deepen our understanding of information-transfer and responsibility-transfer in time-critical and safety-critical periods and provide new concepts and directions for the development of computer supported cooperative work tools that capitalize on the power of information technology. This will help information and computing technology improve safety and efficiency, and it will contribute to the general understanding of the role of information tools in joint cognition.","title":"Collaborative Research: Supporting Rapid Transfer of Information and Responsibility","awardID":"0534797","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[289873,289874],"PO":["388678"]},"109481":{"abstract":"Wilderness search and rescue (WSAR) is the task of finding and giving assistance to humans who are lost or injured in mountain, desert, lake, river, or other remote settings. Because of the vast distances involved in wilderness settings, searchers frequently depend on surveillance from helicopters and small airplanes. Although these resources are very useful for searchers, the have limitations: resources consume considerable cost, there can be delays between when the resources are needed and when they arrive, ground searchers and pilots must overcome communications barriers between them, and the aircraft may not be able to provide low level imagery because of flying restrictions associated with rugged terrain. The central hypothesis of this project is that mini (3-5 foot wing spans), fixed wing Unmanned Aerial Vehicles (UAVs) can be used by WSAR personnel to efficiently find people in the wilderness. The human factors issues associated with small UAVs are much different than those associated with large UAVs, mostly because small UAVs for WSAR personnel imply limitations on operator training, sensor capacity, autonomy capability, and flight time. The PI's plan is to develop operator interfaces and UAV autonomy for WSAR systems that allow people without RC-piloting skills to search an area, using either online or offline approaches. When working online, the PI will adopt a non-pilot operator perspective and design autonomy to allow operators working in an \"augmented virtuality\" environment to \"guide the camera\" rather than fly the UAV. In situations where information from a UAV's video is to be recorded and used in offline information retrieval and analysis, the PI will pursue an active mosaic approach in which video images are overlaid on terrain maps. The PI will employ a strongly human-centered approach in all phases of the project, both for creating the WSAR systems and for evaluating them, in which expertise from researchers in human-robot interaction, computer vision, controls, and artificial intelligence is integrated. User studies will include field tests with WSAR personnel, investigation of current work practice in WSAR teams, usefulness of active mosaicing for offline and online searches, and so on.<br\/><br\/>Broader Impacts: Each year, many people are lost or find themselves in jeopardy while hiking, boating\/kayaking, skiing, fishing, etc. Each year, wilderness search and rescue consumes thousands of person-hours and hundreds of thousands of dollars in Utah alone. With each hour that passes between the time that a person is lost and WSAR people find the victim, the effective search radius grows by approximately 3km. Each hour spent in the water or lost in the woods decreases the likelihood of a successful rescue. A portable UAV with appropriate interfaces, autonomy, and sensor processing at an affordable price should decrease the amount of time required between when searchers arrive at a scene and the time when aerial surveillance is present to support their efforts. Such a system would increase the probability of successful rescue.","title":"UAV-Enabled Wilderness Search and Rescue: A Human-Centered Approach","awardID":"0534736","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["521484","371283","507826"],"PO":["565227"]},"109460":{"abstract":"Autism is a pervasive developmental disorder that is characterized by a severe set of social and communicative deficits. Autism is diagnosed behaviorally; there is no known blood test, genetic test, or functional imaging method that can diagnose autism. Existing diagnostic methods provide primarily qualitative descriptions of dysfunctional social skills. Given the need to capitalize on early brain plasticity and thus maximize the beneficial impacts of intervention, there is a great need for novel, sensitive and quantified performance-based measurements of social vulnerabilities in young children with autism.<br\/>The goal of this project is to enhance methods for diagnosing autism by providing technology that can produce quantitative, objective measurements of social response from both passive and interactive recognition techniques. Passive recognition systems characterize social responses without directly taking part in the social interaction (for example, from cameras and microphones in the walls and ceiling of a room). Interactive robots will engage in social presses with an individual in the interest of eliciting a social response that can be measured directly. Preliminary data shows that these interactive systems can provide measurements which are free of subjective bias, which can be tailored to the needs of an individual, and which generate interest and motivation in many children with autism.","title":"Quantative measures of social response for autism diagnosis","awardID":"0534610","effectiveDate":"2005-11-15","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[289787,"497120","497125"],"PO":["387198"]},"109471":{"abstract":"For many practical geoscientific tasks, such as natural resource exploration, geohazard prevention or aquifer-characterization, geologists need detailed information about the underlying structure (3D shape) of subsurface rock formations in the form of a computer 3D Earth model. Advances in 3D computer graphics already allow geologists to effectively visualize geologic models in 3D stereo systems. However, the actual creation of such models, by interpreting the 3D geologic raw data spatially, is still severely limited by the lack of direct 3D interaction with 3D geologic data. This lack of interaction negatively impacts the quality of the Earth models and has, so far, limited their widespread use. The hardware costs for multi-model interfaces (specifically touch and sound) have dropped considerably in the past and could become mainstream technology in the next years. The project will investigate if virtual environments that use vision, touch and sound are potentially more effective for understanding and modeling 3D geologic shapes than the traditional, visual-only, systems. The focus of the project is to design and implement a variety of different interaction methods for deforming and cutting triangle meshes representing geologic surfaces (rocks and faults), using a combination of 3D stereo vision, force-feedback (haptic) technology and interactive audio streams (sonification). A thorough user evaluation of these interaction methods will test how well geologists are able to interactively correct spatial errors in the shapes of geologic surfaces i.e., overlaps or gaps with other surfaces. The project will result in a novel multi-modal geologic virtual reality system and will lay the foundation for the next generation of mainstream computer systems for modeling 3D geologic structures.<br\/><br\/>Broader Impacts: The ability to easily create and maintain 3D Earth models is fundamental to many areas of applied geology which in turn impact large parts of our society. The result of this project will be knowledge about the use of multi-modal (sensory) interaction methods for shaping geologic surfaces and will aid their integration into future mainstream 3D geologic modeling systems. Providing the everyday geologist with more efficient interaction methods will lead to significant improvements in the creation of 3D computer models with regards to speed and quality. Many geoscientific tasks are critically dependent on access to the best possible, qualitative information about geologic structure and so stand to benefit from the potential improvements resulting of this project, such as: exploration and exploitation of natural resources (e.g., minerals or petroleum), characterization of rock units for hydrogeologic tasks (such as groundwater flow modeling) and geotechnical applications (such as slope failure prediction). This multi-modal VR system will be implemented as an open source project and will be made available via the web to any geoscientists interested in exploring its potential benefits for research or classroom teaching.","title":"Modeling 3D Geologic Structures in a Multi-sensory (Touch and Sound) Virtual Environment","awardID":"0534681","effectiveDate":"2005-11-15","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["562298","507725","430000"],"PO":["565227"]},"109571":{"abstract":"This project studies general purpose heuristic problem solving through development of (1) efficient strategies and algorithms for solving combinatorial optimization problems, and (2) effective methods for exploiting intrinsic problem features of phase transitions and \"backbones\" -- that is, variables that need to be fixed among all optimal solutions -- to solve these problems. The general approach of this project is to mechanize problem solving using mathematical means. Each of the two research thrusts of the project involves several subtopics. The first thrust is to develop a general approach to heuristic problem solving that involves a new set of methods for automatically developing heuristic strategies and search algorithms. It employs a representation scheme using a constraint programming paradigm, a set of constraint manipulation methods for deriving heuristic functions, and a learning scheme to automatically determine the 'right' combination of heuristic functions and search methods for a given problem. The second thrust focuses on utilizing intrinsic problem features, particularly phase transitions and backbones. The project plans to consider a variety of problems, including combinatorial optimization problems (e.g., the Traveling Salesman Problem), constraint optimization problems (e.g., scheduling and resource allocation), and complex optimization problems in computational biology (e.g., sequence alignment and haplotype inferencing). The results of this research could have a very broad impact in computer science and beyond (e.g., operations research, computational molecular biology) due to the great variety of problems that can be approached through heuristic search and combinatorial optimization.","title":"Mechanistic heuristic problem solving and heuristic search algorithms that exploit phase transitions and backbones","awardID":"0535257","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["356253"],"PO":["387198"]},"109572":{"abstract":"Programming robots that function robustly in unstructured environments has met with limited success. In contrast, humans can often successfully teleoperate a robot to accomplish complex tasks in natural environments, using only the robot's sensors and actuators. The goal of this proposal is to exploit the knowledge encoded in the actions of human teleoperators to learn more robust controllers for autonomous robot tasks. <br\/><br\/>The first step is to refine the huge volumes of data available to the robot to a set of features or percepts, which are both tractable for our systems to process, and sufficient to perform the task at hand. One way to empirically satisfy these constraints is to demonstrate whether a human user can execute the task in a teleoperation setting, given only the displayed sensor features. We will identify task appropriate feature sets by analysis of teleoperator performance (success, speed, distance etc.) under displayed feature combinations.<br\/><br\/>The proposed approach to learning robust controllers can be summarized as: 1) a human demonstrates a task remotely; 2) recorded sensor sequences are used to learn compact low dimensional manifolds that represent regions of the feature space safe for a robot to traverse; 3) a reinforcement learning paradigm is employed to find task-optimal paths within the manifolds. The skill or task is considered mastered when the robot's performance equals or exceeds the human's. The learned controller autonomously directs the robot, and reinforcement reward is used to autonomously optimize it. However, whenever the robot runs into difficulties, the human operator can take over, generating new examples used to modify and refine the manifold.","title":"Human-to-Robot Skill Transfer","awardID":"0535269","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[290083,"290085",290085],"PO":["543539"]},"109363":{"abstract":"Although there appear to be many clear benefits to using multimodal human-machine interfaces in terms of increased information transfer, there are also potential performance costs that may result from inter-sensory biases, degraded processing associated with attending to more than one sensory modality, and inhibitory interactions in crossmodal reorienting. The creation of effective and intuitive multimodal interfaces hinges on the ability of the designer to recreate the natural integration between sensory modalities that occurs in the real world (e.g., when we look towards a voice in a crowd). Unfortunately for the interface designer, the conditions that distinguish between \"good\" and \"bad\" inter-sensory interactions have not been clearly elucidated. There remain many basic research questions in the realm of sensory integration that must be answered to optimize multimodal human-machine interfaces. In this project the PIs will conduct a series of basic psychophysical experiments to investigate several crucial outstanding issues in the development of multimodal human-computer interfaces. First, the spatial and temporal parameters needed to achieve faster response times will be identified through a systematic parametric investigation of crossmodal interactions using visual, auditory and tactile signals. Second, because for many human-machine interfaces it is necessary to present signals from distinct areas of the display, the PIs will explore the crossmodal mapping between proximal and distal surfaces by extending their pilot research which has demonstrated that tactile cues presented to a user's back can be used to speed responses to visual targets presented on a monitor in front of the user. Knowledge gained from the aforementioned experiments will be applied to the development of a novel haptic directional display for automobile driver assistance, whose effectiveness will be tested in a series of driving simulator experiments.<br\/><br\/>Broader Impacts: This project will significantly advance our understanding of human multi-sensory integration, and will provide a framework that can be used to guide both future research and the engineering of multimodal human-machine interfaces. The haptic driver assistance display to be developed will help transform automobile information technology, reducing the serious problem of driver distraction.","title":"Sensory Integration of Multimodal Human Computer Interfaces","awardID":"0533908","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["464438","441541"],"PO":["565227"]},"109463":{"abstract":"This is a research project in the field of distributed implementation, in which the goal is to facilitate collaboration between self-interested agents but without centralized computation and without the direct revelation of private information. This generalizes mechanism design, which is inherently centralized, in a way that makes it more relevant for many distributed systems. The intention is that distributed implementation will facilitate the integration of methods for cooperative problem solving in Distributed Artificial Intelligence (DAI) with the methods to handle self-interest in computational mechanism design. <br\/><br\/>One often imagines that collaborative systems are those for which the participants have some intrinsic altruism. But in fact, collaboration can also be promoted between participants with intrinsic self-interest. For instance, while participants in a team may share high-level common goals, each individual may prefer that others perform tasks. Careful design can provide appropriate incentives to promote collaborative behavior in many domains, including: automated task allocation amongst a team of workers (e.g. at an airport or a hospital); for collaborative network protocols (e.g. peer-to-peer routing, grid computing); and also in e-commerce domains (e.g. for the automation of logistics such as fleet procurement and scheduling between shippers and carriers).<br\/><br\/>This project will significantly extend both the theory and practice of distributed implementation, moving beyond overarching principles to the design and analysis of specific (constructive) protocols. One fundamental problem that it will address is that of distributed sequential decision making with self-interested participants. Many systems are dynamic, and as such it seems important to study how to apply recent methods in sequential decision making with a central mechanism in our distributed context. This research will study the problem of distributed (but episodic) constrained optimization, adapting existing algorithmic methods from DAI in order to make them work with self-interest. It will also consider settings in which computation is costly, which raises new tensions. Finally, it will expand the theory to address multi-agent systems with richer agent behaviors, including mixtures of obedient, self-interested, faulty and malicious agents. This will make the theory even more relevant in practical systems.<br\/><br\/>Advances in distributed implementation will have a direct impact in a number of areas. For distributed computational systems such as grid computing, peer-to-peer, and ad hoc networks, this research can promote optimal and coordinated decision making (for instance on how to allocate resources, store content, route packets) within the system and without requiring some trusted third-party. For e-commerce, it can enable trading with dynamic pricing amongst mobile users with wireless devices in public spaces, such as in shopping malls, on campuses and at ball games. More broadly, distributed implementation can promote collaboration within firms and other organizations, for instance providing automated task allocation to workers in dynamic and complex domains such as airports and hospitals. An important component of the research plan involves the continued integration of these ideas into both undergraduate and graduate curricula at the interface between computer science and economics.","title":"Distributed Implementation: Collaborative Decision-Making in Multi-Agent Systems with Self-Interest","awardID":"0534620","effectiveDate":"2005-11-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["541779"],"PO":["564456"]},"109541":{"abstract":"This is an interdisciplinary research project on the premises, requirements, and effects of fully mobile, wirelessly connected applications on information load and use, work organization, informal organization, worker job satisfaction, and organizational transformation in local government. Digital Government impacts the way the business of government is done. Recently, governments have begun examining and testing the potential of fully mobile wirelessly connected (FMWC) applications, which give government field operations an unprecedented quality of immediacy in information availability needed for critical ad-hoc decision making. Many FMWC applications are also sensitive to the ambience and to the needs of a specific individual worker. The potential utility and efficacy of these applications might significantly help advance the Digital Government agenda. Since major variables of the organizational and work context are immediately impacted, the introduction of new base technologies is highly risky. By developing an analytical and formative model, this research intends to contribute to the understanding of critical interdependencies and interactions between important variables.<br\/><br\/>Through field studies, observation and interviews, the research team will iteratively develop a formative model representing the constraints, interactions, and interdependencies of the studied fieldwork domains and their contexts, in which FMWC applications are either already in use or are under consideration for use. Based on this work- and task-anchored model, the team will develop the requirements and characteristics of FMWC devices and applications. Also included will be an analysis and specification of the organizational, social, individual, and technological impacts of FMWC applications for various fieldwork types.<br\/><br\/>Intellectual Merit<br\/>This project has the capacity to break new ground in the following areas: (1) With the fieldwork domain-centered approach, going beyond specifying the factors influencing the organizational outcomes of FMWC application uses as most research has done so far, and determine the effects of their interactions and interdependencies within a formative framework. (2) the formative framework increases the explanatory power of the structuration perspective on Information and Communication Technology (ICT) as introduced by Orlikowski & Robey (1991). (3) there will be further definition of the requirements for FMWC applications and workflows as well as the policy choices available to decision-makers in Digital Government. In this regard, the proposed research contributes to the understanding of the elements and processes leading to the organizational success of FMWC applications in Digital Government, and provides a mechanism for the evaluation of such technology in use or when considered for use.<br\/><br\/>Broad Impact<br\/>This research will help define strategic choices and avoid costly failures when adopting FMWC applications in Digital Government, and will also inform both academics and practitioners about the organizational prerequisites, consequences, and the specific requirements regarding FMWC technology. The potential utility of the expected findings on FMWC applications and fully mobile modes of operation, however, are not limited to government. They may be highly informative to other environments including private-sector organizations and institutions in the education sector.","title":"Fully Mobile City Government","awardID":"0535088","effectiveDate":"2005-11-01","expirationDate":"2011-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[289997,289998,289999],"PO":["543481"]},"109464":{"abstract":"This project will further develop case-based reasoning (CBR) techniques for the automatic generation of multi-modal drawing-structure-behavior-function (DSBF) teleological models from line drawings. The focus in this project is on conceptual-that is, preliminary, qualitative-designs involving linear and rotational motion. The employed approach takes its motivations from current practice in computer-aided design (CAD), which uses a variety of \"modal\" information (e.g., sketches, drawings, 2-D and 3-D geometric models), and focuses on perceptual information. A long-term practical goal of the project is to contribute to a new generation of CAD tools that can support the use of teleological models in conjunction with drawings. The long-term theoretical goal is to build a computational theory of multi-modal CBR in teleological modeling and design. In this project, case memory consists of DSBF models of known drawings, and cases are indexed by their drawings as well as their functions. Given a target drawing of a kinematics device, the CBR system retrieves a DSBF model of a known drawing that is considered to be similar to the new drawing. The DSBF model then guides the transfer and adaptation of the DSBF model of the retrieved drawing into a candidate DSFB model for the new drawing. The proposed research is developing the idea of multi-modal patterns of regularity, called Generic Visual Teleological Mechanisms (GVTM). GVTM would be used to help map differences between the new and the known drawings into the DSBF model of the known drawing, and to enable the system to reason about the differences between drawings (e.g., different components, different configurations of the same components). The quality of the DSBF models constructed is to be evaluated by reusing them in a legacy system for a different ask, namely, automated generation of a structure for a design achieving a specified function. One of the broader impacts of this work is on the next generation of CAD systems and CBR systems in general. Another contribution would be the use of the SBF methodology for teleological modeling as a technique for teaching and learning causal models in science and engineering, for instance, by the research team at Georgia Tech working together on an NSF SLC (Science of Learning Centers) Catalyst grant.","title":"Multimodal Case-Based Reasoning in Modeling and Design","awardID":"0534622","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["539354"],"PO":["564316"]},"109486":{"abstract":"To explore the merits of continuous coordination, this project will research, develop, and evaluate a collaborative software infrastructure called Neon, that transcends the traditional distinction between formal and informal coordination. Many problems require collaborative efforts by groups of people and it has been a long-term goal of many researchers to provide software systems to support collaboration. In general, these systems take either a formal or informal approach. Formal coordination is achieved by partitioning work into separate, insulated activities that are periodically shared and resynchronized. Informal coordination is supported by a variety of human activities; often they are ad hoc, but from a general perspective, they are intended to raise awareness of concurrent actions. Neither formal nor informal approaches alone are satisfactory. In particular, the strict isolation maintained in formal coordination frequently leads to integration problems at coordination points and informal coordination has difficulty scaling and often leads to problems of visibility and awareness. These problems compound when confronted with the reality of coordination needs in distributed, collaborative settings: e.g., how to account for the fact that different groups and tasks require different levels of coordination that must continuously be adjusted to support the coordination needs of the situation at hand?<br\/><br\/>This research parts with two fundamental assumptions underlying approaches to date. First, it breaks the long-standing belief that formal and informal coordination must be treated as opposites, or even that one form is subsidiary to another. Second, it parts with the traditional approach of treating coordination as a strategy that is selected at initiation of an activity and then maintained throughout the duration of that activity. Instead, Neon will follow an integrated and dynamic approach to supporting collaborative work that combines formal and informal coordination and supports fluidly changing levels of coordination. The result, continuous coordination, is highly flexible and continuously adapts coordination support to the needs of the task at hand.<br\/><br\/>Underlying Neon is a coordination protocol that supports applications with three critical design elements: multiple perspectives, translucency, and non-obtrusive integration. Neon raises both technical and social research questions: (1) how to share, condense, and visualize high volumes of information regarding parallel and potentially dynamic activities, (2) what protocols will support workspace-to-workspace communication and collaboration, (3) what levels of information sharing and collaboration will and will not be tolerated by developers, and (4) how, if at all, will users change their work habits?<br\/><br\/>The research will empirically evaluate Neon in three application domains: configuration management, software design, and face-to-face, ad-hoc collaborative meetings, which represent a broad range of collaborative settings and requirements. Studies will involve laboratory experiments, controlled experiments in classes, and field studies at NASA\/Ames and IBM Research.<br\/><br\/>Continuous coordination is a novel approach to effective collaboration in complex, dynamic, distributed settings. The principle of continuous coordination is general and not limited to the three examples of configuration management, software design, and face-to-face meetings. Results are likely to transfer to many domains of broad societal impact, such as collaborative learning, collaborative research and analysis, and emergency response.","title":"Unifying Formal and Informal Collaboration through Continuous Coordination","awardID":"0534775","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["483634","551130"],"PO":["564456"]},"113292":{"abstract":"The flooding of New Orleans in the wake of Hurricane Katrina on August 30 revealed several fissures in local, state, and national strategies for emergency preparedness and disaster relief. Geographically, the hardest hit areas were those inhabited by socioeconomically marginalized communities; these also were the areas that had restricted access to communications about evacuation, the extent of the flooding, and evacuation procedures. The Katrina disaster serves as a wake-up call and reveals how racial inequality and economic disparities are still a societal reality. There is an urgent need to analyze the spatial, socioeconomic, and psychological consequences of Hurricane Katrina and its aftermath on the most vulnerable segments of our society: those who are economically marginalized, racially marked, spatially segregated, and\/or linguistically isolated. <br\/><br\/>The interdisciplinary team consists of geographers, Asian- and African-Americanists, Vietnamese language specialists, a nursing scientist, sociologist, and historian with complementary analytical and language skills. The study area is located in the easternmost sections of New Orleans residential subdivisions that have an almost equal distribution of Vietnamese Americans and African Americans. <br\/><br\/>The research will address: (1) The pre-Katrina socio-spatial configuration of the Vietnamese American and African American communities in the study area, and what damage Katrina caused to these communities. (2) Whether previous experiences of involuntary geographic displacement of evacuees, especially among Vietnamese Americans, as well as gender, cultural, linguistic, legal status, geographic, and socioeconomic differences affect their perceptions of risk and uncertainty, access to emergency relief services. Also, it will examine which similarities and differences exist between the two communities in how each community negotiates evacuation and access to emergency relief services, relocation assistance and rebuilding funds through existing racial\/ethnic and\/or faith-based community networks, as well as their adaptation to temporary or permanent resettlement of their community and business rebuilding efforts in New Orleans. (3) The similarities and differences in physical and psychological vulnerability between the two groups of interests after the disaster and what are the critical factors contributing to their physical and psychological outcomes. <br\/><br\/>This study will evaluate the mental and organizational decision-making process by the two study groups in the face of uncertainty and produce policy recommendations to better serve the needs of such communities during the recovery period and better prepare for similar disasters in future.","title":"SGER Collaborative Research: Surviving Katrina and its Aftermath:A Comparative Analysis of Community Mobilization and Access to Emergency Relief by Vietnamese and African Americans","awardID":"0555135","effectiveDate":"2005-11-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":["280792","280792","299987",299987,299988,299989,"359346"],"PO":["380485"]},"109487":{"abstract":"Mixed- and augmented-reality (MR-AR) techniques extend the virtual reality (VR) paradigm by selectively augmenting the physical environment with computer-generated objects or vice versa, and consequently create tremendous interest in exploring a wide range of applications such as scientific visualization, medical diagnosis and surgery planning, and training and education. However, lack of image brightness common to many existing 3D display systems imposes significant restrictions on the lighting conditions of the working environment, forcing users to turn off or dim room lighting for most MR-AR demonstrations, and eliminating application scenarios where well-illuminated environments cannot be avoided (e.g., outdoor environments and surgical operating rooms). In this project the PI will seek to alleviate this problem by developing a prototype ultra-bright head-mounted polarized projective display, in which advances in optical design coupled with careful manipulation of the polarization state of the light passing through the optical system results in an observed image that is theoretically up to 4 times brighter than is possible to achieve in existing designs. Because the measure of display technology is that it provide quantitative and qualitative visual representations of scenes that conform to a predictive model, the PI will further devise methods for calibrating the new display's parameters, and evaluate both subjective and objective image qualities as well as the accuracy of depth\/size representation.<br\/><br\/>Broader Impacts: This research will result in better displays suitable for demanding MR-AR applications where bright and high-contrast virtual images are required and only minimal intrusion by real-world views is acceptable. This in turn will spur development of MR-AR solutions in domains for which illumination has until now been an insurmountable challenge.","title":"Development and Assessment of an Ultra-Bright Polarized Head-Mounted Projective Display","awardID":"0534777","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["485281"],"PO":["565227"]},"109388":{"abstract":"Automatic dictation software with reasonably high word recognition accuracy is now widely available to the general public. Many people with gross motor impairments, including some people with cerebral palsy and closed head injuries, have not enjoyed the benefit of these advances, however, because their general motor impairment includes a component of dysarthria, that is to say reduced speech intelligibility caused by neuro-motor impairment, while the motor impairment often precludes normal use of a keyboard. For this reason, dysarthric users often now find it easier to use a small-vocabulary automatic speech recognition system, with code words representing letters and formatting commands, and with acoustic speech recognition models carefully adapted to the speech of the individual user. But development of such individualized speech recognition systems remains extremely labor-intensive, because so little is understood about the general characteristics of dysarthric speech. In this project, the PI will study the general audio and visual characteristics of articulation errors in dysarthric speech, and apply the results to the development of speaker-independent large-vocabulary and small-vocabulary audio and audiovisual dysarthric speech recognition systems. More specifically, the PI will research word-based, phone-based, and phonologic-feature-based audio and audiovisual speech recognition models for both small-vocabulary and large-vocabulary speech recognizers designed for unrestricted text entry on a personal computer. The models will be based on audio and video analysis of phonetically balanced speech samples from a group of speakers with dysarthria, categorized into the following four groups: very low intelligibility (0-25% intelligibility, as rated by human listeners), low intelligibility (25-50%), moderate intelligibility (50-75%), and high intelligibility (75-100%). Interactive phonetic analysis will seek to describe the talker-dependent characteristics of articulation error in dysarthria; based on analysis of preliminary data, the PI hypothesizes that manner of articulation errors, place of articulation errors, and voicing errors are approximately independent events. Preliminary experiments also suggest that different dysarthric users will require dramatically different speech recognition architectures, because the symptoms of dysarthria vary so much from subject to subject, so the PI will develop and test at least three categories of audio-only and audiovisual speech recognition algorithms for dysarthric users: phone-based and whole-word recognizers using hidden Markov models (HMMs), phonologic-feature-based and whole-word recognizers using support vector machines (SVMs), and hybrid SVM-HMM recognizers. The models will be evaluated to determine overall recognition accuracy of each algorithm, changes in accuracy due to learning, group differences in accuracy due to severity of dysarthria, and dependence of accuracy on vocabulary size.<br\/><br\/>Broader Impacts: This research will lay the foundation for constructing a speech recognition tool for practical use by computer users with neuro-motor disabilities. Tools and data developed in this project will all be released open-source, and will be designed so they can be easily ported to an open-source audiovisual speech recognition system for dysarthric users. The work may also have applicability beyond the target community, in that project outcomes may be relevant to many other populations (e.g., people with foreign accents) who have trouble training current ASR systems.","title":"Audiovisual Distinctive-Feature-Based Recognition of Dysarthric Speech","awardID":"0534106","effectiveDate":"2005-11-15","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550184",289589,"426305",289591],"PO":["565227"]},"113293":{"abstract":"The central question of the study is about the role that social (and kinship) networks in determining a person's success in the aftermath of a natural disaster such as Hurricane Katrina. \"Success\" refers to the individual's capacity to obtain physical and emotional relief as well as to maintain a strong perception of eventual community recovery in the immediate disaster aftermath. <br\/>Social networks serve as the glue holding individuals together, they form much of the structure from which the information comes that we use to make decisions and take actions. Social networks may protect individuals from disasters like Hurricane Katrina and they may act as an emergency response system to aid recovery after such disasters. Some social networks are strong while others are weak. Some individuals with the same level of wealth may have suffered a similar level of damage to their lives from Hurricane Katrina, but some cope well personally and economically while others do not. Many individual attributes affect the responses as do attributes of social networks. Understanding the attributes of these social networks could prove valuable in both preparing for and recovering from future disasters. For example, extensive local area family ties, strong ties with neighbors, or the development of neighborhood and civic organizations may each be key to having people both be better prepared for a future disaster and recover from it. If so, then for those communities without strong local family ties, the neighborhood and civic organizations may more frequently necessary to prepare for disaster preparation. . <br\/>To study the role that social networks play, the researchers will conduct a field survey in Hancock and Harrison counties, two of the hardest counties in the Mississippi Gulf Coast region. The survey instruments will measure the strength and number of kinship and neighbor relationships for individuals within various Mississippi Gulf Coast communities. The analysis will provide a measure of bonding and bridging networks within their immediate community. Measures of personal relief and perceptions of recovery will be examined in a statistical analysis. A similar analysis will be used to look at the effects of individuals' social and kinship networks versus their socio-economic standings on disaster relief and recovery perceptions. The broader impact of this research is that it will enhance the ability of communities and groups to understand how aspects of public policy, health, safety and public welfare can be addressed in advance and in the aftermath of catastrophic natural events by identifying community social networks.","title":"Evacuees Perceptions of Disaster Relief and Recovery: Analyzing the Importance of Social and Kinship Networks Among Hurricane Evacuees on the Mississippi Gulf Coast","awardID":"0555136","effectiveDate":"2005-11-15","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":[299992,299993,"559285"],"PO":["380485"]},"109411":{"abstract":"The objective of this project is to solve technical problems that need to be overcome to build socio-cognitive orthotic systems, which will augment human cognitive capabilities to promote social interactions. Information technology can help a person with cognitive impairment in managing his or her everyday life, by modeling the activities the person wants or needs to do, monitoring the person's activities as they unfold, and guiding the person to ensure that the most important activities occur. Thus, information technology can provide a cognitive orthotic that augments reduced cognitive abilities and helps the person live independently. Unfortunately, though, replacing dependence on other people with reliance on information technology can mean fewer opportunities for social interaction, which in turn can lead to loneliness and isolation. <br\/><br\/>To solve this problem, a person's socio-cognitive orthotic system could be networked with the systems of other people. Now, as time passes and people make choices about their activities, these choices can help bring about, or make more difficult, potential planned social activities. Thus, the networked orthotic systems, as agents acting on behalf of their associated users, need to behave as a collaborative multi-agent system to cooperatively manage the users' plans. Each separate system needs to monitor and guide its user's activities while giving its user as much autonomy as possible to independently control his or her day, and yet must also attempt to maintain desirable options for social activities that obviously must be timed well with the schedules of other participants. And all this should be done in a timely, adaptive, and efficient way. <br\/><br\/>The hypothesis that this project will investigate is that incorporating hierarchical activity abstractions and richer constraint models into well-founded temporal constraint network representations, and augmenting distributed constraint reasoning techniques to adaptively handle these more flexible representations, will provide a principled and efficient foundation for collaborative plan management systems for individual and social activities. Some of the key ideas to be investigated include: using abstract activity specifications that can postpone commitments about which particular activities will be done, when, and by whom, until decisions need to be made; developing algorithms that can exploit, and even introduce, abstractions in activities, their timing, and (for social activities) their participants to increase flexibility and to reduce computation and communication; representing alternative activity plans, even if they contradict each other, to leave many options open for important social (and individual) activities; and capturing activity importance and costs of violating constraints in the models to calculate tradeoffs in the (likely) case where the multi-agent plans evolve such that contentions arise. <br\/><br\/>The project will build from the current state-of-the-art in hierarchical multi-agent planning and coordination, single-agent plan management, and distributed constraint reasoning. It will incorporate new ideas in multi-agent activity modeling, continual distributed constraint network maintenance, and adaptive refinement and constraint relaxation mechanisms, to innovate practical computational techniques that will scale to multi-agent applications involving complex interrelationships in continually-evolving worlds. The project will design, develop, analyze, and empirically test novel techniques for continual collaborative multi-agent management of loosely-coupled plans, a problem that deserves more study and for which no general intuitions or solution methods exist. <br\/><br\/>Developing socio-cognitive orthotics, where information technology can be cost-effectively used to simultaneously promote independence while combating isolation for cognitively-impaired people, can have tremendous societal benefits. A further expected impact of this project is that it will form the basis for a course in information technology for cognitive assistance, which will introduce first-year undergraduates not only to computer science concepts but also to the possible societal contributions computer scientists can make. It is expected that such a course can attract more students, and particularly women and minorities, to major in computer science.","title":"Multi-Agent Plan Management for Socio-Cognitive Orthotics","awardID":"0534280","effectiveDate":"2005-11-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["438665","333698"],"PO":["564456"]},"109543":{"abstract":"Each year Federal regulatory agencies issue more than 4,000 new rules. Many of these must be created through a process known as notice and comment (N&C) rulemaking: the agency drafts a proposed rule and then exposes the proposal, any underlying data, and its legal and policy rationale to public comment. N&C rulemaking is one of the most important methods of contemporary public policy making; it is also one of the slowest and most expensive. Although an agency may receive hundreds of thousands of comments for a proposed rule, its legal obligation is to review and respond to all significant comments. As requirements to consult, study, and\/or certify have proliferated, rule writers have found it increasingly difficult to keep track of them and to recognize which, if any, are relevant in a particular rulemaking. Electronic rulemaking (eRulemaking) has the potential to radically transform the N&C process. It could make the process more transparent and accessible to the public, and more substantively reliable and cost-effective for the agency. So far, though, E-docket systems and eRulemaking workbenches make only rudimentary use of available technology.<br\/>This grant will use well-developed and emerging methods of natural language processing (NLP) to develop tools to aid agency rule writers in: (1) organizing, analyzing, and managing the comments, studies, and other supporting documents associated with a proposed rule; and (2) analyzing proposed rules to flag possibly relevant legal mandates from among the large number of statutes and Executive Orders that potentially require<br\/>analyses, consultations, or certifications during rulemaking. The research team will collaborate with the Federal Departments of Transportation and Commerce. The team will focus, in particular, on the use of<br\/>information extraction, text categorization, and opinion-oriented text analysis techniques in both supervised and weakly supervised machine learning frameworks. Evaluation will involve: the use of accepted technical measures of NLP performance (e.g., recall and precision); a combination of qualitative and quantitative social science methods to assess integration of the tools into the rulewriting process as perceived by staff at various levels of the agency hierarchy; and observation by legally-trained researchers with expert understanding of the rulemaking process.<br\/><br\/>Intellectual Merit. <br\/>The research will help realize the positive potential of eRulemaking, advance the state-of-the-art in NLP, and improve our understanding of the effects of technology on rulemaking. Because of its interdisciplinary composition - combining expertise in NLP, expert knowledge about regulatory law and legal information systems, and social science experience in the effect of technology on organizations - the Cornell team is well situated to generate both qualitative and quantitative data about the crucial, but still<br\/>largely under-studied, rulemaking process.<br\/><br\/>Broader Impacts.<br\/>The project provides an important opportunity for interdisciplinary education and research for PhD, master's, and undergraduate students in Cornell's Information Science Program. All data sets and tools will be made available to other researchers. The NLP methods to be developed are general-purpose techniques, trainable for any domain or genre, and useful in any context that requires managing, organizing, and analyzing large volumes of text. Finally, many of the same techniques that help agency rule writers can be used to design<br\/>agency websites that help the public search, sort, and otherwise selectively access materials in the rulemaking process.","title":"Natural Language Processing Support for eRulemaking","awardID":"0535099","effectiveDate":"2005-11-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["548297","548296"],"PO":["563751"]},"109444":{"abstract":"This research addresses one of the most important problems in human-computer interaction: interruption. E-mail notifications, agent requests, system alerts, and instant messages all periodically interrupt a user's tasks. Studies show that when tasks are interrupted at random moments, users take more time to complete tasks, commit more errors, and experience more frustration, annoyance, and anxiety than when tasks are interrupted at scheduled, opportune moments. In safety critical domains a small response delay or error committed due to poorly timed interruption can cost human lives or cause catastrophic damage, while in office settings increased frustration and anxiety hurt the user experience. When extrapolated over millions of users, the collective impact of interruption is quite remarkable. Nevertheless, users often desire or need the benefits that proactive systems provide, e.g., enabling near instant communication, maintaining awareness of information, being reminded of upcoming activities, learning to perform complex tasks, etc. The PI's basic hypothesis is that rather than interrupt immediately, proactive systems should wait for an opportune moment, that is to say a moment of lower mental workload such as at a task or subtask boundary, in a task sequence. In this research the PI will develop a theoretically-grounded framework and software that enable users to retain the benefits of proactive systems while mitigating negative effects of periodic interruption, thereby allowing users to be more productive and to experience less frustration, annoyance, and anxiety when multi-tasking. The framework will consist of empirically-based heuristics for assigning costs of interruption to various moments in a task, a description language for concisely expressing a broad range of user task behaviors, a task monitor that tracks execution of user tasks and builds a predictive model of execution, a decision algorithm that determines when to interrupt given a time window and a user's current position in a task, related tools, and empirical results and lessons. As part of the framework, the PI will develop attention manager software that defers granting requests for user attention until opportune (i.e., low cost) moments during task execution., yet which is useful even for requests with short timeframes due to urgency or relevance. The PI will empirically compare how well his attention manager balances awareness of information with mitigation of negative impact relative to other known strategies for interruption management.<br\/><br\/>Broader Impacts: This research will refine and demonstrate a method for aligning mental workload to a model of task execution that will facilitate the use of workload as a new metric for evaluating complex interfaces. Project outcomes (including software) will be widely disseminated. The PI will furthermore integrate results from this research into a graduate course on human-computer interaction that offers multi-disciplinary perspectives on human attention; and will encourage participation from under-represented groups by funding at least one graduate assistant from an under-represented group for this research and by hosting two students from UIUC's Summer Research Opportunities Program each summer.","title":"A Framework and System for Intelligent Interruption Management","awardID":"0534462","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["515821"],"PO":["565227"]},"109565":{"abstract":"The ultimate aim of this investigation is to develop computer systems capable of operating autonomously in dynamic and uncertain environments. Specifically, the investigation comprises theoretical and experimental studies in the following areas: (1) Information fusion, situation assessment, diagnosis, and planning under uncertainty using causal and counterfactual relationships; (2) Automatic generation of natural language explanations of actions, recommendations, and unexpected eventualities; and (3) Learning causal structures from data to facilitate predictions and decisions in data-intensive applications. Priority will be given to new methods of generation explanatory sentences and to structural learning tasks in molecular biology. The theoretical part of the research is fundamental to our understanding the structure of human knowledge and scientific inquiry, and could have far-reaching broader impact in the fields of epidemiology, social science, economics, medicine and biology, where causal knowledge plays a major role.","title":"Probabilistic Networks for Automated Reasoning","awardID":"0535223","effectiveDate":"2005-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["541989"],"PO":["387198"]},"109412":{"abstract":"Multimodal human-computer interaction has emerged as a major research topic during the past decade. This trend can be expected to continue, as designers struggle to address challenges such as data overload, the need for increased expressive power of modern technologies, and support for time sharing and attention management in a variety of complex real-world domains. To ensure the robustness of multimodal interface designs, it will be critical to consider recent findings from behavioral and neuro-physiological research, which suggest the existence of considerable crossmodal constraints on attention in the form of modality expectations, modality shifting, and spatial and temporal crossmodal links. Despite their potential for leading to performance breakdowns in human-computer interaction with potentially catastrophic consequences, these constraints have received little attention in guidelines for, and the design of, multimodal interfaces. In an effort to address this shortcoming, the PI's main goals in this project are: (a) to determine whether performance effects of crossmodal links in attention that were reported in laboratory research scale up to complex real-world domains; (b) to determine whether tactile and peripheral visual cues, which were not considered in most earlier research on multimodal information processing, but which are increasingly included in multimodal interface design, are affected by crossmodal constraints to the same extent as foveal visual and auditory system output; and (c) to establish the effectiveness of an adaptive approach to multimodal information presentation for exploiting the performance benefits, and eliminating the performance costs, of crossmodal interactions. The particular application domain for this research will be Air Traffic Control (ATC), a complex data-rich environment where difficulties with processing multimodal information are contributing to workload bottlenecks, breakdowns in situation awareness, and operational errors. The number of concurrent attentional demands in this domain continues to increase with the introduction of advanced automation technologies. Faced with these challenges, air traffic managers at the Cleveland En-Route Traffic Control Center have indicated a strong interest in collaborating with the PI on this research. They will conduct a contextual inquiry and focus groups with controllers, and allow controllers to participate in experiments, whose purpose is to inform the design and iterative refinement of a multimodal ATC interface that includes visual, auditory, and tactile cues, where parameters such as the timing, salience, and location of cues can be adjusted dynamically in an attempt to exploit the benefits and avoid the performance costs of crossmodal links in attention. The investigation will take place in the first stage within the context of a medium-fidelity ATC simulation in the PI's laboratory, and will later move to the dynamic ATC simulation facility at Cleveland Center.<br\/><br\/>Broader Impacts: The findings from this research will advance our knowledge and understanding of multimodal information processing and, more specifically, the nature and extent of crossmodal links between vision, audition, and touch. The results will also inform the design of future multimodal displays for data-rich event-driven domains such as aviation, medicine, or process control, and thus promote the safety of operations in these workplaces and benefit society through the transfer and application of basic research to applied system design.","title":"Crossmodal links in attention between vision, audition, and touch: Their implications for the design of adaptive multimodal interfaces","awardID":"0534281","effectiveDate":"2005-11-15","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[289648],"PO":["565227"]},"109467":{"abstract":"This is a project to understand essential issues related to rapid transfer of information and responsibilities in mission critical domains such as medical intensive care units, and to further our understanding of embedded technology as part of collaborative systems. Mission critical domains usually require continuous, high reliability operations in environments that are inherently unpredictable and sensitive to external events and threats. Examples of such domains include disaster responses, space missions, air transportation, military operations, industrial processing plants, financial institutions and hospitals. In such domains, information transfer always has implications for responsibility due to reliability and accountability requirements. <br\/><br\/>Workers often convene under extreme time pressure with the need to communicate often-complicated, yet safety-critical information in a short period of time with maximum reliability and efficiency. Interactions during such convening are \"critical discourses.\" Information technology plays an increasingly important role in supporting collaborative work. Designing next generation technology-embedded environments as part of collaborative systems depends upon our understanding of how rapid transfer of information and responsibility is achieved and how it might be enhanced, particularly during critical moments. The research will examine the phenomenon of critical discourses through field studies and field experimentation in one type of high stakes domain: intensive care units. The field studies are focused on essential issues related to rapid transfer of information and responsibilities, and the field experimentation is to further our understanding of embedded technology as part of collaborative systems.<br\/><br\/>Critical discourses are carried out through and are shaped by the information arena. Field studies will delineate the roles of information objects, which are often created by workers themselves through adaptation of information technology and are part of joint cognitive environments created by workers. This phase of the research will investigate and contrast three different types of hospital rounds (walking-rounds, sit-down rounds, and discharge rounds), and extend the findings to information transfer during cardiac surgery. Ethnographic methodologies as well as analysis of video records of hospital rounds will be used to develop a conceptual model of how participants in critical discourses create and interact through the information arena to achieve information transfer and to negotiate common interpretation of information. The model will describe structures of extreme discourses and main shaping factors of structures, such as preparatory activities, time pressure, and barriers to timely access to information. It will also depict stages and modalities of information transfer. The field experimentation will interject a large computer display to enhance the information arena. Analysis of interaction patterns with the display will further develop the conceptual model of critical discourses. <br\/><br\/>Information technology tools (e.g., large computerized displays and group decision-support systems) have typically been designed for tasks that are highly structured, with minimal time pressure and stable collaborators. Understanding critical discourses would provide insights for new generations of supporting tools that are likely to be used in mission critical domains. This research will deepen our understanding of information-transfer and responsibility-transfer in time-critical and safety-critical periods and provide new concepts and directions for the development of computer supported cooperative work tools that capitalize on the power of information technology. This will help information and computing technology improve safety and efficiency, and it will contribute to the general understanding of the role of information tools in joint cognition.","title":"Collaborative Research: Supporting Rapid Transfer of Information and Responsibility","awardID":"0534646","effectiveDate":"2005-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["472085",289806,"500566","500566"],"PO":["564456"]},"113076":{"abstract":"This award supports planning for a Social Informatics Network. The PI will constitute a small working group that will act as the enduring organizational and intellectual institution to promote, improve and support research in this critical area. Several face-to-face meetings are planned including one with the Deans and Department Chairs at institutions where faculty conduct research in Social Informatics. This Social Informatics Network is important to the Nation for several reasons including continuation of research focused on society and the societal benefits and costs of information technology, the encouragement of risk taking and innovative research among young scholars that might not otherwise take place, the development of students willing to do interdisciplinary research, and the development and maintenance of a research community.","title":"Planning for a Social Informatics Network","awardID":"0554004","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["519226"],"PO":["565136"]},"109523":{"abstract":"Technical Overview. This project addresses the design of features extracted from video streams to enable detection and classification of visual events. The emphasis of the project is on unsupervised learning of features and classifiers from training data and on the ability to deal efficiently with large volumes of data. Careful design of the features is crucial to ensure that they can handle a large volume of data efficiently while, at the same time, accurately extracting events that are relevant to the applications. This project focuses on the development of spatio-temporal features that can be efficiently and accurately extracted from video streams. This is combined with recent developments in the area of architectures for distributed search based on active storage, which are specifically designed for processing very large databases of images and videos, are ideally suited for making effective use of the video feature detectors. Key objectives of the project include integrating the feature extraction approach with current active storage approaches and evaluating the resulting systems in the context of applications such as video retrieval, surveillance, and forensic video reconstruction.<br\/>The project addresses the fundamental questions related to the analysis of video streams: (1) What makes a good feature representation and is there a single choice of representation? (2) What spatio-temporal primitives exist in video? (3) How to efficiently detect spatio-temporal primitives? These questions are addressed in the course of the project by (1) developing a novel approach for the automatic segmentation of spatio-temporal regions that are consistent in both appearance and motion; and (2) developing a novel approach for extracting spatio-temporal features based on new \"volumetric\" operators that operate directly on the spatio-temporal cube and for using these features for event classification. The segmentation algorithm is an extension of the classical mean shift, and the volumetric operators are spatio-temporal extensions of box operators that have been successful in extracting and classifying features in 2D images. These two developments provide the fundamental modules for future video analysis systems. These techniques are important building blocks for efficient object recognition in video. In addition to the fundamental contributions in algorithms and feature design, the scope of the project includes validating the approaches by demonstrating their integration with emerging approaches in distributed search systems that employ active storage to enable efficient processing of 100 terabyte-sized video collections.<br\/><br\/>Broader Impact. The amount of digital video data has grown exponentially in recent years due to the increasing affordability of digital consumer video cameras, large-scale deployment of video surveillance systems, ease of digital content creation, and availability of high-speed networks and high-capacity storage devices. Manual organization and annotation of this content is becoming infeasible. Unfortunately, the technology for searching, indexing and retrieving video content has failed to keep pace. In particular, the processing of very large volumes of video data requires efficient ways of pre-processing the videos to extract features corresponding to interesting temporal events. The project addresses this need directly by providing new technology that will enable the development of large-scale video analysis tools. The products of project have potential impact on all virtually all applications of video analysis. The project focuses on a few broad classes of applications with substantial societal impact in the areas of improved access to information and security. In particular, the project contributes to video retrieval (e.g., for education), video surveillance (e.g., for homeland security), forensic video reconstruction (e.g., for law enforcement) and smart environments (e.g., for business and homes). In order to assist in the application of the technology to these areas, the project includes a plan for transfer through an external partner whose role is to provide data sets (e.g., the IRP speaker video dataset), scenarios, computing resources, software and guidance for the evaluation of the algorithms, as well as access to state of the art active storage technology. This collaboration will enable the integration our the video processing elements with new developments in active storage technology, and to demonstrate the applicability of our approach to large-scale distributed video analysis systems.<br\/>URL: http:\/\/www.cs.cmu.edu\/~hebert\/vol3d.html","title":"Volumetric Features for Large-Scale Video Processing","awardID":"0534962","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["520920"],"PO":["564318"]},"109468":{"abstract":"This project seeks to develop a scientific basis for principles for relating architectures to artifacts, and experimentally validate those principles, with specific application to software design. The intimate relationship between artifact architecture and collaboration in artifact design is widely acknowledged but inadequately understood. Architectures describe a system in terms of its high-level structures and the relationships between them. Because architectural descriptions take advantage of the \"nearly decomposable\" nature of the designed artifact, they provide a powerful basis for dividing the work in such a way that teams can design individual components without being overwhelmed by the need to coordinate with other teams designing other components. The decoupling of functionality defined by the architecture translates into a decoupling of the work, which makes collaboration feasible.<br\/><br\/>Yet, components interact, and the details of these interactions create varied and potentially complex interdependencies in the design work. We cannot fully exploit the potential of architectures for supporting coordination because we know very little about the fit between organizational characteristics and architectures. How do organizational characteristics constrain the range of architectural styles an organization can use in design? How do architectural characteristics constrain the range of organizations that can build them?<br\/><br\/>In many kinds of design, we also know very little about how to make the architecture visible in the day-to-day design and implementation work. In software design, for example, there are no practical and effective techniques for guiding a component designer toward decisions that conform to the architectural description, or for checking whether an implementation is faithful to its architecture. In practice, violations of architectural descriptions, resulting in unpredictable dependencies among components, are commonplace.<br\/><br\/>This research will focus on the relationship between software architectures and collaboration in software projects because the highly volatile nature of software requires frequent change, and because the rapid emergence of new organizational forms (open source, outsourcing, globally distributed) present serious challenges to existing ways of coordinating work. In collaboration with industry partners (at Siemens Corporation and NASA's Jet Propulsion Laboratory), field studies will be conducted of collaborations occurring within a variety of architectural styles in order to identify the principles that relate architectural descriptions to task characteristics, such as uncertainty, interdependence, equivocality, and centralization, which are known to have major implications for coordination, collaboration, and communication in organizations. These principles will make it possible to develop technologies to analyze the tradeoffs and understand the fit of product architectures and organizations.<br\/><br\/>The research will also develop practical techniques for exposing the architecture in the code so that the architectural description can effectively guide the development work. It will develop innovative structuring techniques for making the component and connector architecture visible, and for enforcing style-specific constraints and idioms. In addition, a new language will be created to define and check mappings between architecture and the implementation constructs. Finally, research will validate these techniques, both in laboratory studies in order to see if they improve speed and quality of development, and in the field to test their robustness, generality, and ability to scale.<br\/><br\/>The engineering techniques will be made generally available for use in architectural tradeoff analysis. The techniques will also be introduced into well-established software engineering curriculum, where they will impact students at many schools for whom this curriculum serves as a model.","title":"The Role of Architecture in Facilitating Design Collaboration","awardID":"0534656","effectiveDate":"2005-11-15","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[289810,"485947","551802"],"PO":["564456"]},"116552":{"abstract":"Streaming media content delivery in the Internet has become increasingly demanding in many important application areas, such as education, medical research and practice, news media, and entertainment and gaming industries. Although the proxy caching technique has been widely and successfully used for textbased Web content delivery, it is not suitable for streaming media due to the general huge sizes of media objects and the rigorous requirements of continuous and timely streaming, which demand dedicated and continuous bandwidth for a long period of time. To significantly improve the quality of Internet streaming services with low cost and high quality, the project will design and implement Next Generation Internet Proxy Systems that include effcient and complex streaming functions and resource coordination and provisioning capability in the proxy.<br\/><br\/>The proposed project will develop and analyze a set of algorithms for streaming caching with interactive requests, resource-constrained transcodings, and for resource provisioning and coordination of different types of cached objects, and will produce a real system by implementing core streaming functions, accurately prefetching media segments to ensure good streaming quality, and enabling format-independent streaming in the proxy.","title":"CSR --- AES: Collaborative Research: Next Generation Internet Proxy Systems","awardID":"0613280","effectiveDate":"2005-11-01","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["551992"],"PO":["493916"]},"113285":{"abstract":"The flooding of New Orleans in the wake of Hurricane Katrina on August 30 revealed several fissures in local, state, and national strategies for emergency preparedness and disaster relief. Geographically, the hardest hit areas were those inhabited by socioeconomically marginalized communities; these also were the areas that had restricted access to communications about evacuation, the extent of the flooding, and evacuation procedures. The Katrina disaster serves as a wake-up call and reveals how racial inequality and economic disparities are still a societal reality. There is an urgent need to analyze the spatial, socioeconomic, and psychological consequences of Hurricane Katrina and its aftermath on the most vulnerable segments of our society: those who are economically marginalized, racially marked, spatially segregated, and\/or linguistically isolated. <br\/><br\/>The interdisciplinary team consists of geographers, Asian- and African-Americanists, Vietnamese language specialists, a nursing scientist, sociologist, and historian with complementary analytical and language skills. The study area is located in the easternmost sections of New Orleans residential subdivisions that have an almost equal distribution of Vietnamese Americans and African Americans. <br\/><br\/>The research will address: (1) The pre-Katrina socio-spatial configuration of the Vietnamese American and African American communities in the study area, and what damage Katrina caused to these communities. (2) Whether previous experiences of involuntary geographic displacement of evacuees, especially among Vietnamese Americans, as well as gender, cultural, linguistic, legal status, geographic, and socioeconomic differences affect their perceptions of risk and uncertainty, access to emergency relief services. Also, it will examine which similarities and differences exist between the two communities in how each community negotiates evacuation and access to emergency relief services, relocation assistance and rebuilding funds through existing racial\/ethnic and\/or faith-based community networks, as well as their adaptation to temporary or permanent resettlement of their community and business rebuilding efforts in New Orleans. (3) The similarities and differences in physical and psychological vulnerability between the two groups of interests after the disaster and what are the critical factors contributing to their physical and psychological outcomes. <br\/><br\/>This study will evaluate the mental and organizational decision-making process by the two study groups in the face of uncertainty and produce policy recommendations to better serve the needs of such communities during the recovery period and better prepare for similar disasters in future.","title":"SGER Collaborative Research: Surviving Katrina and its Aftermath:A Comparative Analysis of Community Mobilization and Access to Emergency Relief by Vietnamese and African Americans","awardID":"0555086","effectiveDate":"2005-11-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":[299963],"PO":["380485"]},"113186":{"abstract":"Existing research in the area of tactile perception has shown the potential of haptic (touch based) interfaces for human-machine interaction. In this project, the PI will seek to advance the scientific underpinnings and technology necessary for the development of assistive haptic user interfaces for individuals who are blind, by exploring two key research issues that must be resolved before \"natural\" and effective interfaces of this type can be deployed.<br\/><br\/>First, he will design and conduct experiments with human subjects to better understand the haptic perception process, so that he can model the psychological basis of assistive haptics. A fundamental issue in haptic object identification is dimensional salience. Common objects differ along a myriad of dimensions, including their size, shape, texture, weight and material. We know little about which dimensions are primary in haptic object identification, how this information is represented in memory, and whether retention properties by various subgroups of individuals who are blind follow qualitatively similar functions compared to the sighted.<br\/><br\/>Second, he will design novel haptic rendering techniques that allow people to \"hold\" and explore complex virtual objects through multi-point contact sensations. Prevalent approaches to haptic rendering do not incorporate the nuances of the human haptic perceptual system. The PI will develop a library of surface interrogation tools that can analyze a given virtual object and automatically assign realistic haptic features to it, and will incorporate results from the psychological experiments into the design of new real-time rendering algorithms that support a two-handed haptic interface that can be delivered through a pair of gloves in a body-centric reference frame.<br\/><br\/>The PI's goal is to achieve significant preliminary results, which will provide the basis for an expanded research program aimed at developing an assistive system for blind individuals affording distal object perception in real environments.<br\/><br\/>Broader Impacts: This research will make contributions of both a technical and societal nature. Significant technical contributions will be made through this research in the fields of collaborative human computer interfaces, universal access and assistive devices, haptic rendering, multimedia systems and the psychological knowledge base of haptics. The social impact of development of spatial perception devices lies in the empowerment of individuals who are blind and visually impaired to overcome their sensory limitationss, increasing their independence and potential for huamn-human interaction.","title":"SGER: Incorporation of Psychological Basis of Haptics in the Design of Assistive Haptic User Interfaces","awardID":"0554698","effectiveDate":"2005-11-15","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":[299696,299697,"528940","495194"],"PO":["565227"]},"109524":{"abstract":"Proposal 0534978<br\/>\"Robustness from Non-Stop Collaboration\"<br\/>PI: Patrick H. Winston<br\/>MIT<br\/><br\/>This proposal seeks to understand how robust behavior can emerge from modules that collectively develop descriptions and cooperatively solve problems at a level beyond the ability of any one module operating individually. For instance, human language and vision systems cooperate to form a world view that is beyond what either could produce individually. A key aspect of this project is to understand how the necessary intermodular communication capabilities grow as the modules grow in their individual capabilities, and how such communication can be tolerant of imperfections in the communications. This research approaches this problem through development of composable intermodular channels, using two enabling ideas: fusion maps and self-configuring communication channels. Fusion maps use constraint propagation, elevated to operate between modules and across representations, to determine semantic correspondences between modules and to support bi-directional transfer of knowledge from a module that is more certain of information to those that are less so. Self-configuring communication channels learn constraints between modules from shared experiences; this idea addresses the twin problems of when should a channel attempt to learn and how can useful equivalences actually be learned. The project will investigate these ideas on the problem of forming a composite record of activities from data collected from a diverse set of sensors (e.g., images, sound), for instance, in an office domain where there can be a variety of activities. Besides giving insight into the nature of intelligence, this research will improve the robustness of computer systems, important in many contexts from the control of dangerous equipment to the mitigation of natural disasters.","title":"Robustness from Non-Stop Collaboration","awardID":"0534978","effectiveDate":"2005-11-15","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["536919","485691"],"PO":["387198"]},"109535":{"abstract":"A Video Indexing Ontology Using Fuzzy Metadata<br\/><br\/>Video has been very difficult to understand by a machine. While humans<br\/>have a seemingly \"direct\" way of seeing something and understanding a<br\/>scene in terms of background, foreground objects, and motions, video<br\/>understanding has been one of the perplexing problems of automatic video<br\/>and image analysis to date.<br\/><br\/>This project proposes a \"divide and conquer\" approach, where several<br\/>hundred general-purpose concepts (e.g., outdoors, animals) will be used<br\/>to describe and annotate a very large universe of scenes commonly<br\/>depicted in video. Analogously to a limited vocabulary set of indexing<br\/>terms one might find in a library card catalog, each video scene can be<br\/>annotated through a combination of these concepts (\"metadata\"). To go<br\/>beyond a mere listing of objects, actions and scenes visible in the<br\/>video, carefully chosen concepts also allow the description of<br\/>relationships between them (\"ontology\"), which allows for much richer<br\/>composite descriptions. The challenge will be to define these concepts<br\/>so that they satisfy several criteria at once:<br\/>* The concepts must represent things frequently visible in video<br\/>broadcasts.<br\/>* The concepts must be clearly identifiable to give computer<br\/>algorithms a chance to detect them automatically.<br\/>* The concepts must be linkable into an ontology that defines how<br\/>concepts are related.<br\/><br\/>Since video annotations, whether done by a computer or a human, always<br\/>will contain errors, this work will incorporate probabilistic confidence<br\/>metrics (\"fuzzy metadata\") into the annotation. No existing indexing and<br\/>classification schemes have explicitly defined standards for measuring<br\/>and reporting errors and omissions of indexing annotations; since<br\/>librarians and archivists have traditionally assumed that an index<br\/>contains only complete, trusted and verified metadata.<br\/><br\/>Furthermore, the project will assess to what extent these concepts can<br\/>be automatically extracted with state of the art video analysis<br\/>techniques. Using footage from documentaries and television news, the<br\/>project will perform video search and retrieval experiments to determine<br\/>the usefulness of the ontology and the confidence of the annotations.<br\/><br\/>URL: http:\/\/www.informedia.cs.cmu.edu\/ontology","title":"A Video Indexing Ontology Using Fuzzy Metadata","awardID":"0535056","effectiveDate":"2005-11-15","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["533348","371225"],"PO":["564318"]},"109546":{"abstract":"In spoken dialog systems, interpreting user speech input is still a significant challenge due to limited speech recognition and language understanding performance. This problem is further amplified if a user has an accent or is speaking in a noisy environment. However, previous research has shown that, in multimodal systems, fusing two or more information sources can be an effective means of reducing recognition uncertainties, for example through mutual disambiguation. Inspired by earlier work on multimodal systems, in this project the PI will investigate the role of eye gaze in human machine conversation, in particular in salience modeling for robust spoken language understanding. Cognitive studies have shown that human eye gaze is one of the reliable indicators of what a person is \"thinking about.\" Specifically, eye gaze is tightly linked to human language processing. Previous psycholinguistic work has shown that almost immediately after hearing a word, the eyes move to the corresponding real-world referent. And right before speaking a word, the eyes also move to the mentioned object. Not only is eye gaze highly reliable, it is also an implicit, subconscious reflex of speech. The user does not need to make a conscious decision; the eye automatically moves towards the relevant object, without the user even being aware. Motivated by these psycholinguistic findings, the PI's hypothesis is that during human machine conversation user eye gaze information coupled with conversation context can signal a part of the physical world (related to the domain and the graphical interface) that is most salient at each point of communication, thus it can potentially be used to tailor the interpretation of speech input. Based on this hypothesis, the PI will seek to improve spoken language understanding in conversational interfaces through a new salience-based framework with two objectives: (1) To better understand the role of eye gaze in human language production and its implications in salience modeling for automated input interpretation; and (2) To develop algorithms and systems that apply computational gaze based salience modeling to robust spoken language understanding. These objectives will be pursued in the following four directions: (a) Investigation of the utility of human eye gaze and its implications for salience modeling during human machine conversation through psycholinguistic studies; (b) Development of computational salience models that integrate eye gaze with conversation context to automatically identify a salient part of the physical world at each point of communication; (c) Development of approaches that apply the new salience models to constrain the hypothesis space for robust spoken language understanding; and (d) Evaluation of the generality of the new approaches in two different applications: an interior design\/training application based on a 3D rendered interface, and an information seeking application using a 2D map-based interface.<br\/><br\/>Broader Impacts: The technologies to be developed in this interdisciplinary project can be applied to many applications such as virtual training systems where users can see the interface and talk to the computer system at the same time. The technologies will benefit a variety of diverse users, and particularly individuals who are unable to interact with graphical interfaces with their hands (e.g., motion disabled users). Since one major application area of the work is e-training and e-learning, the education and outreach impact of the proposed research is potentially profound; the PI will make specific efforts to transfer the research results into classrooms. The project will also provide a unique opportunity for students in Computer Science, Psychology, and Cognitive Science to work together, and thus will synergize multidisciplinary research activities at Michigan State University.","title":"Eye Gaze in Salience Modeling for Robust Spoken Language Understanding","awardID":"0535112","effectiveDate":"2005-11-15","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["565127","520062"],"PO":["565227"]},"113374":{"abstract":"This research will develop the first known wearable device capable of perceiving and reporting on social-emotional information in real-time human interaction. Using a small wearable camera and customized video and pattern analysis algorithms, the system will automatically read and interpret the facial expressions and head movements of the person the wearer is interacting with and will communicate its inferences to the wearer via sound or tactile feedback. The system builds on and extends the computational model of \"mind-reading\" developed by Rana el Kaliouby, which forms the basis of an automated system for the inference of mental states from head and facial displays in a video stream in real time. Bringing together and expanding upon recent advances and methodologies in three key scientific and technical areas - affective computing, wearable computing, and real time machine perception - the project will significantly advance the nascent ability of machines to infer cognitive-affective states in real-time from nonverbal expressions of people engaged in a range of natural interactions.<br\/><br\/>The proposed work is for the first prototype of what is expected to become a sequence of increasingly intelligent prosthetics. The design and strategy will open up new lines of inquiry in understanding the role of social-emotional cues in natural interaction. The automated perception of nonverbal cues and inference of mental states are problems that continue to challenge researchers in the domains of machine vision and machine learning. These problems become even more complex if the system is required to execute in real-time and to generalize to novel situations and people, a necessary requirement in the case of an assistive technology. The project addresses open research questions pertaining to whether machine perception can be reliable enough and comfortable enough to augment social interactions in a way that improves human to human communication. The challenge is further complicated by the requirement of operating in a mobile environment with varied lighting conditions and limited processing and power. Being the first prosthetic assistive technology that is designed to augment a person's impairment in socio-emotional intelligence skills, the project has the potential to lead to a line of new research. <br\/><br\/>A system with social-emotional perceptual abilities can potentially assist the growing number of individuals diagnosed with Autism Spectrum Disorder, in perceiving communication in a natural rather than a structured environment, bootstrapping their ability to learn and develop in social settings. The system will also provide a new tool for researchers on collaborative systems to more carefully examine the communication of nonverbal cues in natural everyday communication. The results of this interdisciplinary work can be leveraged in human-computer interaction, wearable computing, robotics and in future technologies with social-emotional intelligence. Results will be distributed in all of these communities through peer-reviewed publications and conference presentations, as well as through forums for attracting more minorities to scientific and technical fields. This work promotes the training and education of students by deeply involving them in the proposed research activities, with a commitment to growing the participation of underrepresented minorities in cutting-edge scientific research","title":"SGER: Social-Emotional Intelligence Prosthetic","awardID":"0555411","effectiveDate":"2005-11-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["457547"],"PO":["564456"]},"116553":{"abstract":"Collaborative Research: Foundations of Solving Large Direct and Inverse Scattering Problems --- Algorithm Analysis and System Support<br\/><br\/><br\/><br\/>Summary<br\/><br\/>We propose to develop and implement new computational methods on large cluster-based high-end systems for solving the direct and inverse problems in electromagnetics motivated by industrial and military applications. We will address two sets of important and closely related technical issues for this high-end scientific computing project. First, the targeted problems for the proposed project are large-scale direct and inverse scattering problems that can be only solved in high-end systems. These problems involve<br\/>particularly electromagnetic wave propagation with high wave numbers. A major difficulty for solving the inverse problems by an optimization method is the ill-posedness and the presence of many local minima. We propose a novel approach for solving the inverse medium scattering problem of Maxwell's equations in three dimensions. Crucial to the approach will be the development of an efficient regularized iterative linearization algorithm (recursive linearization with respect to the wave number). A challenge in<br\/>developing our numerical methods is to deal with large and structured data sets. The second set of technical issues for solving the targeted problems is concerned with the lack of system support in high-end architectures to maintain high sustained performance of<br\/>computing due to increasingly high speed gap between the CPU and the memory and the I\/O storage. This challenge can also be found in many other large scientific computation problems on high-end systems. An equivalently important objective to the scientific computing in this proposal is to design and build effective system support by effectively allocating both CPU and memory resources, by establishing a global network RAM system in high-end architecture, and by providing exceptional system handlers to deal with dynamic and unexpectedlylarge memory demands from applications.<br\/><br\/>Intellectual merits of this proposal come from several aspects. (1) Our proposed numerical methods will address several scientific challenges in applied mathematics including electromagnetic wave propagation with high wave numbers, ill-posedness for inverse problems, and management of large data sets in multiple dimensions. (2) Processors and high-end systems have become increasingly complex, which makes the understanding of execution behavior more and more difficult. Our proposed system support based on both hardware counters and a system kernel instrumentation tool will address the system complexity issue, and provide insightful runtime system information for resource management systems with low overhead. (3) In order to effectively support high sustained performance and high productivity computing in clusters, our system support aims for several important resource management objectives, such as high memory utilization, low communication latency, and fast response time. (4) Although our system will be mainly tested by solving the large direct and inverse problems, it is also our aim to build it as a general purpose system so that it will become a fundamental software system infrastructure for many other large scientific applications in high-end systems.<br\/><br\/>Broader impact of this proposal will be: (1) Due to the fast development of high performance systems, computational electromagnetics has become a fundamental, vigorously growing technology in diverse science and engineering disciplines, such as<br\/>microwaves, millimeter waves, optics, and acoustics. Our computational models and cluster system support will provide an inexpensive and easily controllable ``virtual prototype\" of the structures\/media as opposed to costly, time-consuming physical prototyping. (2) The proposed system resource management tools and system prototype will be disseminated in the high-end computing and systems community for a wide usage. (3) The research results will be timely introduced to both undergraduate and graduate curriculum development of scientific computing, parallel computing, and operating systems.","title":"Collaborative Research: Foundations of Solving Large Direct and Inverse Scattering Problems --- Algorithm Analysis and System Support","awardID":"0613282","effectiveDate":"2005-11-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7417","name":"S AND T HIGH-END COMPUTING"}}],"PIcoPI":["551992"],"PO":["562944"]},"109547":{"abstract":"0535118<br\/>Luebke David<br\/>University of Virginia Main Campus<br\/>Establishing the SAVE Center: Studying Secure Dissemination and Archiving of 3D Cultural Heritage Projects <br\/><br\/>Constant improvements in the ability to measure and computationally model the physical world have led to ultra-high fidelity threedimensional models of people, objects, and environments. The proposed research will address several key challenges in the archiving and dissemination of valuable 3D models and associated metadata. The long-term objective is to create a center to Serve and Archive Virtual Environments (SAVE), containing scientifically authenticated content derived from cultural heritage and other sites. The investigators propose to address a number of open questions including those concerned with best approaches for archiving and preserving acquired virtual environments, flexible and open standards for storing and manipulating valuable 3D environments, and authentication and secure dissemination issues. Test environments will include computer models of archaeological sites around the world, ranging from Peru to Israel and from the Bronze Age in Europe to the Colonial period in the Americas. Research activities are expected to significantly advance the state of the art in secure remote delivery of interactive content, and elucidate new techniques for future generations of graphics hardware and display technology. The investigators are leading researchers in the fields of digital cultural heritage, perceptually guided geometric algorithms, and high performance distributed remote rendering. This team will address research challenges of particular relevance and application to the real world problems confronted by domain scholars in a number of areas and working in a variety of international collaborative contexts.","title":"Establishing the SAVE Center: Studying Secure Dissemination and Archiving of 3D Cultural Heritage Projects","awardID":"0535118","effectiveDate":"2005-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["451003","451788","338013","338013"],"PO":["565136"]},"109448":{"abstract":"This project concerns a new class of location-aware information systems that link People-to-People-to-geographical-Places (P3-Systems), based on technologies that can locate individuals as they go about their daily activities, including the near ubiquitous mobile phone. Specifically, the research will explore how P3-Systems can strengthen community by helping individuals leverage location information to make new social ties and to coordinate better the interactions with colleagues, friends, and family to reinforce existing social ties. To achieve this goal, the project will work towards gaining an understanding of how to 1) capture and utilize geotemporal histories to identify social matches, 2) provide users with trustworthy face-to-face introduction tools and 3) provide geotemporally relevant introductions and social reminder alerts that do not overly interrupt the users or invade their privacy. Unfortunately, knowledge in regards to each of these key issues is lacking. We do not know how to effectively manage the capture of personal geotemporal histories from mobile networks of heterogeneous devices in order to compute social matches that take into account place types, recurring patterns of co-location, and place-linked roles. Nor do we have a basic understanding of how to effectively enable face-to-face introductions between users while simultaneously ensuring appropriate exchange and control of personal identity data. Important questions in regards to identity exchange to be examined include: In what order and at what rate should basic demographic details be transferred between users? How is the revelation of identity data affected by situational variables such as place, time and social company? How can the process be tied to social networks in terms of reputation and trust?<br\/><br\/>These key issues will be studied intensively using the New Jersey Institute of Technology's (NJIT) NSF supported SmartCampus location-aware community system test-bed. The SmartCampus test-bed will provide hundreds of students with heterogeneous wireless, locatable, lightweight, mobile, computing devices and deploy a variety of P3- Systems. A key SmartCampus P3-System that will be used to support this research is CampusMesh, a location-aware geotemporal social matching and reminding system. Multiple research methods will be employed, ranging from laboratory studies of how \"strangers\" engage in identity revelations, through usability studies of various software prototypes on different types of devices, through large scale field trials on the NJIT campus that will include user surveys and longitudinal monitoring of who-to-whom network traffic to identify changes in social networks. In the final year, field trials in one or more corporate locations will assess the generalizability of the findings. These studies of using P3-Systems to build and sustain community will directly result in: the development of design guidelines and theoretical frameworks that will inform system developers and HCI\/CSCW researchers; empirical findings that will inform social scientists concerned with 'introductory communication' and the relationship between measurable affinities and the potential for growing social ties; and a variety of novel software applications.<br\/><br\/>This project will support several educational goals. First, the system developed will be field tested at NJIT, by the NJIT community. NJIT is a leader in minority education, and the city has a large minority population. Thus, the benefits of the technology to be developed will accrue to a population with fewer resources and more limited opportunities than the U.S. as a whole. Second, the project will provide excellent training and learning opportunities for numerous students through: courses in Human-Computer Interaction, Computer Supported Cooperative Work, Research Methods, Sensor Networks, and Pervasive Computing where students will work together in team projects that will either use CampusMesh and other SmartCampus applications or be directly involved in its research and development. Research assistants will participate in research using leading-edge technology, where they will learn a diverse set of empirical research methods. Finally, the research outlined will result in the creation of a technology rich, friendly, and welcoming campus experience for the NJIT student population.<br\/><br\/>In the early 20th century, people often came together face-to-face to make new acquaintances and to form voluntary associations such as social clubs, professional societies, and religious institutions that supported civil society. In subsequent decades the frequency of individual participation in these traditional associations and face-to-face meetings has declined along with associated measures of local social ties and social capital. P3-Systems offer one path to developing geographically concentrated social capital by enhancing community cohesion and by helping people to meet each other an","title":"Using GeoTemporal Social Matching to Support Community","awardID":"0534520","effectiveDate":"2005-11-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["352199","291803","538322","383971",289753],"PO":["564456"]},"109526":{"abstract":"The automated monitoring and surveillance of crowded scenes is a remarkable challenge for current image and video understanding technology. It has application in areas such as homeland security, natural disaster prevention, research on insect behavior, and monitoring of animal populations, among others. It has recently acquired strong societal significance, due to the possibility of terrorist attacks on events involving large concentrations of people, a problem for which there are currently no effective solutions. This project lays the foundation for the technology that will enable the automated monitoring and surveillance of crowded scenes, by modeling their video as a visual texture that deforms itself in stochastic but predictable ways, in response to certain events. In particular, the project aims to produce 1) a suite of generative probabilistic models for the video produced by various types of crowded scenes, and optimal algorithms for the estimation of their parameters, 2) a family of classifiers that build on these models to design detectors of important events, 3) a collection of algorithms for crowd video stabilization, segmentation, and parsing, and 4) a large database of video examples, that will establish a common experimental framework for the evaluation of future research in the field. Educationally, the project will provide research opportunities to both undergraduate students and students of underrepresented backgrounds.<br\/><br\/>The URL address is:<br\/><br\/> www.svcl.ucsd.edu\/crowds","title":"Understanding Video of Crowded Environments","awardID":"0534985","effectiveDate":"2005-11-15","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["513306"],"PO":["564316"]}}