{"146520":{"abstract":"How do nervous systems transform sensory signals into motor commands to guide locomotion? To address this question, this research examines a class of sensory guided locomotion tasks uniquely amenable to computational and engineering analyses: sensorimotor stabilization tasks. In these tasks, animals automatically modulate muscle commands to drive sensory signals (e.g. electrosensory, tactile, visual) to desired equilibria or limit cycles.<br\/><br\/>Specifically, this research examines three remarkably divergent animal locomotor behaviors: multisensory control of swimming in weakly electric knifefish, high-speed antenna-based wall following in cockroaches, and visual yaw control in fruit flies. While performing sensory guided locomotion tasks, these animals are subjected to behaviorally naturalistic perturbations that lead to rich transient dynamics during recovery. Mechanical signals (e.g. positions, forces) and neural activity (e.g. action potentials) during recovery to these perturbations are used to validate (or refute) specific closed-loop sensorimotor control models. These models identify the roles of mechanics versus neural computation in the stability and performance of each behavior. The same approach to modeling, analysis, and experimentation is vetted in a biomorphic robot, establishing an experimental baseline in a highly controlled context, as well as enabling the translation of biological control strategies to a robotic platform.<br\/><br\/>This research, disseminated broadly through both the engineering and biological literatures, lays a scientific foundation on which to develop biomorphic robots for critical applications such as disaster recovery, space exploration, and security. Longer term, the unified approach to biological and robotic modeling developed in this project may lead to enhanced neural prostheses and brain--machine interfaces.","title":"CAREER: Sensory Guidance of Locomotion: From Neurons to Newton's Laws","awardID":"0845749","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["522960"],"PO":["543539"]},"146531":{"abstract":"Standardized general-purpose middleware remain an attractive option to develop performance-sensitive and safety-critical distributed systems due to their support for commonly required features that simplify distributed computing. The feature-richness of these middleware and coarse-grained design, however, often adversely impact memory footprint and performance of the applications. Proprietary solutions and handcrafted optimizations to standardized middleware are infeasible due to high development and maintenance costs. This research is addressing these problems via automated specialization of general-purpose middleware (i.e., pruning unwanted features, and adding and customizing the necessary ones). The intellectual merit of this research lies in how the automated specializations are realized by (a) identifying and exploiting the algebraic structure of middleware that helps map the specialization problem into a feature-oriented software development problem; (b) developing a new theory for feature composition, refactoring, and interactions across the lifecycle stages of applications; and (c) developing a well-defined specialization process based on generative programming. The broader impact of this CAREER research is observed through the (a) development of new principles to design middleware that make them inherently amenable to specialization; (b) documentation of specialization patterns, which reduces software maintenance; (c) enhanced developer productivity and system correctness; and (d) transitioning of the research artifacts to education and scientific community through an open source tool suite called GAMMA (Generative Aspects for the Manipulation of Middleware Architectures).","title":"CAREER: Principles and Techniques for Automated Middleware Specializations in Distributed Systems","awardID":"0845789","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["536408"],"PO":["535244"]},"155387":{"abstract":"This is funding to support this year's HCI doctoral research consortium (workshop) of approximately 15 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2009 Conference on Human Factors in Computing Systems (CHI 2009), which will be held April 4-9 in Boston, and sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI). Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on April 4-5, with follow up activities planned during the technical program of the conference. Extended abstracts of the students' work will be published in the CHI 2009 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The CHI doctoral consortia, which began in 1986, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today's leading HCI researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field. This year, in an effort to further broaden the impact of the event, the organizers have undertaken to use NSF funds to support participation by no more than one student from any one institution, and to also consider gender in the participant selection process with a target of a 50\/50 split.","title":"ACM CHI 2009 Workshop: Human-Computer Interaction Doctoral Research Consortium","awardID":"0922161","effectiveDate":"2009-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[413598],"PO":["565227"]},"146356":{"abstract":"Abstract of Proposal 0845042<br\/><br\/>CAREER: Malware Immunization and Forensics Based on Another Sense of Self<br\/><br\/>Xinyuan Wang, George Mason University<br\/><br\/><br\/>Despite recent advances in malware defense, computer malwares<br\/>(e.g., virus, worm, botnets, rootkit, spyware) continue to pose<br\/>serious threats to all computers and networks. Besides being more<br\/>damaging, modern malwares (e.g., blue pill, agobot) are becoming <br\/>increasingly stealthy and evasive. This has made it increasingly <br\/>difficult to protect our computer systems and networks from malwares <br\/>and ensure the trustworthiness of our mission critical systems.<br\/><br\/><br\/>Our natural immune systems are very effective in protecting our <br\/>body from intrusions by (almost endless) variations of pathogens. <br\/>Our immunities depend on the ability to distinguish our own cells <br\/>(i.e., \"self\") from all others (i.e., \"non-self\"). Inspired by the <br\/>self-nonself discrimination in the natural immune systems, this <br\/>research explores a new direction in building artificial malware <br\/>immunization and malware forensics capabilities based on \"another <br\/>sense of self\", which is essentially a unique mark to be assigned <br\/>to the programs to be protected. Based on such an actively assigned <br\/>\"another sense of self\", the \"immunized\" program is able to <br\/>detect application level malwares effectively and efficiently. In<br\/>addition, the actively assigned \"another sense of self\" enables<br\/>new malware forensics capabilities that were not possible before.<br\/>Since the artificial malware immunization technique does not require <br\/>any specific knowledge of the malwares, it has the potential to be <br\/>effective against new and previously unknown malwares. The new <br\/>artificial malware immunization techniques and tools to be developed <br\/>could automatically make many applications (e.g., Web server) immune <br\/>to many malwares and thus greatly improve the trustworthiness of <br\/>computer systems.","title":"CAREER: Malware Immunization and Forensics Based on Another Sense of Self","awardID":"0845042","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[390316],"PO":["564388"]},"143354":{"abstract":"Proposal Title: Collaborative Research; CT-M: Computer Systems Vulnerabilities<br\/>and the Efficacy of Defensive Mechanisms<br\/>Institution: University of California-San Diego<br\/>Abstract Date: 08\/12\/08<br\/>Longitudinal studies of network systems are very difficult to conduct when systems are<br\/>large, heterogeneous, highly interconnected, and open; yet, the importance of these<br\/>studies cannot be underestimated. This project focuses on an 18-month longitudinal<br\/>study on server-side vulnerabilities in the campus network of the University of California<br\/>at San Diego and on client-side vulnerabilities the University of California at Davis. The<br\/>issues concern the efficacy of security measures at the campus-wide networks and its<br\/>implication for security of networked systems at universities, government facilities, and<br\/>commercial enterprises.<br\/>NATIONAL SCIENCE FOUNDATION<br\/>Proposal Abstract<br\/>Proposal:0831132 PI Name:Marzullo, Keith<br\/>Printed from","title":"CT-M: Computer System Vulnerabilities and the Efficacy of Defensive Mechanisms","awardID":"0831002","effectiveDate":"2009-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["560876","564751"],"PO":["565264"]},"146544":{"abstract":"The next years will see a shift from traditional desktop or server applications to a model that is dominated by the confluence of several trends: web-based application delivery, utility computing, software as a service, data mash-ups, and client-side extensions for web customization. This paradigm shift to next-generation cloud applications profoundly changes the way in which users use the world wide web and provides tremendous potential for accelerating scientific discovery. A crucial component in this shift is the web browser and the server infrastructure delivering those complex applications, which typically consist of multiple, interconnected components from different sources.<br\/>This research aims to create advanced browser and server execution environments that address the needs of these applications.<br\/><br\/>This project integrates a research and education plan that develops abstractions for advanced execution environments that can robustly support next-generation cloud applications. Our primary focus falls on an advanced client-side execution environment called script spaces.<br\/>Script spaces provide an environment that can support the client side of cloud applications in a reliable, robust, secure, flexible, and scalable fashion. A complementary effort provides a server-side execution environment. We are prototyping our abstractions and validate our techniques by applying them to a client-side mash-up framework that is in daily use. Our education plan applies the research artifacts we create to reinvigorate our undergraduate curriculum by emphasizing real-world contexts in student assignments, even in a first CS course.","title":"CAREER: CCF-SHF Advanced Execution Environments for Next-generation Cloud Applications","awardID":"0845830","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["427184"],"PO":["564388"]},"146313":{"abstract":"The main goal of this project is to develop theoretical foundations for robustly-stable and high-fidelity shared haptic collaboration among geographically-distributed multiple users over the Internet. For this, the project utilizes: 1) distributed architecture for real-time responsiveness of each user?s haptic feedback regardless of Internet?s latency; and 2) passivity (of total distributed architecture) as a means for robust-stability of haptic interaction with a wide-range of heterogeneous human users. More specifically, the project focuses and investigates the following three key research tasks: 1) discrete-time passive haptic simulation algorithms for consistent\/scalable deployment of the shared virtual environment, particularly among (computationally) heterogeneous users; 2) haptically-convincing physics-based passive hierarchical model reduction frameworks to mitigate communication\/computing burdens, particularly when the shared virtual environment is of large-scale; and 3) high-performance passive local replica synchronization frameworks over the Internet for crisp\/stable shared haptic experience, and fundamental performance limitation given communication imperfectness.<br\/><br\/>By providing systematic and theoretical frameworks, this project will significantly advance the current state of the art, which is largely heuristic, ad-hoc and qualitative. This project is also expected to produce new results\/perspectives\/frameworks for general haptics\/telerobotics as well as for adjacent research fields. <br\/><br\/>The theoretical foundations laid by this project will make many powerful applications closer to reality (e.g. virtual collaborative surgical training, pre-manufacturing product evaluation, virtual collaborative sculpting, haptically-enabled networked games, etc). Perhaps more importantly, this project may fundamentally change how we interact with each other in the cyberspace. <br\/><br\/>Education\/dissemination activities of this project will include: development of new hands-on and research-level robotics courses; student advising\/mentoring, particularly for minority students; haptics summer camp for K-12, particularly for female students; seminars in local high schools and public demonstrations; project web site, international collaboration, and book writing.","title":"CAREER: Passivity-Based Distributed Frameworks for Multiuser Shared Haptic Collaboration over the Internet","awardID":"0844890","effectiveDate":"2009-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[390225],"PO":["543539"]},"143355":{"abstract":"The goal of this research is to solve some important problems in nnnntorus-based, pairing-based, multilinear, and elliptic curve and abelian variety cryptography. Elliptic curve cryptography helps to secure the Internet and is used by the U.S. and other governments and institutions to provide secure communication. Abelian variety cryptography includes elliptic and hyperelliptic curve cryptography, scales well to high security levels, and is especially advantageous in constrained environments. Pairing-based cryptography is a recent cutting-edge use of elliptic curves, with numerous useful security applications. Torus-based cryptography and compression-based abelian variety cryptography improve the efficiency of discrete log and pairing-based cryptography. Multilinear cryptography, which generalizes pairing-based cryptography, is an open question; an efficient and secure solution would give efficient and secure multi- party communication. The security of these systems and the difficulty of the number theoretic problems on which they are based are crucial for the health of the economy and for national and international security.<br\/><br\/>The project focuses on the security of the elliptic curve discrete log problem and other number theoretic problems on which cryptographic security is based, and on the construction of efficient, secure, and scalable public key cryptosystems. The techniques will involve some deep and interesting mathematics.<br\/><br\/>This project will educate and train a diverse workforce in cybersecurity by supporting graduate students, promoting the participation of underrepresented groups, furthering the development of new courses in cutting-edge cybersecurity, and promoting outreach that educates the public.","title":"CT-ISG: New Directions in Elliptic Curve, Pairing-Based, and Torus-Based Cryptography","awardID":"0831004","effectiveDate":"2009-03-15","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["475021"],"PO":["565264"]},"154289":{"abstract":"This proposal is seeking funding for Technical Committee on Parallel Processing (TCPP) to allow 44 awards (at $700\/student) to be split evenly between IPDPS student author support and PhD forum travel support. The proposed increase from $500 to $700 per award is in light of the expected increase in travel and lodging cost to Rome, the location of IPDPS-09. This proposal is seeking funding for Technical Committee on Parallel Processing (TCPP) to allow 44 awards (at $700\/student) to be split evenly between IPDPS student author support and PhD forum travel support. The proposed increase from $500 to $700 per award is in light of the expected increase in travel and lodging cost to Rome, the location of IPDPS-09. Based on the TCPP's 2009 budget, the PIs expect to supplement this with additional number of awards and\/or additional amount per award.","title":"TCPP PhD Forum and IPDPS-09 Student Travel Awards","awardID":"0917894","effectiveDate":"2009-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["526127"],"PO":["565272"]},"146479":{"abstract":"CCF - 0845605 <br\/>Title: CAREER: Design Framework for Organic Transistor Based Integrated Circuits<br\/>PI: Chris H. Kim<br\/>INST: University of Minnesota-Twin Cities <br\/><br\/>ABSTRACT<br\/>Organic Field-Effect-Transistors (OFET) have recently drawn much attention as their unique attributes make them attractive for emerging large-area electronics such as flexible display panels, organic ID tags, and electronic paper which were not achievable using traditional silicon-based devices. Although the last decade has seen a tremendous progress in OFET performance, there has not been any significant research effort from the design community addressing challenges associated with OFET systems. The goal of this project is to develop a comprehensive design framework for future OFET systems in which the circuit design knowledge, device compact models and design tools will be developed and integrated into an OFET process design kit. The research and education activities will be carried out in collaboration with the organic transistor group at the University of Minnesota. <br\/><br\/><br\/>This project is structured to maximize the impact on several sections of the general scientific and engineering community, as well as on society, education and outreach. The proposed research will produce prototype designs showcasing new innovations in OFET electronics. Key achievements will be disseminated to the public through the PI's research webpage. This project will proactively recruit and nurture minorities (Afro-Americans, Hispanics, native Americans), women, under-represented groups and members of K-12 organizations, as well as strongly leverage existing university-wide efforts for diversity, service, and outreach. New course materials on OFET electronics design will be developed for undergraduate and graduate curriculum with special emphasis on training future scientists and engineers with creative problem-solving skills in cross-disciplinary areas.","title":"CAREER: Design Framework for Organic Transistor Based Integrated Circuits","awardID":"0845605","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["541006"],"PO":["562984"]},"146227":{"abstract":"Improving energy efficiency is critical since future users will demand mobile devices with even longer battery life or higher performance stationary systems that are cost effective to operate even when energy costs increase. The challenge that efficient energy management faces is matching the power state of the system resources to the application or user demand. The goal is to reduce energy consumption by keeping the device in the low-power state when not used, but at the same time provide high response when the demand for the device arrives. Current solutions are either not transparent and require programmer involvement, or are less effective in reducing energy consumption and can expose significant delays to the application and the user. The goal of the proposed work is to design a fully autonomous and unified system that will transparently examine and adapt to application demands of both interactive as well as non-interactive applications in the current and future systems. This goal will be achieved through highly detailed user and application behavior monitoring in the operating system for interactive system, and application monitoring for non-interactive server type systems. Capturing and understanding such user and application behavior is critical in meeting user demand for high performance while saving energy. <br\/><br\/>The project will involve students in designing and evaluating energy-efficient mechanisms for various system components and device types through in-class assignments as well as independent studies. The projects and assignments will provide students with better understanding of the challenges that they will face in their future careers.","title":"CAREER: Exploiting Instruction-Based and User-Behavior-Based Prediction for Energy and Performance Management in Operating Systems","awardID":"0844569","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["475180"],"PO":["565255"]},"152465":{"abstract":"The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing. The ACL's annual conference is the major international conference in this field. This project is to subsidize travel, conference, and housing expenses of students selected to participate in the Association for Computational Linguistics (ACL) Student Research Workshop, which is part of the ACL conference on August 2-7, 2009 in Singapore. The workshop consists of two tracks: full paper presentations and poster presentations. All selected work has only student authors. The full paper sessions are composed of paper presentations followed by a discussion panel led by respected researchers in the field. The workshop is organized and run by students.<br\/><br\/>The Student Research Workshop provides a valuable opportunity for the next generation of natural language processing researchers to enter the computational linguistics community. It allows the best students in the field to take their first important step toward becoming professional computational linguists by receiving critical feedback on their work from external experts, and by making contacts with other students and senior researchers in their field. The students who are involved in running and selecting papers for the workshop also gain valuable opportunities for professional growth and interaction with the researchers on the organizing committee of the main conference. The workshop contributes to the maintenance and development of a skilled and diverse computational linguistics and natural language processing research community.","title":"Student Research Workshop in Computational Linguistics at the ACL 2009 Conference","awardID":"0910455","effectiveDate":"2009-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["467640"],"PO":["565215"]},"146438":{"abstract":"NSF Proposal #0845407<br\/><br\/>Title: Theory and Application of Small-Sample Error Estimation in Genomic Signal Processing<br\/><br\/>P.I.: Ulisses Braga-Neto<br\/><br\/>Project Abstract<br\/><br\/>Genomic Signal Processing (GSP) is the engineering discipline that<br\/>studies modeling and statistical issues related to biological signals<br\/>measured by high-throughput technology, such as gene-expression<br\/>microarrays or protein-abundance mass spectrometry. Research in GSP<br\/>typically involve the discovery of reliable molecular markers for<br\/>disease diagnosis and prognosis, using pattern recognition or machine<br\/>learning approaches. Such approaches rely on the accuracy of error<br\/>estimation for classification and prediction. This is particularly<br\/>critical due to the small sample sizes that are common in GSP<br\/>applications. Novel robust small-sample error estimation methodologies<br\/>in GSP are needed in order to enable reproducible scientific discovery<br\/>that leads to genuine medical advancement.<br\/><br\/>This research has as its goal solving significant computational and<br\/>statistical problems that exist in small-sample error estimation.<br\/>Among the open problems that will be addressed are (1) to obtain exact<br\/>and approximate representations of the joint sampling distribution of<br\/>the estimated and true errors for linear continuous classifiers, which<br\/>will lead to better-performing error estimators and practical tools to<br\/>assess significance of results; (2) to study error estimation for<br\/>discrete classifiers, including the binary coefficient of<br\/>determination (CoD), using both analytical and complete enumeration<br\/>approaches; (3) to develop the methodology of bolstered error<br\/>estimation, addressing the application in high-dimensional spaces and<br\/>with adaptive kernels, with an emphasis on feature selection; (4) to<br\/>apply these error estimation techniques to the problem of biomarker<br\/>discovery for diagnosis and prognosis in cancer and infectious<br\/>diseases, in partnership with medical collaborators at Translational<br\/>Genomics (TGen), the Johns Hopkins Medical School, and the Oswaldo<br\/>Cruz Foundation, Brazil (FIOCRUZ).","title":"CAREER: Theory and Application of Small-Sample Error Estimation in Genomic Signal Processing","awardID":"0845407","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["551032"],"PO":["564898"]},"151762":{"abstract":"The 2009 IEEE INFOCOM Conference on Computer Communications will be held in Rio de Janeiro, Brazil from April 19 to April 25, 2009. This preeminent technical conference is a primary venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners in the field. Attending conferences such as INFOCOM is of great importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field. This award provides funds to support approximately sixteen graduate students in the United States to attend this premiere conference. The travel awards will target graduate students, in particular, women and under-represented minority students, since attending conferences is an important part of their educational experience, and they often have limited travel funds. <br\/><br\/>The intellectual merit of the proposal resides in encouraging and supporting graduate student attendance to INFOCOM 2009, which will continue the tradition of the previous INFOCOM conferences as a premier venue for bringing together academia, industry, and government to share newest developments in communications. Besides technical paper presentations, the conference offers a wide range of technical activities including workshops and tutorials. <br\/><br\/>In terms of its broader impact, this proposal aims at providing graduate students conducting research in the field of communications with the opportunity to attend the INFOCOM 2009, one of the main technical conferences in the field. Attending such high-caliber technical venues is extremely valuable for future researchers. Not only they will be exposed to the state-of-the-art in the field, but also they will have the opportunity to interact with peers from institutions worldwide, meet with leading researchers, and take part in discussions that are likely to shape the future of the field (e.g., in terms of technology, standards, etc.).","title":"Student Travel Support for IEEE INFOCOM 2009","awardID":"0908073","effectiveDate":"2009-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["418075"],"PO":["564777"]},"146439":{"abstract":"People are able to learn new concepts much faster than computers, often requiring only a handful of examples where a computer might require hundreds. This remarkable ability is partly the consequence of extensive experience with the world, resulting in strong prior knowledge about the kinds of objects that are likely to form categories. This research project bridges the gap between human and machine learning by developing probabilistic models of human category learning, connecting psychological data with the latest theories from computer science and statistics. These mathematical and computational models are used to explore how people learn categories so quickly, to capture the effects of prior knowledge on categorization, and to build a catalogue of human concepts that can be used to test psychological theories and to train machine learning systems. In each case, the research combines the ideas, methods, and sources of data used in psychology and computer science, using hierarchical Bayesian models and Markov chain Monte Carlo algorithms to model human cognition, laboratory experiments to test these models, and large databases as a source of statistical information that guides model predictions. This research program is integrated with an educational plan that incorporates undergraduate and graduate teaching and mentoring, development of a textbook on probabilistic models of cognition, tutorials and workshops aimed at increasing contact between the computer science and psychology communities, and outreach through talks and a website.","title":"CAREER: Connecting Human and Machine Learning through Probabilistic Models of Cognition","awardID":"0845410","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["557870"],"PO":["491702"]},"154207":{"abstract":"Digital library developments currently emphasize traditional services, such as searching, archiving, and access to digital information (e.g., the HathiTrust and Google Book Search), but fail to recognize the potential for eScience to identify latent information that is buried in digital collections and scientific databases. This SGER is exploring the new forms of scientific research that are possible in an all-digital library. As a case study we are using Cornell's Mann Library, which will be one of the first large scientific libraries to digitize at least 80 percent of its book collections. As yet, only a few scientists are aware of the opportunities that an all-digital library offers. The first part of the study is gathering information from scientists about the potential for information-driven research in their domains, and the tools and services that they need. The second part of the study is undertaking pilot experiments to gain insights into the practical difficulties in carrying out information-intensive research on digital book collections. This will use an initial collection of 100,000 digitized books to which we are providing tools for indexing, simple data mining, and extraction of subsets. <br\/><br\/>Public dissemination of the results is an integral part of this study. The aim is not simply to explore eScience in the all-digital library, but to enable scientists to carry out eScience research without the help of computing specialists. For this they need support from universities, libraries, and the government. This support must be built on a well-informed analysis of the technical, human, and organizational factors that will maximize the benefits of the all-digital library.","title":"SGER: EScience in the All-Digital Library","awardID":"0917666","effectiveDate":"2009-03-15","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[410331],"PO":["563751"]},"150566":{"abstract":"This workshop focuses on the impact of YouTube and Web 2.0 on the 2008 election cycle in the United States. It brings together scholar in Political Science, Computer Science, and related disciplines to examine this topic. At this time, most work concerning the impact of the web on politics is of an anecdotal matter. There does not exist agreed upon standards on how to approach this topic. One of the purposes of this workshop is to serve as a catalyst to develop baseline measures, metrics, integrative tools, and uniform repositories to facilitate the study of the impact of Web 2.0 on politics in a coherent manner. It will also serve to develop new teams and networks of scholars working on projects involving this subject matter.<br\/><br\/>In addition, the research presented at and resulting from this workshop will demonstrate new technical and analytic opportunities and highlight where there is a need for more focusesd research and tool development. The results of the workshop might also be of interest to practioners.","title":"Workshop: YouTube and the 2008 Election Cycle in the United States, April 3-4, 2009","awardID":"0903886","effectiveDate":"2009-03-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1371","name":"POLITICAL SCIENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["491832"],"PO":["559351"]},"146607":{"abstract":"Numerous technical and environmental forces are increasing the importance of data privacy for businesses and individuals alike. These forces include the migration of data to Web services, the permanent archiving of large volumes of data and communications by services and ISPs, and legal actions that are forcing individuals and organizations to reveal private (and even encrypted) data. Traditional encryption is an insufficient solution under these conditions, thereby creating new challenges to preserving our digital privacy in an increasingly inter-connected and digital world. This project tackles these challenges through the creation of a principled framework for protecting the privacy of past data -- such as copies of emails maintained by an email provider -- against accidental, malicious, and legal disclosure, even to entities who have access to the decryption keys. This framework consists of both underlying technical mechanisms and prototype applications; these mechanisms and prototype applications are developed in concert to ensure the broadest applicability of the overall framework. These prototype applications, by themselves, also directly address the privacy needs of broad classes of individuals, ranging from home users wishing to enhance the privacy of their email communications to voting machine manufacturers wishing to improve the privacy of electronic voting audit logs.","title":"CAREER: A Comprehensive Framework for Disappearing Data","awardID":"0846065","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1668","name":"FED CYBER SERV: SCHLAR FOR SER"}}],"PIcoPI":["559051"],"PO":["497499"]},"146590":{"abstract":"The ever-shrinking feature size in CMOS process technology has enabled the integration of a large number of devices such as cores, caches, and other special engines in a single chip. The growing popularity of Chip Multiprocessors (CMPs) has ushered in the arrival of a communication-centric system where the design of interconnection architecture has a significant impact on the overall system performance as well as power dissipation and area of a chip. To overcome traditional interconnects problems, Network-on-chip (NoC), using switch-based networks, has been widely accepted as a promising architecture to orchestrate chip-wide communication. Although there has been significant research on NoC designs, there is still a lack of a unified design methodology integrating system and NoC design.<br\/><br\/>The investigator is developing a comprehensive design paradigm for exploring the on-chip interconnect design space, especially focusing on how it interacts with the rest of the CMP architecture. This research program is comprised of four intertwined research objectives. First, simulation testbeds and traffic analysis methodologies are developed to understand the interplay between applications and system architecture. Traffic analysis tools are used to capture the runtime behavior of various applications in CMPs. Second, solutions for high and predictable performance within power and area budgets in current and future technology generations are provided. Third, the PI is developing a domain specific NoC design for CMP memory systems. As the last objective, the PI explores new opportunities and challenges posed by future applications of next-generation CMP. The research is integrated into the education curriculum, through existing and new graduate courses, and in undergraduate research programs.","title":"CAREER: Communication-Centric Chip Multiprocessor Design","awardID":"0845998","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":[390805],"PO":["366560"]},"146592":{"abstract":"Software innovation typically relies on performance improvements of<br\/>the underlying hardware. However, technology limitations hinder<br\/>further significant progress in single-thread performance. Therefore,<br\/>the software industry has the immense problem of rethinking its<br\/>software development process and techniques to adopt multicore<br\/>systems. Popularizing parallel programming is a Grand Research<br\/>Challenge for the systems community [CRA]. Being able to leverage the<br\/>full potential of multicores would put us back into exponential growth<br\/>of usable performance as well as lead to significant power savings.<br\/><br\/>One of the main reasons why parallel programming is hard is that<br\/>parallel code in current multicore systems can execute<br\/>nondeterministically. Each time a multicore executes a parallel<br\/>application, it can produce a different output even if supplied with<br\/>the same input. This frustrates debugging efforts and limits the<br\/>ability to properly test parallel code, becoming a major obstacle to<br\/>widespread adoption of parallel programming. <br\/><br\/>This project poses broad intellectual questions with far-reaching<br\/>implications in modern computer systems: Can nondeterminism be removed<br\/>from shared-memory multiprocessor systems without degrading<br\/>performance? What are the trade-offs in designing deterministic<br\/>multiprocessor systems? What are the implications and uses of<br\/>deterministic behavior in programmability? The PI plans to answer these<br\/>questions by devising efficient, general purpose, fully deterministic<br\/>shared memory multiprocessor systems and demonstrating that they can<br\/>enable significant changes in how parallel programs are written,<br\/>tested and deployed. An integral part of the concurrency challenge is<br\/>education, so this project also aims to develop a graduate and<br\/>undergraduate curriculum that will teach students about concurrency<br\/>principles and practical parallel programming.","title":"CAREER: Deterministic Shared Memory Multiprocessing: Vision, Architecture, and Impact on Programmability","awardID":"0846004","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["555936"],"PO":["366560"]},"155580":{"abstract":"This project is partially funding up to 30 US graduate students to attend the 2009 IEEE International Conference on Robotics and Automation in Kobe, Japan, in May 2009. It is also supporting student visits to laboratories in Japan before and after the conference. The purpose of this project is to increase exposure of US graduate students in robotics to research and researchers in Japan; to help establish meaningful relationships between US students and their counterparts in Japan; and to encourage future collaborations by planting the seeds of international collaboration early in these students' careers. In this sense, the goals of this project have much in common with the NSF East Asia and Pacific Summer Institutes (EAPSI). Indeed, one outcome of this project is expected to be increased interest in the EAPSI and postdoctoral fellowship opportunities in Japan. Other outcomes will be measured by student trip reports and surveys. This project is also producing a database of US robotics labs willing to host future visitors from Japan as part of reciprocal programs.","title":"Student Travel Support to Japan: 2009 IEEE Int Conf Robotics and Automation and Lab Visits","awardID":"0922766","effectiveDate":"2009-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7731","name":"OTHER GLOBAL LEARNING & TRNING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["522422"],"PO":["543539"]},"146450":{"abstract":"While sighted people readily enjoy the added value of the graphical content (digital images, maps, diagrams, etc.) that has become prevalent in the information age, visually impaired users can with the help of screen-reader software such as JAWS and Window-Eyes independently access only digital textual data, because such software cannot handle graphical information. Typical procedures for manually producing tactile graphics by sighted professionals are generally time consuming and labor intensive, hence coverage is extremely limited; furthermore, there is no online and independent availability if the production has to be done by third-party professionals. The PI's ultimate goal is to afford users with visual impairments independent real-time access to diverse types of graphical information, while taking into account often-overlooked issues such as privacy. In this project, however, he will address one specific and challenging subproblem of practical significance: how to make digital graphical content more independently accessible to students in the science, technology, engineering, and mathematics (STEM) fields. In addition to line-drawing graphics of a primarily binary nature, a specific type of continuous-tone image, human portraits, will also be considered, both due to the special value that facial images have in our social and emotional life, and also to demonstrate the potential of the PI's approach for handling more complex visual content. The research activities planned to these ends include a focused study of the peculiarities of haptic perception in tactile exploration of graphics, development of visual processing techniques for automated visual-to-tactile conversion, a usability study to determine intuitive and efficient presentation and interface schemes for the target end-users, prototype development and evaluation. Encouraging preliminary results have been obtained by the PI, demonstrating the feasibility and potential of the planned research and of the proposed methodologies. This research will advance our knowledge in the domains of visual-tactile cognition, image understanding, human-computer interaction in general and assistive technologies for people with visual impairments in particular. The PI?s institution provides an excellent and unique environment for performing this work.<br\/><br\/>Broader Impacts: This research will contribute to the research fields of visual-tactile cognition, automatic understanding of visual data for visual-to-tactile conversion, and development of assistive devices for the visually impaired. It will have significant impact on society, by ultimately enabling independent access to a wide range of visual content by people who are blind. More immediately, the project will help overcome the current barriers to the STEM fields that confront individuals with visual impairments.","title":"CAREER: Enabling Independent Access to Digital Graphical Content for People with Visual Impairment","awardID":"0845469","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["527025"],"PO":["565227"]},"146571":{"abstract":"Reconstructing 3D geometric models of objects from their 2D images has been a longstanding problem in computational vision. Traditional approaches to this problem require many images taken of the same objects under different viewpoints and\/or illuminations; this requirement poses a significant limitation on the operating range of these methods. For example, in consumer photography, the majority of photos are not taken with such a purpose in mind. Even in research communities, collecting multi-view\/illumination image data sets is a tedious task. <br\/><br\/>The PI and his team are investigating novel 3D reconstruction methods that operate on a collection of images for similar-but-not-identical objects in one category and recover a family of parameterized 3D models for the category. The underlying assumption made is that the shape distribution has only limited number degrees of freedom, many less than the image data that are available for the category. This approach exploits the abundance of images on the Internet that densely sample the appearance of similar objects in different categories, such as faces, vehicles, architectures, humans, and animals. The outcome of this research enables the creation of large-scale parameterized 3D model databases for these categories, without the need of placing all individual objects on a turntable in a controlled setting. Such databases have a wide range of impact, such as autonomous navigation, security surveillance, human computer interaction, biometrics, graphics, industry design, virtual environment, forensics, archeology, and entertainment. <br\/><br\/>The PI also seeks to integrate the core idea of this research project into his education plan. In particular, his primary education goal-both in course work and in mentoring graduate students - is to emphasize a data - driven approach to vision that is both foundational and practically important. The data and tools will be disseminated in a timely fashion. Updates will be available from http:\/\/www.cs.wisc.edu\/~lizhang","title":"CAREER: Categorical Shape Reconstruction","awardID":"0845916","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["490501"],"PO":["564316"]},"156383":{"abstract":"This is funding to support a consortium (workshop) of approximately 12 promising doctoral students from the United States and abroad, along with about 5 distinguished research faculty. The event will take place on Sunday, October 25, immediately preceding and in conjunction with the Eleventh ACM SIGACCESS Conference (ASSETS 2009), to be held Monday-Wednesday, October 26-28, 2009, in Pittsburgh, and sponsored by the ACM Special Interest Group on Computers and Accessibility. The ASSETS conference is the premier forum for presenting research results and innovations in software and technology designed to address the special needs of people with disabilities of all kinds. Researchers and developers from both academia and industry around the world will meet to exchange ideas and present reports on the latest work relating to speech, motor, hearing, and vision impairments, cognitive limitations, emotional and learning disabilities, and aging. A key component of building this community is through its youth. The ASSETS 2009 doctoral consortium will provide an opportunity for graduate students from diverse backgrounds (computing, engineering, psychology, architecture, etc.) to come together and explore their research interests in an interdisciplinary workshop, under the guidance of the PI and a panel of other distinguished experts in the field, so that they can see the broader spectrum of research and development approaches to assistive technologies and universal usability, and also experience the community in which they can pursue their endeavors. Student participants will make formal presentations of their work during the consortium, and will receive constructive feedback from the faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the consortium will help shape ongoing and future research projects aimed at assistive technologies and universal access, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will expose these promising young researchers to a larger community. A session has been set aside during the main conference to allow doctoral consortium participants to present to the entire conference, and one student from the doctoral consortium will be selected to deliver the closing plenary presentation. The organizers will take special steps to promote participation from institutions with relatively large numbers of students from underrepresented groups. More information is available online at http:\/\/www.sigaccess.org\/assets09. Evaluation of the consortium will be conducted, and the results made available to the organizers of future such events.<br\/><br\/>Broader Impacts: The doctoral consortium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Workshop: Doctoral Consortium for ASSETS 2009","awardID":"0925357","effectiveDate":"2009-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["485574"],"PO":["565227"]},"147121":{"abstract":"This workshop, supported by the Science, Technology & Society Program and the Computer and Information Science and Engineering Directorate at NSF, will discuss ethical guidance for research and application of pervasive and autonomous information technology. Technologies are being developed today using very small, relatively inexpensive, wireless-enabled computers that will most likely result in the near-omnipresence of information gathering and processing devices embedded in clothing, appliances, carpets, food packaging, doors and windows, paperback books, and other everyday items to gather data about when and how (and possibly by whom) an item is used. The data can be analyzed, stored, and shared via the Internet. Some of these pervasive technologies will also be autonomous, making decisions on their own about what data to gather and share, which actions to take (sound an alarm, lock a door), and the like. <br\/><br\/>The potential benefits of pervasive and autonomous information technology are many and varied, sometimes obvious, sometimes obscure--as are the ethical implications of their development and deployment. The history of information technology suggests that long-standing issues including usability, privacy, and security, among others, as well as relatively new phenomena such as ethically blind autonomous systems, are best addressed early. When such issues are addressed early, they can become part of the culture of researchers and engineers responsible for identifying needs and designing solutions. <br\/><br\/>This will be an international meeting of experts in ubiquitous and autonomous information technologies, ethicists well-versed in practical ethics, and other stakeholders. The meeting will feature: discussions of case studies describing actual and anticipated uses of pervasive and autonomous information technology, invited presentations on key issues, working groups to identify and categorize ethical concerns, and other community-building activities aimed at formulating ethical principles to help researchers and designers recognize and address ethical issues at every stage, from design to deployment to obsolescence. The participants will form the core of a new interdisciplinary subfield of value-centered pervasive and autonomous information technology which will build on the principles by developing guidelines and conceptual tools to support communication and collaboration among researchers, engineers, and ethicists.","title":"Workshop: Ethical Guidance for Research and Application of Pervasive and Autonomous Information Technology","awardID":"0848097","effectiveDate":"2009-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7603","name":"SCIENCE, TECH & SOCIETY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[392004,392005],"PO":["471270"]},"157473":{"abstract":"The project will develop a multiscale, data-driven, high performance computational framework for real-time reconstruction of hazardous events from sparse measurements, and consequent probabilistic prediction of the evolution of the hazard. The framework is distinguished by four phases that are performed continually with dynamically-obtained data over the lifetime of the hazardous event. (1) Measurement: Distributed sensors provide dynamic measurements over a specified time horizon that will be used to reconstruct the initial conditions of the event. (2) Inversion: Driven by the sparse measurements, an inverse problem is solved to estimate the initial conditions for the equations governing the evolution of the hazard. (3) Prediction: Statistical analysis of the inversion results permits estimation of the uncertainty in the initial conditions, which is propagated into a prediction of the evolution of the hazard and its uncertainty. (4) Steering: Sensors are steered to new locations based on an effectivity index that incorporates sensitivities of the inversion with respect to sensor location, estimated uncertainty in the prediction, and population density factors. Continual application of the measure-invert-predict-steer (MIPS) framework described above results in updated predictions of the evolving hazard with built-in uncertainty estimates, as well as revised sensor deployment strategies that refine the predictions to reduce their uncertainty. The methods developed consider two time scales of decision making at which the MIPS framework must execute. The seconds-to-minutes decision-making scale is required by first responders to begin immediate response efforts. For such time scales, high-fidelity models in the form of partial differential equations (PDEs) are too formidable. Instead, the proposed methods will construct reduced-order models of the PDEs to facilitate realtime execution of the MIPS framework. The minutes-to-hours decision-making scale permits more careful and measured response by emergency officials using high-fidelity, high-resolution PDE models. To enable rapid execution of the MIPS cycle for such models, the project will develop fast, scalable, parallel algorithms for inversion and prediction. To demonstrate, assess, harden, robustify, and the resulting framework, will be validated on a specific application testbed: prediction of the urban\/regional dispersion of intentionally- or accidentally-released atmospheric contaminants from sparse measurements.","title":"Collaborative Research: DDDAS-TMRP: MIPS: A Real-Time Measurement Inversion Prediction Steering Framework for Hazardous Events","awardID":"0929947","effectiveDate":"2009-03-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T363","name":"AIR FORCE-PRED OF URBAN\/REGION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["559409"],"PO":["535244"]},"146441":{"abstract":"Morphogenetic Primitives: Self-Organizing Geometry Based on Morphogenesis and Evolutionary Computing<br\/><br\/>Dr. David Breen<br\/>Department of Computer Science<br\/>Drexel University<br\/><br\/>It has been noted that two types of systems exist in the world: 1) systems designed and built by humans to perform a specific job, and 2) biological systems that self-organize to also perform complex tasks without a master plan or overseer directing the actions. The self-organization found in biological systems is a powerful untapped paradigm that, if formulated and exploited, could lead to a superior approach to designing human-made structures. Self-organization algorithms could enable collections of software agents, micro-devices and engineered cells to form into user-defined shapes using only minimal, local information. Developing these algorithms should lead to advances in geometric computer-aided design, tissue engineering, swarm robotics, sensor networks and the custom-design of living cell aggregates.<br\/>This research project combines and extends concepts from morphogenesis (the cell-level spatial process that produces the structure of an organism), cell aggregation simulation and evolutionary computing in order to produce a new, organic approach to shape generation. Called Morphogenetic Primitives (MPs), this approach captures the fundamental algorithmic constructs of geometric self-organization and harnesses their capabilities within a software framework. MPs are being applied to a number of innovative and important problem-domain areas. The approach creates a new class of self-organizing modeling primitives that may be programmed to ?grow? shapes that meet a specific need while adapting to constraints in the environment. The conceptual framework of MPs is rooted in developmental biology and is based on the multiple biological\/physical mechanisms of morphogenesis. Local cell-level interactions aggregate to create high-level shapes and structures. Given the extreme challenges of determining the correct local actions that produce a desired final structure, evolutionary computing techniques are utilized in order to computationally produce the instructions and equations needed for a specific morphogenetic primitive application.","title":"CAREER: Morphogenetic Primitives: Self-Organizing Geometry Based on Morphogenesis and Evolutionary Computing","awardID":"0845415","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7946","name":"BIO COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["453840"],"PO":["532791"]},"143373":{"abstract":"Longitudinal studies of network systems are very difficult to conduct when systems are large, heterogeneous, highly interconnected, and open; yet, the importance of these studies cannot be underestimated. This project focuses on an 18-month longitudinal study on server-side vulnerabilities in the campus network of the University of California at San Diego and on client-side vulnerabilities the University of California at Davis. The issues concern the efficacy of security measures at the campus-wide networks and its implication for security of networked systems at universities, government facilities, and commercial enterprises.","title":"Collaborative Research; CT-M: Computer Systems Vulnerabilities and the Efficacy of Defensive Mechanisms","awardID":"0831132","effectiveDate":"2009-03-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[381771,"451956"],"PO":["565264"]},"146585":{"abstract":"The exponentially increasing demands for heterogenous services<br\/>over Internet and wireless networks have imposed new urgency<br\/>and great challenges for designing next-generation networks<br\/>that achieve higher throughput, better resiliency to adversary<br\/>attacks, and stronger security for sensitive information.<br\/>Recently, a new network coding paradigm has emerged, which<br\/>potentially achieves the above goals simultaneously in an<br\/>optimal fashion. Nonetheless, to realize fully its promised<br\/>benefits requires a clean-slate methodology of network code<br\/>design that achieves optimal performance and maintains low<br\/>complexity while reacting quickly to the ever changing network<br\/>environment.<br\/><br\/>To that end, the investigators study coded feedback, which<br\/>generalizes the conventional feedback mechanism that<br\/>acknowledges non-coded traffic by incorporating the unique<br\/>algebraic structure of network-coding. This research first<br\/>explores the joint algebraic properties between coded forward<br\/>and feedback packets, which are the basis for the subsequent<br\/>development of new, efficient network protocols for next<br\/>generation network codes. In particular, the investigators are<br\/>interested in the roles of coded feedback that transform the<br\/>non-coding network resource allocation algorithms to their<br\/>coding-oriented counterparts. The rich information carried by<br\/>coded feedback is then used to design protocols that offer<br\/>enhanced global and local error protection and data security<br\/>while self-adapting to network changes. The theoretic studies<br\/>of this program follow closely practical considerations<br\/>including the dynamic channel quality and the interference<br\/>nature of wireless networks and the complexity of the resulting<br\/>protocols. System-level implementation is used to verify and<br\/>further refine the theoretic findings of this program. The<br\/>coordinated approaches of coding theory, graph theory, and<br\/>network optimizations provide valuable interdisciplinary<br\/>training for students with Purdue University.","title":"CAREER: Next Generation Network Coding: Distributed Design Via Coded Feedback","awardID":"0845968","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["402421"],"PO":["564924"]},"146365":{"abstract":"This project includes the development of theory and algorithms, the design of a system architecture, and the prototyping, testing and large-scale deployment of two mobile sensing platforms. The two applications are highway traffic estimation and river flow estimation using GPS-equipped smartphones. The algorithms run online, gather mobile data and send it to a server, which uses inverse modeling to estimate the state of the system. It broadcasts information back to the smartphones and to the internet. A field operational test, called Mobile Millennium is aimed at reaching thousands of users in California. The river flow monitoring project is aimed at deploying a hundred drifters in the Sacramento Delta.<br\/><br\/>The contributions are in the field of Lagrangian sensing in large-scale cyber-physical infrastructure systems. \"Lagrangian\" refers to a form of sensing in which sensors measure quantities along their trajectories; \"cyber-physical\" refers to the flow of information and computing in a system governed by physical phenomena. The project investigates the following question: how to reconstruct the state of a distributed system from mobile sensors which cannot control their motion? The mathematical techniques used include inverse modeling, applied to partial differential equations.<br\/><br\/>This project addresses some important issues related to transportation and clean water. With the free downloadable smartphone software, commuters have real-time traffic information to increase their travel efficiency. By involving students from underrepresented minorities, the UC Berkeley Disabled Student Program, and the Berkeley High School, this research provides a valuable opportunity for students to develop their interest in engineering.","title":"CAREER: Lagrangian Sensing in Large Scale Cyber-Physical Infrastructure Systems","awardID":"0845076","effectiveDate":"2009-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["526902"],"PO":["561889"]}}