{"51915":{"abstract":"This project is centered on connections between long range dependence and heavy tails. The primary application areas are data networks, finance, actuarial research and industrial engineering. The project includes a consideration of statistical issues related to detection of long range dependence, self-similarity and multifractality as well as fundamental issues of basic concepts being inadequately defined. For instance, long range dependence is often defined in terms of correlations but these may be either undefined due to the presence of heavy tails or for non-Gaussian processes rather uninformative. <br\/> Our society is a fast moving and changing one, with ever increasing amounts of information being moved from one end of the country to the other. Dramatic technological and scientific advances are, often, day-to-day phenomena. The stock market is very volatile. The Internet and other communication networks are susceptible to overloads and delays and because of their crucial role in our economic and public life, one needs to be concerned with their performance. Appropriate models are required to make sense of these wildly oscillating processes. This project is centered on models appropriate to understanding and controlling these phenomena-- models with heavy tails and\/or long range dependence.","title":"Long Range Dependence, Heavy Tails and Communication Networks","awardID":"0071073","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["353685","467354"],"PO":["517169"]},"47150":{"abstract":"9982349<br\/>Fessler<br\/>Tomographic imaging is used in a variety of scientific, industrial, national security, and medical applications. Since tomographic imaging problems generally are ill-posed, the reconstructed images can be severely degraded by measurement noise, unless one employs adequate regularization methods. Conventional quadratic regularization methods have the undesirable property of producing nonuniform and anisotropic spatial resolution properties when applied to photon-limited emission computed tomography (SPECT). These properties cause noticeable distortion of object shape in reconstructed images, such as elongation of tumors in PET scans, and can cause nonuniform contrast in thin structures such as the myocardium in cardiac SPECT scans. These deficiencies may impact the diagnostic accuracy of PET and SPECT imaging. The goals of this research project are to develop, analyze, and evaluate improved regularization methods of tomographic image reconstruction, particularly in the context of PET and SPECT imaging. Current commercially available iterative image reconstruction algorithms for SPECT and PET are all based on unregularized methods. The methods developed in this project will improve the suitability of regularized methods for routine use in tomographic imaging by providing uniform spatial resolution where appropriate, and by improving the bias-variance tradeoffs of regularized image reconstruction methods.","title":"Regularization Methods for Tomographic Image Reconstruction","awardID":"9982349","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["351740"],"PO":["564986"]},"55060":{"abstract":"This workshop by the Net@EDU Project within EDUCAUSE and the follow-on information dissemination activities are designed to generate an analysis of voice-over-IP (VoIP) options, strategies, and best practices. The results will be made available to the community of universities and parties involved in NGI, Internet2, and other related initiatives. VoIP promises to be an important technology on emerging, advanced networks. One of Net@EDU's special interest groups has already been working these issues. They will be <br\/>involved in these workshops and already have some useful work done that should help to jump start and accelerate this workshop activity and the quality of the proceedings.","title":"Identifying and Implementing a Coordinated Strategy for Voice over IP in Higher Education","awardID":"0083358","effectiveDate":"2000-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["43608","547713"],"PO":["389815"]},"48680":{"abstract":"The potential applications of nanometer-scale devices and systems are revolutionary. They range from miniscule computers and nanoelectromechanical systems (NEMS), to programmable artificial cells and nanorobots capable of entering cells and repairing them. A promising approach for building such nanostructures consists of assembling molecular-sized building blocks by using Scanning Probe Microscopes (SPMs) as robots. Techniques for SPM nanomanipulation, which are being developed at USC and a few other laboratories, appear to be of wide applicability, but suffer from poor throughput because single-tip SPM operations are sequential. <br\/><br\/>The primary goal of this project is to develop high-throughput, massively parallel SPM techniques for nanomanipulation with multi-tip arrays, which are currently being developed at several <br\/>laboratories, worldwide. A secondary goal is to investigate novel nanomanipulation techniques that use an SPM tip array to shape an electrostatic potential over a sample surface, thereby moving single nanoparticles or groups of particles in a controlled fashion.<br\/><br\/>The emphasis of the research is on algorithm development, by using methods from the fields of algorithm design, geometric modeling, robotics and computational geometry. The algorithms <br\/>will be tested by simulation studies, and also by implementation with physical tip arrays when these become available.","title":"Massively Parallel Nanorobotics With Multi-Tip Scanning Probe Microscopes","awardID":"9987977","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["187175"],"PO":["234178"]},"48681":{"abstract":"Computational vision has made significant strides in the development of sensors and algorithms that recover scene properties from images. However, virtually all work in vision is based on the assumption that the observer is immersed in a transparent medium (air)and that the objects of interest are opaque. It is assumed that light rays reflected by the objects travel to the observer without attenuation or alteration. Therefore, existing vision sensors and algorithms have been created only to deal with clear weather. In practice, however, a vision system must reckon with the entire spectrum of atmospheric conditions commonly known as bad weather. It must continue to perform in the presence of a variety of conditions,including, haze, fog, rain, hail and snow.<br\/><br\/>This proposal outlines a comprehensive research program geared towards the development of models and methods that can aid vision in bad weather. The first step is to understand the visual manifestations of different types of weather conditions. For this, we will draw on what is already known about the optics of the atmosphere. Since the atmosphere modulates the information carried from a scene point to the observer, it can be viewed as a mechanism of visual information coding. We propose the development of a general computational framework that exploits the brightness and color changes that are induced by bad weather. Based on this framework, we will develop models and methods for recovering pertinent scene properties such as true (clear weather) color and three-dimensional structure, from images taken under different (unknown) weather conditions. Such models and methods have obvious applications in scene understanding, autonomous navigation and video surveillance. In addition, we wish to create an extensive image\/video database that captures the wide range of visual effects caused by weather. We believe that such a database will make it easier for researchers to study this important area of computational vision.","title":"Computational Vision in Bad Weather","awardID":"9987979","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["438618"],"PO":["234178"]},"47240":{"abstract":"The investigation of multicast communication as a service in the Internet has been an issue for nearly a decade. And in that time, much progress has been made. From its early inception as a means of streaming audio and video to researchers around the world, the Multicast Backbone (MBone) has grown into an infrastructure supporting commercial applications. But, even though great strides have been made, there are still numerous, serious technical problems to be solved. The rapid growth in multicast users, and the rapid growth in the interest in multicast means not only more and more multicast-capable sites are being added but more demands are being made for a richer set of multicast-base services. As multicast grows in use, the need to make good on the promises of scalability becomes even more important. Furthermore, the complexities of multicast protocols are significantly greater than for unicast protocols. Multicast protocols must communicate state information to manage the dynamic growth of multicast trees and ensure traffic flows only on necessary links; they must implement congestion control among many receivers instead of just one; and they must support management fuctions in an environment with more complexity than traditional management protocols were designed to handle. If multicast implementors have learned anything, it is that fuctions that are easy for unicast protocols are not so easy for multicast. Once one problem is solved, there is another set of problems to be identified and then solved. But even with all the hurdles to overcome the potential utility of a ubiquitous multicast service is immense. Once the protocol issues are more fully solved, the potential for new multicast-based applications and services will carry the Internet to a new level of utility. While multicast is quickly evolving and industry is beginning to take notice, there are still problems to be solved by the academic community. In the last several years, multicast has developed into more than just a research initiative. Multicast is now of interest to many companies. These companies see the value in multicast and also see the value in having multicast as a premiere Internet service. However, just because multicast is being touted as a service ready to roll-out, does not mean all of the technical problems have been solved. More importantly, it would be dangerous for the academic community to believe industry will assume full responsibility for solving the most important problems. The role of academia, and the goal of the research plan described in this proposal, is to support the investigation of problems limiting the effectiveness of the Internet-wide deployment of multicast. Furthermore, results of this research will hopefully be applied in next-generation high speed regional (Ca1REN-2) and national (vBNS and Internet2) networks. The basic goal of the research outlined in this proposal is to continue evolving multicast into an Internet service. A number of multicast research topics and deployment issues are targeted. Because multicast communication is both the subject of ongoing academic research and deployment issues, this CAREER proposal is an investigation of issues along two axes: (1) networking issues ranging from the data link layer up to the application layer, and (2) the type of research ranging from basic research to applied research. Significant thought has been given to organizing this CAREER proposal in a manner that reflects the changing philosophy of academia. The first axis is developed based on the philosophy that applications drive the need to develop new Internet services. In the network, Internet service enable new paradigms and applications to be developed. The second axis is developed based on the philosophy that a new era has begun in which successful faculty must be capable of addressing both fundamental research issues and applied research issues across a range of areas. The proposed education plan relates very closely to the proposed research plan. The educational mission is to teach undergraduates and graduates the fundamental aspects of networking and then to relate them to how things work in the Internet. The key strength of the educational mission is its close ties to the research plan. In particular, the digital classroom is the enabling concept which bring education and research together. The digital classroom is an ideal application. It embodies much of my research philosophy and is an excellent bridge for students. They can see the need for distance learning at the macro-level and can use that knowledge to put into context the micro-level projects. The best way to evaluate a digital classroom is to use it, and the best way to build a digital classroom is to have students (not as chep labor but as eventual \"useer\") build it. The classroom provides a traditional environment for students to learn theoretical topics, the classroom can also be a place where traditional topics using non-traditio","title":"CAREER: From Protocol Support to Applications: Elevating Multicast to a Ubiquitous Internet Service","awardID":"9982769","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["552796"],"PO":["565090"]},"29398":{"abstract":"","title":"NYI: Object-Oriented Database Tools for Supporting Complex Evolutionary Software Systems","awardID":"9796264","effectiveDate":"2000-07-15","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["543520"],"PO":["563751"]},"48770":{"abstract":"Recent advances have demonstrated how Quality of Service (QoS) at the resource management level brings content-rich applications, such as video-on-demand, visual tracking and tele-instrumentation, to our laboratories, and homes. In order for these applications to make full use of QoS and in turn impact our lives in a beneficial, secure and economic manner, fundamental mappings between QoS\/ resource-specific and application-specific parameters must be addressed. Solving this problem is the next major step in bringing out the full potential of QoS.<br\/><br\/>Nahrstedt's research will address the systematic theoretical and experimental exploration of methodologies for matching between QoS\/ resource and application requirements, resulting in a framework, called 'QoS Talk\". The primary objective of the research is to achieve effective \"talking\" between two different worlds. To achieve this objective, 'QoS Talk' project will (1) develop concepts for matching of local and distributed resource management environments to application requirements and their QoS guarantees, (2) provide theoretical framework, building on top of models such as fuzzy control, adaptive control, probabilistic models, and (3) implement a testbed.","title":"A QoS Mapping Framework: QoS Talk","awardID":"9988199","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["561784"],"PO":["309350"]},"47373":{"abstract":"EIA-9983304<br\/>Chen, Hsinchun<br\/>University of Arizona<br\/><br\/>Digital Government: COPLINK Center: Information and Knowledge Management for Law Enforcement<br\/><br\/>The information and knowledge management problems facing many government agencies stem from barriers to access and utilization resulting from the content and format of information. These problems make information (and eventually knowledge) creation and utilization and complex and daunting process. New knowledge management technologies have started to emerge in a number of different applications and organizations, such as virtual enterprising, joint ventures, aerospace engineering and digital libraries. However, there has been no systematic attempt to study the technical, social and managerial foundation, theory and methodology of knowledge management that can be adopted in various social and industrial contexts. The COPLINK Center for Excellence aims to achieve the following two goals: 1) Develop knowledge management systems technologies and methodology that are appropriate for capturing, analyzing, visualizing and sharing law enforcement related information in social and organizational contexts. The basis of such research will be grounded in information retrieval, computational linguistics, information visualization, artificial intelligence, multimedia systems, multi-agent systems, and telecommunications. 2) Study of organizational, social, cultural and methodological impacts and changes that organizations need to make to maximize and leverage on a law enforcement agency's investments in information and knowledge management. The academic foundation for such research will be based on social informatics, decision theory, communication theory, cognitive psychology and managerial and organizational research.","title":"Digital Government: COPLINK Center: Information and Knowledge Management for Law Enforcement","awardID":"9983304","effectiveDate":"2000-07-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7293","name":"DISASTER RESPONSE TEAMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V424","name":"CIA-HUMAN LANGUAGE & COMM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V713","name":"CIA-KDD NSF GRANT RECIPIENTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V068","name":"CIA-KDD & TARGET CHARACHTERIZA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W295","name":"CIA-KNOWLEDGE DISC & DISSEMIN"}}],"PIcoPI":["548216","387279","258181"],"PO":["371077"]},"47285":{"abstract":"DIMACS, the Center for Discrete Mathematics and Theoretical Computer Science, will run a ``Special Year on Computational Molecular Biology'' to follow up on its highly successful ``Special Year on Mathematical Support for Molecular Biology.'' The special year is motivated by major developments at the interface between biology and information science: The availability of massive amounts of data in novel and diverse forms, requiring the expertise of information scientists; the availability of new technologies, powerful experimental tools that need to be integrated with fundamental algorithmic research; and the development of new mathematical and computational tools that make it possible to understand biological processes at a much more complex level than before. The special year will include workshops, visitors, and the involvement of postdoctoral fellows and graduate students from around the country. Activities will be organized around a series of workshops: Integration of Diverse Biological Data, Sequence Motif Recognition, Whole Genome Comparison, Learning Stochastic Processes, Protein Structure (Recent Computational Advances and Future Directions), System-based Modeling in Bioinformatics, Geometric Searching, Analysis of Gene Expression Data, Computational Issues in Signal Transduction, Protein Structure Comparison and Prediction Assessment, and DNA Topology. This award is co-funded with the Sloan Foundation. NSF funds will specifically be used to support the attendance of young scientists from underrepresented minorities.","title":"DIMACS Special Year on Computational Molecular Biology","awardID":"9982983","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["531670","122839","259414","264120"],"PO":["292812"]},"48782":{"abstract":"9988227\/9988315<br\/>Slaughter, Sandra<br\/>Kemerer, Chris F.<br\/>Carnegie Mellon University<br\/>University of Pittsburgh<br\/>Discovering the Profiles and Patterns of Software Evolution<br\/><br\/>Software evolution refers to the dynamic behavior of <br\/>software systems as they are maintained and enhanced <br\/>over their lifetimes. Software evolution is of increasing<br\/> importance as systems in organizations become longer-lived. <br\/>However, empirical studies of software evolution face particular<br\/> challenges due to the longitudinal nature of the evolution <br\/>phenomenon. As a result, there is relatively little scientific<br\/> knowledge about how software systems actually evolve. <br\/>This research has the objectives of developing and evaluating <br\/>models of the process of software evolution. Specifically, <br\/>this research seeks to: (1) Identify typical patterns in the <br\/>changes to software systems over time, (2) Determine the extent <br\/>to which the patterns coalesce into distinct evolutionary phases,<br\/> (3) Understand why systems follow similar or different <br\/>evolutionary paths, and (4) Develop and evaluate models that <br\/>predict the evolutionary patterns of software systems. <br\/>The empirical evaluation involves collecting, coding, and <br\/>analyzing more than 25,000 change events that occurred over <br\/>20 years in 23 commercial software systems. Given the relative <br\/>paucity of research on software evolution, this study should yield <br\/>unique insights that contribute to theory building. In addition, <br\/>longitudinal empirical data and databases on software change <br\/>histories will be created that are novel, detailed, and of high <br\/>quality.","title":"Discovering the Profiles and Patterns of Software Evolution","awardID":"9988227","effectiveDate":"2000-07-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["405531"],"PO":["564388"]},"48793":{"abstract":"Institution: U of MD College Park<br\/>Proposal Number: CCR-9988256<br\/><br\/><br\/>How Good Can Parallel Algorithms Really Be?<br\/>Uzi Vishkin, PI and Manoj Franklin, co-PI<br\/>Abstract<br\/><br\/>Experimental study of parallel algorithms and applications is proposed. The investigators plan to conduct this study with respect to the Explicit Multi-Threaded (XMT) platform for instruction-level parallelism (ILP). A general goal of this work is to promote \\thinking and programming in parallel\". For this the investigators will try to better understand the performance potential of a platform such as XMT relative to existing parallel and serial platforms\/models. Work which the investigators have already done provides interesting preliminary examples for mixing experimental research and theoretical analysis. This preliminary work appears to update previous knowledge by suggesting that: (i) Good speedups for much smaller inputs are possible. (ii) Incorporating analytic (non-asymptotic) performance evaluation into experimental performance analysis is possible; this includes applicability to relatively small inputs. Explicit Multi-Threading (XMT) is a fine-grained computation framework introduced in a SPAA'98 paper by Vicki et al. XMT aims at faster single-task completion time by way of ILP. Building on some key ideas of parallel computing, XMT covers the spectrum from algorithms through architecture to implementation; the main implementation related innovation in XMT is through the incorporation of low-overhead hardware and software mechanisms (for more effective fine-grained parallelism).","title":"How Good Can Parallel Algorithms Really Be?","awardID":"9988256","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["508237","225924"],"PO":["543507"]},"47880":{"abstract":"The research supported by this proposal addresses all stages of communications technology development - from protocol design through implementation -- identifying hard-wired technical biases and predicting emergent biases. Hypotheses of biases in protocols from the physical to the applications layer are based on examinations of the protocols including the relevant regulatory regimes, economic distributions, and design processes. Hypotheses are tested using the extensive body of data on the use of emerging (e.g., pointcast, the web, real time interactive services) and adopted (e.g., telephony, broadcast, email, print) communications technologies as well as current conceptualizations of security and privacy. Enumeration of the values embedded in popular protocols, in addition to alternatives to these proposed protocols as appropriate, will be the result. This research will achieve the following goals: 1) amelioration of the problem of unwitting design of values by publication in technical forums, particularly in quality of service technologies; 2) prevention of the adoption of policies via unexamined technology by presentation in policy forums; and 3) integration of the methods considered, including evaluation of their efficacy in various situations, into teaching not only at Harvard but also in the curricula at several European universities.","title":"CAREER: Values and Protocol Design","awardID":"9985433","effectiveDate":"2000-07-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}}],"PIcoPI":["537066"],"PO":["495796"]},"48761":{"abstract":"This project will design efficient geometric multigrid methods using <br\/>intermediate grids to solve convection diffusion problems discretized <br\/>by high order compact schemes. The use of intermediate grids aims at <br\/>reducing discrepancy between the solutions obtained on different<br\/>grids. Symbolic computation packages will be used to derive a fourth <br\/>order finite difference scheme on the intermediate grids. Special <br\/>relaxation schemes and intergrid transfer operators will be developed.<br\/>The nonstandard multigrid method with high order discretization <br\/>schemes will be used in the numerical simulation of laminar diffusion <br\/>flames. The use of intermediate grids is expected to alleviate the <br\/>problem haunting existing multigrid methods in the flame simulation, <br\/>in which the converged coarse grid correction is not in the <br\/>convergence domain of the fine grid Newton iteration.<br\/><br\/>This project requires both symbolic and numerical computation <br\/>techniques. The successful development of a useful symbolic <br\/>computation procedure will greatly promote the awareness and use of <br\/>symbolic computation packages in numerical computation community.<br\/>The results of this research project will make important contribution <br\/>to the understanding of geometric multigrid solution of convection<br\/>diffusion problems, and of the applications of high order compact<br\/>schemes to realistic flow simulations. Efficient solution of such <br\/>problems is central to many numerical simulations in computational <br\/>fluid dynamics. The fast laminar diffusion flame code is useful in <br\/>combustion and environment protection. Certain U.S. industries related <br\/>to commercial burners, pollutant tracking, car and airplane <br\/>manufacturing, combustion, can benefit from this research.","title":"Nonstandard High Order Multigrid Techniques with Applications to Laminar Diffusion Flame Simulations","awardID":"9988165","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["495104","94260"],"PO":["321058"]},"48772":{"abstract":"PI: Partha Dasgupta<br\/><br\/>The process migration problem has received a lot of attention but has<br\/>produced only mixed results. Traditionally, migration mechanisms have<br\/>been used to balance the load among processors in a distributed<br\/>system. However, most mechanisms proposed to date for general-purpose<br\/>applications have required extensive operating system kernel<br\/>modifications. Hence, conventional wisdom has held that the costs of<br\/>process migration are not justified by resulting benefits. This<br\/>research takes a new look at process migration, recognizing both its<br\/>utility for an increasing number of emerging applications that can<br\/>tolerate higher overheads, as well as the possibility of implementing<br\/>necessary mechanisms using novel user-level techniques. Process<br\/>migration enables a host of capabilities such as mobility,<br\/>collaborative work, distributed systems management, automatic<br\/>reconfigurability, and fault-tolerance. Moreover, API interception<br\/>technologies, which permit insertion of arbitrary functionality in the<br\/>execution path of an application's interactions with the underlying<br\/>operating system, enable process migration to be implemented without<br\/>kernel modification. This research investigates a virtualization<br\/>scheme that decouples an application from dependencies in the<br\/>operating system and the physical environment. Virtualization also<br\/>monitors and controls the interactions and the resulting side effects<br\/>between processes and operating systems, making process migration<br\/>possible.","title":"General Purpose Process Migration","awardID":"9988204","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["448647"],"PO":["241298"]},"47397":{"abstract":"EIA-9983368<br\/>Law, Kincho H.<br\/>Stanford University<br\/><br\/>Digital Government: REGBASE: A Distributed Information Infrastructure for <br\/>Regulation Management and Compliance Checking<br\/><br\/>This research project proposes to develop a formal, but practical infrastructure (REGBASE) to support national efforts to make governmental regulations publicly and beneficially available. The objective is to enhance the access and retrieval of government regulations by the public, as well as to provide support for the users, framers and critics of the regulations. It has been well recognized that the complexity, diversity, and volume of regulations are detrimental to business and also hinder public understanding of government. The means to improve the situation is to understand the issues in depth, and then develop tools that can support the interaction and collaboration among different parties involved. In the proposed distributed information service framework, governmental regulatory information will be made available on-line for use by designers, inspectors and regulatory policy bodies. The infrastructure includes repositories as a base and, more importantly, tools to locate, merge, compare, and analyze the information. This application infrastructure will exploit in an intelligent way the communication and computational resources that are now widely available to the public. New network access, search and analysis tools will help disseminate regulatory data and allow finding and comparing multiple sources of related data. Partial support for this project is provided by the Information Technology and Infrastructure Systems program of NSF's Directorate for Engineering.","title":"Digital Government: REGBASE: A Distributed Information Infrastructure for Regulation Management and Compliance Checking","awardID":"9983368","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["370768","540494"],"PO":["371077"]},"46891":{"abstract":"ABSTRACT<br\/><br\/><br\/>This project, which is being supported by the Directorate for Biological Sciences, the Directorate for Computer and Information Science and Engineering and by the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences, will fund research on mangrove forests that dominate the world's tropical and subtropical coasts, paralleling the geographical distribution of coral reefs. Ecological processes here are influenced by inputs from the land, sea, and sky, which result in extreme fluctuations of flooding, salinity, temperature, light, and nutrient availability. Mangrove-associated organisms have specialized physiological and structural adaptations that sustain them in this variable environment. Human-caused enrichment is one of the major global threats to these coastal ecosystems. Experiments show that nutrients are not uniformly distributed among or even within mangrove forests. Soil fertility can switch from nitrogen to phosphorus limitation across narrow gradients. This study will explore the relationships among physical and chemical factors, nutrients, microbes, trees, and elemental cycling on off-shore mangrove islands in Belize.<br\/><br\/>We will examine the interactions between the environment and organisms to determine how changes in nutrient inputs from natural, agricultural, or urban sources might alter the delicate balance among these ecosystem components. Mathematical models will help us predict the contribution complexity makes to the ability of mangrove ecosystems to survive both natural and anthropogenic disturbances. The results of the study will help scientists understand how to better manage and conserve mangrove ecosystems and will contribute to our understanding of biocomplexity in other ecosystems.","title":"BIOCOMPLEXITY: Collaborative Research: Microbial and Nutrient Controls in Mangrove Ecosystems","awardID":"9981328","effectiveDate":"2000-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":[120041],"PO":["345195"]},"47596":{"abstract":"Switch architectures for parallel systems have traditionally been designed for performance, eliminating only the worst kinds of unfairness such as starvation scenarios. With the increasing use of parallel systems in multi-user environments, however, stricter fairness is essential for reliable benchmarking, <br\/>performance guarantees and protection from other users. This research investigates novel approaches to achieving fairness in high-performance wormhole <br\/>switch architectures popular in interconnection networks of parallel systems. This project seeks to also have an impact on research in switch and router architectures for local area and wide area networks. The increasing use of the Internet as a commercial infrastructure with rising demands for differentiated services for users with widely varying requirements provides an additional motivation for this research.<br\/><br\/>This research focuses on developing novel scheduling disciplines, buffering strategies and routing algorithms for high performance with fairness. In addition, the research addresses the requirements of global fairness and investigates novel system-level solutions. The methodology used is based both on the development of analytical proofs of new hypotheses and on simulation-driven verification. The simulation code libraries developed as part of this project will serve as instructional tools in graduate and undergraduate courses.","title":"CAREER: Novel Wormhole Switch Architectures for High Performance with Fairness","awardID":"9984161","effectiveDate":"2000-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["533237"],"PO":["325495"]},"49785":{"abstract":"ABSTRACT<br\/>Proposal: C-CR 0000988<br\/>PI: Donald Yeung, University of Maryland<br\/><br\/>Conventional memory latency tolerance techniques are limited on pointer-intensive applications because pointer-chasing memory references must perform sequentially and prevent the overlap of multiple cache misses. Pointer-chasing computations, however, traverse several independent pointer chains. Such independent traversals provide a source of memory parallelism that has remained untapped by the existing latency tolerance techniques.<br\/><br\/>This research develops novel pointer prefetching techniques to exploit \"inter-chain\" memory parallelism. Compared to existing techniques, the new techniques address more effectively the memory bottleneck for pointer-chasing computations commonly found in non-numeric applications. The research consists of three major thrusts. First, techniques are developed to schedule prefetches across multiple independent pointer-chain traversals simultaneously; thus overlapping cache misses from separate pointer-chasing loops or recursive function calls. Both compile-time and run-time scheduling techniques are investigated. Second, architectural support is developed to issue prefetch requests according to the required prefetch schedules. Initially, a prefetch engine capable of traversing pointer-based data structures is studied. The research also investigates into lightweight microthreads to perform prefetching inside a multithreaded CPU. Finally, compiler support is developed to automatically extract program information for computing the prefetch schedules and for generating the prefetch requests at runtime.","title":"Uncovering and Exploiting Memory Parellelism in Pointer-Chasing Applications","awardID":"0000988","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["157565","486066"],"PO":["180163"]},"47882":{"abstract":"Proposal Number: CCR-9985441<br\/>Title: CAREER: Architecture-Based Support for Software Application Families<br\/>Principal Investigator: Nenad Medvidovic, USC<br\/><br\/>ABSTRACT<br\/>----------------<br\/>Software architecture research has yielded numerous techniques for<br\/>developing complex applications by focusing on the composition of<br\/>coarse-grain software components. However, existing architecture-based<br\/>approaches have typically modeled systems as \"one of a kind;\" additionally,<br\/>they have failed to ensure consistent transfer of architectural properties<br\/>to a system's implementation. Realizing the full potential of software<br\/>architectures requires a more realistic approach, in which systems are<br\/>modeled and implemented as members of an application family. This project<br\/>focuses on the design, implementation, and empirical evaluation of<br\/>techniques for supporting architecture-based development of software<br\/>application families. Three general issues are studied: (1) notations for<br\/>modeling application family architectures; (2) mechanisms for refining<br\/>family architectures into their implementations; and (3) nature of software<br\/>connectors--services facilitating component interactions--and their role in<br\/>controlling non-functional properties (e.g., performance, security) across<br\/>applications in a family. This research will augment the current<br\/>model-centric focus on architectures with a system-centric perspective and<br\/>provide principled support for heterogeneity and reuse, two cornerstones of<br\/>developing application families. The research will also serve as a vehicle<br\/>for modernizing the software engineering curriculum, by exposing students to<br\/>the impact of architecture-based and application family-based development on<br\/>fundamental software engineering principles","title":"CAREER: Architecture-Based Support for Software Application Families","awardID":"9985441","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["551145"],"PO":["564388"]},"48763":{"abstract":"Proposal Number: 9988168<br\/>Shatz, Sol, M.<br\/>University of Illinois at Chicago<br\/>Design Support for State-Based Distributed Object Software<br\/><br\/>Computer system applications are rapidly becoming<br\/>more decentralized and concurrent, especially for<br\/>important environments like military command and control,<br\/>commercial telecommunications, and evolving Internet<br\/>applications. Complexity in specification, design, and analysis<br\/>dramatically increases in software architectures defined<br\/>by distributed components interacting via non-deterministic<br\/>communication patterns. One of the most significant research<br\/>problems is achieving a balance between general theoretical<br\/>concepts and specific practical techniques. This research<br\/>investigates a domain-specific design technique for<br\/>distributed-object software systems. The approach is based on<br\/>applying and adapting Petri nets, an existing graph model<br\/>oriented toward concurrent systems. The specific objectives<br\/>are to solidify the theoretical foundations for a<br\/>state-based object design notation and investigate<br\/>capabilities for inheritance modeling within the design<br\/>framework. This research can lead to methods and notations that<br\/>support engineering-oriented design of complex distributed<br\/>software systems. This has the potential to improve the overall<br\/>quality and cost-effectiveness of development and maintenance<br\/>for a wide range of critical software applications.","title":"Design Support for State-Based Distributed Object Software","awardID":"9988168","effectiveDate":"2000-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["339525"],"PO":["564388"]},"48774":{"abstract":"NSF Research Proposal Number: CCR-9988210<br\/>PI Name: Bruce, Kim B.<br\/>PI Institution: Williams College<br\/>Title: RUI: Design of Object-Oriented Programming Languages<br\/><br\/>The overall goal of this research is to improve the design of<br\/>statically typed programming languages, especially object-oriented<br\/>programming languages. The main projects for the next three years<br\/>include the following: 1. Consolidating and disseminating knowledge of OO language design,<br\/>type theory, and semantics, by completing a monograph presenting the <br\/>results of recent research in this area. 2. Investigating further issues in the design of language features<br\/>for programming in the large, especially with object-oriented<br\/>languages. 3. Investigating typed intermediate languages and other<br\/>implementation strategies for object-oriented languages.<br\/>We intend to continue using the language LOOM as a test bed for further<br\/>investigations into the best way to support features of<br\/>object-oriented languages, while also investigating how to use the<br\/>best of these ideas to enhance real languages like Java and its<br\/>successors.","title":"RUI: Design of Object-Oriented Programming Languages","awardID":"9988210","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["319445"],"PO":["564388"]},"55187":{"abstract":"Abstract:<br\/>The Fourth International Conference on Formal Methods for Open Object-Based<br\/>Distributed Systems (FMOODS 2000) will be held at Stanford University September 6-8, 2000. The organizing committee is chaired by Carolyn Talcott (Stanford University) with co-organizers Scott Smith (PC Chair, The Johns Hopkins University) Nalini Venkatasubramanian (University of California at Irvine), and Sriram Sankar (Metamata Inc.).<br\/><br\/>The conference series was initiated by Elie Najm and Jean-Bernard Stefani, who organised the first FMOODS in Paris in 1996. The second was held in Canterbury in 1997, and the third was held in Florence in 1999. FMOODS 2000<br\/>will be the first time the conference is held in the US. By bringing the conference to the US we are hoping to increase the US participation in the series, and to bring more US researchers into the FMOODS community.<br\/><br\/>The objective of FMOODS is to represent work at the convergence of three important and related fields: formal methods, distributed systems, and object-based technology. This convergence is representative of some of the latest advances in the field of distributed systems (for example, the ODP reference model and the work of the OMG) and provides links between a number of important communities (for example, FORTE\/PSTV, ICODP, ECOOP, et cetera).","title":"Workshop on Formal Methods for Open Object-Based Distributed Systems (FMOODS2000)","awardID":"0084160","effectiveDate":"2000-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["499298"],"PO":["241298"]},"52690":{"abstract":"The objective of this project is to investigate and evaluate innovative hardware-based approaches to reducing misses in multiprocessor caches due to interference. Interference between cache lines in a multiprocessor can cause lines to be involuntarily relinquished while they are still in the working set of a computation. The problem is especially serious for modified lines, which not only account for a large percentage of cache misses, but also incur a high miss penalty.<br\/><br\/>The fundamental idea in this research is to record the lines that a cache has given up involuntarily, and use them as prefetching targets. Simulation studies based on transaction processing and scientific workloads will be carried out to evaluate several algorithms for prefetch selection. These algorithms include intuitive approaches that take advantage of coherence transactions, as well as more aggressive approaches in which processes that modify a cache line notify other processes to prefetch that line.","title":"Predictive Multiprocessor Caching Techniques Based on Cache Interference and Working Set Change","awardID":"0073473","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["485309"],"PO":["180163"]},"51271":{"abstract":"","title":"Dealing with Inexactnesss in Fault-Tolerant Systems","awardID":"0049016","effectiveDate":"2000-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["562577"],"PO":["209879"]},"47883":{"abstract":"A broad research program is outlined for investigating fundamental issues arising in the design of high speed, quality-of-service (QoS) capable data networks. Several key problems are identified within an over all architectural framework, similar to that considered by the IETF Working Group on Differentiated Services (DIFFSERV) for the Next Generation Internet (NGI). The research program consists of technological and economic components, each containing several problems that confront the research community.<br\/> The essential issue of providing differentiated QoS to individual users is the fair allocation of network resources among the users. The network can accomplish this by employing packet scheduling mechanisms like Weighted Fair Queueing (WFQ) at the switching nodes. It has been shown that these schemes effectively erect bandwidth firewalls between the flows of different users, thus guaranteeing that the QoS of one flow is not at the mercy of other flows. But schemes like WFQ suffer from the curse of dimensionality: They require switches\/routers to maintain flow state information for distinguishing the packets of individual flows. This renders them too complex to be used in large high speed networks.<br\/> Alternatively, if users can be incentivised to condition their flows to prescribed parameters, then the network can be spared the burden of having to erect bandwidth firewalls. This considerably reduces the complexity of router design. Using economic thinking researchers argue that the requisite incentive can be provided by charging users for the damage caused to other traffics by their ill-conditioned flows. But the feasibility of charging schemes depends on their implementability: Although they reduce the cost of routers, they require the installation of devices for monitoring each flow and for producing a charge accordingly.<br\/> This research program taps into both these interrelated currents and takes a unified<br\/>approach. The central questions addressed are: (i) Can implementationally simple router<br\/>mechanisms be designed for providing QoS guarantees to individual flows? (ii) Can simple and effective charging mechanisms be devised for incentivising users to condition their flows? Preliminary work conducted by the proposer gives an encouraging answer to these questions, and suggests a general approach to the problem of providing QoS with minimal implementation overhead. The overall program involves devising algorithms, considering architectural issues, analyzing mathematical models, and using game theoretic and economic ideas. The robustness of solutions will be tested through extensive simulation of a wide range of network topologies and parameter values. The complexity of implementing them will be explored through simulation and possibly through prototype design.<br\/> The education plan consists of developing an advanced networking course which aims to closely integrate theory and practice, developing an undergraduate course in Networking over the next two years, initiating cross-disciplinary education and research activities, and involving undergraduate and graduate students in research.","title":"CAREER Proposal: Fundamental Algorithmic, Architectural and Economic Issues in Designing High Speed QoS-capable Data Networks","awardID":"9985446","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["348451"],"PO":["565090"]},"47894":{"abstract":"The project will measure structural and dynamical properties of aggregates of the protein tubulin. These measurements will test the current understanding of microtubule dynamic instability, improve the ability to discriminate between competing models of the conformational change of tubulin and, within those models, refine the description of the structure-function relationship. This approach is inspired by the hypothesis that GTP-hydrolysis results in the unfolding of a portion of the beta-monomer of the tubulin dimer into a random-coil. This hypothesis is part of a unique, physical approach to understanding protein design. This radical new approach could have profound impact. In the context of tubulin, the hypothesis, if supported, will inform proposed mechanisms for how various proteins and drugs interact with tubulin to affect the stability of its aggregates. More broadly, evidence of the proposed 'simple' conformational change will stimulate novel applications of polymer physics to protein design, which might elucidate the engineering of single molecule machines. One set of experiments will involve varying assembly conditions and measuring structural differences among the resulting tubulin aggregates. Parameters to be varied include tubulin concentration, proportion of non-hydrolyzable GTP analog, and concentration of non-specific solutes (e.g. glycerol) which, by altering the solvation of polypeptides, predictably change the effective size of a random coil. Structural measurements will be made using transmission electron microscopy and atomic force microscopy. Another set of experiments will involve observing single microtubules by video-enhanced DIC microscopy and characterizing their dynamic instability as a function of similar parameters. The focus will be on microtubule disassembly and the distribution of lengths lost. The innovation is to observe disassembly in microtubules that were intentionally grown to very long lengths under one set of solution conditions and then switched to the solution conditions of interest and\/or severed in situ, so as to optimize the chances of observing a transition to the growing state. These experiments are biochemically simple, but technically complex. Their interpretation will demand quantitative analysis and rigorous physical modeling. Thus, they are ideally suited for physics students at both the graduate and undergraduate level, providing a concrete and tested path for introducing them to the basics of biochemistry and cell biology. A final experiment will involve directly engineering a variant of tubulin to have a smaller random-coil domain. It offers a well-motivated introduction to the powerful techniques of molecular biology for a student with interdisciplinary undergraduate training. As a result, students involved in this educational program will be well prepared to appreciate and contribute to the unfolding \"biotech\" renaissance. Meanwhile, their experience will be vital in formalizing an interdisciplinary education along such lines, including a minor in biophysics and a graduate program in bioengineering and physics. Educational aspects of this proposal that are not directly related to the research plan, are also designed to involve students in hands-on discovery. The central aim of the educational component of this project will be to place students at the limits of their knowledge in an environment where they can learn by doing.","title":"CAREER: BioPolymer Physics-Understanding Protein Conformational Change","awardID":"9985493","effectiveDate":"2000-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1114","name":"Cellular Processes"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1132","name":"CELLULAR ORGANIZATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1164","name":"MOLECULAR BIOPHYSICS"}}],"PIcoPI":["527564"],"PO":["310749"]},"48775":{"abstract":"As computers become pervasive in the home and community, a variety of new applications will emerge which will allow widely distributed users to share and manipulate continuously evolving information. The problem of providing secure access to such information in a timely fashion is highly challenging in wide area environments where the applications will be deployed. The project will focus on an integrated approach that will explore the scalability and security of such demanding applications. The provide interactive response time to request for shared information, a variety of consistency models and protocols will be developed, and they will specially address the timeliness needs of applications. To secure the applications, a new context-aware security approach will be explored. In this approach, access can be controlled not only based on the user that makes the request but also on the security relevant context of the request. An access control model based on this approach as well as relevant security services will be developed. A general service architecture that employs the scalability mechanisms and the associated services will be built in a distributed object based middleware system. The effectiveness of these services will be evaluated using novel applications and workloads.","title":"Securing Scalable Distributed Services","awardID":"9988212","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["549757"],"PO":["241298"]},"48896":{"abstract":"Proposal: CCR-9988531<br\/>Principal Investigator: Graham, Susan L. <br\/>Institution: University of California, Berkeley<br\/><br\/><br\/>The Harmonia Framework for Interactive Software Development <br\/><br\/>Both societal infrastructure and the economy depend on increasingly <br\/>complex software systems. To create and maintain high-quality <br\/>software, developers need software tools and services that enhance<br\/> their productivity. The goal of this research is to devise the<br\/> underlying technology that provides developers with integrated<br\/> language-based interactive tools and services. The technology <br\/>can be used to create multi-lingual and language-portable <br\/>development environments or to create new tools for existing <br\/>environments. The languages at issue are the myriad of <br\/>formally-specified system architecture, specification, design, <br\/>programming, scripting and command languages used by the developer. <br\/>Better language tools make it easier to develop and use new <br\/>domain-specific languages, and to extend development environments <br\/>to dialects of existing languages. This research will address <br\/>several aspects of interactive language-based software development. <br\/>The starting point is an existing language-based framework that <br\/>provides an annotated structural representation of programs, <br\/>together with an embedded history of changes and support for <br\/>incomplete or incorrect versions during the development process. <br\/>This project will devise a method to improve the ease of formally <br\/>specifying the semantics of languages, will create new analyses <br\/>and transformation capabilities, and will create the means to <br\/>integrate externally developed analyses and program manipulation <br\/>services into the framework.","title":"Frameworks for Interactive Software Development","awardID":"9988531","effectiveDate":"2000-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["495935"],"PO":["564388"]},"49930":{"abstract":"\\0001334<br\/>Shankar<br\/><br\/>This U.S.-Argentina proposal will give support to Dr. Natarajan Shankar of SRI International for the organization of a workshop on Programming Methodology, to be held in conjunction with the 29th Argentine Meeting on Computer Science and Operational Research, to be held in Argentina. The co-organizers are Professor Armando Haeberer of Pontifical Catholic University of Brazil, Professor Gabriel Baum of the University of La Plata, Argentina and Professor Rafael Lins of the Federal University of Recife, Brazil.<br\/>Following the two-day workshop, there will be an eight-day school directed at young researchers in Argentina and Brazil. The Argentine Society for Informatics and Operations Research is sponsoring these events. The subject of the workshop and school is Program Design Using Logic. It will cover the spectrum of programming methodology including a basic background in calculational logic, requirements modeling, refinement calculi, and logics for imperative programs. Correct computer programming is critical to ensure that computer software is reliable. This impacts every aspect of daily life, including commerce, communications, power and transportation.<br\/><br\/>A strong U.S. presence at this workshop will help create strong ties and promote lasting collaborations with researchers in South America.","title":"US-Argentina-Brazil 2000 Workshop on Programming Methodology","awardID":"0001334","effectiveDate":"2000-07-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["555363"],"PO":["493911"]},"48973":{"abstract":"CCR-9988742<br\/>Jack Snoeyink<br\/>University of North Carolina at Chapel Hill<br\/><br\/>This is a grant to apply computational geometry to Geographic Information Sciences. <br\/>Specific areas include arithmetic precision in geometric algorithms, generalization<br\/>aspects of geometric partitioning, and optimization in large datasets.","title":"Geometric Structure in Geographic Information Systems and Molecular Modeling","awardID":"9988742","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["554471"],"PO":["321058"]},"58676":{"abstract":"","title":"CAREER: Tractable Formal Methods for the Synthesis of Concurrent Programs","awardID":"0096356","effectiveDate":"2000-07-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["306142"],"PO":[150697]},"48897":{"abstract":"Future wireless mobile systems promise universal coverage and require terminals to be capable of seamless roaming between networks, which may be of different types. Next generation mobile terminals will haveto exist in a world of multiple standards, and mobility management <br\/>procedures (i.e., location registration, paging and handoff) will have to be interoperable across network providers and network backbones as well as geographical regions. <br\/><br\/>Location registration, paging and handoff will be investigated, and new protocols will be introduced to solve these problems. From the standpoint of location management, the mobile terminals must register before they enter new systems in order to reserve radio resources. In addition, the signaling formats must be converted and the mobile terminals must be authenticated. A new scheme is proposed, which estimates the user mobility pattern in order to help new protocols and to estimate the signaling costs of the new mobility management procedures. Also, a new intersystem location update scheme is introduced, which reduces the signaling traffic by assigning update distance thresholds based on a per-user profile. Furthermore, the boundary location area is introduced, which enables the MTs to request location update between two different systems. Another problem for future wireless systems is the intersystem paging problem. The search operation may be carried out not only in the system where the mobile terminal last registered, but also in the system the mobile terminal has passed since the last call. A new scheme is proposed that combines and reorders the paging areas in decreasing order of location probabilities, until the delay bound has reached a certain threshold value as a QoS parameter. For handoff management, the radio access system must support intersystem handoffs for mobile terminals with multiple connections that are sending and receiving multimedia traffic with different Quality of Service (QoS) expectations. Radio signal strengths must be measured and compared across different air interfaces and power levels, and signaling procedures must cooperate between the switches of each system. A new intersystem handoff scheme is proposed that uses boundary cells to perform system transformations when mobile terminals begin to handoff into new systems. Finally, a new signaling protocol will be developed to handoff the mobile terminal into the boundary cell, perform the format transformation, and then handoff the mobile terminal into the new system.","title":"Mobility Management in Next Generation Wireless Systems","awardID":"9988532","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["562752"],"PO":["250082"]},"48787":{"abstract":"Future signal processing systems will use a heterogeneous System-on-a-Chip architecture for performance, flexibility, cost and power efficiency. Components will include programmable DSP and RISC cores, memories, dedicated hardware blocks and embedded field programmable logic cores for flexible and late-bound functionality. Adaptation of the system will be required to track time-varying aspects of the environment. Dynamic reconfigurability can be used to adapt algorithms and architectures to time-varying computations in signal processing applications, thus dramatically reducing average power consumption. The objective of this project is to develop theory, methodology, tools, and demonstration of several adaptive signal processing systems using parameterized macros which can be dynamically configured to adapt to the computation and save power. Improvements to embedded field programmable architectures and circuits will be developed to make them better suited for low-power signal processing applications. This includes hardware and software mechanisms at the chip and system level to support the dynamic reconfiguration of parameterized macros to save power. CAD techniques will leverage recent work in incremental place-and-route, macro-based floorplanning, and statically scheduled communication. New design methods and tools will be evaluated in four realistic and complex DSP systems which all have time-varying computations and tight power budgets: 1) an MPEG2 encoder, 2) an FFT-based wireless receiver, 3) a radar for unmanned aircraft, and 4) a wireless LAN prototype. Collaboration with ENST\/Paris is anticipated.","title":"Adaptive Systems-on-a-Chip for Low-Power Signal Processing","awardID":"9988238","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["549952","438750"],"PO":["562984"]},"47346":{"abstract":"EIA-9983215<br\/>Croft, W. Bruce<br\/>University of Massachusetts Ahmerst<br\/><br\/>Digital Government: A Language Modeling Approach to Metadata for Cross-Databse Linkage and Search<br\/><br\/><br\/>A crucial problem in government on-line services is that related information is often maintained in different systems across different agencies, thus making it difficult to integrate that information. Most attempts at \"one-stop shopping\" sites in the government fail for that reason; they must be maintained manually which does not work over time. On the other hand, data warehousing, where the data is cleaned, made conformant and housed in a central location, will not work due to the distributed nature of government-held information.<br\/><br\/>One promising avenue to approach this problem would be through the use of automated systems which generate metadata (data about data) for various datasets, allowing them to be integrated more easily, while the original data remains in place at its home site. The work of this proposal will address this problem in a new way - language modeling. The government collaborators are the US Geological Survey, the US Department of Commerce, the General Services Administration and the US Library of Congress.","title":"Digital Government: A Language Modeling Approach to Metadata for Cross-Database Linkage and Search","awardID":"9983215","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V068","name":"CIA-KDD & TARGET CHARACHTERIZA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V083","name":"CIA-KNOWLEDGE DISCOVERY TO NSF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V203","name":"CIA-KDD WORKING GROUP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W295","name":"CIA-KNOWLEDGE DISC & DISSEMIN"}}],"PIcoPI":["524130","562750","507668"],"PO":["371077"]},"42484":{"abstract":"9910084<br\/>Monteiro<br\/><br\/>This award supports a three-year collaborative research project between Professor Renato Monteiro of the Georgia Institute of Technology and Professor Takashi Tsuchiya at the Institute of Statistical Mathematics in Tokyo, Japan. The researchers will be undertaking a study of algorithms for linear programs over symmetric cones. Since large-scale semidefinite programming (SDP) problems arise in many applications in continuous optimization, matrix analysis, engineering, statistics and discrete\/combinatorial optimization, it is of paramount importance to develop fast and reliable algorithms to solve them. The goal of the proposed research is to provide new insight into the behavior of primal-dual interior-point algorithms and to develop novel computational tools that will enable practitioners to solve large-scale SDP problems. The researchers will investigate nonlinear-programming-type algorithms for solving large-scale specially structured SDP problems. They will also be researching new methodologies to enhance the computational performance of interior-point methods towards solving large-scale SDP problems. Finally they plan to develop and implement efficient interior-point methods for solving nonlinear SDP problems. <br\/><br\/>The project brings together the efforts of two laboratories that have complementary expertise and research capabilities. This research project has excellent potential to have a strong impact on the growing literature about (SDP) problems and on the development of efficient methods to solve them. It will also lead to new or improved algorithms to find exact or approximate solutions to large-scale optimization problems arising in diverse applications in industry, finance science, and engineering. The project advances international human resources through the participation of a graduate student. Through the exchange of ideas and technology, this project will broaden our base of basic knowledge and promote international understanding and cooperation. Results of the research will be published in international scientific journals and also presented at scientific meetings in the U.S. and abroad.","title":"U.S.-Japan Cooperative Science: Algorithms for Linear Programs Over Symmetric Cones","awardID":"9910084","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["540935"],"PO":["449696"]},"48820":{"abstract":"This project studies the floorplanning problem from the standpoint of improving design productivity. The design productivity crisis faced by the semiconductor industry has been well documented in the National Technology Roadmap for Semiconductors, 1997 Edition. Floorplanning has a significant impact on productivity because of its interaction with architectural synthesis during the earlier stages of the design process and with logic and layout synthesis in the later stages of the design process. The research problems that are being addressed by this project include the white space distribution problem, incremental floorplanning, and intelligent post-floorplan analysis. This research is being carried out in consultation with Dr. Naveed Sherwani, Strategic CAD Labs, Intel Corporation.","title":"Productivity-driven Floorplanning","awardID":"9988338","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["420994"],"PO":["562984"]},"47742":{"abstract":"Computer communication networks are evolving from convenient communication mechanisms<br\/>offering \"best-effort\" service into key elements of our national infrastructure that we depend on for both business and personal use. As such, the need for improved fault management techniques is increasing and the open problem of network fault management continues to grow in complexity.<br\/> A major cause of the increase in complexity of this problem is the heterogeneity of networks.<br\/>Today's networks are comprised of a variety of technologies (e.g. Wireless, ATM, Ethernet), that<br\/>are required to support a diverse set of networked applications (WWW, electronic commerce, video conferencing).<br\/> The fault management problem has been studied in varying degrees for different technologies, but<br\/>there are many open issues and the research is unaware of any methods that can effectively be<br\/>applied across technologies. Current methods are largely ad hoc and rely on the expertise of a<br\/>human network manager. Even within single-technology networks (e.g. Ethernet LANs); strategies developed for one network cannot easily be generalized to other networks. In addition, the rate of change within a network makes it difficult for the network manager to maintain a high enough level of expertise to develop and maintain effective fault management strategies. New techniques that can be generalized and applied across technologies are needed to ensure network reliability in an efficient manner.<br\/> The long-term goal of this research is to move toward self-managing networks by automating as<br\/>much of network management as possible. Within network management, the project will first focus on<br\/>fault management. Fault management encompasses a large, complex set of problems that have not been well studied or defined. Before methods for automation can be studied, the fault management problem must be better understood. The research proposes a set of studies aimed at discovering aspects of the problem that are common across many different types of networks.<br\/> The proposed studies are primarily experimental. The research plans to use network fault insertion to study the impact of various faults on a network. Faults will be inserted into simulated networks, a<br\/>network testbed, and a campus network. The experiments will provide insight into fault propagation and allow the researcher to study how various aspects of the fault management problem change from fault to fault, with network dynamics, and with different network types. Data collected from two operational networks (CS Department network and Motorola wireless networks) will be analyzed and used to validate simulation accuracy. A set of benchmarks for testing and comparing fault management results will be created and made publicly available.<br\/> In the short-term, results can be used to develop fault management methods that (1) can be applied across different technologies, (2) can generalize from network to network, and (3) can adapt to changes in the network. Common traits discovered through experimentation can be used to formulate a theoretical foundation. This foundation coupled with the availability of benchmarks allows researchers to systematically decompose and demonstrate progress on widely applicable fault management problems. In the long-term, the results can help us understand how to design components for manageability.","title":"CAREER: An Infrastructure for Multi-Technology Network Fault Management","awardID":"9984811","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["560175"],"PO":["565090"]},"47775":{"abstract":"Internet traffic patterns and applications have been evolving rapidly in recent years and network congestion is becoming a problem of extreme importance. While the Internet's transport protocol, TCP, incorporates congestion control machinery and has largely been responsible for the stability of the Internet to date, two problematic trends threaten this situation:<br\/> Concurrent flows: Several applications are characterized by multiple concurrent flows between sender and receiver. Today, these flows compete with each other for network resources, prove overly aggressive on the network, and do not share information about the network with each other.<br\/> Lack of adaptation: An increasing number of applications use UDP-based flows without sound congestion control because they do not need the reliable, in-order service provided by TCP. Today, they do not learn about or adapt well to hanging network conditions. Unfortunately, current protocol architectures do not<br\/>provide adequate support for this.<br\/> Motivated by these trends, this NSF CAREER proposal takes a fresh look at Internet congestion management from an end-system perspective and proposes a new architecture built around a Congestion Manager (CM). The CM maintains network statistics across flows, orchestrates data transmissions governed by robust control principles, and obtains feedback from the receiver, using a congestion Controller, Flow Scheduler, and Feedback Prober. It also exports a simple yet powerful API for applications to learn about network state and adapt their data transmissions to obtain the best possible performance.<br\/> The research thrusts of this proposal include: (i) network architecture, involving the design and deployment of the CM infrastructure and API, (ii) analysis using mathematical and simulation techniques of the impact of congestion feedback on control quality, of the spatial stability of Internet performance, and of the temporal stability and potential for caching of network performance parameters, (iii) algorithms, for deciding which flows share congestion state, for new congestion control techniques, and for aging congestion control parameters in the absence of receiver feedback, (iv) protocols to communicate probes and feedback between senders and receivers and allow user preferences to be reflected in data transmissions, (v) implementation of the CM and several applications including Web and real-time conferencing ones, and (vi) deployment of the CM and its applications in the wide-area Internet to conduct performance experiments.<br\/> If successful, this research has the potential to fundamentally change the network architecture of end-hosts and greatly improve the design and implementation of Internet applications, forming the basis for congestion management in the future Internet. As this work matures, IRTF- (Internet Research Task Force) and IETF-sanctioned (Internet Engineering Task Force) standardization of some of the CM protocols and API are expected, as are discussions with vendors of popular server operating systems to explore technology transfer issues. The major expected results of this research are a detailed design, analysis, and evaluation of the CM architecture the internal algorithms, analysis of congestion, the adaptation API, the CM protocol, a reference implementation in the Linux operating system, and several applications. The resulting software will be made freely available under the standard M.I.T. copyright.<br\/> The education plan in this proposal consists of three components: (i) curriculum development, to introduce two new courses in networking at the undergraduate and graduate levels, focusing on fundamental principles as well as practical issues, (ii) undergraduate research, tapping into M.I.T.'s UROP program and involving undergraduate students in various aspects of the proposed research, and (iii) a teaching philosophy emphasizing the scientific method and experimental computer science in undergraduate education, by designing several hands-on experimental tasks and using simulation and visualization extensively in lectures the same tools that are the vehicles for the research proposed herein.","title":"CAREER:The Internet Congestion Manager","awardID":"9984921","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["508283"],"PO":["565090"]},"48678":{"abstract":"This work considers a hybrid motion planning\/control problem termed controlled and constrained coverage -- i.e. the precise regulation of a mechanism's work space effects through planning, sensor observations, and long-term process monitoring to achieve the controlled execution of area-covering tasks. Typical work space effects include the sensitivity pattern of a detector used for search tasks, the reach of a lawn mower's cutting tool, but paint application in the automotive industry motivates this effort. The two basic intellectual foci of this work are understanding how coverage tasks can be accomplished while ensuring the precise control of process variables and the development of coverage path planning tools which will make it possible to adjust process variables necessitating complete replanning. These results will enable paint application<br\/>specialists (or anyone involved in surface coating\/inspection tasks) to efficiently program trajectories that satisfy performance constraints while reducing cycle time, and improving efficiency. The Principle Investigators will be working closely with researchers within Ford, including members of Ford's Scientific Research Labs, their Advanced Manufacturing Technology division, and Global Paint Engineering, to ensure practical utility and applicability of the research.","title":"GOALI: Controlled Coverage With Applications to Automated Robot Painting","awardID":"9987972","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[124605,"553216","249126"],"PO":["234178"]},"52231":{"abstract":"Nonlinear Partial Differential Equations (PDEs) are the basic mathematical description for a wide variety of important application areas. In particular, this project will consider PDEs that arise in fluid dynamics, biology, and radiation diffusion. Because of their complexity, these equations can only be solved numerically by computers, and because of their particular properties (shock waves, sharp fronts, and local singularities) they are difficult to solve even then. This project will design, analyze, and implement software for a class of iterative methods to numerically solve nonlinear PDEs. The software will be provided in two forms - Matlab codes and a package interoperating with the PETSc library - for other researchers to apply the methods.<br\/><br\/>Technically, the project will study a class of nonlinear elimination algorithms for solving algebraic nonlinear equations with unbalanced nonlinearities. The elimination methods avoid traditional methods' slow convergence when local singularities appear by identifying \"misscaled\" nonlinear components and replacing them with a function of the remaining more uniformly scaled components. The family of algorithms thus devised will obtain parallelism from domain decomposition, scalability (with respect to problem size) from multilevel methods, and robustness (against local singularities) from incomplete elimination. The methods will be tested on three important classes of applications: transonic compressible flows (CFD), electric wave problems in the heart (computational biology), and Marshak wave problems (radiation transport). The proposed algorithm and software development will have a great impact on the three applications, and will also have substantial influence on other areas of computational science where large nonlinear equations need to be solved.","title":"Parallel Nonlinear Elimination Methods and Software for Partial Differential Equations","awardID":"0072089","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["517075"],"PO":["551992"]},"51274":{"abstract":"","title":"Connections between Space-Bounded Molecular Computation and Classical Complexity Theory","awardID":"0049019","effectiveDate":"2000-07-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["499399"],"PO":["499399"]},"43321":{"abstract":"This project studies techniques for designing video signal processors (VSPs), which are single-chip processors for video and other multimedia data. The project considers both hardware and software optimization techniques for video signal processor architectures and the programs that run on them. As a first step, the project analyzes the characteristics of modern multimedia applications, including analysis as well as traditional compression applications. One goal is to develop techniques for optimizing the design of a VSP based on application characteristics. The project also considers techniques for optimizing software running on VLIW and other styles of VSPs. The design of memory system performance is an especially important consideration for both hardware and software optimization.","title":"CAD Techniques for Embedded Video Signal Processing","awardID":"9912413","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["431683"],"PO":["562984"]},"46500":{"abstract":"This project will focus on developing innovative methods for analysis, representation and interpretation of human actions from data repositories containing information which describes human motion. Analysis of human motion is important in many areas including kinesiology, ergonomics, anthropology, medical rehabilitation, creative arts such as dance, and athletic studies.<br\/><br\/>Using motion representations derived from related work in robotics and virtual reality modeling, the project will build user-friendly interfaces and tools which can accept various query forms, such as spatio-temporal specifications and other symbolic descriptors. A second goal for the project is to develop robust and flexible indexing methods which can be used in recognition, reconstruction and retrieval of human actions from video and other motion databases.","title":"DLI-2: Digital Library for Human Movement","awardID":"9979774","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["402665"],"PO":["564456"]},"42023":{"abstract":"This project addresses a well-recognized research challenge in scientific visualization - how to visualize tensor fields. Tensor fields are prevalent in a variety of scientific and engineering disciplines such as fluid dynamics, mechanics, material science, and earth sciences, where they quantify the opposing forces on various materials. Tensor fields are particularly hard to visualize because of (a) the large number of variables (e.g. 9 for 3D second order tensors) and their interplay, and (b) the large data sets involved, particularly for time varying tensor fields. Currently, there are a very limited number of visualization methods for understanding tensors. This project will provide a suite of novel and intuitive visualization methods, based on deformation and intelligent agents, to help scientists and engineers interactively explore and understand the nature and structure of tensor fields. Conceptually, tensors exert force on the space around them. This project's approach is to allow the tensor field to manifest itself by deforming idealized elements representing that space. The goal is to do these deformations interactively so users can examine different regions and properties of the data that may be of interest. The project will explore different implementations of the deformations, as well as the use of different methods of tensor decomposition to create more intuitively meaningful deformations. The project will also investigate intelligent agents that will seek out features of interest in the tensor field, so that they may be better displayed. Ideas and methods from this project will be enabling technologies towards understanding fundamental problems throughout science and engineering, and will be tested against real data sets.","title":"Interactive Tensor Field Visualization","awardID":"9908881","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0803","name":"Division of BEHAVIORAL & NEURAL SCIENCES","abbr":"BNS"},"pgm":{"id":"1392","name":"Biological Anthropology"}}],"PIcoPI":["424191"],"PO":["565272"]},"48810":{"abstract":"9988227\/9988315<br\/>Slaughter, Sandra<br\/>Kemerer, Chris F.<br\/>Carnegie Mellon University<br\/>University of Pittsburgh<br\/>Discovering the Profiles and Patterns of Software Evolution<br\/><br\/>Software evolution refers to the dynamic behavior of <br\/>software systems as they are maintained and enhanced <br\/>over their lifetimes. Software evolution is of increasing<br\/> importance as systems in organizations become longer-lived. <br\/>However, empirical studies of software evolution face particular<br\/> challenges due to the longitudinal nature of the evolution <br\/>phenomenon. As a result, there is relatively little scientific<br\/> knowledge about how software systems actually evolve. <br\/>This research has the objectives of developing and evaluating <br\/>models of the process of software evolution. Specifically, <br\/>this research seeks to: (1) Identify typical patterns in the <br\/>changes to software systems over time, (2) Determine the extent <br\/>to which the patterns coalesce into distinct evolutionary phases,<br\/> (3) Understand why systems follow similar or different <br\/>evolutionary paths, and (4) Develop and evaluate models that <br\/>predict the evolutionary patterns of software systems. <br\/>The empirical evaluation involves collecting, coding, and <br\/>analyzing more than 25,000 change events that occurred over <br\/>20 years in 23 commercial software systems. Given the relative <br\/>paucity of research on software evolution, this study should yield <br\/>unique insights that contribute to theory building. In addition, <br\/>longitudinal empirical data and databases on software change <br\/>histories will be created that are novel, detailed, and of high <br\/>quality.","title":"Discovering the Profiles and Patterns of Software Evolution","awardID":"9988315","effectiveDate":"2000-07-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[124941],"PO":["564388"]},"53045":{"abstract":"EIA-0074663<br\/>Papandreou-Suppappola, Antonia<br\/>Arizona State University<br\/><br\/>POWRE: Time-Frequency Analysis of Signals with Non-Linear Structures<br\/><br\/><br\/>This proposal focuses on investigation of the feasibility of obtaining new quadratic time-frequency representations that are matched with non-linear group delay, while exhibiting a maximum concentration and reducing the effect of cross terms. In addition, this work will address a new line of research in analyzing the difficult case of multicomponent signals with different types of linear and\/or non-linear structures present simultaneously. The proposed methodology will involve a matching pursuit dictionary with basis functions of different types of group delay.","title":"POWRE: Time-Frequency Analysis of Signals With Non-Linear Structures","awardID":"0074663","effectiveDate":"2000-07-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["478524"],"PO":["289456"]},"46896":{"abstract":"ABSTRACT <br\/><br\/>This project, which is being supported by the Directorate for Biological Sciences, the Directorate for Computer and Information Science and Engineering, and the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences, will fund research on mangrove forests that dominate the world's tropical and subtropical coasts, paralleling the geographical distribution of coral reefs. Ecological processes here are influenced by inputs from the land, sea, and sky, which result in extreme fluctuations of flooding, salinity, temperature, light, and nutrient availability. Mangrove-associated organisms have specialized physiological and structural adaptations that sustain them in this variable environment. Human-caused enrichment is one of the major global threats to these coastal ecosystems. Experiments show that nutrients are not uniformly distributed among or even within mangrove forests. Soil fertility can switch from nitrogen to phosphorus limitation across narrow gradients. This study will explore the relationships among physical and chemical factors, nutrients, microbes, trees, and elemental cycling on off-shore mangrove islands in Belize.<br\/>We will examine the interactions between the environment and organisms to determine how changes in nutrient inputs from natural, agricultural, or urban sources might alter the delicate balance among these ecosystem components. Mathematical models will help us predict the contribution complexity makes to the ability of mangrove ecosystems to survive both natural and anthropogenic disturbances. The results of the study will help scientists understand how to better manage and conserve mangrove ecosystems and will contribute to our understanding of biocomplexity in other ecosystems.","title":"BIOCOMPLEXITY: Collaborative Research: Microbial and Nutrient Controls in Mangrove Ecosystems","awardID":"9981357","effectiveDate":"2000-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":[120052],"PO":["345195"]},"47754":{"abstract":"This is the first year of funding of a 4-year continuing award. The objective of this research is to lay the<br\/>groundwork for machines that are capable of accurate recognition and realistic synthesis of facial expressions. The approach is to develop and validate a dynamic spatio-temporal representation of facial movements, To this end, the PI will develop and evaluate methodologies for. robust analysis and modeling of facialmovements from video (so as to allow for unencumbered measurement in noninvasive interfaces). Facial activity is inherently dynamic in nature; therefore, automatic recognition of expressions from video and realistic animation of facial motion require a detailed dynamic representation of facial action. The PI will develop an analysissynthesis framework wherein model-based synthesis is used to analyze facial movement, to construct a spatio-temporal 3D representation of facial action that encodes the dynamics inherent in facialmotion. He will then evaluate the representation by analyzing videos of many human subjects making facial expressions, and by testing the synthesis of realistic facial motions. This research will provide a detailed scientific understanding of how people make facial expression and how recognition of facial expressions is possible, and thus will lay the foundation for systems that recognize human expressions and emotions, read lips, generate realistic facial animations, and code facial movements, which will form a vital component in the next generation of human-machine interfaces.","title":"CAREER: Developing and Evaluating a Spatio-temporal Representation for Analysis, Modeling, Recognition and Synthesis of Facial Expressions","awardID":"9984847","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["508256"],"PO":["565227"]},"48865":{"abstract":"The project investigates the design and implementation issues in the mointoring of information changes in large distributed networks such as the Internet and World Wide Web. One of the objectives is to develop efficient and scalable strategies, techniques, and systems support for distributed control of large numbers of information change monitoring requests. Research questions to be addressed include the following. What software techniques and tools are able to extract, integrate, and query streams of data over semi-structured or unstructured data? Which distributed trigger and data processing techniques are most scalable and yet efficient in the presence of millions of information change monitoring requests? How do change monitors adapt to wide system parameter variations in runtime environments such as the Internet? How do they scale up as the number of information sources reach millions? Critical system components include change detection algorithms (e.g., tree comparison for web pages), trigger and query grouping, indexing, and caching, as well as parallel processing. Appropriate components will be implemented and evaluated through simulation and measurements on the Internet. These experiments will emphasize the efficiency and scalability of Internet-scale information change monitoring systems. The research results will aid in the engineering, implementation and evaluation of systems and middleware software support for scalable and efficient processing of distributed triggers and queries, as well as effective detection and notification of information changes.","title":"System Support for Distributed Information Change Monitoring","awardID":"9988452","effectiveDate":"2000-07-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["532971","521101"],"PO":["309350"]},"49504":{"abstract":"Information and communication technologies (ICT) are used pervasively in the real estate industry. This study examines how people and organizations in this industry work and how this work adapts and is affected by the use of ICT. Since real estate agents act as transactional intermediaries, this industry is affected by a shift to electronic transactions and the potential disintermediation this implies. Since many industries are shifting towards more information\/knowledge-based structures, understanding how ICT use is changing this industry will provide empirical evidence about potential changes that might be expected in other industries. The study has three objectives: 1. Describe how the use of ICT changes the ways individual knowledge workers conduct their work; 2. Describe organizational and industrial changes related to the use of ICT; 3. Describe how changes in individual work relate to changes in organizational and industrial structures and processes. At the individual level, the researchers focus on changes in work design and social capital. At the organization and industry levels, ideas from transaction cost and coordination theory are applied.","title":"Towards Friction-Free Work: A Multi-Method Study of the Use of Information Technology in the Real Estate Industry","awardID":"0000178","effectiveDate":"2000-07-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["483279","565342"],"PO":["565227"]},"47348":{"abstract":"New technological advances and recent developments in research are leading the way towards an enhanced next-generation Internet. This new medium will surpass the current best effort only\" capability and evolve into a multiservice network able to accommodate differentiated classes of service to support various types of applications and business requirements. Now that the technology has dramatically evolved and computer networks have become ubiquitous, the proposed work aims at addressing some of the important remaining<br\/>challenges: (i) to use the network resources efficiently, and (ii) to facilitate the creation of a healthy market environment, where new network services can be introduced and sustained. To this end, it is proposed (1) to devise mechanisms and tools that will enable network service providers to optimize their operations and make them economically viable, and (2) to provide, through pricing, sufficient incentives to users of network services that will help smooth spikes in demand and lead to a more efficient utilization of the available resources.<br\/> The Internet, and computer networking in general, are evolving into a real industry. The developments in other more mature industries (e.g., airlines, car rentals) are indicative of its future. Such industries implement sophisticated revenue management practices including pricing and efficient resource allocation. In networking, these actions can also be instrumental in alleviating congestion which is not only caused by the lack of bandwidth but, increasingly, due to overloading of Web servers.<br\/> The proposed research contains specific plans on (1) models for pricing multiple network services that incorporate users' reaction to prices (demand functions), service characteristics, network effects, and the inherent uncertainty in the problem; (2) estimating from measurements the amount of network resources consumed by various services, which can be instrumental in pricing and other resource allocation mechanisms; (3) optimizing the operation Web of servers, i.e., implementing sophisticated scheduling and routing of tasks in clusters of servers; and on (4) making strategic service provisioning decisions, which<br\/>are affected by competition and consumer choice and include capacity planning, buying or selling in bandwidth markets, and deciding the optimal menu of offered services.<br\/> The proposed work will draw upon methodologies and techniques that the PI has considerable expertise and, in some instances, has helped in developing. These include: (i) large deviations, (ii) dynamic (and approximate-dynamic) programming, and (iii) potential function methods.<br\/> On the educational front, the proposed plan aims at promoting a synergy between optimization and stochastic techniques, and at preparing graduate students well versed in both areas who can contribute to this research agenda. It consists of specific (graduate and undergraduate) curriculum development ideas, the organization of an invited seminar series, and the creation of an instructional software laboratory that will enhance undergraduate recruitment and teaching. Graduate students in the PI's group typically have strong background in stochastic processes, control, and optimization. Two proposed graduate courses in computer networking aim at helping them focusing their research in this area by providing a sufficiently deep survey of advances and outstanding issues.","title":"CAREER: Pricing and Resource Allocation in Multiservice Broadband Communication Networks","awardID":"9983221","effectiveDate":"2000-07-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["526820"],"PO":["565090"]},"48217":{"abstract":"This research project is undertaken to guide the construction of new markets on the Internet. It will help answer the following questions: Should the order flow be accessible only to specialists or to everyone? Should last-second orders be penalized? Should only one side of the market (say sellers) post price, or both sides? Should automated buyers and sellers be encouraged or discouraged? In general, how effective is a new market in quickly leading intelligent (but self-interested) traders to efficient transactions and encouraging their participation? Three projects will be carried out to answer these questions. The first project examines how automated access strategies affect Internet congestion. The second project compares the effectiveness of alternative market institutions in Internet-like environments. The third project compares alternative pricing schemes for Internet access. Four complementary methodologies will be employed: 1) theoretical models of market equilibrium and transient performance; 2) computer simulations of traders and their market interactions; 3) laboratory markets with human traders interacting with automated traders; and 4) statistical analysis of recent Internet activity.","title":"Market Dynamics in Cyberspace","awardID":"9986651","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1320","name":"ECONOMICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1321","name":"DECISION RISK & MANAGEMENT SCI"}}],"PIcoPI":[123234,"537808"],"PO":["564456"]},"52760":{"abstract":"The researchers have observed an explosive growth in transporting continuous media applications to multiple recipients on the Internet. Examples include continuous media servers, digital libraries, remote medical diagnosis, and distance learning. As most Internet continuous media based multicast applications do not support end-to-end congestion control, wide deployment of these applications have severe negative impact, ranging from starvation of self-controlled TCP flows to the potential for congestion collapse. The main intent of this proposal is thus to design, implement, analytically validate, and empirically evaluate a class of congestion control schemes for multicasts with the following design objectives: scalability, capability to adjust source sending rates to achieve TCP-friendliness and (weighted) fairness in an analytically provable manner, capability to handle independent losses of the same packet, capability to deal with dynamic traffic\/membership changes, and minimal router support.<br\/> Specifically, the researchers will lay out an analytical framework for rate-based multicast congestion control. In particular, T1. The researchers propose a novel approach for ACK aggregation so as to provide the sender with a simple but comprehensive view of congestion conditions in the multicast tree.<br\/> T2. The researchers characterize the congestion status with three phases: congestion free, congestion alert, and congestion avoidance, and will devise a simple, yet effective mechanism for a sender to diagnose, based on the parameters in the aggregated acknowledgment received and parameters locally kept, which congestion phase its connection is in and whether or not independent losses of the same packet has occurred.<br\/> T3. The researchers will devise, based on robust feedback control theory, a class of rate adjustment schemes that are (i) TCP-friendly, (ii) robustly stable, and (iii) achieve (weighted) fairness among competing multicast sessions, feature (ii) is especially important for systems with feedback loops, but has not been extensively addressed in most of the multicast congestion control work perhaps except [10]. The proposed control theoretic work will hence center around robust stability and disturbance attenuation problems that appear in rate-based flow control for multicasts.<br\/> T4. To promote the wide deployment of proposed schemes, the researchers will investigate whether or not, and how, the operations (perhaps except acknowledgment aggregation) can be realized at end hosts. If some of the operations cannot be accomplished without router support, the researchers will look into possible light-weight implementation methods.<br\/> T5. To empirically evaluate the performance of proposed multicast congestion control schemes, the researchers will conduct extensive simulation in ns-2 [81] to test their TCP-friendliness, fairness, and scalability properties and compare them against existing work. With the help of OARnet (the Ohio GigaPOP manager of Internet2) personnel,the researchers will also implement the proposed schemes in FreeBSD, and use a database server centered on large amounts of patient images acquired from MR and CT as a representative multicast application to empirically measure the key functional, scalable, and adaptive characteristics of the prototype software over the Internet2.","title":"Design, Theoretical Validation, and Empirical Evaluation of a Class of Multicast Congestion Control Schemes: Marriage of Feedback Control Theory and Multicast Congestion Control","awardID":"0073725","effectiveDate":"2000-07-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[134510,"342042"],"PO":["565090"]},"51594":{"abstract":"The purpose of this research is to extend knowledge about automated capture environments to better support long-term use. In earlier work, the goal was to make capture a ubiquitous service at any point in time and over a short period of time. However, as more live events are captured and views of the captured experiences are automatically prepared, having too much information available becomes a problem. The objective of this project is to find information access solutions that scale over time, increasing the benefit of captured memories for the human as time passes and more information is captured, rather than increasing the burden of foraging through a morass of memories to find ones of importance. Two approaches to this problem will be used. The first approach is to create an application-specific information model for a captured experience. This leads to captured experiences being contained in a searchable repository of experiences. The second approach is to view capture as only one part of the knowledge acquisition process in any given application. Specifically, a general infrastructure for building capture and access applications, and storing, retrieving and visualizing large repositories of captured experiences that evolve over time will be built. Capture and access in the educational domain as well as in distributed collaborative meetings will be explored. The major contribution is general support for the construction of capture and access applications as well as deeper evaluation of long-term use of capture and access in educational and meeting environments.","title":"NSF-CNPq Collaborative Research: Development and Understanding of Automated Capture Environments to Support Long-Term Use.","awardID":"0070345","effectiveDate":"2000-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["563803"],"PO":["565227"]},"51000":{"abstract":"EIA -0004043<br\/>Damon, Peter<br\/>Allied Technology Group<br\/><br\/>Title: NSF Contract No. DAS-9816737- Task Order No.25<br\/><br\/><br\/>This award is to provide proposal processing and data entry support for the Information Technology Workforce Panel Meeting.","title":"NSF Contract No. DAS-9816737 - Task Order No.25","awardID":"0004043","effectiveDate":"2000-07-15","expirationDate":"2000-10-15","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["130583"],"PO":["146304"]},"52573":{"abstract":"Proposal: 0073085<br\/>Title: Efficient Multicast Communication in Switch-Based Networks for Quality of Service<br\/>PI: Yuanyuan Yang<br\/><br\/>Multicast involves transmitting information from a source to multiple destinations, and is a requirement in high-performance networks. It is projected that multicast will be increasingly used to support various interactive applications such as video-on-demand, teleconferencing, web servers and E-commerce on the Internet. Many of these applications require not only multicast capability but also predictable performance, such as guaranteed multicast latency and bandwidth, called quality-of-service (QoS). The objective of this research is to design a QoS capable multicast architecture based on multicast networks with built-in QoS functions to support multicast communication. Specially, the research focuses on:<br\/>(1) design of basic building-block multicast networks with better QoS functions and lower network cost;<br\/>(2) establishing analytical models on performance metrics of statistical QoS-capable multicast architectures;<br\/>(3) study of efficient schemes to schedule multicast for different QoS requirements;<br\/>(4) building simulation tools for validating theoretical results, and making them available to research community and system designers.<br\/><br\/>This research combines algorithmic, probabilistic, combinatorial, and simulation techniques to conduct comprehensive studies. The proposed research has a significant impact on scalable and high-performance parallel\/distributed computing as efficient support for multicast communication can significantly reduce the communication latency and simplify the design and implementation of numerous parallel\/distributed applications.","title":"Efficient Multicast Communication in Switch-Based Networks for Quality-of-Service","awardID":"0073085","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550688"],"PO":["180163"]},"48833":{"abstract":"The explosive growth of both large and small scale distributed systems is leading to a host of new applications, most of which employ some notion of distributed shared state: information required<br\/>at more than one location. Building on the experience of the PIs, this research will develop convenient, efficient middleware for applications running on heterogeneous platforms. The goal is to dramatically reduce the programmer effort required to develop distributed applications, and in particular to make it as easy to run applications on a local-area cluster as it is to to run them on<br\/>a shared-memory multiprocessor. The proposed research will therefore employ a shared-memory programming model. The PIs will extend their previous work in software distributed shared memory (S-DSM) to accommodate heterogeneous languages and machine types,<br\/>and to transparently provide shared state for independently-deployed processes. They will introduce application-specific notions of when a cached copy of data is ``recent enough'' to use, thereby facilitating optimized communication in more globally distributed environments.<br\/><br\/>The applications driving the research include both scientific simulations and codes developed by local colleagues in the areas of datamining and intelligent multi-sense environments.<br\/>The research will facilitate the effective distribution of these applications across the resources they require.","title":"Transparent Middleware Support for Shared State on Heterogeneous Clusters","awardID":"9988361","effectiveDate":"2000-07-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["564815","556692"],"PO":["241298"]},"55367":{"abstract":"0084788<br\/>Gurer, Denise<br\/>Association of Computing Machinery<br\/><br\/>Special Project: Scholarship and Travel Grants for the Grace Hopper Celebration of Women in Computing 2000, ACM, Denise Gurer, PI<br\/><br\/>On September 14-16, 2000, the third Grace Hopper Celebration of Women in Computing (GHC) is being held at the Sheraton Hyannis Hotel in Hyannis, Massachusetts. The meeting is a technical conference presenting talks by successful women in the computing field, short technical presentations by a range of conference participants, as well as panels, workshops, and birds-of-a-feather sessions. This grant provides travel costs and registration expenses for approximately eighty people in computing and related fields who otherwise would be unlikely to attend. The awards are made to selected advanced undergraduates, graduate students, and people early in their professional careers. Cost sharing by the institutions represented covers part of the costs for many of the participants.","title":"Special Project: Scholarship and Travel Grants for the Grace Hopper Celebration of Women in Computing 2000","awardID":"0084788","effectiveDate":"2000-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["197870"],"PO":["329035"]},"48844":{"abstract":"The proposed research addresses the problem of designing interconnect-optimized systems in deep-sub-micron technologies. All recent studies on the performance of VLSI systems in terms of timing, noise, power dissipation and related problems point to interconnect as a major factor. Thus, a central challenge in designing low-noise, low-power, high-speed reliable systems is to be able to estimate and optimize interconnect lengths, geometrical shapes, locations and thus delays, as well as minimize cross-talk by predicting and controlling mutual relations between individual wires. These problems are addressed by using (1) an innovative, interconnect-regular design representation (2) decomposition algorithms integrated with floorplanning and with simultaneous prediction, estimation and optimization of interconnect lengths, delays and cross-talk. The influence of process parameter variations is also considered.","title":"Interconnect-Driven CAD Methodologies for VLSI Layout","awardID":"9988402","effectiveDate":"2000-07-15","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[125027],"PO":["562984"]},"47645":{"abstract":"DATE: April 19, 2000<br\/>PROPOSAL NUMBER: C-CR 9984371<br\/>INSTITUTION: Northwestern University<br\/>PI: Andreas Moshovos<br\/>TITLE: CAREER: Slice-Processing: Highly-Accurate Prediction for Future High-Performance Processors<br\/>ABSTRACT<br\/>Prediction-driven speculative techniques are used in virtually all modern, high-<br\/>performance processors. Such techniques offer a promising direction for further<br\/>boosting performance. However, the benefits so obtained are only as good as the<br\/>underlying prediction-based methods are at guessing what the program needs.<br\/>This project investigates slice-prediction, a paradigm that aims at providing<br\/>highly accurate prediction beyond what is possible with the existing methods.<br\/>Existing methods are primarily outcome-based since they rely on repeating<br\/>patterns in a program's outcome stream (e.g., addresses or branch directions).<br\/>However, such patterns do not always exist. More importantly, as current<br\/>outcome-based methods are perfected, irregular patterns increasingly dominate<br\/>performance. Slice-prediction attacks such cases by predicting the computation-<br\/>slice that produces such irregular yet performance-critical outcomes. Predicted<br\/>slices are then treated as miniature, autonomous programs, which can precompute<br\/>performance critical outcomes. The intuition is that while the outcome of a<br\/>program can be irregular the method used is typically relatively simple and<br\/>fairly stable.<br\/>This project focuses on architecturally invisible, hardware implementations of<br\/>slice-prediction, and targets the following applications: (1) Branch Prediction<br\/>and (2) Data Prefetching. Performance achieved by slice-prediction is evaluated<br\/>through a detailed software simulator over a set of widely used benchmarks.","title":"CAREER: Slice-Processing: Highly-Accurate Prediction for Future High-Performance Processors","awardID":"9984371","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[121884],"PO":["180163"]},"52420":{"abstract":"NEW STATISTICAL CHALLENGES POSED BY MULTISCALE AND ADAPTIVE<br\/>REPRESENTATIONS D.L. Donoho & I.M. Johnstone, PI's.<br\/>Project period: 07\/01\/00 -- 06\/30\/05<br\/><br\/>The project will address the following specific topics:<br\/>1. Estimation in tomography: the curvelet tight frame of<br\/>representation seems, according to preliminary calculations, to<br\/>achieve faster rates of convergence than traditional tomographic<br\/>methods.<br\/>2. Estimation and testing in time-frequency analysis: a new tight<br\/>frame of chirplets has been built by deploying curvelets in the<br\/>time-frequency plane. The new representation has promise for detection and<br\/>estimation of chirps in the presence of noise.<br\/>3. Recent work in computational vision asks ``what is the best basis<br\/>for representing natural images?'' It is proposed that many empirical<br\/>results in the rapidly growing literature on this topic might be<br\/>explained and improved using analytically-constructed representations:<br\/>ridgelets and curvelets.<br\/>4. Geometry-driven diffusions are popular in applied image processing<br\/>-- but their quantitative performance is not well-understood. It is<br\/>proposed to develop a quantitative statistical theory using recent<br\/>tools such as multiscale ridgelets.<br\/>5. Extensions of Sparsity-Based ideas. Problems of finding `edgels in<br\/>white noise' and `subspaces in white noise' offer challenging and<br\/>timely directions in which to generalize existing sparsity ideas.<br\/>6. Testing Sparse Means. An adaptive approach is suggested for<br\/>testing if the mean of a random vector is nonzero, when the vector<br\/>might exhibit an unknown degree of sparsity.<br\/>7. Asymptotics of top eigenvalues of large covariance matrices.<br\/>A program is set out to develop statistical theory for principal<br\/>components of large data matrices based on recent progress in<br\/>random matrix theory.<br\/>Consistent with the principle of ``reproducible research'', software<br\/>and figures from this project will be made available in future<br\/>releases of the public domain WaveLab system.<br\/><br\/><br\/>In recent years, research in wavelets and time-frequency methods has<br\/>broadened to construct new systems of representation, including<br\/>systems custom-tailored for specific phenomena. Examples include<br\/>wavelet packets and cosine packets, and very recently, systems like<br\/>edgelets, ridgelets, chirplets, warplets, and curvelets. In parallel,<br\/>research in statistical analysis and cognate fields allows data<br\/>themselves to dictate the design of their own optimal systems of<br\/>representation. Principal components (i.e. Karhunen-Loeve<br\/>decomposition) is the oldest example of such data-adaptive<br\/>representation; many newer ideas have been proposed recently, such as<br\/>independent components analysis. The proposers have been<br\/>active in both domains, creating new image and signal<br\/>representations and developing statistical theory to underpin adaptive<br\/>signal representations. The current project will (a) pursue two<br\/>opportunities arising from the recent introduction of curvelets, (b)<br\/>address two active applied research areas, computational vision and<br\/>geometry driven diffusions, and (c) attack some issues which are<br\/>argued to be at the core of new developments in statistical decision<br\/>theory. Topic (a) may have implications for applied work in<br\/>tomography, image and signal processing, and (c) may impact applied<br\/>uses of principal components in domains such as climate and global<br\/>change studies.","title":"New Statistical Challenges Posed by Multiscale and Adaptive Representations","awardID":"0072661","effectiveDate":"2000-07-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["403485","403486"],"PO":["478395"]},"51342":{"abstract":"","title":"PECASE: New Techniques for Optimizing the Quality and Capacity of Wireless Communication Systems","awardID":"0049089","effectiveDate":"2000-07-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["456909","223414"],"PO":["564898"]},"53113":{"abstract":"EIA-00748<br\/>Claire Cardie<br\/>Cornell University<br\/><br\/>POWRE: Integrating Natural Language Processing and Information Retrieval for Intelligent Text-Processing<br\/><br\/><br\/>This POWRE proposal, request funds for the PI to explore information retrieval as a new, but related direction of her research. Her past work was in the area of natural language, understanding and intelligent text processing. The PI also proposes a combination of readings and system implementation to solidify her knowledge of information retrieval techniques, while gaining a better grasp of existing results in the field, and to develop the necessary system-building experience. As a result, she will concentrate on two topics that will leverage her existing research strengths in natural language processing. In particular she will investigate the integration of noun phrase conference resolution and shallow parsing for query-dependent text summarization.","title":"POWRE-Integrating Natural Language Processing and Information Retrieval for Intelligent Text-Processing","awardID":"0074896","effectiveDate":"2000-07-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["548297"],"PO":["564181"]},"48801":{"abstract":"Cardinal splines (i.e. splines with equally-spaced knots) provide a <br\/>canonical example for demonstrating the mathematical structure of <br\/>multiresolution analysis (MRA), which is a very powerful tool for the <br\/>construction of orthogonal, semi-orthogonal, and bi-orthogonal <br\/>wavelets. However, for practical applications, splines with arbitrary <br\/>knots are often needed; and although the multi-level (ML) structure of <br\/>spline subspaces is still valid, the Fourier approach to the study of <br\/>cardinal splines and their corresponding wavelets no longer applies to <br\/>this more general study. In addition, even for the cardinal setting, <br\/>orthogonal and semi-orthogonal splines must be replaced by tight affine <br\/>(or wavelet) frames when compact support (or finite time-duration) is <br\/>needed for both spline-wavelet analysis and spline-wavelet synthesis. <br\/>Furthermore, for CAD\/CAM applications, there is also the need of <br\/>rational B-splines (or NURBS) for precise representation of various <br\/>geometric objects such as conic sections.<br\/><br\/>This proposal is based on our recent results on tight frames of <br\/>cardinal splines and on our newly developed complete ML structure of <br\/>NURBS in terms of their weights. We propose to introduce non-stationary <br\/>time-domain techniques to build a unified mathematical foundation of <br\/>tight affine frames of compactly supported splines with arbitrary <br\/>knots, and more generally, of NURBS. This will be followed by <br\/>development of efficient algorithms and computational schemes <br\/>associated with these new basic functions, which will be used as <br\/>analysis and synthesis tools for CAD\/CAM and computer graphics <br\/>applications. We also propose to develop software libraries of these <br\/>analysis and design tools that will be fully compatible with the <br\/>industrial standards such as IGES, STEP, and PHIGS, for the CAD\/CAM\/CAE <br\/>industries.","title":"Tight Frames of Rational Splines and Application to CAD\/CAM and Computer Graphics","awardID":"9988289","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["152485","152486"],"PO":["201974"]},"47833":{"abstract":"The proposed research focuses on practical solutions that will advance the current Internet technology to meet the challenge of the Next Generation Internet. The educational component of the project aims to train the network experts that the industry needs. <br\/> One of the main problems of the current Internet infrastructure is its inability to provide services at high Quality-of-Service (QoS) levels. The lack of such quality guarantees affects the reliability and the commercial value of the services. New protocols and architectures are needed to support the emerging applications. An impediment in the development of such architectures is our limited ability to understand, model and simulate the Internet and its topology. The proposed work tackles these two problems. First, the project proposes to develop a multicast protocol for the Internet that will support group applications with high QoS requirements such as tele-conferencing. Second, the project proposes to develop a novel method to characterize the topology of the Internet and explore its applications.<br\/> The project proposes the QoSMIC Internet routing protocol to support QoS in group (multicast) communications. The researcher's Ph.D. work introduced QoSMIC, a new QoS0sensitive multicast protocol. QoSMIC differs from the previous protocols in that it identifies multiple paths and selects the one that can provide the QoS level the applications requires. In addition, QoSMIC is resource-efficient and flexible without compromising its scalability. Preliminary simulations show that QoSMIC can support 4 times as many users with a specified QoS level compared to the current protocols. There are a lot of research issues that are needed to complete the protocol. The research proposes to develop, implement and test protocol in three steps: extensive simulations, software implementation, and testing in the researcher's network campus. The long-term goal is to incorporate QoSMIC in commercial routers through an industrial collaboration.<br\/> One of the most difficult tasks in the design and the testing of a new protocol is predicting its behavior in a large-scale realistic network. Thus, the research proposes to model, re-create, and predict the growth of the Internet topology. The research presents a novel way to describe topological properties of large networks using power-laws. Despite the randomness of the Internet, the researcher has discovered that some surprisingly simple power-laws can describe the Internet topology based on measurement data during the year 1998. The power-laws fit the real data very well, with correlation coefficients of 96% of higher. The rsearcher's initial set of power-laws is only the beginning of a new way to view and model the Internet. The project proposes to continue work focusing on three major research directions. First, it will identify more power-law properties and thus characterize and classify graphs effectively. Second, it will develop a new graph model for realistic topologies. Finally, it will measure and predict the growth patterns of Internet. In all three areas, software tools will be developed to analyze, generate, and predict graphs and their topological properties.<br\/> The project proposes to develop a strong educational program as a vital part of the career development plan. The goal of the educational plan is to provide students with a soled theoretical background and practical experience on cutting-edge technologies. The project proposes an educational framework that is based on a) a strong theoretical and technical curriculum, b) early student involvement in research and teaching, and c) collaboration with the industry through internships and sponsorships.","title":"CAREER: Multicast Protocols and Topology Models for the Internet","awardID":"9985195","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["549003"],"PO":["565090"]},"48812":{"abstract":"CCR-9988320<br\/>Gamble, Rosanne, F.<br\/>University of Tulsa<br\/>Integration Architecture Theory<br\/><br\/>Current software development practices frequently incorporate the reuse of<br\/>multiple, existing, and often heterogeneous, components in a single<br\/>application. This style of development is thought to increase adaptability<br\/>and evolvability of the resulting integrated system. Unfortunately, it also<br\/>manifests complex interoperability conflicts among participating components.<br\/>Though commercial middleware is being touted as resolving these problems,<br\/>often its use results in incomplete solutions, which are neither flexible<br\/>nor evolvable. To overcome these problems, it is necessary to capture and<br\/>codify the inherent nature of interoperability conflicts in order to<br\/>determine and apply appropriate resolution techniques in a principled<br\/>manner. Toward this end, this project focuses on developing a theory of<br\/>integration founded on formulating software architecture descriptions of<br\/>interoperability conflicts, mapping these conflicts to resolution<br\/>strategies, and defining a formal composition of these strategies as they<br\/>are used in middleware frameworks. The goal of this research is, therefore,<br\/>to provide key resources at a foundational level to make principled and<br\/>repeatable design decisions that result in more complete and adaptable<br\/>integration solutions.","title":"Integration Architecture Theory","awardID":"9988320","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["362926"],"PO":["564388"]},"47844":{"abstract":"This is an NSF CAREER\/PECASE grant proposal for research into Extremely Wide-Area StorageSystems (EWASS). Ideally, such storage systems are highly-available from anywhere in the network, exploit automatic replication for disaster recovery, employ strong security by default, and provide performance that is similar to that of local storage under numerous circumstances. Further, such systems are self-repairing, providing automatic serviceability and maintainability.<br\/> The research envisions a utility model in which users pay a monthly fee to one particular \"utility provider\" while consuming resources from many providers. The utility providers buy and sell capacity amongst themselves in direct analogy to the deregulated electric industry. A demand for capacity or bandwidth in one region of the country would encourage entrepreneurs to bring additional services online. One of the key requirements for such utilities is nomadic data, i.e., data that is free to migrate and be replicated anywhere within the system. Nomadic data lends itself to fluid analogies (data is free to \"flow\" wherever it is needed) and permits flexible exploitation of spatial locality. This property is in contrast to existing distributed systems that confine their data to a small number of physical servers within the network.<br\/> Given the fluid analogy, the EWASS prototype described within this proposal is called the \"Oceanic Data Utility\" or \"OceanStore\". The project outlines five assumptions for the OceanStore utility:<br\/> (1) The \"Mostly Well-Connected\" Assumption: Most of the network is comprised of high-bandwidth links<br\/>and periods of disconnection are brief - even at the leaves.<br\/> (2) The \"Promiscuous Caching\" Assumption: Data can be cached anywhere, anytime.<br\/> (3)The \"Operations-based Interface with Conflict Resolution\" Assumption: Applications utilize an operation-based interface that is oriented toward conflict resolution.<br\/> (4)The \"Untrusted Infrastructure\" Assumption: The infrastructure is fundamentally untrusted. This means that only ciphertext is stored in the network.<br\/> (5)The \"Responsible Party\" Assumption: Each repository of data has at least one responsible party that is charged with knowing where the data actually resides and ensuring that it is properly replicated.<br\/> These assumptions define the OceanStore infrastructure. In constructing this infrastructure, the research proposes to utilize a number of technologies, some of them mature, others relatively new:<br\/> (1)Organization of data as a series of \"pools\" of information. Each pool will include a randomized tree indexing structures (e.g., treaps) connected via Bloom-filter summaries.<br\/> (2)Transaction-like operation structures to describe updates and permit infrastructure-side conflict resolution (similar to Bayou), combined with incremental cryptographic techniques to operate directly on encrypted information in the infrastructure.<br\/> (3)Use of erasure-tolerant coding and replication to enhance the survivability of data.<br\/> (4) Online Introspection to detect and exploit patterns of access in order to optimize the position of nomadic data.<br\/> The research proposes two distinct phases of OceanStore prototype, one read-only, the other complete with conflict resolution. This phased style of implementation permits incremental testing and analysis of components of the system that are somewhat orthogonal. Further, we propose to use the OceanStore infrastructure to enhance education at Berkeley in several ways. Among them:<br\/> (1) Collaborate with other faculty to combine the persistent storage system with experimental wireless infrastructures in order to exploit online content during class and to provide novel faculty\/student interactions at nonstandard venues such as cafes.<br\/> (2) Provide a fundamental infrastructure for undergraduates and graduates exploiting the consequences of ubiquitous computing.<br\/> OceanStore provides a foundation for ubiquitous computing, and as such will doubtless have a major impact on educational paradigms.","title":"PECASE: OceanStore: An Oceanic Data Utility for Ubiquitous, Highly-Available, Reliable, and Persistant Storage","awardID":"9985250","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["211900"],"PO":["565090"]},"47734":{"abstract":"John Hale<br\/>University of Tulsa<br\/>CCR-9984774<br\/><br\/>ABSTRACT<br\/> Systematic attacks to military, government and corporate networks underscore<br\/>the fundamental importance of computer security. Unfortunately, current<br\/>approaches to security often yield ad hoc patchworks of inconsistent policies<br\/>and incompatible mechanisms. The problem is two-fold: Techniques and tools are<br\/>limited, and educational programs are sparse.<br\/> The research activities embed configurable security services within<br\/>programming languages for developing distributed applications. Denotational<br\/>semantics for these languages map high-level access control structures into a<br\/>ticket-based model that captures heterogeneous security policies and supports<br\/>the formal verification of secure behavior. Specialized algorithms implement<br\/>security proofs for applications at compile-time and runtime.<br\/> A secure information enclave, a proof-of-concept application, is built<br\/>around a glue language with programmable security policy coordination services.<br\/>Mediators gather metadata from remote sites, engaging cooperative policy<br\/>management methods to negotiate secure interoperability. Static and dynamic<br\/>analyses guarantee global policy consistency for the enclave.<br\/> The educational activities have three major thrusts: The development of a<br\/>Center of Excellence for Information Assurance Education, the expansion of the<br\/>Tulsa Undergraduate Research Challenge --a nationally recognized program of<br\/>academics, research and service designed for computer science majors, and the<br\/>systematic incorporation of minorities, especially Native Americans (the PI is a<br\/>native Cherokee), in computer science and engineering programs in the state of<br\/>Oklahoma.","title":"CAREER: Programmable Security for Distributed Systems and Databases","awardID":"9984774","effectiveDate":"2000-07-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["354943"],"PO":["564388"]},"47745":{"abstract":"9984822<br\/>Bultan, Tevfik<br\/>University of California, Santa Barbara<br\/><br\/>CAREER: Verifiable Specifications: Tools for Reliable Reactive<br\/>System Development<br\/><br\/>Developing reliable software for reactive systems is a<br\/>challenging task. This project will focus on combining<br\/>and extending the results from two areas which address<br\/>this problem: 1) specification languages and 2) automated<br\/>verification methods for reactive systems. Building on the<br\/>recent results in these areas the goal of this project<br\/>is to develop verifiable specification languages. This<br\/>will involve research from two directions: 1) From the<br\/>verification side the goal is to extend the scope of<br\/>techniques such as model checking to make them applicable<br\/>to a wider set of systems. 2) From the specification side<br\/>the goal is to restrict the specification languages as much<br\/>as possible (without reducing their ability to specify<br\/>complex systems) in order to make their automated verification<br\/>feasible. This project will address both theoretical issues<br\/>such as complexity and efficiency of model checking<br\/>techniques, and practical issues such as investigating<br\/>usability of software specification languages and automated<br\/>verification techniques in practice. Automated verification<br\/>tools developed based on the results of this project will<br\/>also be used as educational tools in both graduate and<br\/>undergraduate courses on formal methods and programming<br\/>languages.","title":"CAREER: Verifiable Specifications: Tools for Reliable Reactive Software Development","awardID":"9984822","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["486421"],"PO":["564388"]},"48758":{"abstract":"PI: Ramachandran, Vijaya<br\/>Institution: U of Texas Austin<br\/>Proposal Number: 9988160<br\/><br\/>A. Project Summary<br\/>An important goal in parallel processing is the development of general-<br\/>purpose parallel models and algorithms. The challenge here has been to find<br\/>the right balance between simplicity, accuracy and broad applicability. This<br\/>project will develop a comprehensive collection of parallel algorithms suitable<br\/>for practical use by working with three general-purpose parallel computation<br\/>models that have been proposed over the last decade | Bulk-Synchronous<br\/>Parallel (BSP), LogP, and Queuing Shared-Memory (QSM) models | as<br\/>well as with the external memory Parallel Disk Model (PDM). Some uni-<br\/>fying themes for the design of efficient algorithms on these models will be<br\/>developed, and these will form the basis for a systematic development of al-<br\/>gorithms on these models. The algorithms to be developed will range from<br\/>kernel algorithms for basic primitives to algorithms for important applica-<br\/>tions.<br\/>The research will expose unifying themes relating these well-<br\/>known models, and will result in fast and efficient parallel algorithms with<br\/>good performance on a wide range of parallel machines for large problem sizes<br\/>typically seen in practice. Additionally, this research will provide insight into<br\/>the fundamental benefits and limitations of parallel processing through the<br\/>investigation of asymptotically optimal algorithms and lower bounds.","title":"Parallel Algorithm Design: From Theory to Practice","awardID":"9988160","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550960"],"PO":["543507"]},"52454":{"abstract":"CCR-0072763<br\/>Richard Kieurtz<br\/>Oregon Grad Institute<br\/><br\/><br\/>This is a grant to support the 13th annual Conference on Theorem Proving in Higher Order Logics (TPHOLs 2000) to be held at the Oregon Graduate Institute during August 2000.<br\/><br\/>This conference will bring together top researchers from around the world to discuss higher-order logic theorem provers. A conference allows new ideas to be disseminated more rapidly than is possible through the literature. Applications of this subject include, among others, hardware verification & synthesis, and verification of security & communications protocols. NSF is giving $10,000 for scholarships to subsidize up to 20 students who would otherwise be unable to attend.","title":"13th International Conference on Theorem Proving in Higher Order Logics","awardID":"0072763","effectiveDate":"2000-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["40586"],"PO":["179846"]},"54302":{"abstract":"EIA-0079875<br\/>Kitts, Christopher A.<br\/>Santa Clara University<br\/><br\/>CADRE: A Robotic Control Network for Distributed Experimentation<br\/><br\/>Santa Clara University is developing a Distributed Robotic Control Network for use as an experimental control system for a variety of remote, unmanned robotic devices. This system supports the operation of remote robots with scientific and technology demonstration missions. In addition, the system permits experimental verification and validation of new operational control techniques. The control network will consist of a centralized mission control center, several low-cost communications stations, a Web-based user interface for distributed users, interfacility communications links, and a few low-cost test robots that can be used to demonstrate system functionality. The system will be designed and implemented to specifically support the work of geographically distributed researchers.","title":"CADRE: A Robotic Control Network for Distributed Experimentation","awardID":"0079875","effectiveDate":"2000-07-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["428845","530335"],"PO":["241298"]},"47801":{"abstract":"This is the first year of funding of a 4 year, continuing award. One of the major roadblocks in the<br\/>efficient and accurate communication between humans and machines is the resolution of the<br\/>ambiguity inherent in natural languages. A major bottleneck in developing solutions is the severe<br\/>shortage of training data that distinguishes word senses, and the high cost of inputting this<br\/>information manually. A focus of this project is the development of unsupervised and minimally<br\/>supervised algorithms for acquiring such skills without costly hand-tagged training data. Such<br\/>methods will exploit the distribution properties observed in very large text corpora (over 10 billion<br\/>words); the PI will also investigate richer representations of feature space, class models,<br\/>smoothing methods and learning algorithms specialized for classification in very high-dimensional<br\/>featurespaces. In addition to the problem of word-sense disambiguation, this project will explore<br\/>shared solutions to a closely related set of lexical-ambiguity tasks including spelling correction,<br\/>propername classification, capitalization restoration, accent and diacritic restoration for, diverse<br\/>languages, vowel restoration in Hebrew and Arabic, speech synthesis on homographs, lexical<br\/>choice in machine translation, and certain aspects of choosing among phonetically confusable<br\/>candidates in speech recognition. These diverse problems are not normally recognized as being<br\/>members of the same class, and this project seeks to exploit the synergies present by developing<br\/>methods and training data on one member of the class and utilizing the methods and data on other.<br\/>problems in the class. Thus this unified approach offers the potential for rapid parallel progress on<br\/>key problems in human-computer interaction and information extraction.","title":"CAREER: Resolving Lexical Ambiguities in Natural Language Processing","awardID":"9985033","effectiveDate":"2000-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V242","name":"CIA-MACHINE TRANSLATION(MT)"}}],"PIcoPI":["445169"],"PO":["565215"]},"46888":{"abstract":"ABSTRACT<br\/><br\/><br\/>This project, which is being supported by the Directorate for Biological Sciences, the Directorate for Computer and Information Science and Engineering and by the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences, will fund research on mangrove forests that dominate the world's tropical and subtropical coasts, paralleling the geographical distribution of coral reefs. Ecological processes here are influenced by inputs from the land, sea, and sky, which result in extreme fluctuations of flooding, salinity, temperature, light, and nutrient availability. Mangrove-associated organisms have specialized physiological and structural adaptations that sustain them in this variable environment. Human-caused enrichment is one of the major global threats to these coastal ecosystems. Experiments show that nutrients are not uniformly distributed among or even within mangrove forests. Soil fertility can switch from nitrogen to phosphorus limitation across narrow gradients. This study will explore the relationships among physical and chemical factors, nutrients, microbes, trees, and elemental cycling on off-shore mangrove islands in Belize.<br\/><br\/>We will examine the interactions between the environment and organisms to determine how changes in nutrient inputs from natural, agricultural, or urban sources might alter the delicate balance among these ecosystem components. Mathematical models will help us predict the contribution complexity makes to the ability of mangrove ecosystems to survive both natural and anthropogenic disturbances. The results of the study will help scientists understand how to better manage and conserve mangrove ecosystems and will contribute to our understanding of biocomplexity in other ecosystems.","title":"BIOCOMPLEXITY: Collaborative Research: Microbial and Nutrient Controls in Mangrove Ecosystems","awardID":"9981309","effectiveDate":"2000-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}}],"PIcoPI":["390128",120034],"PO":["345195"]},"52785":{"abstract":"Quality-of-Service (QoS) routing is an important traffic engineering mechanism for providing requisite services for many emerging applications on the Internet. In QoS routing, paths for flows are selected based upon knowledge of the resource availability (referred to as QoS State) at network nodes (i.e., routers) and the QoS requirements of the flows. It is expected that QoS routing will choose, among the many possible choices, a path that has sufficient resources to accommodate the QoS requirement of a given flow. Because of its awareness of the network QoS state, QoS routing, if done appropriately, can significantly improve network throughput.<br\/> In this proposal, the researchers present a novel approach to QoS routing -the localized QoS routing approach. Unlike the conventional global QoS routing approach that requires network-wide exchange of QoS states among routers, the proposed localized routing approach attempts to infer the network QoS state from locally collected flow statistics such as flow arrival\/departure rates and flow blocking probabilities, and performs path selection based on this local information. As a result, the proposed localized QoS routing approach avoids the drawbacks of the conventional global QoS approach such as degraded performance in the presence of inaccurate routing information. Furthermore, it has the advantage of minimal communication overhead, no processing overhead at core routers, and easy deployability.<br\/> The researchers propose to study and develop localized QoS routing algorithms using a novel adaptive proportional routing framework. Adaptive proportional routing exploits the inherent randomness in path selection by proportioning flows among multiple paths between a source and a destination. Flow proportions are determined based on the perceived quality of these paths, and are dynamically adjusted in response to the changing network conditions. Using adaptive proportional routing framework, the researchers will focus on the following aspects of their localized QoS routing approach.<br\/> Theoretical Foundations: The researchers plan to develop theoretical models under which the behavior of localized QoS routing can be studied and analyzed. Their insights will then be used to guide the design of practical schemes.<br\/> Proportional Source Routing: The researchers will develop proportional source routing schemes using local flow statistics collected either at route-level or link-level. Through theoretical analysis and simulations, the researchers will study the adaptivity and stability of these schemes.<br\/> Proportional Next-hop Routing: The researchers also will explore applicability of localized adaptive proportional routing to hop-by-hop path selection and will develop proportional next-hop flow routing schemes using locally gathered aggregate flow statistics.<br\/> Hierarchical Proportional Routing: The researchers plan to study methods for topology and QoS state aggregation using the localized adaptive proportional routing framework, and to develop hierarchical proportional routing schemes using a combination of proportional source routing and proportional next-hop routing.<br\/> Proportional Hybrid Routing: The researchers will develop hybrid QoS routing schemes that 1) combine infrequent global QoS update mechanisms and localized flow proportioning methods, and 2) integrate on-line path selection with off-line traffic engineering\/flow placement. The fundamental trade-off between the system overhead, the time scale of control and the system performance will be investigated in these contexts.<br\/> Implementation: The researchers plan to implement the proposed localized QoS routing schemes in a testbed. They will measure the performance and processing overhead of these schemes under real traffic settings.<br\/> The deliverables from the research effort will include journal and conference publications, technical reports and memorandums, Internet Drafts, and software prototype implementation.","title":"Localized Approach to Quality-of-Service Routing","awardID":"0073819","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["543509"],"PO":["565090"]},"46944":{"abstract":"ABSTRACT<br\/><br\/><br\/>This project, which is being supported by the Directorate for Biological Sciences, the Directorate for Geosciences, the Directorate for Computer and Information Science and Engineering, and the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences, will fund research on mangrove forests that dominate the world's tropical and subtropical coasts, paralleling the geographical distribution of coral reefs. Ecological processes here are influenced by inputs from the land, sea, and sky, which result in extreme fluctuations of flooding, salinity, temperature, light, and nutrient availability. Mangrove-associated organisms have specialized physiological and structural adaptations that sustain them in this variable environment. Human-caused enrichment is one of the major global threats to these coastal ecosystems. Experiments show that nutrients are not uniformly distributed among or even within mangrove forests. Soil fertility can switch from nitrogen to phosphorus limitation across narrow gradients. This study will explore the relationships among physical and chemical factors, nutrients, microbes, trees, and elemental cycling on off-shore mangrove islands in Belize.<br\/><br\/>We will examine the interactions between the environment and organisms to determine how changes in nutrient inputs from natural, agricultural, or urban sources might alter the delicate balance among these ecosystem components. Mathematical models will help us predict the contribution complexity makes to the ability of mangrove ecosystems to survive both natural and anthropogenic disturbances. The results of the study will help scientists understand how to better manage and conserve mangrove ecosystems and will contribute to our understanding of biocomplexity in other ecosystems.","title":"BIOCOMPLEXITY: Collaborative Research: Microbial and Nutrient Controls in Mangrove Ecosystems","awardID":"9981535","effectiveDate":"2000-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}}],"PIcoPI":["475663","487820","159012"],"PO":["345195"]},"53115":{"abstract":"EIA-0074909<br\/>Palamidessi, Catuscia<br\/>Pennsylvania State University<br\/><br\/>POWRE: Probabilistic Methods for Concurrency<br\/><br\/> <br\/> The main objective of this proposal is to develop a probabilistic concurrent calculus, which is the study of its semantics, and formal methods for reasoning with implementation. Furthermore, such calculus will be used as an intermediate level for the implementation of the pi-calculus, a powerful formalism for the specification of concurrent systems with link mobility.","title":"POWRE: Probabilistic Methods for Concurrency","awardID":"0074909","effectiveDate":"2000-07-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[135321],"PO":["289456"]},"43325":{"abstract":"Proposal-9912422<br\/>PI: David Shmoys<br\/><br\/>Most combinatorial optimization problems that arise in applications from scheduling, logistics, and network design, for example, are NP-hard, and hence unlikely to have a polynomial-time algorithm that finds an optimal solution. This project is focused on the study of approximation algorithms for these problems, where the aim is to design effective algorithms that are guaranteed to produce near-optimal solutions, and typically produce solutions of extremely high quality.<br\/>This project aims to further develop the three major techniques that have emerged as consistently producing superior results: rounding techniques based on mathematical programming relaxations, primal-dual methods, and local search methods. Although there has been significant progress, there are many problems for which the current state of knowledge is not sufficient. This project is devoted to the investigation of several problems in this area.<br\/>The primary focus of this work is to investigate algorithms that produce solutions guaranteed to be nearly-optimal by relying on information contained in the optimal solution to a linear programming relaxation. One consequence of such results would be to provide a theoretical justification for the strength of the bounds given by these linear programming relaxations. By giving algorithms for which one can prove that the solution found has value relatively close to the LP bound, one also shows that relative error of the solution (compared to the integer optimum) is also small. Furthermore, past experience has shown that the insight needed to devise algorithms with such performance guarantees can also lead to algorithms with superior empirical performance.<br\/>This work focuses on several specific areas to attempt to design approximation algorithms with good performance guarantees and good practical performance. <br\/>Facility location, clustering problems, and scheduling problems arise in a number of application settings, including computational biology and project resource management, and this project considers a number of basic models, with the aim of developing algorithmic techniques that are not particularly application specific.<br\/>For several basic problems including the k-median problem, the uncapacitated facility location problem, the bin-packing problem, and the problem of scheduling jobs on parallel machines subject to precedence constraints, the aim of this work is to design algorithms with superior performance than was known previously.<br\/>Polyhedral methods are the foremost techniques used to find optimal solutions to hard discrete optimization problems. These methods require the solution of a series of linear programming relaxations. Heuristic methods that rely on linear programming can be easily integrated into this approach, with the aim of speeding up these methods, since they can take advantage of the work already done is solving these linear programs. This work also studies the efficacy of such heuristics in enhancing the polyhedral methods to solving (to optimality) these problems.","title":"The Design, Analysis and Application of Approximation Algorithms","awardID":"9912422","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["562312"],"PO":["543507"]},"48902":{"abstract":"Proposal CCR-9988540<br\/>Henninger, Scott R.<br\/>University of Nebraska-Lincoln<br\/>Toward an Understanding of Contextual Factors in Software Development<br\/><br\/><br\/>With the rise of software architectures, frameworks, component-based<br\/>software engineering, design patterns, and other software development methodologies, it is becoming increasingly important to understand<br\/>the context in which different software development methods and<br\/>techniques are most effective. This research will seek to provide<br\/>a theoretical framework for understanding the contextual and<br\/>domain-based factors that mediate between success and failure for<br\/>different software development contexts. Particular emphasis will<br\/>be placed on tools and techniques that allow organizations to<br\/>systematically accumulate and improve knowledge of effective software<br\/>development practices within an organizational context. Methods<br\/>for empirical observation based on ethnomethodology and activity<br\/>theory will be developed to establish and validate a scientific<br\/>basis for understanding critical success and failure factors.<br\/>Results of this research will be used to 1) Develop methods for<br\/>scientific inquiry that will lead to engineering disciplines for<br\/>software development based on domain and context analysis, 2) Better<br\/>understand the knowledge-intensive nature of software development<br\/>activities and how past experiences can be used as the basis for<br\/>improvement, and 3) Development of methodologies that integrate<br\/>modern, component and framework-based techniques, with contextual<br\/>factors that match application problems to specific techniques with<br\/>the highest probability of success.","title":"Toward an Understanding of Contextual Factors in Software Development","awardID":"9988540","effectiveDate":"2000-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["356244"],"PO":["397849"]},"48913":{"abstract":"In this project, perceptual systems will be developed for modeling objects as they are manipulated during teleoperation. These systems will estimate those object properties that mediate the interaction between the robot and its environment, including object geometry, mass, moment of inertia, and friction. The inputs to the system will be sensor data streams from the remote environment, including force, position, and video signals, and the outputs will be models of the manipulated objects and their properties. This approach, modeling by manipulation, will create new robot perceptual capabilities in unstructured environments. In doing so, it will address a fundamental challenge in the development of autonomous robots: the ability to sense and model the environment. The proposed system will be built in the context of teleoperation to take advantage of the human operator's motor skills to execute the manipulation tasks. The sensory information returned from the remote robot will provide a comprehensive description of the task. By focusing the project's theoretical developments on specific test beds, tasks and properties, the essential perceptual capabilities will be developed to enable new progress on the other components of autonomy, including planning and control.","title":"Modeling by Manipulation","awardID":"9988575","effectiveDate":"2000-07-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["402282","513297"],"PO":["234178"]},"42379":{"abstract":"9909797<br\/>Zucker<br\/><br\/>This award supports a three-year collaborative research project between Professor Steven Zucker of Johns Hopkins University in Baltimore, Maryland and Professor Hiroyuki Yoshida of Kyoto University in Japan. The researchers will be undertaking a study of shimura varieties and automorphic forms. Shimura varieties comprise the number-theoretical elaboration on the locally-symmetric varieties of complex geometry. The importance of the later spaces comes from applications to number theory and moduli problems. Most locally-symmetric varieties are non-compact, so it becomes necessary to study their compactifications. The goal of the project will be research into the interplay between the various compactifications and automorphic forms. There will be a series of workshops, one of which will be accessible to graduate students, postdocs and faculty. They will also arrange for weekly meetings and presentations. They hope to foster interaction between mathematicians working on different aspects of the subject and the communication of recent progress. <br\/><br\/>The project brings together the efforts of two laboratories that have complementary expertise and research capabilities. This field draws from complex geometry, algebraic geometry, harmonic analysis, topology, and number theory (both algebraic and analytic). According to conjecture of Langlands, the theory of automorphic representations controls a large class of motives. Therefore, the field holds a rather central place within mathematics as a whole. The project advances international human resources through the participation of postdocs and graduate students. Through the exchange of ideas and technology, this project will broaden our base of basic knowledge and promote international understanding and cooperation. Results of the research will be published in international scientific journals and also presented at scientific meetings in the U.S. and abroad.","title":"U.S.-Japan Cooperative Science: Shimura varieties and Automorphic Forms","awardID":"9909797","effectiveDate":"2000-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["560901"],"PO":["449696"]},"48825":{"abstract":"TITLE: Topics in Parametric Optimization<br\/><br\/>ID: 9988348<br\/><br\/>PI: David Fernandez-Baca<br\/><br\/>ABSTRACT <br\/><br\/>Parametric problems are those whose input depends continuously on one or<br\/>more values. This award supports work in two fundamental areas in<br\/>parametric optimization. The first is fixed-dimensional optimization,<br\/>with special emphasis on problems whose objective function can be<br\/>efficiently evaluated at any point by a well-behaved algorithm. Problems<br\/>of this sort arise, for example, in Lagrangian relaxation. The main<br\/>question is to determine the conditions under which evaluation is as easy<br\/>as global optimization, within the context of Megiddo's method of<br\/>parametric search. The second area to be investigated is the construction<br\/>of parameter space decompositions yielding optimal solutions for all<br\/>parameter values. One issue is obtaining bounds on the number of regions<br\/>of the decomposition. This will be studied in part within a framework<br\/>that captures the essence of problems as diverse as stable marriage and<br\/>evolutionary tree construction. Another question is whether one can<br\/>accelerate the construction of the decomposition by exploiting structural<br\/>similarities between adjacent regions.","title":"Topics in Parametric Optimization","awardID":"9988348","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["451154"],"PO":["321058"]},"48847":{"abstract":"Proposal Number: CCR-9988409<br\/>PI: Lee, Insup<br\/>Co-PI: Sokolsky, Oleg<br\/>University of Pennsylvania<br\/>An Integrated Approach to Improving Design-Time and Run-Time Confidence<br\/><br\/>The proposed research addresses two ways to improve confidence in<br\/>software systems: design-time analysis and run-time monitoring. The<br\/>design-time analysis is to verify design specifications with respect<br\/>to requirements, whereas the run-time monitoring is to assure that an<br\/>implementation is behaving as required. The proposed research will<br\/>improve design-time analysis by means of domain-specific extensions to<br\/>analysis techniques and tools. An extension for a chosen domain will<br\/>be based on specification patterns typical of the domain, and on<br\/>domain-specific abstraction mechanisms. Furthermore, the design-time<br\/>analysis approach will be integrated with the run-time monitoring and<br\/>checking approach. Since the success of this integration work will<br\/>depend on the characteristics of specific domains, the identification<br\/>of such characteristics will be part of the proposed work. The<br\/>proposed work will be performed in the context of framework for<br\/>end-to-end system development of high confidence software, based on a<br\/>suite of methods and tools for the specification, analysis,<br\/>development, testing, prototyping, simulation and monitoring. The<br\/>integration of design-time analysis and run-time monitoring is the key<br\/>novel aspect of the proposed work. The proposed work will be<br\/>evaluated on a collection of applications chosen to represent domains<br\/>requiring high confidence and real-time requirements, such as embedded<br\/>systems and electronic commerce systems.","title":"An Integrated Approach to Improving Design-Time and Run-Time Confidence","awardID":"9988409","effectiveDate":"2000-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["553656","553657"],"PO":["564388"]},"47648":{"abstract":"This is the first year of funding of a 4 year continuing award. The PI will explore new ways that technology can enhance education without becoming the focus of the educational experience. The central goal is to help teachers get students interested in or even excited about careers in math and science. To this end, the PI will develop strategies and software that support the development of tangible interfaces for collaborative learning environments. Such interfaces enable the computer to \"watch\" as children work together on puzzles and other educational tasks in a physical environment, and to then act as a \"guide on the side\" that encourages and prods much as a teacher would. The PI will build on her earlier effort that produced a prototype Tangram puzzle which uses computer vision techniques to track the puzzle pieces and offers encouragement and guidance as is appropriate. Issues to be addressed in the current project include tracking multiple objects simultaneously using low cost technologies, and expressing 3D topological relations uniquely. Evaluation of this prototype and its extensions, conducted at the Goudreau Museum of Mathematics in Art and Science, will guide the evolution of the ideas and software, in this effort, which will ultimately create tools that enable instructors to develop their own tangible interfaces for collaborative learning environments. This software will be made publicly available via the world wide web.","title":"CAREER: Tangible Interfaces for Collaborative Learning Environments","awardID":"9984385","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["477225"],"PO":["565227"]},"47308":{"abstract":"ABSTRACT<br\/><br\/>(revised 5\/30\/00 -pgilna)<br\/><br\/>DBI 9983081 <br\/><br\/>Preparata Brown University <br\/><br\/>Applying Universal Bases to Achieving Full Potential of SBH<br\/><br\/><br\/>Summary<br\/><br\/>The goal of this interdisciplinary project is to establish the feasability of a more powerful and robust experimental system for the sequencing of DNA by hybridization. A conceptually novel approach is based on a new probe design and a new algorithm for sequence reconstruction which have been demonstrated by computational modeling to provide optimum information extraction in sequencing by hybridization. The probe pattern is based on a recent combinatorial result showing that the use of probes composed of natural bases and universal bases in a well defined periodic pattern is crucial for utilizing the full power of DNA hybridization chips. <br\/><br\/>The successful implementation of this new method depends on the suitable performance of universal bases (wild cards), i.e., of natural or artificial bases with the capability of \"hybridizing\" with any of the standard nucleic acid bases, on chips. This method will be tested in chemical systems in order to discover optimum patterns in the context of non-ideal behavior of oligonucleotide probes. Specific activities for the proposed grant period are:<br\/><br\/> 1. A program of experiments with oligomers incorporating universal bases.<br\/> 2. Research on the synthesis of a new best suited universal base.<br\/> 3. Matching of sequence reconstruction procedures to developed models.","title":"Applying Universal Bases to Achieving the Full Potential of Sequencing-By-Hybridization (SBH)","awardID":"9983081","effectiveDate":"2000-07-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":[121084,121085,121086,"531608"],"PO":["216753"]},"48529":{"abstract":"ABSTRACT<br\/>To overcome the limitations of current design verification methods for computer interconnect busses, this project explores application-specific heuristics that can significantly reduce the amount of fresh intellectual effort needed in verification. These heuristics are supported by a suitable integration of deductive and algorithmic methods. Separate application of deductive and algorithmic methods to verification results in either inordinate human effort or inadequate coverage due to ad hoc abstractions. This project addresses coverage by formally verifying the adequacy of abstractions using a deductive theorem prover. It reduces proof effort by carrying out much of the reasoning using automated finite-state model-checking. These ideas are explored in the context of bus-bridge connected I\/O systems and distributed shared memory systems, with verified properties including transaction orderings and formal memory models, and with case studies drawn from commercial I\/O bus standards and commercial shared memory systems.","title":"Formalization and Verification of Computer System Interconnect Busses","awardID":"9987516","effectiveDate":"2000-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["561775"],"PO":["562984"]},"51334":{"abstract":"","title":"High-Quality Tests for Synchronous Sequential Circuits","awardID":"0049081","effectiveDate":"2000-07-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550779","152126"],"PO":["201974"]},"55756":{"abstract":"The 2000 ACM SIGCOMM Conference on Communications Architectures, Protocols and Applications will be held in Stockholm, Sweden, from August 28 September 1, 2000. This conference is the premier technical meeting that examines the state-of-the-art in computer networks and communications. This proposal requests funding to assist 18 United States-based graduate students in attending this meeting. Participation in conferences such as SIGCOMM is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work in the field. The support requested in this proposal will enable the participation of students who would otherwise be unable to attend ACM SIGCOMM 2000.","title":"Student Travel Support for ACM SIGCOMM 2000; Stockhold, Sweden; August 28- September 1, 2000","awardID":"0086216","effectiveDate":"2000-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["451830"],"PO":["194325"]},"52754":{"abstract":"Ad hoc networking involves computers, typically wireless mobile nodes, that cooperatively form a network without specific user administration or configuration. In other words, ad hoc networking allows an arbitrary collection of mobile nodes to create a network on demand. This capability has numerous applications in tactical missions and rescue operations, as well as for educational and commercial use. Due to the number of applications desiring the formation of an ad hoc network infrastructure, development of this technology is currently a research priority at NSF. The work in this proposal concerns the development and performance evaluation of protocols that offer geocast communication in an ad hoc network. The goal of a geocasting protocol is to deliver a packet to a set of nodes within a specified geographical area, i.e., the geocast region. The researchers will develop and evaluate protocols that offer geocast communication to both explicityly defined groups (i.e., geocast to those mobile nodes in the geocast region that have registered with the group) and implicitly defined groups (i.e., geocast to all mobile nodes in the geocast region). The researchers will also consider both fixed geocast regions (i.e., defined by a specific geographical location) and dynamic geocast regions (i.e., defined by a dangerous moving target). The researchers will develop and evaluate (via simulation) three different approaches to geocasting: a directed flooding approach, a tree-based approach, and a mesh-based approach. They also propose to develop a hybrid approach that is based on the nature of the message to be transmitted and\/or performance considerations (e.g., if the mobile nodes have been moving slowly in the recent past, then the redundancy offered by a mesh-based approach may not be needed). Lastly, the researchers plan to incorporate predictable and controllable end-to-end quality of service when a shared tree or shared mesh approach is used. Throughout the project, they will conduct extensive simulations to determine the conditions under which each of the geocast algorithms is most effective. The researchers will vary the essential parameters in the simulations to avoid biased results, e.g., network size, connectivity, topological rate of change, and various movement\/calling patterns. In addition, the simulations will take into account some realistic limitations that have not always been addressed in prior performance evaluations, e.g., location errors that exist in widely available consumer Global Positioning Systems. The proposed project is a collaboration between two investigators who have the experience and capability necessary to complete the project successfully. The expertise of one investigator is in the mobile computing and networking area. The expertise of the other investigator is in the development of simulation models and the evaluation fo a protocol's performance. Throughout the investigation, the approach will be from a practical sense. The researchers will attend Internet Engineering Task Force meetings to obtain the current status of ad hoc protocols and to share the results.","title":"Development of Geocasting Protocols for a MANET","awardID":"0073699","effectiveDate":"2000-07-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["392036","546219"],"PO":["565090"]},"51324":{"abstract":"","title":"CAREER: Efficient algorithms for problems in combinatorial optimization","awardID":"0049071","effectiveDate":"2000-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["450928"],"PO":["279077"]},"52237":{"abstract":"Solvers for Partial Differential Equations (PDEs) are the backbone of much of scientific computing. In particular, they are the basis of Computational Fluid Dynamics (CFD), the modeling of liquid and gas flows. This project studies new, efficient methods for solving PDEs and implements those methods on modern high-performance parallel computers. These solvers are useful in areas other than their original CFD home - in particular, surprising applications to diverse areas such as image restoration and VLSI placement will be studied as well.<br\/><br\/>Technically, this project will investigate efficient algebraic multiscale algorithms for elliptic and non-elliptic PDE and CFD problems on arbitrary unstructured meshes which are suitable for distributed and shared memory parallel computing architectures. In addition, it will study how these algorithms can be extended to other large scale non-PDE problems, including image restoration and VLSI placement problems. Three aspects of these multiscale algorithms will be emphasized in this work: (1) Issues arising from making these algorithms more algebraic (for ease of use) including robustness to anisotropy, jumps and oscillations in coefficients, homogenization, etc. (2) Extension of these algorithms from their normal elliptic setting to non-elliptic and more generally non-PDE, graph-based settings. (3) Performance on modern high performance computer architectures with particular attention paid to communication and cache memory latency. Particular attention will be placed on algorithms appropriate for solving discretization matrices arising from a variety of large scale scientific computing problems such as CFD for advection dominated problems, VLSI placement an image processing. The non-elliptic behavior of these practical problems renders the known multilevel theory inadequate and serves to motivate a balanced effort consisting of algorithmic development, theoretical analysis, and practical application.","title":"Scalable Multilevel Algorithms in Computational Sciences","awardID":"0072112","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["306467","517640","135485",133275],"PO":["551992"]},"46924":{"abstract":"ABSTRACT<br\/><br\/><br\/>This project, which is being supported by the Directorate for Biological Sciences and by the Directorate for Computer and Information Science and Engineering, will fund research on mangrove forests that dominate the world's tropical and subtropical coasts, paralleling the geographical distribution of coral reefs. Ecological processes here are influenced by inputs from the land, sea, and sky, which result in extreme fluctuations of flooding, salinity, temperature, light, and nutrient availability. Mangrove-associated organisms have specialized physiological and structural adaptations that sustain them in this variable environment. Human-caused enrichment is one of the major global threats to these coastal ecosystems. Experiments show that nutrients are not uniformly distributed among or even within mangrove forests. Soil fertility can switch from nitrogen to phosphorus limitation across narrow gradients. This study will explore the relationships among physical and chemical factors, nutrients, microbes, trees, and elemental cycling on off-shore mangrove islands in Belize.<br\/><br\/>We will examine the interactions between the environment and organisms to determine how changes in nutrient inputs from natural, agricultural, or urban sources might alter the delicate balance among these ecosystem components. Mathematical models will help us predict the contribution complexity makes to the ability of mangrove ecosystems to survive both natural and anthropogenic disturbances. The results of the study will help scientists understand how to better manage and conserve mangrove ecosystems and will contribute to our understanding of biocomplexity in other ecosystems.","title":"BIOCOMPLEXITY: Collaborative Research: Microbial and Nutrient Controls in Mangrove Ecosystems","awardID":"9981457","effectiveDate":"2000-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["520508"],"PO":["345195"]},"43316":{"abstract":"PI: Maurice Herlihy<br\/>Institution: Brown University<br\/>Proposal NumberL 9912401<br\/><br\/>Abstract:<br\/><br\/>Concepts and techniques borrowed from combinatorial and algebraic topology have proved to be effective tools of for analyzing distributed and concurrent computation. This approach has yielded a variety of accomplishments, including new results and better formulations of earlier results. The research program described here is extending this work in tow directions. First, it focuses on reformulation classical notions from algebraic and combinatorial topology into a more combinatorial form better-suited to modeling computation. These notions can simplify and unify the analysis of a variety of computational modes. A second, complementary focus is on exploiting algebraic invariants uncovered by topological methods to classify the computational power of various synchronization primitives.","title":"Topological Methods in Distributed and Concurrent Computatioin","awardID":"9912401","effectiveDate":"2000-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["554181"],"PO":["543507"]},"47628":{"abstract":"As magnetic recording densities increase, powerful signal processing algorithms will need to be utilized to overcome a drop of up to 6dB in the signal-to-noise ratio. Recently, iterative decoding methods (applied to turbo codes and low-density parity-check codes) have shown to approach the channel capacity of additive white Gaussian noise channels. Simulation show that turbo codes routinely achieve coding gains up to 6dB over conventional maximum likelihood detection in magnetic recording partial response channels. A drawback of iterative decoding is a decision delay that is intolerably long for the timing recovery loop. Clearly, robust timing recovery algorithms that can operate at very low signal-to-noise ratios and can tolerate long decision delays are needed. This project is developing timing recovery methods for receivers employing iterative decoding strategies. <br\/><br\/>Since iterative decoders introduce a delay of several thousand bits, it is suggested that the waveform be asynchronously oversampled, and that the decoding delay be used to refine the sampling in an iterative schedule that follows closely the schedule of the iterative decoder. This research developing a 'soft' decision-directed timing recovery method. During the decoding iterations of an iterative decoder, soft information is passed between the processing elements. This soft information is the reliability information regarding a specific bit (or a bit-sequence) and could be used to refine the sampling instants of the received waveform. This is precisely the strategy used here. Iterative decoding is well explained by passing conditional probability information on a code-graph. Recently, it has been shown that both equalization and decoding can be performed using the same message-passing strategy on a joint channel\/code graph. The goal here is to expand this concept by formulating the entire receiver using a system graph. A suitable message-passing algorithm on the entire graph will then perform the basic receiver functions (synchronization, sampling, equalization, decoding).","title":"CAREER: Timing Recovery in Digital Magnetic Recording Systems","awardID":"9984297","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["492224"],"PO":["564898"]},"47529":{"abstract":"Abstract<br\/><br\/>PI: Michael Mitzenmacher<br\/>Proposal Number: 9983832<br\/>Institution: Harvard University<br\/><br\/>This research addresses several problems in the intersection of networks and random processes, including the design of erasure and error-correcting codes based on random graphs, the analysis of dynamic load balancing schemes, and the development of new algorithmic approaches for studying the size and structure of the World Wide Web. These problems, besides all relating to the design and analysis of networks, share a common framework: they can be embedded into models of dynamic random processes. As such, they often can be attacked using theoretical techniques such as fluid limit models and Lyapunov analysis. A major goal of this research is to develop the proper framework for using, improving, and simplifying these techniques, so that they may be applied more easily in these and other areas.<br\/>Another major goal of the proposed research is to connect theory and practice. For example, the research on codes is being applied to the problem of reliable multicast. The models for load balancing in the face of delay are being applied to systems of Web servers. As part of the effort to bridge theoretical work and practical problems in modern networks, the PI is planning a new graduate course that covers issues in information retrieval, codes, cryptography, and compression.","title":"CAREER: Dynamic Processes and Network Algorithms","awardID":"9983832","effectiveDate":"2000-07-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["560092"],"PO":["279077"]},"51952":{"abstract":"This is a standard award. Automated systems that interact with human users in spoken and written communication will greatly enhance productivity and program usability. These systems will allow friendly access to information services and are essential for people with disabilities, or for accessing databases while performing intricate tasks. Unfortunately, current technology is inadequate for the tasks at hand, and there is a need to make progress. The number of available personnel trained in the field must be vastly increased and solutions to long standing problems must be found. At this time, relatively few universities educate students capable of performing the required tasks. Leading professionals are scattered in various industrial, academic, and governmental institutions, often duplicating each other's work. This award will allow a summer workshop on language engineering to be conducted where mixed teams of leading professionals and students can cooperate to advance the state of the art. The professionals will normally be university professors and industrial and government researchers working in widely dispersed locations. Graduate and undergraduate students will join these teams. The participation of undergraduate students is intended not only as an educational opportunity, but also to broaden the appeal of the language engineering field amongst students considering graduate studies.","title":"Workshop: 2000 Language Engineering Workshop for Students and Professionals: Integrating Research and Education (WS00)","awardID":"0071215","effectiveDate":"2000-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X422","name":"DEFENSE-2000 INTENSION SUMMER"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X440","name":"DARPA-JHU RODIPASS PROPOSAL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X441","name":"DARPA-JHU SUMMER WORKSHOP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X650","name":"DEFENSE-2000 INTENSIVE SUMMER"}}],"PIcoPI":["445172","445173","168075"],"PO":["565227"]},"52689":{"abstract":"Proposal: CCR 0073469<br\/>Title: New VLSI Arithmetic Logic Schemes and Low-Power High-Performance Circuits<br\/>For Parallel and Reconfigurable Computations<br\/>PI: Rong Lin<br\/><br\/>ABSTRACT<br\/><br\/>This research investigates several basic parallel and reconfigurable arithmetic and elementary functional unit designs, architectures and algorithms. Recently developed non-binary VLSI shift switch logic schemes and low-power high-performance circuits are used for the study. A set of application specific processors, using the novel logic and the building-block circuits, has demonstrated superiority in VLSI design, which includes high-speed large-size array multipliers, reconfigurable inner product processors and reconfigurable matrix multipliers. Development of a dynamically reconfigurable platform for all of these computations is a major target of this project.<br\/><br\/> The new logic schemes primarily employ shift switch parallel counter units as logic operators, and 4-bit digital signals, representing values ranging from 0 to 3, as logic operands, where only 2-out-of-4 signal bits are subject to value-change at any logic stage in the worst case. This is used to simplify the circuit designs and to reduce the power-dissipation. The main focus of this research is to further explore the properties and advantages of the logic schemes and circuits, and to develop superior applications for parallel and reconfigurable computations. A significant impact on the next generation of microprocessors and SOC designs is expected.","title":"VLSI Arithmetic Logic Schemes and Low-Power High-Performance Circuits for Parallel and Reconfigurable Computations","awardID":"0073469","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[134347],"PO":["180163"]},"48828":{"abstract":"Frankl, Phyllis G.<br\/>Polytechnic University, Brooklyn, NY<br\/><br\/>Techniques for Testing Database Applications<br\/><br\/>Databases play in important role in almost every modern<br\/>organization. Although considerable research effort has been devoted<br\/>to assuring correctness and efficiency of database management<br\/>systems, little attention has been paid to assuring the correctness<br\/>of the application programs that run on these systems. Failure of<br\/>database application programs can have severe economic impact, so<br\/>development of techniques for testing them is of obvious importance.<br\/>This research project involves development of software testing<br\/>techniques targeted specifically to database application programs. It<br\/>includes development of techniques for generating database states<br\/>that are useful for testing the given application and techniques for<br\/>checking the database state after running a test. The techniques<br\/>studied are partially automated, relying on the user to supply some<br\/>information and deriving other information automatically. They use<br\/>the integrity constraints described in the database schema as a<br\/>source of information to aid in test generation and checking. A<br\/>prototype testing tool is being developed. Preliminary evaluations<br\/>of the effectiveness and usability of the techniques will be<br\/>performed with the aid of the tool prototype.","title":"Techniques for Testing Database Applications","awardID":"9988354","effectiveDate":"2000-07-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["528387"],"PO":["564388"]},"52866":{"abstract":"The unprecedented growth in the number of networked users and the emergence of high-bandwidth end-user applications impose new challenges in the design of architectures for next-generation computer networks. Optical networks, employing Wavelength Division Multiplexing (WDM), transcend the bandwidth limitations of electronic networks by utilizing the enormous capacity of the optical fiber. Though this technology looks extremely promising, large-scale deployment of such optical networks in the future depends on a rapid convergence of communication network requirements and physical network realities. The focus of the proposed research in optical networks is to facilitate this process, by tackling several system-level challenges while acknowledging the limitations of existing devices. Wavelength Division Multiplexing of numerous multi-gigabit\/sec channels is being deployed right now on existing and new fiber infrastructure in respones to explosive growth in both local and long-haul digital traffic. WDM deployment is surging because capacity may be economically provisioned by activating additional wavelength channels on existing fiber plant. However, as the fiber capacity grows, increasing strain is placed on the capacity of costly electronic switches at network nodes and access points. A reconfigurable transparent optical network seeks to provide a low-cost alternative by ensuring that the signal leaves the optical domain only at the source and destination, thereby avoiding unnecessary opto-electronic conversion. There are, however, fundamental limits imposed by physical-layer impairments that limit the length of end-to-end connections in transparent optical networks. Connections that span several nodes and large distances may acumulate severe impairments imposed by fundametal physical constraints such as fiber dispersion and nonlinearties, spontaneous emission noise, and device imperfections such as crosstalk. Since the physics of point-to-point communications performance is well understood experimentally and theoretically, it has been argued that nation-scale networks will avoid physical-layer impairments by deploying point-to-point WDM with electronic regeneration at each node. Such a network is called an opaque optical network. Unlike the case of point-to-point links and physical-layer optical devices, the analysis and simulation of complex all-optical or hybrid optical-electronic networks is still in its infancy and well-tested tools are only now being developed. The goals of this project are to propose, evaluate and study designs for the next-generation high-bandwidth WDM-based optical networks, which are compatible with the physical-layer characteristics of optical devices. In particular, the researcher plans to investigate the following research topics: Sparse Regeneration and Translucent Optical Networks: There has been a great deal of discussion regarding transparency vs. opacity in (national-scale) optical wavelength devision multiplexed (WDM) networks [11]. In [22], the researcher introduced the notion of a translucent optical network - a network which supports selective regeneration of optical signals within the network. The researcher's study showed that, for medium-scale networks translucency can help to improve the overall network performance. For larger-scale networks, where impairments introduced by fiber nonlinearities and dispersion cannot be ignored, the researcher anticipates that a higher degree of opacity may be needed to combat signal degradations, but this is an open problem for further research. The researcher also plans to investigate the effect of a few signal regenerators at select locations in a nation-wide WDM network. Routing and Wavelength Assignment with Power Considerations: Routing and wavelength assignment (RWA) is an important problem that arises in wavelength division multiplexed (WDM) optical networks. Previous studies have solved many variations of this problem under the assumption of perfect conditions regarding the power of a signal. The researcher propose to investigate this problem while allowing for degradation of routed signals by components such as taps, multiplexers, switching elements, fiber links, etc. The researcher plans to include novel amplifier and other device models to characterize the performance of the networks.","title":"Design of Translucent Optical WDM Networks","awardID":"0074121","effectiveDate":"2000-07-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["559287"],"PO":["565090"]},"51337":{"abstract":"","title":"POWRE: Techniques in Approximation Algorithms and Polyhedral Combinatorics for Problems in Network Design and Routing","awardID":"0049084","effectiveDate":"2000-07-01","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["450928"],"PO":["557609"]},"43318":{"abstract":"This research project explores an emerging and potentially<br\/>important area of distributed computing: interactive distributed<br\/>applications that involve mobile users with disparate network<br\/>connections and computing devices. Specifically, the project<br\/>addresses the design of group communication protocols for<br\/>reliable multicasting, event synchronization, and leadership<br\/>control. Key issues include how such protocols adapt to network<br\/>dynamics produced by mobile nodes and how they accommodate<br\/>performance differences among network connections and hardware<br\/>platforms. The project investigates the integration of three<br\/>host-level techniques to support group communication: enhanced<br\/>network interface card functionality, new operating system<br\/>services, and user-level\/proxy-based protocols. In addition to<br\/>analysis and simulation, the project involves extensive<br\/>experimentation on a research testbed. Expected results include:<br\/>new protocols and implementation techniques for use by software<br\/>developers; performance data on the merits and deficiencies of<br\/>various development techniques; and a framework for developing<br\/>and testing new applications. On a broader scale, improving the<br\/>underlying support for interactive distributed applications<br\/>enhances their performance and makes them more accessible to<br\/>domains such as education, science, and public safety.","title":"Host-Level Protocol Support for Interoperable Distributed Computing","awardID":"9912407","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["472159"],"PO":["309350"]},"47806":{"abstract":"Current low power technology focuses on low power hardware designs<br\/>and OS-level power management. In contrast, compiler support for <br\/>low-power is still in its infancy, mainly due to the fact<br\/>that most classical optimizations for speed and space <br\/>typically reduce a program's overall power consumption as well, <br\/>making power as a separate optimization objective redundant. <br\/>However, recent trends and developments in architecture and OS <br\/>design have made power dissipation an optimization objective in its<br\/>own right. These recent developments are (1) more advanced OS-level <br\/>power management support, (2) availability of low-power wireless <br\/>communication, and (3) reconfigurable architectures with dynamic <br\/>voltage scaling capabilities. This project investigates low-power <br\/>optimizations in the context of the Java programming language. Java <br\/>has become the language of choice for portable programming across a <br\/>variety of different architectures, including mobile computers, <br\/>personal digital assistants (PDA), and embedded systems. Such devices <br\/>rely on battery power for significant periods of their up-time, if <br\/>not during the entire time of their operation, making power savings <br\/>a crucial issue. The new low-power optimizations may trade-off <br\/>execution time for power savings. They include application-driven <br\/>power management, location-aware method\/task mapping to remote <br\/>servers, and instruction scheduling for reconfigurable architectures <br\/>with dynamic voltage scaling.","title":"CAREER: Compiler Optimizations for Low Power","awardID":"9985050","effectiveDate":"2000-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["421129"],"PO":["565272"]},"51338":{"abstract":"","title":"Research at the Frontier of the Physical Layer","awardID":"0049085","effectiveDate":"2000-07-01","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[131015,"223414"],"PO":["188393"]},"55507":{"abstract":"The investigator and his colleagues organize a workshop to<br\/>explore opportunities in robotics for synergistic collaborations<br\/>among engineers, computer scientists, and mathematicians. The<br\/>workshop brings together engineers, computer scientists, and<br\/>mathematicians to discuss examples of research needs in robotics,<br\/>to look for common themes, and to explore new ideas, rooted in<br\/>mathematics, that could advance this area. A major product of the<br\/>workshop is a report that summarizes the present state of the art<br\/>and that lays out future opportunities for collaborative<br\/>research.<br\/> Robotics is concerned with the design of mechanical<br\/>manipulators, the systems needed to control them, and various<br\/>applications such as materials handling, assembly, exploration in<br\/>extreme environments, prosthetics, and minimally invasive<br\/>surgery. For their solution, problems in robotics have drawn<br\/>heavily on techniques and ideas from engineering and computer<br\/>science. It is becoming apparent that progress on significant<br\/>open problems requires greater involvement of modern mathematics.<br\/>This workshop combines engineers, computer scientists, and<br\/>mathematicians in a joint exploration of needs and opportunities<br\/>in robotics. The workshop report is expected to stimulate both<br\/>new interactions among researchers and new insights and<br\/>approaches to this important class of problems.","title":"An NSF Workshop on Mathematics and Robotics","awardID":"0085339","effectiveDate":"2000-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}}],"PIcoPI":["547027"],"PO":["562372"]},"51713":{"abstract":"William D. Banks<br\/><br\/> This research will focus on two somewhat distinct areas of number theory. First, the investigator will continue to study the Whittaker-Fourier coefficients of metaplectic forms, with a view to seeking new arithmetical and analytical applications in number theory, such as improved average value results for L-series attached to n-th order Hecke characters, and generalizations of the Bump-Hoffstein conjectures for L-functions on GL(n). Second, the investigator and his colleagues will continue their joint research in number of areas of cryptography, including the development of efficient identification schemes, new techniques of encryption, and further results in the theory of pseudorandom functions.<br\/><br\/> Automorphic forms (such as those associated to elliptic curves) play an important and central role in modern number theory, allowing the powerful tools of complex analysis to come to bear on arithmetical questions. Metaplectic forms are a natural (though more mysterious) generalization of automorphic forms whose construction intimately depends on very deep results of class field theory (in particular, the higher order reciprocity laws). While the study of metaplectic forms in still in its infancy, the results of this proposed research will prove to be very exciting. The second part of this proposal focuses on cryptography, the rapidly developing field of mathematics\/computer science that deals primarily with information security. The investigator and his colleagues plan to continue their work on identification schemes for use with credit\/smart cards, encryption algorithms, and questions related to the theory of pseudorandom functions.","title":"Metaplectic Forms and Cryptography","awardID":"0070628","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["329896"],"PO":["562466"]},"52516":{"abstract":"The focus of this research is the design and evaluation of hardware assists and software profiling techniques that allow better utilization and performance of the memory hierarchy of high-performance systems. The overall goal is to lessen the impact of the increasing speed discrepency between processors and the various levels of the memory hierarchy.<br\/><br\/>The research methodology will compare the results of offline, optimal algorithms with algorithms that can be feasibly implemented in a memory system, to guage the performance increase possible from prediction triggering, indexing, prediction mechanisms, and feedback. This methodology will be applied to three specific problems: Dynamic line size choice, replacement algorithms for caches with large associativities, and prefetching in lower levels of the memory hierarchy.","title":"Using Predictor Paradigms to Enhance Memory Hierarchy Performance","awardID":"0072948","effectiveDate":"2000-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[133935],"PO":["180163"]},"47819":{"abstract":"This is an NSF CAREER\/PECASE grant proposal for research into a new Architecture for wide-area, Dynamic Adaptive Systems (ADAS). The decreasing cost of computing and networking technology and network-enabled devices is enabling the large-scale deployment of a wide-area infrastructure that operas many new and innovative services (e.g., a service that allows a user to control the lights in a room).<br\/> Unfortunately, wide-area network deployment has not yielded the expected improvements in access to new and existing devices, services, and networks. Each of these areas faces significant problems: end devices that are more powerful than earlier generations, but are still very limited and fragile relative to their fixed counterparts; many services are developed with the static assumption of high-bandwidth and low-latency networks and thus perform poorly in the low bandwidth, high-latency wide-area environment; networks that have different capabilities (e.g., bandwidth, latency, cost, coverage) making reconciliation of these differences difficult for many services.<br\/> This CAREER grant proposal addresses two key problems of wide-area services: (1) Dynamically adapting to the current conditions and environment at each level of the service and network, and (2) Locating the appropriate service for a task.<br\/> Adaptive systems are a necessary response to the significant performance problems associated with accessing services in the wide-area. A dynamically adaptive system continually changes based upon changing conditions at multiple levels: link, network, and service, yielding a significant improvement in the perfor-<br\/>mance and usability of services.<br\/> Most networks make a fixed tradeoff between reasonable performance under worst-case conditions and performance under best-case conditions. However, for a fixed design point, best-case performance usually suffers. Previous research efforts have primarily focused on only one aspect of adaptation. What makes this<br\/>grant proposal unique is a plan for developing a new architecture that supports novel, dynamically adaptive services and enables anywhere, anytime, any mode access to services.<br\/> The first step is to produce software tools, applied theoretical and simulation results, and an experimental testbed, all of which will aid researchers working with new models for wide-area service construction, deployment, and access. The second step is to use more mature versions of these tools in a large-scale experiment focused on two areas: improving the undergraduate and graduate academic experience in two courses and providing new undergraduate research opportunities in the intersection between mobile computing, wireless networking, and wireless telephony.<br\/> This work builds upon the our research in the following areas:<br\/> (1) Information Exposure and Multi-level Dynamic Adaptation. A key enabler for adaptation is the exposure of metadata between link, network, and service levels (e.g., a service can inform the link layer of its latency and reliability quirements). This technique will depend upon the development of theoretical models for the predicted state of a wireless link, upon based upon extensive experimental<br\/>and simulation research.<br\/> (2) Providing high-performance, wide-area access to services. The researcher strongly believes that \"Access is the killer application.\" Decoupling user interfaces from communication and dynamic adaptation are the keys to delivering high-performance.<br\/> (3) Large-Scale Deployment of Wide-Area Information Access. An important component of the research is conducting large-scale testbed experiments in both research and academic settings. Graduate and undergraduate students will be included in the project's research by leveraging the significant hardware and software testbed being deployed by related projects at UC Berkeley.<br\/> These research directions will work together in a synergistic fashion, where theoretical, analytical, and simulation results guide the development of useful software infrastructure components | components that will be deployed in a large-scale research and academic testbed, providing a unique opportunity for significant<br\/>research and academic use of the results by both undergraduate and graduate students.<br\/> Since the ADAS framework is really an abstraction and synthesis of many earlier ideas, the research results from this effort should be of interest to users of a broad class of wide-area information access services and applications, not merely those who choose to use ADAS software. These results will be applied within the ADAS architecture to a variety of service and information access challenges.","title":"CAREER: An Architecture for Building Dynamic, Adaptive Systems","awardID":"9985129","effectiveDate":"2000-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["427181"],"PO":["565090"]},"54949":{"abstract":"This is a grant to support a workshop on Algorithmic Issues in Modeling Motion to be held at Duke during August 2000.<br\/><br\/>Representations of motion are central to all computational disciplines dealing with modeling the physical world. This grant will support a direction-setting workshop on algorithmic issues in modeling motion. About 20 research leaders from a variety of fields, such as computational geometry, computer graphics, robotics, spatial databases, molecular dynamics, and computer vision will participate. Currently, each of these fields has its own methods for handling moving objects. By bringing together these experts in different areas, unified approaches and new techniques for representing, processing, reasoning, analyzing, searching, and visualizing moving objects will be developed. The workshop will produce a final report.","title":"Algorithmic Issues in Modeling Motion","awardID":"0083033","effectiveDate":"2000-07-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["554177"],"PO":["179846"]}}