{"19291":{"abstract":"9700285 Nemhauser This research involves the development of solution methods for mixed-integer programming problems. The objective of a mixed-integer programming problem is to maximize a function subject to linear inequality (or equality) constraints and integrality restrictions on some or all of the variables. The goals of the research are to develop new methodology, algorithms, and prototype software for solving this class of programming problems. The research addresses two specific problem domains, stochastic integer programming and set partitioning, which have heretofore not received much attention. The researchers will investigate linear programming-based approximation methods, parallel integer programming, and decomposition techniques as methodologies for obtaining robust solutions to these difficult combinatorial problems. The research results are to be implemented in openly distributed software systems, and will thus be accessible throughout the research community. Mixed-integer programs have broad application in solving problems that arise in logistics and distribution, production planning, aircraft (flight and crew) scheduling, and resource allocation. It is likely that tremendous progress in the size of problems that can be solved and in the time it takes to solve them will come from parallel computing, and thus this research has high potential to improve decision-making in such large-scale systems.","title":"Research in Large-Scale Integer Programming","awardID":"9700285","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["565101","210152","284091"],"PO":["185422"]},"29370":{"abstract":"","title":"Proposal for a Model Ethics Center for Engineering & Science on the World Wide Web","awardID":"9796234","effectiveDate":"1997-07-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7410","name":"DUE COURSE & CURRICULUM PROG"}}],"PIcoPI":["373254","257815"],"PO":["288903"]},"14092":{"abstract":"This project covers the development and analysis of new algorithms for weighted least-squares problems and their applications. In many practical applications, the weights vary by large factors, giving rise to ill-conditioned cases. In the past decade several authors independently proved a norm bound for this case of an ill-conditioned weight matrix. In previous work the PI followed up on this norm bound with the discovery of a stable algorithm for weighted least squares. ``Stable'' means that the accuracy of the algorithm is not affected by ill- conditioning of the weight matrix. The norm bound and the stable algorithm turn out to have several unexpected applications. For example, a new interior point method was discovered whose running time, unlike for all previous interior point methods, does not depend on the numerical data of the objective function. Also, a way was found to stably solve a class of finite element methods on which previously known algorithms would have failed. In this research project, weighted least-squares problems will be pursued along several lines: (1) iterative methods for weighted least squares will be developed, as well as improved sparse-matrix methods, (2) results for linear programming will be extended to semidefinite programming, (3) new algorithms will be invented for the highly nonlinear problems arising in electric power networks, which have at their core a generalized weighted least-squares problem, and (4) inverse finite element problems will be addressed. The outcome of this project will be more accurate and more efficient algorithms for optimization and simulation problems arising in science and engineering.","title":"Applications of Weighted Least Squares","awardID":"9619489","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["260339"],"PO":["179846"]},"19262":{"abstract":"This research is concerned with algorithmic problems relevant to the design, maintenance, and management of high speed communication networks. High-speed integrated communication networks are going to be the most important communication platform of the future, presenting new technological challenges. The essence of many of these technological problems is the interactability of certain simple network problems, such as routing and packet scheduling. The research is concerned with developing fast and simple approximation algorithms for these combinatorial problems. Such algorithms can serve as tools for successfully answering these challenges. Some of the more promising approaches will be tested on real network data. Designing efficient methods to get packets of information across a communication network is one of the main problems in implementing Broadband Integrated Services Digital Network(BISDN) standards, such as ATM (Asynchronous Transfer Mode). The packet routing problem is simply that of moving packets in a communication network from their sources to their desired destinations quickly, reliably, and using as few resources as possible. A solution to this problem consists of two distinct (though by no means independent ) parts: a selection of paths for the packets (routing) and a schedule of the motion of packets along their selected paths (packet switching). The main thrust of the research is on the two basic algorithmic issues: routing and packet switching. The combinatorial essence of many real-life routing problems is the disjoint paths problem. Research directions for the routing problem include both off-line and online problems with worse-case, and competitive analysis, respectively.","title":"Algorithmic Issues in Communication Networks","awardID":"9700163","effectiveDate":"1997-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["516907"],"PO":["528421"]},"19273":{"abstract":"The focus of this project is a new family of algorithms that has been recently developed within the Computational Learning Theory community. Algorithms in this family do multiplicative updates to their parameters instead of the usual additive updates characteristic of the standard gradient descent methods. The algorithms from the new family have radically different behavior from the algorithms of the gradient descent family. The new family of algorithms is particularly useful when the input dimension is large and the best parameter setting is ``sparse'' -- having only a few non-zero parameters. In many simple settings, the new family has proven loss bounds that grow only logarithmically in the total number of parameters when the best parameter setting uses only a few parameters, whereas the standard algorithms can easily be forced to have loss proportional to the number of input variables for the same targets. This indicates that the new family of algorithms is likely to be particularly effective in settings where the input dimension is large (such as in Information Retrieval) or where a small number of inputs are expanded to a large number of non-linear basis functions over the original inputs. The goals of the research are to extend the new family of algorithms, quantify the qualitative differences between the new family and existing algorithms, and to demonstrate the practical importance of the new family.***","title":"Amortized Analysis for On-Line Learning Algorithms","awardID":"9700201","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["92323","527386"],"PO":["150516"]},"19296":{"abstract":"The project will (1) assess the efficiency and effectiveness of investments in information technology (IT); (2) identify the organizational and IT management practices associated with achieving greater value through IT, and (3) disseminate result in academic, business and policy circles. These issues will be addressed at firm, industry, and country levels, based on several large, detailed, longitudinal databases that will be coupled together for more robust analysis than was heretofore possible. The study will include data on IT in five to 15 industry sectors in 50 countries from 1980-95, and on 200 large US firms for the 1990-95 period. Existing databases will be updated annually, and new databases will be built. The study will shed new light on whether, how, and why IT makes a difference in effectiveness and efficiency across a global spectrum of use, helping to clarify our understanding of the well-known \"productivity paradox\". It will produce a definitive body of research that uncovers the potential payoffs from IT investment and illuminates the mechanisms by which they can be harnessed.","title":"Contributions of IT Investment to Economic Performance","awardID":"9700316","effectiveDate":"1997-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0403","name":"Division of SCIENCE RESOURCES","abbr":"NCSE"},"pgm":{"id":"8802","name":"RESEARCH & DEVELOPMENT STATIST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8804","name":"SCIENCE & ENGINEERNG INDICATRS"}}],"PIcoPI":["540305","426259","439054"],"PO":["495796"]},"19880":{"abstract":"Rapid advances in computer communication technology will soon enable a global information network that will have an unprecedented impact on our daily lives. Two key issues will need to be addressed for this to be successful: integration of services, and guarantees of service quality. High speed networks will carry audio, video, and data traffic from many diverse applications; unlike traditional networks, they will need to provide guarantees of Quality of Service (QoS) to applications, as required. However, application-level QoS requirements are best specified in terms meaningful to the application, while network level QoS requirements are best specified in terms meaningful to the network. The problem is to map between the two. This problem is further exacerbated by the existence of multiple intermediate protocol layers between the application layer and the network layer, as well as the specification of service quality using different parameters at the various layers. Thus a key challenge in the deployment of high speed networking systems is the understanding and development of accurate QoS transformation algorithms that request the minimal network resources to satisfy a specific application requirement. Without such an integrated, holistic treatment of the QoS issues, application users will not see the projected performance increases and may end up requesting more network resources than necessary. This research project will address several fundamental questions on application performance in high speed networks that provide QoS guarantees, and study the relationship between network level QoS and application level QoS in general. Results obtained by simulation and theoretical analysis will be validated empirically. The education component of the career development plan will include mentoring activities for women and minority graduate and undergraduate students with the objective of encouraging them to pursue research and higher education in the networking and communications area. Further, a new course on QoS issues for applications will be developed with the first offering as a research seminar. A final component of the education plan will be to develop innovative laboratory exercises on wide area networking technologies to enhance classroom understanding of concepts. WWW: http:\/\/www.pitt.edu\/~sujata","title":"CAREER: Application Performance Guarantees in High Speed Networks","awardID":"9702389","effectiveDate":"1997-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["84604"],"PO":["234222"]},"19363":{"abstract":"Humans and robots have need to work together in factories, in nuclear facilities, in space and in medicine. To make the interaction inherently safe, this research is investigating the concept of controlled passive robotic interface. The interface under study is essentially an arm with only dissipative (brakes or clutches) or conservative (transmissions) coupling between joints. No motors are used. Forces applied at the end of the arm result in motion that can be computer controlled according to the purposes of the device: to follow a prescribed path, to restrict access to some regions of the workspace, or to provide a haptic display representing the nature of a virtual or remote environment. Experiment and analysis will produce a model of the human-machine interaction. An experimental test bed developed under prior funding will be enhanced to support the current research. At the same time a much smaller scale device is planned with a focus on haptic displays, enabling wider exploration of the range of potential applications of the basic concept. Experiments will be conducted on the device and on its interaction with a human user. The information transmission capability and the trajectory enhancement capability are two related aspects to be studied experimentally and incorporated into the model of interaction. Theoretical studies will be conducted to predict the bounds on the performance to be expected with different controllers.","title":"Passive Actuation for Robotic Devices in Contact with Humans","awardID":"9700528","effectiveDate":"1997-07-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["167538"],"PO":["475621"]},"19892":{"abstract":"The core of this project is to investigate the design and implementation of a Field-Programmable Mixed analog and digital Array (FPMA) analogous to the concept of a Field-Programmable Gate Array (FPGA) for implementing various mixed-signal circuits. An FPMA as an integration of a Field-Programmable Analog Array (FPAA), FPGA, and Reconfigurable Data Converter (RDC) will be developed. An FPMA will contain: (1) an FPAA that integrates a general purpose FPAA and dedicated cells to realize various sampled-data and continuous-time circuits found in mixed- signal systems, (2) an area-efficient FPGA that combines a data-path FPGA and a bit-level FPGA to realize data-path circuits, finite state machines, and random logic, and (3) an RDC that can be configured to realize a number of high accuracy ADCs and\/or DACs with different throughputs and resolutions for interfacing analog and digital signals.","title":"CAREER: Field-Programmable Mixed Analog and Digital Array","awardID":"9702473","effectiveDate":"1997-07-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["71498"],"PO":["562984"]},"19595":{"abstract":"The goals of this research are to improve the computational efficiency of error-correcting codes and to apply techniques from this effort to other problems of computation and information theory. Error-correcting codes are essential components of all electronic communication systems. New constructions for error-correcting codes that could be encoded and decoded very efficiently have recently been developed. The objectives of this research are to extend this initial work by: Improving the error-tolerance and speed of the explicit constructions of error-correcting codes based upon previously developed codes. Developing algorithms that can certify the quality of the randomized constructions. Using related techniques to improve the computational efficiency of other tasks vital to information theory and electronic communication. Developing quality implementations of the codes that will make it easier for engineers to test how these codes would perform in their own application areas. The educational goals of the proposed investigation are broader in scope. They involve the design of classes that teach graduate students about the larger mathematical framework on which this research rests. These classes should attract students from mathematics as well as computer science to learn about the new fascinating ways in which ideas from mathematics can be applied to solve important problems in computer science. These classes are designed to teach how connections in research are made as well as provide them with many areas ripe for connection. Eventually, these classes will teach the students another essential element of the principal investigator's research methodology: that of using computational experiments in mathematical research. They will learn how one can use computer experiments to make and test combinatorial conjectures. As they begin to see the computer as a tool that can aid them in their own research, they will inevitably become concerned with the efficie ncy of computational algorithms and gain intuition for which mathematical ideas might result in practical algorithms.***","title":"CAREER: Computationally Efficient Error-Correcting Codes and Their Applications","awardID":"9701304","effectiveDate":"1997-07-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["483530"],"PO":["528421"]},"29463":{"abstract":"","title":"Design of Mobile Computing and Communication Systems with Mobile Base Stations","awardID":"9796331","effectiveDate":"1997-07-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["462892"],"PO":["250083"]},"19223":{"abstract":"Most combinatorial optimization problems are NP-hard, and hence unlikely to have a polynomial-time algorithm that finds an optimal solution. This project investigates the design of algorithms that find near-optimal solutions but also come with a guarantee that the solution is not too much worse than optimal. This research investigates algorithms that produce solutions guaranteed to be nearly-optimal by relying on information contained in the optimal solution to linear programming relaxation. One consequence of such results would be to provide a theoretical justification for the strength of the bounds given by these linear programming relaxations. By giving algorithms for which one can prove that the solution found has value relatively close to the LP bound, one also shows that relative error of the solution(compared to the integer optimum) is also small. Furthermore, past experience has shown that the insight needed to devise algorithms with such performance guarantees can also lead to algorithms with superior empirical performance. The research focuses on several specific areas in which computational experience has indicated that particular linear programming relaxations provide strong bounds and attempts to build on this to design approximation algorithms with good performance guarantees and good practical performance. Scheduling problems arise in a cross- section of applications, and the proposal focuses on several basic scheduling models, with the aim of developing algorithmic techniques that are not particularly application specific. Facility location problems are a type of network design problem in which the aim is to build a distribution network consisting of facilities and routes used to serve clients from the facilities. Known relaxations produce extremely high-quality bounds and the research will attempt to provide some theoretical justification for this, as well to devise new algorithms that also build on these. The traveling salesman problem is per haps the canonical optimization problem, and this investigation will try to resolve a well-known conjecture on the strength of the so called Held-Karp lower bound. For the bin-packing problem, this research will focus on a conjecture that there exists a polynomial-time algorithm that uses at most a constant extra bins, and is based on the cutting-stock LP formulation. For some other problems, such as the maximum acyclic sub-graph problem, in addition to the LP-based approach described above, this investigation will also explore algorithms based on convex programming relaxations, which have recently been used to strengthen linear relaxations in some settings. The ultimate goal of this research is to devise algorithms that will not just complement the ongoing computational work in polyhedral combinatorics with a theoretical foundation, but will also develop algorithmic implementations to solve these applications more easily.***","title":"Approximation Algorithms via Linear Programming","awardID":"9700029","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["562312"],"PO":["528421"]},"19785":{"abstract":"9701973 Distributed object computing is a new computational paradigm in which independent software objects interact with each other over a distributed computing network. A key promise of distributed object computing is that it may greatly simplify the construction of distributed software systems. However, it also introduces enormous problems in ensuring the integrity of interactions between objects and the reliability of system execution. The objective of this research is to investigate mechanisms for ensuring the integrity of the computational interactions in distributed object systems. In particular, the design, implementation and empirical evaluation of two classes of mechanisms are investigated: (1) formal interface specifications, which allow precise definition of object interface semantics and provide a means for automatically checking conformance to interface semantics during execution; and (2) methods for systematically testing distributed object systems in a minimally invasive manner. The significance of this research is that it addresses those attributes of distributed object systems that make them ill-suited to the use of traditional software validation techniques. An additional objective of this project is to enhance the software engineering curriculum with content that teaches how the fundamental tenets of software engineering both influence and are influenced by the unique aspects of distributed object technology. ***","title":"CAREER: Mechanisms for Ensuring the Integrity of Distributed Object Systems","awardID":"9701973","effectiveDate":"1997-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[50113],"PO":["564388"]},"11590":{"abstract":"This projects seeks efficient algorithms for learning complex concepts from examples and other kinds of information. A major focus on the \"other kinds of information\" that may serve to reduce the computational difficulty of learning complex concepts, including queries to a teacher, advantageous order of presentation of examples, the presence of related concepts, and constraits imposed by real-world situations (e.g., robot navigation, language learning). New models of interaction between a teacher and a learner will be developed and explored. Techniques from computational complexity, the theory of automata and formal languages, the analysis of algorithms, and cryptography will be used to define and explore models of efficient learnability.","title":"\"Theory of Learning Algorithms\"","awardID":"9610295","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["409428"],"PO":["150516"]},"19863":{"abstract":"This research is on asynchronous (self-timed) VLSI circuits. High performance design, and testing of self-timed circuits are being investigated. Research focuses on developing tools and methodologies in the following areas. First, a new data transmission scheme for self-timed VLSI systems, the bounded-skew protocol, is being defined. Second, techniques and tools to test self-timed circuits with special emphasis on modeling and testing the actual delays in asynchronous circuits are being developed. Third, methods to reduce power consumption in self-timed circuits by trading concurrency for power and using voltage scaling techniques are being examined. Finally, the potential of asynchronous VLSI design is being demonstrated through implementing prototype VLSI chips in arithmetic and signal processing applications.","title":"CAREER: Making Asynchronous Design Practical","awardID":"9702302","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485984"],"PO":["564898"]},"29444":{"abstract":"","title":"CAREER: Mixed Integer Programming-Parallelism and Applications to Statistical Analysis","awardID":"9796312","effectiveDate":"1997-07-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["496947"],"PO":["187585"]},"39036":{"abstract":"","title":"Adaptive Power Control & Link Quality Maintenance in Wireless Communication Networks","awardID":"9896365","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[99057],"PO":["565090"]},"20381":{"abstract":"In telecommunications, video-technology, and multimedia applications, a real challenge is posed by some genuinely nonlinear problems for the solution of which, unlike in the linear case, a final unified theory is not yet available. Such nonlinear problems include cancellation of large nonlinear distortion in very-large-scale electronic circuits and systems (VLSI), nonlinear sharpening of contrast in noisy images, modeling and identification of nonlinear signal and image sources, and content-based nonlinear compression and decompression of signals and images. The goal of the current project is to develop a rigorous and yet practical framework for the design\/synthesis of nonlinear analog, digital, and mixed mode filters for the solution of the above types of nonlinear problems. The approach followed in this project is based on an Generalized Fock (GF) space framework developed by the PI (R.J.P. deFigueiredo), T.A. Dwyer, and L.V. Zyla. A GF space is a reproducing kernel Hilbert space of discrete- or continuous- parameter Volterra functional series with a problem-dependent weighted inner product. In the context of a given application-specific problem, the optimal nonlinear filter structure is obtained by an orthogonal projection of the desired filter into the subspace spanned by the representers of interpolating, smoothing, and other design constraint functionals in an appropriate GF space. A number of analysis, synthesis, and implementation issues constitute the focus of the investigation.","title":"Fundamental Theory and Techniques for Nonlinear Signal Processing","awardID":"9704262","effectiveDate":"1997-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[51468],"PO":["564898"]},"20074":{"abstract":"Future mobile computing environments will need to support communication intensive applications such as Web browsing, multimedia conferencing, etc. This requires providing sustained quality of service over scarce and shared wireless links. In the wireline domain, similar resource sharing problems have led to the development of Integrated Services Packet Networks (ISPN) that support multiple service classes for different applications. A similar solution is appropriate in the cellular packet network domain, particularly because application demands will be even more varied, and system resources even more stringent. Three concerns are critical in our environment: (a) applications should be shielded from underlying network dynamics as much as possible, (b) user mobility between cells should be seamless, and (c) due to scarcity of resources, network utilization should be maximized. In this project, we propose to provide an Integrated Services Cellular Packet Network (ISCN), which supports quality of service in mobile computing environments. There are three key ideas in our proposal: (a) we propose Adaptive Services, which provide QoS guarantees\/assurances within bounds and support an enhanced set of QoS parameters for wireless channel error and mobility; (b) we propose new algorithms for resource adaptation in order in increase the network utilization in the presence of mobility; and (c) we propose new algorithms for predictive advance reservation in order to provide seamless mobility for users across multiple cells in the ISCN. For more project details and publications, please refer to the following URL: http:\/\/timely.crhc.uiuc.edu\/projidx.html","title":"CAREER: Quality of Service in Mobile Computing Environments","awardID":"9703409","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["125047"],"PO":["565090"]},"23132":{"abstract":"9712081 Wongsaroj, Ben Florida Memorial College CISE MII: FMC\/FIU Integrated Dual Engineering and Enhanced Computer Science Program This proposal supports the development of a plan that integrates the Dual-Degree\/Pre-Engineering Program at Florida Memorial College, a historically Black institution, with Florida International University's Engineering and Computer Science bachelor degree programs. The endeavour is expected to increase the retention and graduation rates of FMC computer science students by giving them access to FIU's advanced research facilities and of FMC pre-engineering students by allowing them to register for FIU upper-level engineering classes, including computer engineering. Graduates will be positioned for employment after graduation and for entrance into graduate programs at FIU by the enhancement of the computer science and pre-engineering programs at FMC. The net effect will be to increase the number of minority computer scientists and engineers in the workforce. The integration of the programs utilizes strong collaboration between the faculty at FMC and FIU through distance learning, parallel course development, and collaborative computing through the Internet. Hands-on laboratory exercises and design projects create an exciting and innovative academic environment. A structured and well-organized management process is being developed through which the responsibilities of all personnel can be delegated and an attainable schedule for appropriate milestones developed.","title":"MII: Integrated Dual Engineering\/Enhanced Computer Science Program","awardID":"9712081","effectiveDate":"1997-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[58096,"194525","194404",58099,58100],"PO":["297837"]},"14211":{"abstract":"9619843 This research project lies in the area of developing expressive type systems for programming languages. Expressive type disciplines enable more programs to typecheck, and thus support more diverse styles of programming. Constrained types are a new type form that is particularly rich, but many research challenges must be solved before they will be practical. Constrained types are studied with the aim to increase type expressiveness, as well as to apply constrained types to program analysis: these types have recently been shown to be isomorphic to well-known flow analysis algorithms performed by compilers. The project will explore this flow-types duality to (1) Systematize and add rigor to flow algorithm descriptions; (2) Improve the precision of type systems; (3) Develop and implement improved type inference algorithms; (4) Improve the quality of flow analysis algorithms; and (5) Improve the usefulness of typed intermediate languages in compilation. Successful completion of the research will contribute to the quality of (1) Programming languages, by developing richer type systems; (2) Compilers, by enhancing the quality of optimizations possible via better program analyses; (3) CASE tools, by developing both richer algorithms for type inference and a rich suite of flow-based tools to elucidate program function. ***","title":"Types for Software Systems","awardID":"9619843","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["562016"],"PO":["150697"]},"19711":{"abstract":"The research portion of this project advances the study of simultaneous multithreading, a processor architecture technique aimed at increasing the utilization of the execution resources in processors that issue multiple instructions in each clock cycle. The research objectives are threefold: (1) to re-evaluate memory system architecture in light of a simultaneous multithreaded workload; (2) to investigate processor issues such as synchronization methods and strategies to deal with large register files; (3) to address the implications of simultaneous multithreading on the software system. The work entails revamping of an existing simulator for multithreaded processors, and use of the new simulator in evaluating alternatives. The educational portion concentrates on a revamping of the department curriculum in computer architecture. New graduate courses on computer architecture are being introduced, and simultaneous multithreading is being integrated into the core architecture courses for undergraduates. All course work is being enhanced with hands-on experimentation with instruction-level simulation.","title":"CAREER: A Simultaneous Multithreading System Architecture","awardID":"9701708","effectiveDate":"1997-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["542069"],"PO":["197478"]},"16345":{"abstract":"This is developing a methodology and efficient techniques for evaluating and\/or predicting power dissipation of CMOS circuits. The major components of the proposed methodology are survey sampling techniques, automata-based sequence compaction techniques, a behavioral\/logic level co-simulation engine, regression-based power macro-modeling techliques, and information-theoretic models of power dissipation. Special emphasis is being given to parasitic capacitance estimation, input data modeling, impact of memory hierarchy and circuit architecture, and effects of nonlinear delay equations and custom wire load models on accuracy\/efficiency trade-offs of the estimators. Concurrently, CAD methodologies and techniques for minimizing the power dissipation in VLSI circuits and systems are being developed. These are: low power optimization techniques and prototype software programs for system-level partitioning and hardware\/software codesign, communication synthesis, multiple supply voltage scheduling, activity-driven register allocation and binding, bus encoding, state assignment for interacting finite state machines, logic restructuring and simplification, timing-driven placement, routing and zero-skew clock tree construction. Finally, power management techniques such as (serial or parallel) gated clocks, stoppable clocks, and dynamic switching between power modes are being studied and automated.","title":"Presidential Faculty Fellows\/Presidential Early Career Awards for Scientists and Engineers (PFF\/PECASE): Power Estimation and Optimization in IC Design","awardID":"9628999","effectiveDate":"1997-07-15","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["518663"],"PO":["321058"]},"19766":{"abstract":"DNA computing is a new interdisciplinary research area that bridges the gap between computer science and biochemistry. The potential strength of DNA computing lies in the high memory capacity of DNA molecules and the intrinsic massive parallelism of biochemical operations. In 1994, it was demonstrated that it is possible to engage DNA in combinatorial computation through well-established biochemical techniques. The ultimate goal of this four-year project is to establish the foundations of DNA computing while tackling important issues through research and education activities. The following topics are investigated: Establishing theoretical models for DNA computing. Development of computational models, data structures and high-level operations for DNA Computing. Development of a complexity theory for DNA computing. including trade-offs among resources and reducibility. Development of DNA computers algorithms that are more efficient than algorithms on existing computers. Educational plan: An interdisciplinary undergraduate course on DNA computing. The course will be teamtaught. The objective of the course is to introduce students to the basic principles of liquid- phase DNA chemistry and to the relevant notions in computer science. In the last third of the course, students will be divided into teams to work on team projects based on research related problems.","title":"CAREER: Foundations of DNA Computing","awardID":"9701911","effectiveDate":"1997-07-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["434742"],"PO":["528421"]},"20162":{"abstract":"Conditional branches constitute a significant fraction of instructions executed in a typical program. In modern pipelined processor implementations, branches cause wasted processor cycles, due to the unpredictability of the next instruction. This project is exploring an alternative to branch prediction and speculative execution, which is to decouple the branch computations from the basic blocks they control. Branches, and the instructions that compute branch conditions, are peeled out of the main program and executed on a separate processor. Both compiler backend development and processor implementation are affected by this alternative, and the project takes an experimental approach to both.","title":"Branch Decoupled Architectures","awardID":"9703702","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["409197"],"PO":["179487"]},"17721":{"abstract":"This project connects Gogebic Community College to the Internet over 56 kbps lines. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Gogebic Community College Connection to the Internet","awardID":"9634081","effectiveDate":"1997-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[44536,44537,44538,44539,"476824"],"PO":["57343"]},"14135":{"abstract":"In many environments the problem arises of generating motion strategies for real and virtual robotic systems with visibility- based sensing capabilities. This last term refers to the ability of a sensor (e.g., a video camera or a range sensor) to detect objects along one or several line-of-sight rays through free space. Both a new conceptual framework and a collection of specific new algorithms are needed to perform motion planning under visibility constraints, in addition to the classical collision avoidance constraints dealt with by previous planners. The output of these algorithms will be motion strategies that integrate motion commands with visibility-based sensing operations. While robotics has extensively studied the motion planling problem for robots operating in fully known environments with little or no sensing ability, and active vision has studied the problem of local camera motion\/control in order to acquire needed data, the integration of visibility sensing with motion planning has remained relatively unexplored. Yet a variety of important tasks for a robot can be expressed in the language of visibility. `Plan a tour so as to see all of the region of interest,' `move to the desired location while keeping sight of a target,' `keep a moving target into sight despite view- obstructing mobile objects' are just some examples of such tasks. As visibility-based sensing allows robots to operate in partially unknown environments, these techniques allow on-line planning applicable to dynamic environments. Both manufacturing and medicine can benefit from application of such methods, especially in those operations (e.g., part delivery, assembly, monitoring) that occur in heavily occluded and dynamic work environments.","title":"Visibility-Based Motion Planning","awardID":"9619625","effectiveDate":"1997-07-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["521232","264577"],"PO":["179262"]},"14047":{"abstract":"When a acoustic wave propagates from a sound source to the ear drum, wavelength-dependent diffraction by the torso, head and outer ears or pinnae produce major changes in its spectrum. The nature of this transformation depends on the location of the sound source relative to the head, and is completely specified by the so-called head-related transfer function. Because the head- related transfer function completely characterizes the acoustic information available for sound localization, it has become central to any scientific study of spatial hearing. The character of the head-related transfer function varies from person to person. These inter-subject variations are often quite significant, and individualized head-related transfer functions are needed to obtain a faithful perception of spatial location. It is hypothesized that a physically-based model of the head- related transfer function requires a small number of free parameters, and that these parameters can be adapted or customized to individual listeners by statistical matching against experimentally measured head-related transfer functions, and by correlation with anthropometric measurements. This effort will develop and validate head-related transfer function models using a combination of the physical and mathematical approaches. Extensive psychological experiments will be performed to validate the adequacy of the resulting filters. This research has significance for the development of novel man-machine interfaces and interactive systems, for three-dimensional auditory displays as well as for some biomedical applications.","title":"Customizable Head Related Transfer Function","awardID":"9619339","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1185","name":"SENSORY SYSTEMS"}}],"PIcoPI":["151489"],"PO":["565227"]},"19987":{"abstract":"Schematic heterogeneity arises when information that is represented as data under one schema, is represented within the schema in another, for example as relation or class names. Schematic heterogeneity is an important class of heterogeneity that arises frequently in multimedia databases, semi-structured data and in integrating legacy data for data warehousing applications. Traditional query languages and view mechanisms are insufficient for reconciling and translating data between schematically heterogeneous schemas. The goal of this research project is to permit the cooperative use of schematically heterogeneous schemas and the data structured under these schemas. The project addresses the development of novel languages and techniques for: (1) the transformation and integration of schematically heterogeneous schemas; (2) the integrated querying of data from schematically heterogeneous schemas; and (3) the efficient evaluation of queries over integrated views. The techniques are analyzed for efficiency, correctness and completeness. In addition, the techniques are implemented within a heterogeneous repository of medical data. An evaluation of this implementation is used to refine and extend the results. The educational component of this project aims to enhance undergraduate and graduate participation in research, particularly among women and minority students. This is accomplished through curriculum enhancement, expanding undergraduate research opportunities and establishing academic enrichment programs for graduate minority students.","title":"CAREER: Managing Schematic Heterogeneity in Database Management Systems","awardID":"9702974","effectiveDate":"1997-07-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["179485"],"PO":["563751"]},"14058":{"abstract":"As internetworked computing becomes pervasive, common services will be accessed by a large number of widely distributed clients. Thus, scalable implementations of such services must deal with (1) large number of clients, and (2) high latencies that will be common among widely distributed nodes. One approach for reducing server load and communication costs is to create multiple instances of a service close to client groups that frequently access it. Also, when possible, resource rich clients can cache service state to avoid communication latency for common accesses. Service state replication and caching both lead to multiple copies of the service state and lead to the problem of consistency maintenance across copies when service state can be updated (e.g., to support interactions across clients). The focus of this project is on the characterizations of consistency levels that are appropriate in large scale systems with diverse sets of applications. In addition, scalable protocols will be developed to provide both read and write access to service state without requiring communication with all nodes that may have copies of the service state. A distributed object based middleware will be implemented to support scalable service and it will employ object caching and replication to enhance service access performance and scalability. This middleware will be used in the development and evaluation of services targeted to the home that are reached via a variety of communication media such as POTS and cable networks.","title":"System Support for Scalable Distributed Services","awardID":"9619371","effectiveDate":"1997-07-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["549757"],"PO":["209879"]},"19668":{"abstract":"Integrated-services communication networks that carry multiple traffic classes with different Quality-of-Service (QoS) requirements such as voice, video and data are becoming a reality. Each traffic class is characterized by the amount of bandwidth that it requests from the network, and the statistics of its arrival process and holding time in the network. A key feature of emerging high-speed networks is that these characteristics for the various traffic classes tend to be widely different. We focus on two important issues in such networks: (i) resource sharing for traffic with different bandwidth requirements and (ii) performance analysis algorithms to evaluate routing and admission control for such networks. High bandwidth calls typically experience high blocking probabilities without some form of admission control that reserves a certain portion of the network's resources to handle these calls. A goal of this research project would be to develop admission control and routing schemes to improve the blocking performance of high bandwidth calls without adversely affecting the network utilization. The presence of a large mixture of bandwidth classes also poses unique challenges in evaluating the performance of such admission control and routing schemes. We will develop a combination of analytical and simulation techniques that would provide fast and accurate estimates of the blocking probabilities for all traffic classes in the network.","title":"CAREER: Resource Sharing and Performance Analysis Algorithms for Integrated-Services Networks","awardID":"9701525","effectiveDate":"1997-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["509442"],"PO":["194325"]},"22594":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for the installation and operation of a DS-3 ATM connection to the MREN where they can gain access to the Very High Performance Backbone Network Service (vBNS). This link will be upgraded to a OC-3c sometime in the summer of 1988. Applications include: - Advanced Photon Source project - High Energy Physics - Astrophysics - Grand Challange computational fluid dynamics - scalable libraries - meta-computing research - high speed image and video processing - coastal waterways simulation Collaborating with: - Air Force Rome Laboratories - Argonne National Laboratory - Army Waterways Experiment Station - Brookhaven National Laboratory - Cornell Theory Center - Fermilab - Illinois Institute of Technology - Lawrence Berkeley Laboratory - Lawrence Livermore National Laboratory - Maui High Performance Computing Center - Northwestern University - Old Dominion University - Purdue University - Stanford Linear Accelerator Center - Texas Institute for Computational and Applied Mathematics - University of Colorado - University of Florida - University of Washington The award provides partial support of the project for two years.","title":"A High Performance Connection to the Internet and vBNS for the University of Notre Dame","awardID":"9710466","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[56747],"PO":["198445"]},"24014":{"abstract":"This award funds a workshop to explore the research needs related to the interface between computer vision and control. The workshop will be held June 23-25, 1997 on Block Island, Rhode Island. A small number of key researchers from the computer vision and control communities will come together to examine the topics which bridge these two domains. Their presentations and discussions in working groups will undertake to delineate the common ground and to challenge one another with fundamental unresolved problems. The results of the workshop will appear in a widely distributed report on research directions in vision and control.","title":"Workshop on Vision and Control","awardID":"9714967","effectiveDate":"1997-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["531055"],"PO":["475621"]},"19801":{"abstract":"In conventional magnetic and optical recording, data is stored by saturating the media in one of two states. In M-ary recording, more than two recorded signals are used, allowing for larger storage capacity and higher data transfer rates. A number of M-ary recording channels are being developed for optical recording and a good deal of work has been done by the PI and others in this area. The primary objective in the research plan is to move to the next level in the understanding, modeling and analysis of channels, codes and signal processing for M-ary recording channels. The research plan addresses fundamental limits of M-ary constrained recording channels and new coding approaches which seek to achieve them. The teaching plan seeks to increase the number of trained engineers in signal processing and communications for recording and emphasizes close connection with and feedback from industry. The specific research and educational objectives are: 1) To integrate communications and optical models to better characterize the fundamental limits (i.e. channel capacity) associated with optical (both binary and nonbinary) recording channels. 2) To develop new methodologies for code design for M-ary channels whose constraints are typically difficult to deal with. 3) To develop new modulation codes for M-ary recording channels which exploit their three dimensional nature. 4) To develop new educational approaches that emphasize the interrelation of system components and help develop a broader perspective. 5) To emphasize interaction with industry and to take advantage of undergraduate and PhD co-op programs. 6) To continue developing outreach programs for encouraging research careers for undergraduates. The proposed research and educational activities will: 1) Educate and train a core group of researchers in the emerging area of M-ary recording both in fundamental limits and practical systems implementations. 2) Result in modulation codes that are c onceived and designed from a systems and practical perspective and achieve the largest known information density.","title":"PECASE: Fundamentals Limits and Codes for M-ary Recording Channels","awardID":"9702024","effectiveDate":"1997-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["386026"],"PO":["188393"]},"19768":{"abstract":"The primiary purpose of this project is to develop architectural optimization tools with dramatically improved efficiency and accuracy. Tools will be developed in three inter-related categories. The first is a comprehensive semi-automated methodology for simultaneously exploring the microprocessor and system level design spaces. The second is a hardware emulator coupled to software simulation. The third parallelizes the search for an optimum using a network of workstations. The end result, called ROADS, will have dramatically improved efficiency and accuracy over existing methods. ROADS will form the centerpiece of a new course sequence that will integrate the topics of computer architecture and implementation. Multilevel simulation will allow students to address a much wider scope of design problems than the simulators used in most current curricula. The result will be a new generation of engineers better prepared to both design and implement new computing architectures.","title":"CAREER: Architectural Optimization of High Performance Microprocessor-Based Systems","awardID":"9701915","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550887"],"PO":["197478"]},"20692":{"abstract":"With the increasing importance of portable, mobile systems, power consumption has been elevated to be a critical design parameter. Concern over power dissipation is also important for performance-driven designs where power may soon displace chip area as the principal design constraint. This is the motivation for this project, which focuses on the design of low-power, high-performance processors, particularly those customized for use in a mobile environment. Advances are sought in architecture, software, and applications. Activities in the architecture area include the design and characterization of low-power data path functional units, the design of low-power control logic, the design of low- power on-chip caches, and the derivation and quantification of a set of strategies for designing low-power microarchitectures. The software and applications areas will include a study of the effects of compiler optimization techniques, algorithms, and data structures on power consumption of code running on candidate architectures.","title":"Issues in the Design of Low Power, High Performance Processors","awardID":"9705128","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":[52185,"507752"],"PO":["549626"]},"22485":{"abstract":"This research is on test methods for finding process parameter faults in memories embedded in advanced technology chips. The effect of threshold voltage variation and noise (e.g., leakage, charge sharing, crosstalk, etc.) on the functionality of a memory cell is modeled (using circuit simulation and analysis) in terms of read\/write error margins and variance of access delays. Algorithms for failure modes in memories, based on fault models generated from process and circuit studies, are being developed. Tools based on them allow functional and parametric testing of static RAMs. The issues of testing gigabit stretchable DRAMs with multi-valued address decoding schemes are being analyzed from an algorithmic standpoint. Fault models, pertaining to these analog-like components, and memory testing algorithms are being explored. One methodology for testing high-density SRAMs and multivalued stretchable DRAMs with mixed-mode circuits, uses the measure of the harmonic distortion of a pure sinusoidal input signal in order to extract detection and diagnosis information for various technology, parametric and layout-related faults in the memory chip.","title":"Testing of High-Density VLSI Random-Access Memories","awardID":"9710183","effectiveDate":"1997-07-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["521045"],"PO":["562984"]},"23245":{"abstract":"A new application for object recognition, indexing image sets in digital libraries, demands recognition strategies that are (1) effective in cluttered scenes and (2) effective for objects recognised at a class level - for example, people or animals. These needs can be met by recognition algorithms that interpret the world in terms of stylised properties in shape, shading, texture and colour, which are caled 'primitives.' In this approach, objects are represented by a collection of spatial relationships between primitives. The primitives themselves are used as a source of grouping constraints. Recognition proceeds by grouping together features or regions that could represent a primitive, and then assembling groups of primitives that could have come from an object. There is no explicit 3D reasoning, but the grouping processes may contain a great deal of implicit 3D reasoning. This approach to shape and to recognition unites themes studied in active research programs in computer vision, both in the United States and in the European Community. A joint workshop, involving both US and E.C. participants (for whom E.C. funding will be available), will explore representations that use grouping and symmetry as a recognition strategy. Topics will include: shading primitives, image shape constraints that result from volumetric primitives, building grouping-based representations and overall strategies for object recognition. The workshop will be held in Erice, Sicily, in early 1998. The proceedings will be published as a volume in the Springer Lecture Notes in Computer Science series.","title":"Workshop on Shape, Contour and Grouping","awardID":"9712426","effectiveDate":"1997-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["457204"],"PO":["475621"]},"14159":{"abstract":"The project examines the impact of new technologies of information, communication, and computerization on the home life and home-based work life of American families. It is a follow-up study to a 1984-1986 study performed by the same researchers, and an investigation of new areas that have resulted from the recent emergence of new technologies. The project is unique because of the longitudinal opportunity to compare current circumstance with past situations. The project will (1) develop and test a theoretical model that gives the best understanding of household adoption and use of new computing technologies and their diffusion into various aspects of home life; (2) assess the extent to which these new technologies have become available to American homes, the nature of their use, and the types of adopters and users; (3) study the impact of these technologies on family life; (4) uncover what have been the significant changes in uses and impacts that have occurred in the last 10 years; and (5) uncover what are the perceptions of and possibilities for social changes wrought by new computing technologies in the home. The study will be based on a national sample of 600 households with computers and 400 households without.","title":"The Use of New Information Technologies and their Impact on American Households","awardID":"9619695","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0403","name":"Division of SCIENCE RESOURCES","abbr":"NCSE"},"pgm":{"id":"8802","name":"RESEARCH & DEVELOPMENT STATIST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8804","name":"SCIENCE & ENGINEERNG INDICATRS"}}],"PIcoPI":["167080"],"PO":["495796"]},"29449":{"abstract":"","title":"Parallel Fault Diagnosis","awardID":"9796317","effectiveDate":"1997-07-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["499399","409429"],"PO":[74434]},"22772":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for the installation and operation of a OC-3 ATM connection to their Internet Service Provider and access to the Very High Performance Backbone Network Service (vBNS). Applications include: - Computational Neuroscience - Center for Advanced instructional Media - Physics Collaborations Collaborating with: - Brookhaven National Laboratory - Fermilab - Los Alamos National Laboratory - University of California at San Francisco The award provides partial support of the project for two years.","title":"High Performance Connections for Collaborative Research at Yale","awardID":"9711028","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["155743","560901",57194,57195],"PO":["121202"]},"22541":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection from the main campus at College Station to the university's Institute of Biosciences and Technology in the Texas Medical Center in Houston, and an OC-3 ATM connection from there to the vBNS. Applications include the Advanced Research and Industry Enterprise Study (ARIES), comprising projects in telemedicine, visualization, computational chemistry and structural biology, meteorology, digital libraries, distance learning and teleconferencing; long distance collaboration with the National Library of Medicine and the Smithsonian Institution; collaborative projects in teleradiology with other institutions at the Texas Medical Center; and the Partners in Computational Sciences (PICS) project for modelling groundwater remediation strategies in conjunction with Brookhaven National Laboratory, Oak Ridge National Laboratory, University of Texas at Austin, SUNY at Stony Brook, University of South Carolina and Princeton University.","title":"vBNS Connectivity for Texas A&M University","awardID":"9710337","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["530862","292276","398462",56622,"95521"],"PO":["198445"]},"21452":{"abstract":"This proposal deals with the automated layout of mixed analog and digital circuits. Optical interconnect interfaces which contain optoelectronic arrays integrated with digital processing capability require layouts in which noise sensitive analog circuits must be distributed throughout digital designs on a regular pitch for alignment with guided or free-space optical inputs. New layout tools must automatically incorporate application specific geometric constraints and analog noise requirements to produce layouts for these emerging technologies. The floor planning tool must have inputs from (1) a mask encapsulating the optical interface positioning requirements, called a keyhole mask,(2) standard cell and block compilers, and (3) the analog interfaces themselves. Problems being investigated are (1) creating a keyhole mask(2) modifying the Berkeley floor planning tool to provide feedback to the standard cell and block compilers based on keyhole mask inputs, and(3) modifying the Berkeley standard cell compiler to provide modified compilations based on inputs from the floor planning tool.","title":"\"Opti-MOS: A Layout Tool For Integrating Optical Superstructures on CMO Devices\"","awardID":"9707350","effectiveDate":"1997-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["429268"],"PO":["321058"]},"23542":{"abstract":"The project studies the multi-stream approach to automatic speech recognition (ASR) using stream definitions in the modulation spectrum domain. The multi-stream approach is a new acoustic modeling technique to increase the robustness of ASR systems. It derives different information sub-streams from the speech signal followed by independent feature extraction and probability estimation in each sub-stream. The vectors of class-conditional probabilities obtained from each sub-stream are merged to obtain the final decision. The multi-band model which utilizes different regions of the frequency spectrum in the sub-streams has been shown to be robust to frequency-selective degradation. The aim of the project is to utilize different ranges of the modulation spectrum in different sub-streams. A study of the relative importance of the different ranges of the modulation spectrum indicates that they might carry different information. This makes the various elements of the modulation spectrum interesting candidates for the multi-stream approach. The computation of these features requires looking at longer segments (typically syllable length segments) of the signal. The proposed project is an attempt to apply the new assumptions of relative independence of elements of the feature vector and medium-term time dependencies between feature vectors to ASR with a view to improve its robustness.","title":"SGER: Multi-Stream Approach Using Syllable Length Temporal Evidence in Acoustic Modeling of Conversational Speech","awardID":"9713583","effectiveDate":"1997-07-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[59141],"PO":["183208"]},"20033":{"abstract":"The objective of this program is to increase use of low cost CMOS technologies in super-GHz frequency applications to make benefits of communication techniques available to a larger cross section of the population. Successful implementation of RF switches along with progress made by others could make a fully CMOS-based single chip radio a reality, which could significantly lower costs of wireless telephones, local area networks, global positioning systems and others. This program should also provide insights to ease the transition of mainstream digital integrated circuit technologies to the super-GHz frequency range. The research program will implement RF switches, a key RF building block of radios, using low cost bulk CMOS technologies. More specifically, this program will, (1) characterize bulk CMOS processes and develop models for required components, (2) evaluate and understand model parameters which limit performance, (3) identify physical causes for the limitations, and (4) discover approaches to overcome these limitations to implement high and moderate-power RF switches operating at 900 MHz and possible at 2.4 GHz with performance acceptable for typical ISM band applications.","title":"CAREER: Implementation of RF Switches in Low Cost Bulk CMOS Technologies","awardID":"9703214","effectiveDate":"1997-07-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["255828"],"PO":["201974"]},"22695":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for OC-3 connections for eleven institutions to an OC-48 California statewide network. The network will be connected to the vBNS in two places: the Los Angeles Basin, and the San Francisco Bay area. The eleven institutions are: University of California campuses at Berkeley, Davis, Irvine, Riverside, San Francisco, Santa Barbara and Santa Cruz; Stanford; CalTech; University of Southern California and the Information Sciences Institute. The over 40 applications cover fields such as metacomputing; distributed interactive simulation; remote telescope operation, microscopy and tele-imaging for health care; digital libraries; and projects in physics, biology and communications. Collaborating institutions include Oak Ridge National Lab, Rice, Argonne National Laboratory, Los Alamos National Laboratory, Syracuse University, University of Tennessee and the University of Texas.","title":"California Research and Education Network-2 (CalREN-2) Phase 1","awardID":"9710738","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[57004,57005],"PO":["182196"]},"22464":{"abstract":"Semiconductor manufacturing technologies now enable the placement of up to 50 million devices on one die, and allow clock speeds to approach the GHz range. These advances, however, are accompanied by larger yield losses (both catastrophic and parametric) and lower reliability. This project is on the development of techniques for improved yield-reliability estimation and enhancement. These techniques include hierarchical yield estimation and enhancement, minimum perturbation approach for yield and reliability enhancement and new methods for crosstalk and electromigration minimization. The tradeoffs among yield, reliability and other optimization goals such as speed and area, are being investigated as well. This research emphasizes the integration of the yield and reliability enhancement objectives with the primary goals of performance and area, while keeping design data volumes manageable. A major focus of the project is on proving the advantages of the new techniques by implementing and integrating them into existing design frameworks.","title":"Techniques and Tools for Estimating and Improving the Yield and Reliability of VLSI Circuits","awardID":"9710130","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["553614"],"PO":["564898"]},"21386":{"abstract":"This project is experimenting with languages, compilers, and architectures for large-scale multiprocessors based on functional programming and single assignment data structures. The project includes work at USC on translators for functional languages, and work at the University of Delaware on architectures and simulations. The key insight motivating the work is that functional programming can increase performance of multithreaded systems. One increase of performance comes from the ability to move threads among processors. Another is the possibility that single assignment data structures can be cached with no need for coherence traffic, potentially increasing performance of parallel systems. Research will include development of a program execution model and memory model, design of a cache management protocol for single-assignment data structures, translation of benchmarks such as SPLASH 2 into a functional language, and simulation of the benchmarks running on the new execution model with cache protocol. The goal is to measure the extent to which the new models and cache protocols provide a performance advantage over execution models that permit multiple assignments. This project is experimenting with languages, compilers, and architectures for large-scale multiprocessors based on functional programming and single assignment data structures. The project includes work at USC on translators for functional languages, and work at the University of Delaware on architectures and simulations. The key insight motivating the work is that functional programming can increase performance of multithreaded systems. One increase of performance comes from the ability to move threads among processors. Another is the possibility that single assignment data structures can be cached with no need for coherence traffic, potentially increasing performance of parallel systems. Research will include development of a program execution model and memory model, design of a cache management protocol for single-assignment data structures, translation of benchmarks such as SPLASH 2 into a functional language, and simulation of the benchmarks running on the new execution model with cache protocol. The goal is to measure the extent to which the new models and cache protocols provide a performance advantage over execution models that permit multiple assignments.","title":"New Generation Multithreaded Multiprocessors","awardID":"9707125","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["475291"],"PO":["179487"]},"21079":{"abstract":"Early computers fetched data from memory only after it had been requested by the processor. When memory latency is high, this demand fetch policy also has high latency. Many modern computers prefetch data from the memory before it is requested, which can reduce the latency of memory as long as the prefetching is accurate, and timely. This project is a preliminary investigation of a Markov prefetcher, which uses a Markov model to predict subsequent memory references from earlier references. The prefetcher acts as an interface between on-chip and off-chip caches that predicts multiple references to the memory system and prioritizes their delivery to the processor. Cycle-level simulations show that use of a Markov prefetcher reduces the overall execution stalls due to memory operations by about 54% while also reducing memory usage. This project is extending the initial investigation to provide more realistic analysis of the effectiveness of Markov prefetching, reduce implementation costs, and apply the technique to multiprocessor systems. In addition, new aspects of prefetching are being examined, including prediction of access methods (read or write), prefetching between processors, and prefetching between different levels of the memory hierarchy. The primary research method is cycle-level simulation.","title":"Memory Prefetching","awardID":"9706286","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[53119,"543625"],"PO":["197478"]},"14204":{"abstract":"9619831 Query-based visualization is put forth as a novel exploratory approach to understanding distributed computations. The key features of the approach are the use of queries as a device for searching the state space of distributed computations, visual presentation techniques borrowed from program animation, and the ability to navigate through the state space using visual interactions. Query- based visualization treats the state of a running distributed computation as if it were the contents of a distributed database. The user explores this database by issuing queries which are evaluated and the results visualized. A class of queries called persistent enable continuous visual monitoring of the state of a distributed computation. All views correspond to globally consistent snapshots of the computation. The project will produce the first implementation of query-based visualization which will provide a uniform interface for learning about distributed applications that employ the PVM library. In the course of development, contributions will be made to monitoring and snapshot algorithms, graphical representation forms and ways to combine them, and the visual query language. ***","title":"Query-Based Visualization of Executing Distributed Computations","awardID":"9619831","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["384032","214934"],"PO":["150697"]},"19517":{"abstract":"The goal of this research is to lessen the impact of the increasing speed disadvantage of memories when compared to processors. The focus in this project will be the design and evaluation of profiling techniques and hardware assists to allow better utilization and performance of the memory hierarchy. The planned efforts are to (1) improve the efficiency of on-chip caches by using better code and data placement informed by profiling; (2) determine when it is advantageous to bypass the data cache; (3) take advantage of page and burst modes of modern DRAMs; (4) investigate methods to reduce data latency by prefetching; and (5) design hardware assists at the main memory interface for compaction or partial transfer of data. These techniques will be evaluated using trace-driven simulations or profiling of binary executables for SPEC benchmarks and commercial applications.","title":"Improving the Performance of the Memory Hierarchy","awardID":"9700970","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["133935"],"PO":[49508]},"20386":{"abstract":"Optimized codes for multi-dimensional problems such as image processing and fluid dynamics often require the problem space to be traversed in a direction not parallel to any of the basis vectors of the space. Affine transformations of the iteration indices are needed for these oblique traversals. This project is implementing affine transformations for loop retiming in code generators, with consideration of the effect of conditional branches. Architectural support for anticipating conditional branches is also being investigated. With extensive undergraduate participation, research is proceeding toward several goals: identification of new high-level language constructs for describing loop retiming; development of supporting hardware features; new techniques for accomodating conditional branches; and development of simulators and other tools for investigating loop transformations.","title":"Architecture Support and Code Generation for General Nested Loops","awardID":"9704276","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[51480,51481],"PO":["197478"]},"21201":{"abstract":"The phenomenal growth of the World Wide Web is imposing considerable strain on Internet resources and Web servers, prompting numerous concerns about the Web's continued viability. The success of high-performance Web servers in alleviating these performance problems is ultimately limited, unless Web services are designed to be inherently scalable. The Commonwealth project aims to design, implement, and evaluate a prototypical architecture and a set of associated protocols for scalable Web services. The Commonwealth architecture for hosting scalable Web services allows scalability through (1) parallel processing on tightly-coupled nodes within a Web site, and (2) load distribution across loosely-coupled Web sites. Commonwealth's underlying philosophy is to achieve a WEALTH of performance through the use of COMMON components, and to do so along an incremental upgrade path. The Commonwealth protoype will catalyze basic research in four main areas: (1) Data placement (caching, prefetching, and dissemination protocols); (2) Resource management (scheduling, load balancing, and admission control protocols); (3) Networking (routing, packet redirection, and connection migration) and (4) Middleware services (replication and resource discovery). These problems will be addressed with particular attention to the issue of high-variability, which---in previous work by the principal investigators---was shown to pose significant problems for the design of Internet-based systems.","title":"COMMONWEALTH: Architecture and Protocols for Scalable WWW Service","awardID":"9706685","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["562061","486062","529278"],"PO":["179487"]},"22103":{"abstract":"9708957 This project will focus on constructing a \"smart\" programming environment for Java that uses semantic analyses to statically debug, validate, and safely optimize programs. The principal investigators have already developed an early version of such an environment for a dialect of Scheme. A safe implementation prevents the misuse of primitive program operations, such as taking the head of the empty list, through a combination of compile-time analysis, run-time checking, and automatic storage management. Safety, however, is not a panacea: all safe languages defer checking some preconditions until run-time. When a run-time check fails, program execution is aborted. Hence, programmers try to ensure that misapplications are impossible by analyzing what forms of data can appear as input to each primitive operation. Unfortunately, programmers are not very good at this task and frequently make mistakes. The primary goal of the proposed smart programming environment is to prove the run-time checks required for safety never fail. This property, called \"total safety,\" is a much stronger property than ordinary safety. For any interesting programming language, total safety is undecidable; nevertheless, semantic analyses like set-based analysis can prove many of the preconditions checked at run time never fail. Moreover, for any unproven precondition, an environment can construct program \"slices\" identifying the execution paths violating the precondition. Given this information, the programmer can decide if the failing paths are feasible and, if so, repair the code. ***","title":"A Smart Programming Environment for Java","awardID":"9708957","effectiveDate":"1997-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7427","name":"CCLI-EDUCATIONAL MATERIALS DEV"}}],"PIcoPI":["495364","475166"],"PO":["564388"]},"20068":{"abstract":"The defining characteristic of ubiquitous computing is the attempt to break away from the traditional desktop interaction paradigm and move computational power into the environment that surrounds the user. This award focuses on automating the capture of individual and group experiences, in order to facilitate access to a richly integrated record of events: the automated capture, integration and access problem for ubiquitous computing. The natural candidates for this capture are collaborative activities such as meetings, education, and design. This award will initiate a large-scale ubiquitous computing effort--- Classroom 2000---to access and support the rich interaction of classroom experience, and will grow to support and assist students through their educational careers and beyond. Open issues include effects of granularity of capture, support for revision during access, and how interactions among collaborators affects capture and integration. Of special interest is determining whether and how ubiquitous computing technology supports note-taking practices that contribute to near-term and long-term educational goals.","title":"CAREER: Investigating Research Issues in Ubiquitous Computing: The Capture, Integration, and Access Problem","awardID":"9703384","effectiveDate":"1997-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["563803"],"PO":["495796"]},"11610":{"abstract":"This project is concerned with Markov decision processes (MDPs) and concentrates on two problems (1) Finding conditions under which there exist easily implementable optimal policies and (2) Determining how to recognize these policies. Variants on these problems are also studied, in particular finding easily implementable approximations to policies and the computational complexity of recognizing the policies and conditions. This grant will support a transition from a mathematical logic-based approach to computer science (structural complexity theory) to an engineering application-based approach. The applications focussed on in this proposal come from the field of planning, as described both by computer scientists in Artificial Intelligence, and electrical engineers in Discrete Event Systems.","title":"CAREER ADVANCEMENT AWARD: The Complexity of Markov Decision Processes","awardID":"9610348","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["516895"],"PO":["528421"]},"22522":{"abstract":"Marion Technical College will use this grant to connect its campus to the Internet using OARnet, an Ohio based ISP. Marion Technical College is a two-year college offering 30 technical degree and certificate programs. The college has over 1600 students and 100 faculty and staff. The college needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connection to OARnet and Internet","awardID":"9710287","effectiveDate":"1997-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["549530","410030",56564,"179703"],"PO":["121202"]},"20476":{"abstract":"Networks of workstations (NOWs) are becoming increasingly popular for providing cost-effective and affordable parallel computing. However, the LAN environments are gradually becoming heterogeneous due to the commodity nature of workstations and networking equipment. Such heterogeneity gets reflected in terms of communication capabilities of nodes (processor speed, memory speed, network interface support) and network architectures (different interconnects with varying topology and connectivity). This is forcing NOW environments to be gradually redefined as `Heterogeneous Networks of Workstations' (HNOWs). This research is targeted towards providing fast and scaleable collective communication support for such emerging HNOWs. The following problems are being addressed by this project: 1) quantitatively specifying the heterogeneous characteristics of a HNOW environment and studying their impact on the performance of current implementations of collective communication operations; 2) designing and developing optimal algorithms for collective communication operations by considering major heterogeneous characteristics; and 3) studying the performance gains achieved by the optimal algorithms for different suites and HNOW environments. An experimental HNOW testbed consisting of a set of workstations with different speeds and different interconnect types (Fast Ethernet, ATM, and Myrinet) is planned to be used together with theoretical, analytical, and simulation approaches to develop and validate the new research results.","title":"Scalable Collective Communication Support for Heterogenous Networks of Workstations","awardID":"9704512","effectiveDate":"1997-07-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["561947"],"PO":["250083"]},"22577":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years to create a gigapop centered around the University of Maryland-College Park (UM-CP) and the University of Maryland-Baltimore County (UMBC). The two campuses are connected by an OC-48 line, which also connects to the vBNS at OC-3. Other research institutions in the Baltimore area connect through UMBC, while Washington area research institutions connect through UM-CP. Applications include projects in remote sensing data collection and distribution, atmospheric science, the Earth Observing System program, interactive visualization, and large-scale intelligent document retrieval. Collaborating institutions include most of the Internet 2 institutions and several NASA facilities.","title":"Creation of a Gigapop Serving the Baltimore\/Washington Corridor","awardID":"9710435","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}}],"PIcoPI":[56707,"319083"],"PO":["288674"]},"13107":{"abstract":"The goal of this research is to develop fast mapping tools and architectures for logic emulations that can greatly reduce the mapping time, and thus improve the usefulness of logic emulation, and the speed of logic simulation. Being developed are: 1) technology mapping tools that integrate decomposition and covering, and 2) placement tools that use partitioning methods to do higher- quality global placement. These are designed to improve both the mapping times and resulting quality for FPGA-based implementations. Routing complexity estimators are also being developed to guide algorithm choice. These exploit the mapping time-quality tradeoffs in many techniques. Also being investigated are new FPGA architectures for logic emulators, and systems that can support much faster mapping times, yet still achieve high quality results. These steps are being integrated into a complete mapping-time oriented tool suite for logic emulation which exploits the mapping time\/quality tradeoff in these systems.","title":"Mapping Time Oriented Tools for Logic Emulation","awardID":"9616572","effectiveDate":"1997-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["547185","485671"],"PO":["321058"]},"22633":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for the installation and mperation of a OC-3 ATM connection to a cooperative PoP connecting their local service provider NYNEX's ATM network and the the Very High Performance Backbone Network Service (vBNS). Applications include: - Astrophysics - High Energy Particle Physics - Molecular Cellular Biology - Whole Plant Physiology - Digital Library Applications - Data Center on Social Science - Medical Applications - Networking Research Collaborating with: - Indiana University - University of Cambridge - National Center for Biotechnology Infomatics - Berkeley Drosophia Genome Project The award provides partial support of the project for two years.","title":"High-Performance Internet Connection for Harvard University","awardID":"9710567","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["283263"],"PO":["198445"]},"22897":{"abstract":"The unprecedented speed, integration density, and economy of modern CMOS circuit technology have fueled the rapid evolution of the computer industry, and hold the promise of similarly fueling the personal communications industry. However, the circuit technology tends to be highly optimized for digital circuits wherein precise analog performance is not critical. Since communication systems must transmit and receive analog waveforms, the most effective use of CMOS circuit technology for such applications requires on-chip analog-to-digital (A\/D) and digital-to-analog (D\/A) converters, and these are often the limiting factors in overall system price and performance. For low speed applications such as telephone modems, delta-sigma data converters have emerged as the method of choice for implementing the on-chip A\/D and D\/A converters because they are particularly amenable to high-precision CMOS implementation. The purpose of this research is to eliminate a major limitation suffered by existing delta-sigma data converters to facilitate their use in higher-speed applications such as personal wireless communication systems. Specifically, the research involves the development of practical multi-bit noise- shaping DACs to be used in delta-sigma data converters. These DACs avoid the severe component matching requirements of their conventional counterparts through a digital signal processing innovation that causes the noise arising from component mismatches to lie outside the signal band. Such DACs have the potential to significantly increase the present performance limits of delta-sigma data converters by eliminating the need for one-bit quantization. The primary goals of the research are to develop practical high-order noise-shaping DACs that extend the present performance limits of delta-sigma data converters, and to theoretically and experimentally quantify their performance.","title":"Noise-Shaping DACs for Delta-Sigma Data Converters","awardID":"9711331","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["560228"],"PO":["564898"]},"11556":{"abstract":"Pattern Matching is coming of age. The last six years have seen great progress in the area of Pattern Matching Algorithms. In particular, researchers have looked into generalized versions of the problem. The field has evolved from being an important theoretical foundational area to being well-poised on the verge of practical usability in many diverse applications, from multi-media to computational molecular biology. The project is seeking a pro-active role in bringing these new results into the relevant applicant domains, as well as feedback and direction about the important missing parts in the theory of pattern matching. This involves joining some large applied projects as an algorithmic group. The research problems described here are motivated and inspired by the needs of these projects. These problems require achieving new insights into the nature of pattern matching, as well as results of the following nature: Efficient algorithms for association generation in dynamic data bases. Efficient generation of generalized associations (e.g.\\ with negations). Efficient algorithms for approximate matching in hyper-text. Efficient algorithms for approximate dictionary matching. New multidimensional adaptive compression schemes that allow efficient compressed searches and space and time efficient local decompression. Generalization of Pattern Matching.","title":"Data Mining, Information Retrieval and Pattern Matching - Application-driven Algorithmic Research","awardID":"9610170","effectiveDate":"1997-07-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["401872"],"PO":["543507"]},"23788":{"abstract":"This award supports a two day workshop held May 12-14, 1997 in Vienna Virginia to develop the computing and communication research agenda needed to complete the Next Generation Internet (NGI) initiative. The approximately 100 participants were drawn from academia, industry and government. Products of the workshop are a report posted on the Computing Research Association web site, a published document, and a widely distributed video of the workshop.","title":"A Workshop on the Research Agenda for the Next Generation Internet","awardID":"9714350","effectiveDate":"1997-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["217930"],"PO":["121202"]},"22700":{"abstract":"Divine Word College will use this grant to connect its Epworth campus to the Internet using a Dubuque, Iowa based ISP called Midwest Communications. Divine Word College is a four-year college and seminary wholly owned and operated by the Society of Divine Word, a Roman Catholic missionary order. There are approximately 125 full-time students from countries around the world. The college needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Divine Word College Internet Connection","awardID":"9710774","effectiveDate":"1997-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[57015],"PO":["121202"]},"22612":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in computer graphics and visualization, interactive computational steering, meteorology, cardiovascular research, geology and geophysics, mathematics, chemistry, atmospheric and space sciences and physics. Collaborating institutions include the National Center for Supercomputing Applications, Los Alamos National Laboratory, Columbia University, University of Illinois, Duke University, Harvard Medical School, and the National Center for Atmospheric Research.","title":"vBNS Connection to the Internet","awardID":"9710511","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["429182",56796],"PO":["121202"]},"22623":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in atmospheric sciences, astronomy, computer science, high energy physics, telemedicine, and geosciences. Collaborating institutions include most of the Internet 2 institutions.","title":"University of Arizona High Speed Connectivity Project","awardID":"9710542","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["434939","311840"],"PO":["121202"]},"11579":{"abstract":"The principal investigator works on a broad spectrum of problems in finite model theory, which is the subject that studies first-order logic and its extensions on collections of finite structures. He seeks to discover necessary and sufficient conditions under which logics with fixpoint operators capture computational complexity classes on collections of finite structures. Moreover , he investigates the comparative expressive power of extensions of first-order logic on collections as finite structures of asymptotic measure equal to one. He also studies various aspects of logics with fixed finite number of variables, including algorithms for satisfiability, and asymptotic probabilities of properties expressible in such logics. Progress on these problems will strengthen the connections between logic and computation, and enhance the interaction between logic, computational complexity, and asymptotic combinatorics. In a different direction, He continues working towards the development of a structural approximation theory for combinatorial optimization within the framework of integer programming. The objective of this investigation is to identify large classes of NP optimization problems possesing approximation algorithms with performance guarantees.***","title":"Aspects of Computation Theory and Logic","awardID":"9610257","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518005"],"PO":["528421"]},"22921":{"abstract":"The area of automatic indexing is to be explored via automatic content abstraction from a semantic perspective. Robust language processing techniques are used to generate multipurpose data structures called lexical webs. These are, in turn, used in an automated semantic indexing program designed to parse, index, and hyperlink on-line texts. The research involves three major areas: data structure design for implementation of lexical webs; design of lexical web acquisition tools that utilize linguistic and statistical heuristics for developing robust finite-state grammars for chunking of significant phrase-level and discourse-level constituents; and design of document annotation tools that annotate a text with lexical webs by creating appropriate hyperlinks. The creation of lexical webs can accelerate the availability of information in a highly indexed and cross- indexed format, facilitating navigation and rapid information access.","title":"SGER: Semantic Technologies for Automatic Indexing and Tagging","awardID":"9711407","effectiveDate":"1997-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["562587"],"PO":["565227"]},"20413":{"abstract":"This project is finding ways to improve I\/O performance by predicting future accesses based on those that have occurred in the past. The results can be applied all the way from the disk controller cache to the file system to the world wide web. It has been demonstrated that accesses to files, for example, are not random. There are patterns that can be detected and exploited. By exploiting these patterns, files can be prefetched so that the files will be present in the cache when the request occurs. Preliminary results using file system traces indicate that significant performance gains will occur. This project will (1) develop a method for tracking I\/O access patterns that is efficient in terms of both space and time, (2) investigate the use of predictive cache prefetching at three levels: disk controller, file system and the world-wide web, and (3) implement a predictive cache in one or more of these areas. ***","title":"Improving Cache Performance by Predicting I\/O System Actions","awardID":"9704347","effectiveDate":"1997-07-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["540846"],"PO":["250083"]},"22646":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for the installation and operation of a DS-3 ATM connection to the MCI POP in North Royalton, OH for access to the Very High Performance Backbone Network Service (vBNS). Applications include: - Scientific Applications on Arrays of Multi-Processors - HPC++ parallel high performance C++ compiler group - Problem Solving Environments Group - virtual laboratory project Collaborating with: - California Institute of Technology - Drexel University - Indiana University - Los Alamos National Laboratory - New Mexico State University - University of California at Irvine - University of Oregon The award provides partial support of the project for two years.","title":"A High Performance Network Connection for Research and Education at Indiana University and Indiana University-Purdue University Indianapolis","awardID":"9710600","effectiveDate":"1997-07-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["285595",56883,56884,"380554","471971"],"PO":["198445"]},"20127":{"abstract":"9703591 Silverstein The principal investigator plans to work on the behavior of eigenvalues of two classes of random matrices, both of sample covariance type, where the vector dimension and the sample size are large and on the same order of magnitude. The sampled vectors making up the first class are independent, each a linear transformation of a vector containing i.i.d. elements, while the second class models the result of perturbing a sample covariance (or correlation) matrix with noise added to each sampled vector. For the latter case independence is not assumed on the unperturbed samples. Although both classes have a broad range of applicability, motivation for studying them comes from the detection problem in array signal processing, when the number of (unknown) sources, impinging on a bank of sensors in a noise-filled environment, is sizable. For both classes the empirical distribution function (e.d.f.) of the eigenvalues (as the dimension approaches infinity) converges to a nonrandom limit. Using techniques and arguments recently developed to successfully analyze the convergence of individual eigenvalues of the first class to boundary points in the limiting support, the principal investigator plans to solve two remaining open problems concerning this class, namely the rate of convergence of both the e.d.f. and those individual eigenvalues, and relaxing independence assumptions. He also intends to study completely the analogous properties of the second class of matrices, beginning with understanding analytically the limiting e.d.f., which is described in terms of an equation satisfied by its Stieltjes transform. The principal investigator plans to study properties of two classes of random matrices of high dimension used in modeling multivariate random phenomena. The motivation stems primarily from the detection problem in array signal processing, that is, determining the number of sources impinging on a bank of sensors in the presence of noise. Under certain conditions, when the number of sources is sizable, known results on one of the classes of random matrices can be used to reliably estimate the number of sources with the total number of measurements much smaller than what is needed according to standard multivariate analysis. The principal investigator intends to study a few remaining questions pertaining to this class, and to mathematically analyze another class of random matrices which allows for a broader range of applications.","title":"Spectral Behavior of Two Classes of Large Dimensional Random Matrices","awardID":"9703591","effectiveDate":"1997-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[50867],"PO":["517169"]},"19919":{"abstract":"Magnetic disk drives are expected to increase in capacity and drop in price at a rate of over 50% per year for at least a decade. By 2010, a terabyte of magnetic disk storage for personal computers will cost a few hundred dollars. The Personal Terabyte Project is developing a set of tools for managing and exploiting this large personal data repository. To guarantee reliability of personal terabyte data, backup techniques including compression, incremental backups, and selective backups of essential data will be implemented, as will disk array redundancy techniques. Future homes will have a variety of network connections, from high-bandwidth, inexpensive broadcast connections to higher-cost, lower-bandwidth point-to-point links. The personal terabyte will cache relevant data that arrives on broadcast networks and aggressively prefetch additional data over point-to-point, on-demand connections. As data are stored on the personal terabyte, the toolkit will perform automatic indexing of text, images and video to facilitate finding data on the massive file system. To address the gap between memory and disk access times, the toolkit will prefetch data from disk to main memory. Finally, to improve application performance, the toolkit will facilitate sharing of the disk cache among local and remote processes.***","title":"Career: The Personal Terabyte Disk: Managing and Exploiting Large Future Magnetic Disks","awardID":"9702609","effectiveDate":"1997-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["491371"],"PO":["209879"]},"20810":{"abstract":"Conceptually, an image recovery problem can be reduced to a constrained minimization problem. In practice, however, the efficient implementation of standard optimization algorithms often encounters serious difficulties due to the complex nature of recovery problems, which not only involve a sizable amount of data and unknowns, but also a wide variety of constraints. The goal of this research is to develop, analyze, implement, and test a eeneral convex minimization algorithm that addresses the specific numerical difficulties posed by image recovery. The basic principle is to decompose the original problem of minimizing over a complex feasibility set into a sequence of simpler minimizations over the intersection of two larger half-spaces. The bundle of constraints is disintegrated into elementary components and, at every iteration, the half-spaces are constructed by activating in parallel a block of approximated (linearized) constraints. A wide range of constraints can thus be processed in a flexible manner and, moreover, fast convergence is achieved thanks to extrapolated relaxations. The three major objectives of this research are to study the proposed constrained image recovery algorithm and rigorously establish its convergence under very general conditions; to investigate the numerical issues pertaining to its optimal implementation in the context of high performance computing; to demonstrate through extensive numerical testing its flexibility and numerical superiority over existing schemes in a wide range of applied image recovery problems.","title":"Parallel Constraints Disintegration and Approximation Methods for Image Recovery","awardID":"9705504","effectiveDate":"1997-07-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[52482],"PO":["564898"]},"22801":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an DS3 ATM connection to the Very High Performance Backbone Network Service (vBNS). This connection will be made through the proposed Boston Area Gigapop which will be connected the the vBNS with an OC-3c circuit. Applications include: - Magnetosphere Modeling - Satellite Data Research and Analysis - Parallel I\/O - High Performance Distributed Simulation - Analysis of Multimedia Information - Transportable and Intelligent Agent Systems Collaborating with: - Brown University - California Institute of Technology - Goddard Space Flight Center - Harvard University - MIT - Naval Research Laboratory, - University of Maryland The award provides partial support of the project for two years.","title":"Connecting Dartmouth College to vBNS and Internet 2","awardID":"9711110","effectiveDate":"1997-07-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["539473",57269],"PO":["182196"]},"21855":{"abstract":"Configurable computing can customize the hardware of a computing environment for each application. Recently some configurable machines based on field- programmable gate arrays have shown significant performance improvement over more traditional processors. However, this performance has come at the cost of meticulous and time-consuming algorithm mapping. This research consists of two projects that attempt to lower the cost of entry to configurable computing. In the uniprocessor domain, performance monitoring and compilation techniques are under investigation for systems that integrate configurable hardware with traditional processors. Drawing on SUIF compiler technology, this project is working toward identification and optimization of code sections that are both time consuming and implementable using configurable hardware. Such code includes stream-oriented data processing, irregular logic operations, and short integer arithmetic. In the multiprocessor domain, FPGAs are being used to implement application- specific cache coherence protocol processors. The key contribution of this work will be studying the performance tradeoffs of application-specific software, configurable hardware, and custom hardware. These may lead to expanded benefits for application-specific protocols.","title":"Applications and Tools for Configurable Computing in Sequential and Parallel Computers","awardID":"9708624","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["495323"],"PO":["549626"]},"20712":{"abstract":"Due to the existence of fast fading and co-channel interference in wireless communications systems, the problems of adaptive equalization and interference suppression call for solutions that are beyond the reach of conventional schemes, e.g., those based on least squares and least-mean-squares. This research project is applying novel adaptive signal processing techniques, referred to as Set- Membership Adaptive Recursive Techniques (SMART), to resolve critical problems that arise in advanced communications systems. The novelty of SMART stems from the following: (1) Their outcomes always satisfy a prescribed instantaneous bound on the magnitude of the estimation error, which in adaptive equalization, is the difference between the desired output and the filtered output. (2) They are characterized through a feasible set of parameters, which meet the specification without requiring the existence of a true parameter. (3) They update parameter estimates selectively depending on the innovation of the input data. This feature leads to an adaptor sharing paradigm that significantly improves the cost-effectiveness and data usage efficiency in adaptive signal processing. In simulation studies, SMART have exhibited superior performance and lower computational complexity in applications such as adaptive equalization and interference cancellation. More generally, this project will establish a sound theoretical foundation for Set-Membership Adaptive Filtering (SMAF), and explore the use of SMART in those applications where performance requirements may exceed what traditional algorithms can offer, e.g., modern multiple access communication systems. We anticipate that this research will advance the state-of-the-art in adaptive filtering, both theoretically and practically, and significantly enhance the performance of modern wireless communication systems.","title":"Set-Membership Adaptive Filtering for High Performance Communication Systems","awardID":"9705173","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["552328"],"PO":["564898"]},"22703":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in distributed modeling and computation; collaboration among distributed participants; and remote sensing, control and visualization. Collaborating institutions include the Center for Research in Parallel Computing sites: Argonne and Los Alamos National Laboratories, rice University, Boston University, University of Illinois and University of Maryland; Lawrence Berkeley and Oak Ridge National Laboratories and the University of Virginia.","title":"University of Tennessee, Knoxville, High-Performance Network Connections Initiative-vBNS Phase","awardID":"9710781","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}}],"PIcoPI":[57023,"180109",57025],"PO":["564246"]},"10988":{"abstract":"This three-year award supports US-France cooperative research on domain decomposition methods for science and engineering problems. The investigators are Charbel Farhat, Jan Mandel, Xiao-Chuan Cai at the University of Colorado, Olof Widlund at New York University, Yvon Maday, Universite Paris Sud and Armel de La Bourdonnaye at the French National Institute for Research in Informatics and Applied Mathematics (INRIA). The investigators will address interdisciplinary computational problems in large-scale structural mechanics, fluid dynamics, electromagnetics, and fluid\/structure dynamics. The research involves theoretical and analytical studies on domain decomposition, parallel processing and high performance computing, and technological studies on stress analysis and mechanical vibration of automotive structures, real gas flows at high Mach and Reynolds numbers, and aeroelastic analysis of full configurations. The US and French investigators' backgrounds and skills are complementary. The project takes advantage of French expertise in applied mathematics and engineering and will contribute toward the next generation computational methods and computational mechanics software.","title":"U.S.-France Cooperative Research (INRIA, CNRS): Domain Decomposition Methods for Scientific and Engineering Problems","awardID":"9603485","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["292489","517075","517181"],"PO":["323582"]},"11538":{"abstract":"The research supported under this award will extend the formal negotiation modeling frameworks of game theory---an approach that guarantees stable interactions among self-interested agents---to incorporate richer models of communication, belief revision, and computation. The research investigates models of how communication and belief revision can lead to changes in the preferences that agents use to compute negotiation moves that are rational in a game-theoretic sense. A metric for comparing negotiation protocols will be devised, and optimal protocols will be chosen using this metric. Then, a full strategic analysis of these types of negotiation process will be performed, accompanied by additional formal analysis, implementation studies and experimentation. The practical objective is facilitating the design of software for automated negotiations among both human and artificial agents.","title":"Optimal Mechanisms for Negotiation Under Message Passing andBelief Revision","awardID":"9610122","effectiveDate":"1997-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[29335,"561267"],"PO":["495796"]},"22968":{"abstract":"Instruction-level parallel (ILP) processing has been an area of great interest in the computer architecture community and the semiconductor industry. Almost all of the processors developed since the last decade do ILP processing in a major way. Ongoing advances in ILP processing necessitate a careful examination of the amount of parallelism that exists in typical programs under various execution models. The main objective of this research is to investigate the potential of pursuing multiple control flows in ILP processors. The study starts by quantifying the effect of different control flow constraints on available parallelism. Software support for pursuing multiple control flows is then studied. Novel methods to specify control independence and data independence to the hardware are part of this study on software support. This research also studies hardware issues relevant to pursuing multiple control flows, such as tradeoffs between the number of speculative paths and performance using detailed simulation models. Preliminary simulation studies have been conducted to get an idea of the amount of parallelism available with single control flow and multiple control flows. These preliminary results indicate a factor of 2 increase in available parallelism when multiple control flows is pursued instead of a single control flow.","title":"Exploring Multiple Control Flows for ILP Processors","awardID":"9711566","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["225924","150177"],"PO":["250083"]},"22638":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an OC-3c ATM connection to the Very High Performance Backbone Network Service (vBNS). Applications include: - Molecular Dynamics Simulations - Mechanical and Aerospace Engineering - Marine and Coastal Science - Particle Physics Experiments - Nuclear Physics - Astrophysics Experiments - Distributed Software Development and Research - Visualization - Stanford Linear Accelerator Center Collaborating with: - Arctic Region Supercomputing Center - CERN - Columbia University - Cornell Theory Center - Firmilab - National Center for Supercomputer Applications - Pittsburgh Supercomputer Center - Thomas Jefferson National Accelerator Facility - University of Mainz The award provides partial support of the project for two years.","title":"High Performance Internet Access for Research and Education in Science an Engineering","awardID":"9710574","effectiveDate":"1997-07-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["435228",56863,56864,"291876"],"PO":["198445"]},"21318":{"abstract":"In recent years CPU execution speed has increased at a much greater rate than DRAM access speed. This disparity has produced a large speed penalty for access to memory by today's computer systems, which may reach several hundred instructions within a few years. Performance of future computer systems may be limited by this effect to the speed of memory rather than the speed of logic. This project investigates a new memory architecture which reduces the speed gap. By integrating a small, wide cache on each DRAM IC, expected DRAM access time will be reduced. By employing dedicated high-performance connections between processor and memory, memory-bus latency will be eliminated. Finally, by incorporating hardware to predict memory access and prefetch data, DRAM latency will be further hidden. These innovations will be evaluated using architectural-level simulations based on traces of memory-intensive programs.","title":"High Performance Memory System: Narrowing the CPU-Memory Speed Gap","awardID":"9706962","effectiveDate":"1997-07-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[53687],"PO":[53688]},"20703":{"abstract":"ABSTRACT-Paolucci CTS-9705150 Unsteady, multi-dimensional combustion processes are modeled using a newly developed wavelet technique combined with a technique to rationally reduce the relevant differential equations to lower dimensions. The focus is on problems in which there is full coupling between fluid mechanics and chemical kinetics; such problems are characterized by a multiplicity of phenomena evolving over widely disparate length and time scales. The first technique uses a multi-level wavelet collocation approximation. The multilevel structure of the algorithm facilitates the computational adaptation of the grid refinement according to the temporal evolution of the solution. The rational reduction phase of the compu- tation applies intrinsic low-dimensional manifold (ILDM) theory; those processes occurring on time scales faster than a physically motivated cutoff time scale are allowed to relax to partial equilibrium while the remaining processes are subject to time evolution. In brief, the wavelet decomposition reduces the total number of unknowns and the rational reduction then reduces the dimension of the manifold on which the system of differential equations is solved resulting in a more efficient numerical method. This project considers both general algorithmic development and application to specific combustion problems well characterized by experiment and\/or independent theory. This work introduces wavelet techniques into combustion modelling and also has applicability to other large-scale numerical simulations.","title":"A Novel Computational Approach to Combustion Modelling","awardID":"9705150","effectiveDate":"1997-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1407","name":"COMBUSTION, FIRE, & PLASMA SYS"}}],"PIcoPI":["485269","400206"],"PO":["202863"]},"21738":{"abstract":"This project is exploring a new approach to instruction-level parallelism. The new approach, disjoint eager execution, uses branch prediction and eager execution to maximize the number of instructions that can be usefully executed on each cycle. The set of branch paths forms a tree, in which each node represents a branch instruction and each edge represents the code executed between branches. In disjoint eager execution, all of the most likely code segments are candidates for speculative execution, rather than only those code segments on the most likely path. In other words, a subtree of instructions is executed that may not be a simple chain. Preliminary research has included some simulations on benchmarks suggesting that speedup of about 30 is possible. This project includes more comprehensive simulations to determine the benefits, along with architectural studies to determine the effects of parallelism on cycle time of the machine.","title":"Order of Magnitude Instruction Level Parallelism","awardID":"9708183","effectiveDate":"1997-07-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["71847"],"PO":["197478"]},"22739":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in computational biology, computational chemistry, materials science, distributed high performance computing, the Long Term Environmental Research (LTER) Program, and visual programming environments. Collaborating institutions include most of the Internet 2 institutions, as well as the Pittsburgh Supercomputing Center, National Center for Supercomputing Applications, and the National Center for Atmospheric Research.","title":"UNM High Speed Connection to the vBNS","awardID":"9710949","effectiveDate":"1997-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1400","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1922","name":"CONNECTIONS"}}],"PIcoPI":["124114","466322"],"PO":["564246"]}}