{"26770":{"abstract":"9729827 Khosla, Pradeep K. Paredis, Christian Carnegie Mellon University CISE Research Instrumenation: Infrastructure for an Information-Based Manufacturing Testbed: A Joint Initiative of Carnegie Mellon and Drexel University This proposal initiates an education and research effort on information-based manufacturing. This collaborative effort between Carnegie Mellon and Drexel Universities, along with numerous industrial partners, will create a multi-university Information-based Manufacturing Testbed consisting of pilot projects in the areas of - Assembly Process Planning, - Subcontractor Selection; and - Engineering Design Repositories. The CMU-Drexel Testbed will be used by researchers, students, and industry participants to conduct exploratory research toward the reduction and elimination of information bottlenecks in the manufacturing enterprise. The fundamental research thrusts of the Testbed will include (1) to define and test computing and network architectures to support information-based design and manufacturing services; (2) to deploy prototype services for assembly, process selection, design-for-manufacture, and artifact fabrication; and (3) to create novel methods for search, retrieval and tracking of engineering data as it is acted upon by teams of people and software agents. The final results will be open to the public---creating an online forum for providing many with a means to become familiar with the latest information technology for engineering.","title":"CISE Research Instrumentation: Infrastructure for an Information-based Manufacturing Testbed: A Joint Initative of Carnegie Mellon and Drexel University","awardID":"9729827","effectiveDate":"1998-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1468","name":"Manufacturing Machines & Equip"}}],"PIcoPI":["555148","564069","96309"],"PO":["301532"]},"28068":{"abstract":"ABSTRACT NCR-9734090 Tse, David Institution: University of California - Berkeley Title: CAREER: A Framework for Resource Allocation in Wireless Networks with Multi-User Receivers ________________________________________________________________ A central problem in the design of wireless networks is how to use the limited resources most to meet the quality-of-service requirements of applications. Two particular classes of techniques have received much attention: 1) at the physical layer, development of novel multi-user receiver structures which mitigate interference between users; 2) at the network layer, dynamic allocation of resources such as transmit power, bandwidth and bit-rates in adaptation to channel conditions. While the networking aspects for conventional multi-access techniques are well understood, the same cannot be said for problems of resource allocation and power control in the context of these multi-user receivers. In this project, we propose to establish a coherent framework to study problems of dynamic resource allocation for multi-user receivers in an integrated manner, drawing on information theory as a fundamental basis for performance evaluation. The specific topics we will study in the proposed framework are: 1) linear multi-user receivers: system capacity under optimal power control; 2) optimal resource allocation for Shannon capacity-achieving multi-user receivers; 3) capacity gain from the use of adaptive antenna arrays; 4) impact of multipath fading on achievable capacity; 5) resource allocation for cellular networks with multi-user receivers. The solution of problems in resource allocation and QOS provisioning in wireless networks requires a marriage of networking and physical layer concepts. With this in mind, my education plan aims to accomplish the more general goal of providing a solid theoretical basis to our students in networking and communications, as well as the more specific goal of highlighting the interplay between networking and physica l layer concepts in wireless networking. These goals will be implemented by course development in four subjects.","title":"CAREER: A Framework for Resource Allocation in Wireless Networks with Multi-User Receivers","awardID":"9734090","effectiveDate":"1998-02-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["523728"],"PO":["188393"]},"28079":{"abstract":"Configurable computing systems combine programmable hardware with programmable processors to produce an adaptive high-performance system. High-performance customized digital circuits execute on the programmable hardware, while flexible software executes on the processor. This project is developing a partial evaluation approach, in which some parameters of specific computations are programmed into the hardware. For some problems, such as combinatorial optimization or factoring, this approach may accelerate performance. Research in this project concentrates on use of a small number of parameterized macros for each type of problem. The UCLA Electrical Engineering Department is introducing a Computer Engineering option into the undergraduate degree. The PSIC effort will be integrated into the capstone design class for this option. This will combine all aspects of computer system design in a focused environment. Students will be attracted to the course material because of its integration into an advanced research program.","title":"CAREER: PSICs: Problem Specific Integrated Circuits","awardID":"9734132","effectiveDate":"1998-02-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["194083"],"PO":["321058"]},"26672":{"abstract":"This award is made under the high performance connections portion of NCRI's Connections to the Internet announcement, NSF 96-64. It provides partial support for the connection of four universities: the University of Florida, Florida State University, the University of Central Florida, and the University of Miami to the NSF very high performance Backbone Network Service (vBNS). Under this award, each institution will implement a DS-3 (45 Mbps) ATM connection to a Florida gigaPop which, in turn, will be connected to the vBNS through a shared OC-3 (155Mbps) connection to the Southern Crossroads connection point at GCATT, from which there is access to the vBNS. This proposal will support a number of advanced network-based research projects, in areas such as: brain research, image processing, quantum physics, nuclear magnetic resonance spectroscopy, global weather forecasting, real-time multicasting, virtual reality 3D diagnostic anatomy, global satellite remote sensing, ocean modeling, medical informatics and many others. These new vBNS connections will facilitate research collaboration not only among the four institutions but also with federal laboratories such as Sandia and Nasa Jet Propulsion laboratory, other research institutions, and agencies such as NASA Langley. This award provides partial support for establishing and operating the four institutional vBNS connections for a period of two years. Within the next several months, additional research universities will connect to the Florida gigaPoP, and the bandwidth of individual institutional connections will be increased from DS-3 to OC-3.","title":"FloridaNet-Florida's Research and Education Network","awardID":"9729623","effectiveDate":"1998-02-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"Y316","name":"NASA-THREE NEW RES SITES FOR H"}}],"PIcoPI":[67154],"PO":["198445"]},"25385":{"abstract":"This is joint project between UCLA and UC Irvine whose objective is the development of faster processors. The study concentrates on the effects of redundant arithmetic in reducing critical paths in the processor. Redundant arithmetic eliminates carry chains in adders, making addition a totally parallel operation. Consequently addition and other operations are speeded up. However, redundant arithmetic imposes overheads on other operations such as logical operators, shifts, and addressing. The objective of this research is to carry arithmetic redundancy as far as possible, and to analyze its effect on all aspects of the processor. Alternative algorithmic and architectural solutions are being developed and analyzed.","title":"Effect of Redundancy in Arithmetic Operations on Processor Cycle Time, Architecture, and Implementation","awardID":"9725771","effectiveDate":"1998-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[64009],"PO":["197478"]},"26651":{"abstract":"9729576 Goutsias, John I. Prince, Jerry L. Johns Hopkins University CISE Research Instrumentation: Computational Techniques for 3-D Modeling and Analysis of Infrared and MRI Image Sequences This research instrumentation award serves to acquire a high-speed supercomputer which will enable the following research projects: - New Techniques in Automatic Target Detection, Recognition, and Tracking from Optical and Infrared Video Sequences, - Segmentation, Modeling, and Statistical Characterization of the Geometry of the Human Brain Cortex from Three-Dimensional Magnetic Resonance Images, and -Spline Algorithms for the Reconstruction of MR Material Markers from Tagged Magnetic Resonance Images. The proposed equipment will be dedicated to research in novel computational techniques for modeling and analysis of infrared and magnetic resonance imaging (MRI) data. The requested equipment will: (a) Allow development and implementation of real-time and near-real-time algorithms using 3-D morphological image processing and analysis techniques (Project 1). (b) Allow fast implementation of continuous image modeling and active geometry algorithms to fit a topologically correct surface to the central layer of the cortex, and development of efficient methods to statistically characterize the shapes of the major sulci (fissures) of the cortex (Project 2). (c) Allow development and implementation of 3-D optical flow algorithms for motion estimation, and enable solution of large matrix equations to determine higher order spline coefficients for tag surface fitting and analysis (Project 3).","title":"CISE Research Instrumentation: Computational Techniques for 3-D Modeling and Analysis of Infrared and MRI Image Sequences","awardID":"9729576","effectiveDate":"1998-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["517652","444628"],"PO":["301532"]},"26772":{"abstract":"9729829 Loftin, Richard B. Scott, L. Ridgway University of Houston CISE Research Instrumentation: Advanced Visualization Facility This research instrumentation grant contributes to the purchase of a state-of-the-art graphics computer to augment the computational and display resources currently available to the researchers of the College of Natural Sciences and Mathematics of the University of Houston enabling the following projects: - Collaborative Visualization, Computational Steering, and Volume Visualization, and - Physics-based Modeling Methods for 3D Human Motion Capture. The College is home to a number of research groups that make extensive use of both local and remote computational resources for scientific visualization. Over the years these groups have made significant contributions to advancing the state-of-the-art in visualizing molecular structures, fluid flows, and volumetric data. These interdisciplinary research groups will expand their use of three-dimensional, immersive and non-immersive displays, multi-sensory displays, and direct interaction techniques for data visualization. The significance and impact of this project is manifested along three directions: (1) ongoing and future research programs will be enhanced and made more productive through access to high performance computing resources for data visualization, (2) the college's educational programs will be able to attract, serve, and better equip students of science, and (3) new researchers can be recruited and new research projects can be sustained through the acquisition of this new resource.","title":"CISE Research Instrumentation: Advanced Visualization Facility","awardID":"9729829","effectiveDate":"1998-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["520206","503560","191920","554348"],"PO":["301532"]},"26784":{"abstract":"9729853 Kesavadas, T. Bloebaum, Christina State University of New York - Buffalo CISE Research Instrumentation: Establishment of a High Performance Real-Time Visualization Research Laboratory This research instrumentation grant contributes to the purchase of an ONYX 2 Silicon Graphics computer with Infinite Reality Engine dedicated to support research in Computer and Information Sciences and Engineering. The award will enable the following projects: - Virtual Manufacturing Visualization, - Visualization Environment for Large-Scale Multidisciplinary Design Optimization (MDO) Problems, - Visualization-Based Mass Customization of Complex Assemblies, and - Analysis and Visualization of Multidimensional Biomedical Structures. The research instrumentation will foster new knowledge in four research areas: (i) Virtual Reality (VR) based manufacturing and design, (ii) Multivariable concurrent design visualization, (iii) Analysis and visualization of multidimensional biomedical structures and (iv) Visualization-based mass customization of complex assemblies. In the first application, this computer will be used to develop a Virtual Factory Testbed consisting of models of machines, processes and simulations where new factories and products can be tested without having to build costly physical prototypes. In the second application, a new method called \"Graphmorphing\" will be developed to enable multi-variable design optimization of aircraft and automobiles. In the third application, researchers at UB will use the visualization laboratory for very advanced bio-engineering application namely study of Microscopic Biolomedical Structures in 3D and Multimodality Cranial Structures for Radiotherapy. In the fourth application a new Visualization-Based Mass Customization of Complex Assemblies will be developed which will benefit selective design of new products in an efficient way.","title":"CISE Research Instrumentation: Establishment of a High Performance Real-Time Visualization Research Laboratory","awardID":"9729853","effectiveDate":"1998-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0708","name":"Division of EMERGING ENGINEERING TECHNOLOG","abbr":"EET"},"pgm":{"id":"1467","name":"MATERIALS PROCESSING AND MANFG"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"5342","name":"Gen & Age Rel Disabilities Eng"}}],"PIcoPI":["528208","508973","516976","319516"],"PO":["301532"]},"25145":{"abstract":"The goal of this project is to develop test procedures for synchronous sequential circuits to produce high quality solutions taking into account the size and complexity of modern circuits. Quality is measured by the fault coverage, the defect coverage, and the test sequence length. To handle size and complexity, high quality solutions are being derived using limited run time and memory. New heuristics and techniques for test generation, test compaction and design-for-testability to address this need are being explored.","title":"High-Quality Tests for Synchronous Sequential Circuits","awardID":"9725053","effectiveDate":"1998-02-01","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["152126","550779"],"PO":["321058"]},"26697":{"abstract":"The University of La Verne will use this grant to connect three of it's remote campus sites to the Internet. These include: the Inland Empire Center, the San Fernando Valley Site and the Ventura Center. The campus sites will be served with a 128KB frame relay connection. The students and faculty of the University of La Verne need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Internet Access for Branch Campuses and Centers, Phase II: Inland Empire, San Fernando Valley and Ventura","awardID":"9729681","effectiveDate":"1998-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67219],"PO":["121202"]},"26621":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for a connection to enhance and accommodate research needs for the University of Alabama and the University of Alabama at Birmingham by establishing a connection to the Very High Performance Backbone Network Service (vBNS) in coordination with the Alabama Research and Education Network. Projects in this proposal include: collaboration on thin film and particulate materials for ultra high-density information storage, simulation of virus capsid assembly from individual coat proteins, remote interactive design of inhibitors using molecular modeling techniques, multisite three-dimensional brain visualization, digital transmission of pediatric cardiology, remote use of astronomy observatories, medical videoscope computer-assisted neurosurgery, ATM network stress testing based on telepath paradigm, mobile network applications test-bed, distributed parallel processing in \"tuple-space\", simulations of action potential propagation in models of cardiac tissue, large scale simulations of materials, and distance learning. With this high performance network capability the University of Alabama and the University of Alabama at Birmingham will expand current research and collaboration with both academic institutions and federal laboratories. On this project, collaborating institutions include: Washington University, Carnegie Mellon University, University of Minnesota, Harvard University, University of Nebraska, George Washington University, University of California at San Diego, Oak Ridge National Laboratory, University of Kentucky, MIT, Yale University, Columbia University, Auburn University, University of Arizona, Georgia Institute of Technology, National Optical Astronomy Observatories, Virginia Polytechnic Institute, Ohio State University, University of North Carolina, and Henry Ford Hospital.","title":"High Performance Connection for Research Universities in Alabama","awardID":"9729500","effectiveDate":"1998-02-15","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["228575",67002,"521241",67004],"PO":["182196"]},"38886":{"abstract":"","title":"Adaptive Receivers for Uncertain, Time-Varying Channels","awardID":"9896209","effectiveDate":"1998-02-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["224978"],"PO":["150411"]},"23860":{"abstract":"This research will analyze the performance of concatenated coding systems and modulation schemes operating over the additive Gaussian channel (AWGN) and various fading channels by examining the loss of capacity resulting from each of the encoding and decoding steps. This information will then be used to guide the design of new coding systems. The techniques described in this research allow the separate evaluation of codes and decoders and thus the identification of where loss of capacity occurs. Knowledge of this capacity loss is important for the overall design of a communications system, e.g. for evaluating the benefits of inner decoders that produce information beyond the maximum likelihood estimate. First a general technique for calculating the composite capacity of an orthogonal code and the AWGN channel in isolation has been developed. Then the composite capacities of an orthogonal code, the AWGN channel, and various inner decoders including the decoder estimating the bit-by-bit probability of a one, as in turbo codes, has been developed. The calculations in these examples show that the maximum likelihood decoder introduces a large loss in capacity. Some of this capacity loss can be regained by using only slightly more complex inner decoders, e.g. a detector for M-ary frequency-shift-keying that outputs the two most likely frequencies and the probability that the ML estimate is correct gives substantially less degradation than one which only outputs the most likely frequency. This project extends these results to other codes and other channels. Practically useful results should be short codes that come close to the sphere packing bound for the Gaussian channel and improved conventional and parallel concatenated codes for fading channels. Experimental studies will be included in the work.","title":"Code Capacity and Code Design","awardID":"9714557","effectiveDate":"1998-02-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["466234"],"PO":["188393"]},"22232":{"abstract":"This award supports the participation of eight US participants to a US-Italy workshop investigating the role of software architecture in testing and analyzing complex systems. The co-organizers are Debra Richardson of the University of California, Irvine, and Paola Inverardi, University of Aquila in Italy. The workshop's objectives are to identify the appropriate uses of formalized software architectures as the abstract basis for analysis and testing, and establishing a research agenda for cross-disciplinary investigation. Software engineering is strong in Italy, and there is a growing interest in software architecture, testing and analysis, and the interaction between the two disciplines. The workshop will lead to new collaborations between US and Italian participants and advance understanding of the area of software architecture that could become a significant force in organizing approaches to software development.","title":"U.S.-Italy Workshop on the Role of Software Architecture in Testing and Analysis: Marsala, Italy, July 1-3, 1998.","awardID":"9709354","effectiveDate":"1998-02-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["272419"],"PO":["214302"]},"38843":{"abstract":"","title":"Optimization and Learning Over Convex Sets","awardID":"9896165","effectiveDate":"1998-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["320878"],"PO":["150516"]},"26798":{"abstract":"9729889 Cohen, William E. Kavi, Krishna The University of Alabama at Huntsville CISE Research Instrumentation: Infrastructure to Support Accurate Performance Measurements of Multithreaded Programs This research instrumentation enables the following research projects: - Pre-Load\/Post-Store (PL\/PS) architecture, - Fine-grained scheduling of multithreaded applications, and - Performance evaluation of the Java language. To support the aforementioned projects, the University of Alabama at Huntsville (UAH) will purchase a 4-processor SMP system and data logging hardware (NIST MultiKron II instrumentation board) which will provide an environment for experimental research in Computer and Information Science and Engineering. The system's low-overhead hardware\/software instrumentation enables accurate performance measurements of multithreaded software and multithreaded architectures without resorting to slow, often intrusive, software simulation techniques. Research topics supported by this instrumentation include the evaluation of the Pre-Load\/Post-Store (PL\/PS) architecture, the comparison of adaptive and static fine-grained task scheduling techniques, and the examination of runtime performance of multithreaded Java programs. The PL\/PS architecture breaks each task in a program into three phases: load, compute, and store. Separating the phases of each task allows greater flexiblity in scheduling the code and provides a means of hiding memory and communication latencies. Detailed simulators and compiler optimizations are being developed for the architecture. The fine-grained scheduling examines the overhead introduced on contemporary hardware\/software environments by the various scheduling techniques applied to suites of real-world problems. The Java performance evaluation investigates the viability of Java as a programming language for high-performance computing and identifies features in the languages that limit performance. A better understanding of these topics will lead to techniques to improve the performance of multithreaded programs and architectures.","title":"CISE Research Instrumentation: Infrastructure to Support Accurate Performance Measurements of Multithreaded Programs","awardID":"9729889","effectiveDate":"1998-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["13545","185146","533936"],"PO":["301532"]},"27667":{"abstract":"9732522 Shah, Mubarak Weeks, Arthur University of Central Florida Research Experiences for Undergraduates in Computer Vision This Research Experiences for Undergraduates (REU) Site project supports ten students per year in programs carried out during the full calendar year, for three years. The students work on projects involving computer vision, including such subareas as visual lip-reading, human face processing, and color image processing. With the full calendar year experience, the students have time to follow a substantial project through to completion. The students meet with their faculty advisor once each week, they participate in the weekly research group meetings and write a technical report on their project. The project has a target of having 50% of the participants being from underrepresented groups.","title":"Research Experiences for Undergratuates in Computer Vision","awardID":"9732522","effectiveDate":"1998-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["505885",69809,"505886"],"PO":[69811]},"27602":{"abstract":"9732339 Dershem, Herbert Hope College REU: Computer Science Research Experience for Undergraduates This Research Experiences for Undergraduates (REU) Site project supports eight students per year in programs carried out during the summers, for three years. Five of the students are from other than the home institution and significant effort is directed at recruiting women and minority students. Areas of research in which the students will be involved include parallel algorithms, system development environments, human-machine interfaces, algorithm animation, and programming languages. The student will perform independent research, give oral presentations on their work, prepare scientific papers, and present their work at seminars at their home institutions and national and regional meetings.","title":"REU: Computer Science Research Experience for Undergraduates","awardID":"9732339","effectiveDate":"1998-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["503906"],"PO":["329035"]},"26788":{"abstract":"9729858 Franklin, Mark A. Washington University CISE Research Instrumentation: Equipment in Support of Parallel Processing Research This research instrumentation enables research in the following areas:- Patterns and Image Recognition,- Computational Biology, and- Discrete Event Simulation. The instrumentation grant funds the purchase of UtraSPARC II processors, data storage, interfaces, backup disk, and software. The parallel processor will support research requiring considerable computational resources to sustain current efforts and make additional progress. A brief description of the projects follows. - Mammogram Screening: Research will continue in the development of automated means for detecting cancer from mammograms. The goal is to improve existing parallel implementations for effective clinical usage. The techniques employed combine the technologies of artificial neural networks and wavelet transforms. - MCD (Multiple Complete Digestion) Mapping: Research will continue on a form of high-resolution, restriction-fragment DNA mapping (MCD mapping). The mapping problem is fundamental to DNA based genetic research. With genomes of enormous size (millions to billions of base pairs), even relatively simple support activities such as software testing are extremely time consuming. The requested equipment will be used to develop parallel algorithms which are faster and more accurate. - Discrete-Event Simulation: Research will continue on developing parallel discrete-event simulation algorithms for modeling large computer communications networks. Effective network designs are needed for the continued expansion and improvement of the Internet and World Wide Web. Parallel simulation techniques will be used to evaluate system performance when relatively rare events occur. For example, blocking probability evaluation in modest sized networks requires processing more than 10 trillion events.","title":"CISE Research Instrumentation: Equipment in Support of Parallel Processing Research","awardID":"9729858","effectiveDate":"1998-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["511555",67487,"511556","525751",67490],"PO":["301532"]},"25589":{"abstract":"9726401 Riseman, Edward Finn, John University of Massachusetts, Amherst Challenges in CISE: Automatic Interpretation of High-Altitude Image Data for Eco-System Modeling The goal of the joint research effort between the University of Massachusetts Computer Science Department and the Department of Forestry and Wildlife Management is the development and demonstration of a practical methodology to enable highly automated and accurate scientific monitoring of natural resource and land use via aerial video and photography. A secondary goal is to use portions of the same system for wildlife surveys and management. The research project will almost completely automate and significantly extend the manual methodology currently in use involving airborne video data collection, time-consuming manual image registration, and construction of customized expert system classifiers for vegetation and terrain cover. Thus the proposed computer science research spans technical issues in computer vision, machine learning, and high performance computing.","title":"Challenges in CISE: Automatic Interpretation of High-Altitude Image Data for Eco-System Modeling","awardID":"9726401","effectiveDate":"1998-02-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["225743","290021","550864","112249","363349","519591"],"PO":["301532"]},"23873":{"abstract":"IP traffic is becoming the killer application for ATM networks. One challenge in current network research is how to effectively transport IP traffic over ATM networks. IP was independently developed on basis of connectionless model, while ATM was originally designed for connection-oriented services. IP traffic is usually switched using packet software-forwarding technology, which is expensive and has substantially limited forwarding capacity. In contrast, ATM switches are designed with high transmission bandwidth, but having limited connection setup processing capacity due to its complex signalling structure developed for connection-oriented services. The proposed research addresses a fundamental problem in resource management for hybrid switching systems. Such systems aim at efficiently transporting layer 3 connectionless IP traffic over layer 2 connection-oriented ATM switching fabrics. The hybrid switching technology is further classified into flow-driven switching and topology-driven switching. The idea behind the flow-based hybrid switching is first to decompose individual IP packet streams into flows and then to classify them into short-lived flows and long-lived flows. While the short-lived flows are best forwarded by the embedded software through permanent virtual connections (PVC), the long-lived flows are more effectively transmitted by hardware through to-be-established switched virtual connections (SVC). Clearly, the key issue in such a flow-based hybrid switching system is the design of an on-line flow classification scheme, which can effectively utilize the constrained system resources to achieve the maximum throughput performance. In contrast, the topology-driven switching establishes switch connections based on current network routing information, i.e., associated with routing table entries rather than individual flows. Hence, no software forwarding is required if the arriving packets can be mapped into such pre-established switched conne ctions. The key issues in such a topology-based hybrid switching system are related to routing scalability, connection-setup initiation and traffic merge. The first part of our proposal will consider the flow classification design in flow-based hybrid switching systems, such as IP switching and MPOA. Unlike the traditional emphasis on resources such as link bandwidth and cell buffer size, our proposal focuses on the resources which are directly associated with packet processing power, signaling capacity and routing table size. Our study indicates that the presently available {\\it static flow classification} methods have a vital shortcoming in balancing the utilization of the system's resources. This is due to the various system design strategies for allocating resources as well as the time varying traffic characteristics. As a consequence, hybrid switching system can end up operating in a highly unbalanced mode where some resources are significantly underloaded while others are heavily overloaded, causing substantial inefficiencies in network performance. We propose a novel approach for {\\it adaptive flow classification} which can balance the utilization of system resources to match the time varying traffic characteristics. The proposed flow adaptation is formulated as a stochastic control problem, where the stochastic control framework can be applied towards the development of efficient and stable flow adaptation algorithms. Our preliminary studies for this proposal show the viability of the proposed flow adaptation for dynamic resource management in hybrid switching system design. Due to its great impact on system performance, we propose to carry out further theoretical analysis, algorithm development and simulation study for flow adaptation mechanisms. The second part of our proposed research will focus on the development of an unified modeling technique for performance comparison study between the flow-driven and topology-driven switching tech nologies. One of the most challenging issues in networking field today is to decide which of these two switching technologies should be adopted. The success of proposed research is expected to have a substantial technical impact on the selection of the next generation switching technologies and also the design and resource management of such IP\/ATM hybrid switching systems. Please visit http:\/\/www.ece.utexas.edu\/~sanqi\/NSF.html for further information.","title":"Adaptive Resource Management for IP\/ATM Hybrid Switching Systems","awardID":"9714586","effectiveDate":"1998-02-15","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["81730"],"PO":["234222"]},"26404":{"abstract":"This project will extend and test a theory and computer model of human reasoning. People routinely reason using schemas, knowledge structures that describe general situations, events, rules, or relationships. For example, a Restaurant schema might specify the kinds of events that take place in restaurants, and the relationships between the actors in those events (e.g., chefs, waiters, customers); a Family Relation schema might specify the kinds of relationships that define various family members, such as sisters, brothers, parents, and uncles. A schema is both general, in that it refers to many specific situations, and highly structured, in that it specifies the relationships between objects, events, or even between other relationships. Psychologists and computer scientists have long recognized the utility of schemas as a basis for reasoning: If one can recognize an object or situation as an instance of a general schema, then one can use the schema to reason about that object or situation. Although the generality and structured nature of schemas make them extremely useful, these features also make schemas very difficult to model. Traditional symbolic approaches to computer modeling are good at representing structured information, but they have difficulty in flexibly matching specific instances to general facts; by contrast, connectionist models are good at flexibly matching instances to general categories, but they have great difficulty representing structured information (such as rules and relationships). We have recently developed a theory of human schema-based learning and reasoning, and implemented this theory as a working computer model. The model, called LISA (Learning and Inference with Schemas and Analogies), combines the flexibility of a connectionist architecture with the capacity to represent and learn relational structures. The resulting system can (a) learn general schemas from specific examples, (b) match new instances to learned schemas, and (c) use the schemas to make inductive inferences about the new examples. LISA makes several novel predictions about human learning and reasoning. Part of the NSF-supported research will be a series of experiments to test these predictions. Another part of the research will extend the LISA model to account for aspects of human story and event comprehension (e.g., If someone tells us `There are four plates per tray,` how do we know that this means each tray will hold, or contain, four plates?), and aspects of spatial reasoning (e.g., If we are told that Bill is taller than Charles and Abe is taller than Bill, how do we figure out that Abe is taller than Charles?). Importantly, the extended LISA model will account for these seemingly different capacities (as well as other capacities, such as reasoning by analogy) in terms of the same basic mechanisms as it uses to account for our ability to reason using schemas. The knowledge gained from the project will contribute to the development of methods for enhancing human learning and reasoning abilities, and also to the development of artificially intelligent systems.","title":"Learning and Inference with Schemas and Analogies","awardID":"9729023","effectiveDate":"1998-02-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["238591",66479],"PO":["179748"]},"23027":{"abstract":"The goals of the research are to develop new robot learning algorithms for qualitatively more complex robots and tasks than have been attempted so far, and to greatly increase the level of automation of implementing robot learning. The research will focus on: 1: tasks and robots with many degrees of freedom, 2: having one robot learn to perform multiple tasks, and generalize appropriately between tasks, 3: learning over a long time span, in which the robot, the task, and the environment change, and 4: combining multiple approaches to robot learning. The research will contribute to a more automatic process for selecting task structure, representations, and adjustable parameters and functions. Two types of learning will be emphasized: learning from demonstration, where the robot learns from a demonstration of how to perform a task, and reinforcement learning, where the robot learns by optimizing a reward function. Flexible methods to represent knowledge will be emphasized, including locally weighted learning and other nonparametric learning techniques. The techniques developed in implementing learning from demonstration will form the basis of the approach to more general learning problems, such as reinforcement learning. This research will be conducted in collaboration with Dr. Mitsuo Kawato at the Advanced Telecommunications Research Human Information Processing Laboratory in Japan. The expected significance of this research is that it will make it easier and less expensive to program robots and machine-based systems in general. From an engineering point of view the goal is to reduce the amount of expensive expert human input into robot programming. From a psychological point of view the goal is to understand how people learn, and this kind of work leads to models of how learning behavior might be accomplished.","title":"Learning From Demonstration","awardID":"9711770","effectiveDate":"1998-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["438708"],"PO":["179262"]},"27438":{"abstract":"The 1998 IEEE Information Theory Workshop is sponsored by the Information Theory Society of the IEEE will be held in San Diego, CA on February 8-11, 1998. The primary objective of the Workshop is to present new perspectives and results in a broad range of research areas in information and its applications. There will be six technical sessions, held serially covering the following topics: 1) Information Theory: 50 Years and Beyond, 2) Universal and Lossless Source Coding, 3) Channel Coding Applications, 4) CDMA, 5) Channel Coding Theory, and 6) Lossy Source Coding. Each session will include six invited speakers, each internationally recognized for contributions in the respective research areas. In addition, there will be a plenary lecture each morning, as well as a special evening lecture. There is also a session for contributed recent research results. The purpose of the award is to provide financial support from NSF for travel grants to U.S> scientists and engineers who could not otherwise attend the Workshop for lack of funding.","title":"1998 IEEE Information Theory Workshop, San Diego, California, February 8-11, 1998","awardID":"9731798","effectiveDate":"1998-02-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["517054","522738"],"PO":["564898"]},"31772":{"abstract":"This workshop is intended to address questions of how current technologies can be assembled into a coherent framework for multi-functional natural language systems in multiple languages. As the world becomes more and more dependent on global information resources, multimodal and multilingual technologies are being increasingly drawn upon to serve monolingual user populations. This workshop will assess multilingual resources, information retrieval, machine translation, multilingual speech recognition, cross- lingual summarization and information extraction, multimedia communication, evaluation and assessment, and methods and techniques for natural language processing. A report will be presented to the sponsors after public discussion and critique.","title":"Workshop: Support for Workshop on Multilingual Information Management","awardID":"9807199","effectiveDate":"1998-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["543277"],"PO":["565227"]},"30166":{"abstract":"The purpose of the Workshop on Managing and Mining Massive Data (M3D-98) is to foster interactions among an invited group of computer scientists who are interested in developing scalable systems for managing and mining massive data sets. The workshop is co-organized by Robert Grossman (University of Illinois, Chicago) and Reagan Moore (San Diego Supercomputer Center). The goals of the workshop are: to identify promising approaches and technologies for scaling data mining to massive data sets; to investigate how data mining can be more tightly integrated with databases, digital libraries, data warehouses, and data archives; to identify how data mining services can be integrated into the emerging national computational infrastructure; and to begin the process of developing community data sets, benchmarks, interchanged formats, and testbeds appropriate for mining massive data sets. The workshop consists of survey talks, background talks and technical talks on different aspects of data mining as well as several application talks describing data mining case studies. In addition, there are also white papers describing fundamental challenges and issues, proposed research agendas, testbeds, emerging standards, and related matters. The white papers and related materials will be available to the invited participants prior to the workshop and to the general public via a M3D web site approximately a month after the workshop.","title":"Workshop on Managing and Mining Massive Data (M3D-98)","awardID":"9802160","effectiveDate":"1998-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["533353"],"PO":["563751"]},"23896":{"abstract":"Third generation personal communication systems are likely to involve many bursty, mobile, multi-media users whose quality of service needs may vary dynamically over time. In order for a wireless system to respond adequately to these demands it will be necessary to determine fundamental mechanisms for allocating QoS needs in the radio environment. Unlike fiber optic links, radio links are likely to be expensive and of poorer quality. Thus, a large part of the quality of service arbitration will have to be supported via coding and other link enhancements techniques. In this proposal, we first present findings that reveal the importance of higher order error statistics in assessing the impact of particular forms of error control on higher layer services. Then we note that when communications are conducted over a layered stack, a particular error control module exerts influence on the overall end to end performance not only via its own error correcting capabilities but also via the type of error events that it passes up to the higher layers. Therefore, we propose to investigate error management mechanisms that not only correct errors but also shape and possibly exploit the statistics of the residual errors that escape to the higher layers. Finally, given a set of end user performance requirements, one can conceive of multiple ways of distributing the error control functions. So, we propose to investigate how to distribute the error control functions. We expect that the proposed work will help in the design of a new generation of network radios.","title":"Error Management in Wireless Networks","awardID":"9714651","effectiveDate":"1998-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["328469"],"PO":["188393"]},"26757":{"abstract":"9729807 Zhang, Hantao University of Iowa CISE Research Instrumentation: Instrumentation for Research in Search Technology This research instrumentation grant contributes to the purchase of several CPUs, switch, disk and tape which will enable the following projects: - Asynchronous Parallel Search Pruning with Applications, - Fast Interior Point Optimization Algorithms, - Optimized Motion Estimation Algorithms for Video Compression, - High Performance Satisfiability Testing, and - Distributed Automated Reasoning, supporting efforts exploring aspects of high-performance search technology. The projects will address: - Development of nagging, an asynchronous, fault-tolerant, parallel search pruning technique with applications to combinatorial optimization, computational biology, and theorem proving; - Development of fast interior-point optimization algorithms and their application to resource allocation and similar problems; - Optimization-based motion estimation techniques for high-quality video compression; - Development of efficient satisfiability testing algorithms and their application to constraint satisfaction and problems in discrete mathematics; - Development of distributed automated-reasoning systems based on the clause- diffusion principle of parallel search with applications to verification, constraint solving, and logic programming. In addition to an environment for the development and testing of coarse-grained distributed search techniques, this new NSF-supported distributed computing facility's high-speed large-memory CPUs constitute the only available dedicated computational resource for empirical evaluations of algorithmic performance, which may sometimes require weeks of CPU time.","title":"CISE Research Instrumentation: Instrumentation for Research in Search Technology","awardID":"9729807","effectiveDate":"1998-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["292881"],"PO":["301532"]},"23875":{"abstract":"The objective of this research is to develop a suite of techniques to allow video distribution at low cost. We explore a novel version of multicast called Dynamic Multicast, a clever way to deliver videos to homes called 2-Phase Service Model, and an efficient technique for disseminating videos on demand over satellites called Skyscraper Broadcasting. - Dynamic Multicast is designed to address the network-I\/O bottleneck which hinders the server from taking full advantage of the network capacity. With this technique, the system is able to support many more simultaneous multicasts than the server is physically capable of. - Skyscraper is designed to exploit the unique broadcast capability of satellites. In this environment, since the bandwidth requirement is proportional to the number of videos, not the number of users, we have a very scalable technology. In terms of costs, the fact that this approach requires essentially no wiring makes it very appealing. - The third technique, 2-Phase Service Model, is intended for environments where the video playback requires a higher bit rate than the physical medium can sustain. Home users can benefit from this technology. It offers a very effective environment for searching high-resolution video libraries from home. To demonstrate the feasibility of these ideas, we implement three video-on-demand systems. We also conduct experiments to assess the performance of these techniques using real video data. For more information on this project, please visit the web page at http:\/\/www.dsg.cs.ucf.edu\/NSF\/nsf.html.","title":"Enabling Future Multimedia Information Systems to Leverage Next-Generation Networking Technologies","awardID":"9714591","effectiveDate":"1998-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["409925"],"PO":["150490"]},"23897":{"abstract":"In the Internet today, packet losses are typically recovered using retransmission, as for example in TCP. The mechanism employed in TCP works well in the unicast environment. In multicast environment, however, such as the MBone, the TCP approach does not work well, especially when the multicast groups are very large. Difficulties arise because of two main problems: implosion and exposure. Implosion occurs when following a packet loss, many receivers multicast the same request; implosion also occurs when in response to a request, many receivers multicast the lost packet. Exposure occurs when requests and retransmissions reach members that have not experienced loss. Both implosion and exposure cause unecessary overhead. Existing solutions are not general because of the trade-offs they offer for reducing implosion and exposure. SRM for example, trades latency for reducing implosion, and uses a crude method for reducing exposure. RMTP, TMTP and LBRRM reduce both implosion and exposure by arranging members in a tree. The tree, however, is hard to construct and maintain in the face of dynamically changing groups without any access to topology information. We propose a new scheme to perform reliable multicast which overcomes the limitations of existing solutions. Our scheme is based on a dynamic tree hierarchy, but pushes the task of costructing and maintaining the tree to the network, where it can be done very efficiently. To achieve this, we enhance the IP Multicast service model by adding new forwarding services to the routers. The scheme combines three ideas to achieve near optimal performance: (a) electing a replier link at each router to eliminate implosion, (b) defining the concept of a \"turning point\" to discover the subtree where loss occurred, and (c) using \"directed multicast\" to limit replies to the loss subtree. These ideas minimize recovery latency and allow group members to be completely isolated from the details of group topology, thus allowing fast adaptation to dynamic membership changes.","title":"An Error Control Scheme for Large-Scale Multicast Applications","awardID":"9714661","effectiveDate":"1998-02-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["292741","438592",60045],"PO":["125800"]},"25538":{"abstract":"This is joint project between UCLA and UC Irvine whose objective is the development of faster processors. The study concentrates on the effects of redundant arithmetic in reducing critical paths in the processor. Redundant arithmetic eliminates carry chains in adders, making addition a totally parallel operation. Consequently addition and other operations are speeded up. However, redundant arithmetic imposes overheads on other operations such as logical operators, shifts, and addressing. The objective of this research is to carry arithmetic redundancy as far as possible, and to analyze its effect on all aspects of the processor. Alternative algorithmic and architectural solutions are being developed and analyzed.","title":"Effect of Redundancy in Arithmetic Operations on Processor Cycle Time, Architecture, and Implementation","awardID":"9726244","effectiveDate":"1998-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[64393],"PO":["197478"]},"26803":{"abstract":"9729900 Shenai, Krishna University of Illinois - Chicago CISE Research Instrumentation: Research Instrumentation for the Design and Prototyping of Emerging Low-Power RF VLSI Technologies This research instrumentation grant enables four distinct research projects: - Semiconductor Technology CAD (STCAD) Tool Integration and Calibration,- Investigation of a Novel Physical Phenomena in Deep Submicron Low-Power RF CMOS Devides and Interconnects,- Circuit Simulation Modeling of Low-Power RF CMOS Devices and Interconnects, and- Design Optimization and Prototyping of Low-Power Mixed Signal RF CMOS VLSI. To support the aforementioned projects, the Department of Electrical Engineering and Computer Science at the University of Illinois at Chicago will purchase state-of-the-art computing equipment dedicated to supporting multidisciplinary research in computer and information science and engineering. The equipment will be used for several research projects cited above. The primary objective of this proposal is to acquire a high-performance multiprocessor and two workstations which will enable performing highly cpu-intensive finite-element simulations with reasonable turn-around time. The server will provide the performance necessary for simulations of a complexity and accuracy not permitted with conventional desktop workstations. This equipment will support over 20 graduate students and one faculty member in their research.","title":"CISE Instrumentation: Research Instrumentation for the Design and Prototyping of Emerging Low-Power RF VLSI Technologies","awardID":"9729900","effectiveDate":"1998-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["396971"],"PO":["301532"]},"24768":{"abstract":"9724004 Hatcher This two-year award supports US-France cooperative research between Philip Hatcher at the University of New Hampshire (UNH) and researchers affiliated with INRIA (French National Institute for Research in Informatics and Applied Mathematics) at the Ecole Normale Superieure de Lyon (ENS-Lyons). The UNH team are experts on the construction of compilers and run-time systems for parallel computers. The ENS-Lyon researchers have recognized expertise in design, transformation and validation of parallel proposals, as well as expertise in programming environments based upon multithreading. These complementary strengths will be brought together to study issues such as: the utility of multithreaded implementations of data-parallel programming languages, the compilation of Java programs for high performance execution on clusters of multiprocessor PCs, and the utilization of thread migration to effect load balancing in both data-parallel and Java programs.","title":"U.S.-France (INRIA) Cooperative Research: A Parallel Programming Environment for C*","awardID":"9724004","effectiveDate":"1998-02-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["562576","141392"],"PO":["323582"]},"27915":{"abstract":"Time varying environments and limited battery energy are two key hurdles on the route to distributed multimedia systems with wireless network links. This project is exploring architectures, protocols, and algorithms to overcome these hurdles for mobile users. In particular, the research is exploring the use reconfigurability in wireless nodes to allow algorithms and protocols to adapt to evolving environments. The reconfigurable wireless node leads to interesting system-level concepts such as hardware applets, in which hardware datapaths can be downloaded and instantiated on demand from network servers. The educational component of the project is based on tightly integrating the proposed research with new graduate and undergraduate courses. The research topics will be explored in project-oriented graduate courses on mobile multimedia information systems and wireless terminal design. Selected prototyping tasks will be used as projects in undergraduate design courses.","title":"CAREER: Reconfigurable Architectures for Highly Adaptive and Energy Efficient Wireless Networked Computing Nodes","awardID":"9733331","effectiveDate":"1998-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["515835"],"PO":["179487"]},"23907":{"abstract":"Abstract for the web page http:\/\/tesla.csl.uiuc.edu\/~srikant\/~wireless.html Fair scheduling of delay and rate-sensitive packet flows over a wireless channel is not addressed effectively by most contemporary wireline fair scheduling algorithms because of two unique characteristics of wireless media: (a) bursty channel errors, and (b) location-dependent channel capacity and errors. Besides, in packet cellular networks, the base station typically performs the task of packet scheduling for both downlink and uplink flows in a cell; however a base station has only a limited knowledge of the arrival processes of uplink flows. Fair scheduling is closely connected to admission control and channel measurements since these are used to allocate a fraction of the channel's capacity to each flow based or its Quality-of-Service (QoS) requirements. In this proposal, we will study the problem of admission control and scheduling together. Most previous work has addressed these two problems separately in the context of wireline networks, but such an approach is not applicable to wireless networks. On-line measurements will be used along with admission control, scheduling and rate adaption to provide good QoS performance. We plan to use on-line measurements to estimate the parameters of simple stochastic processes (such as on-off Markov models) describing the channel state. Off-line measurements would be used to validate and refine our prediction algorithm as well as to develop a simple model for the channel which can used by the on-line measurement algorithm. We will also study the impact of fair wireless packet scheduling on medium access and develop an effective MAC protocol to support simple rate and delay guarantees. Finally, using existing testbeds, we will evaluate the algorithms that result from this research project.","title":"Fair Scheduling and Admission Control for Shared-Channel Wireless Packet Networks","awardID":"9714685","effectiveDate":"1998-02-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["509442","125047"],"PO":["194325"]}}