{"78494":{"abstract":"Proposal Title: PECASE: Formal Analysis and Validation of Probabilistic Guarantees on QoS and other Power\/Performance Characteristics in Embedded Systems Design<br\/>Institution: Virginia Polytechnic Institute and State University<br\/><br\/>As micro-electronic and micro-computing advances proliferate to a large class of information technology appliances, there are two trends dominating the current generation of applications and capabilities. The first trend is increasing use of software in a large number of appliances that imparts intelligent processing and decision making to manage device response and its interaction with the user and the environment. The second trend is increased networking of this \"embedded intelligence\" (also called ambient intelligence in Europe) due to advances in communication and on-chip networking capabilities. Computing in such systems is increasingly application-oriented and must be responsive to the environment in which the device will be placed from hand-held, personal spaces to the human body. This portability of embedded computing places extreme demands on the ability of the system architectures to tolerate varying energy source conditions, communication channel conditions, network conditions, etc. Yet, there is also an increasing need for the application to be predictable on various measures including performance, energy and power consumption and other QoS (Quality of Service) properties. System availability and performance reliability are also extremely important as these systems interact with real world processes and their unavailability may lead to adverse or even disastrous consequences. This research addresses some of the important challenges in the management of the power, energy and performance of embedded computing and networked devices in ways that allows us to develop close bounds on the quality of results achieved. This project is developing fundamental technical advances in the state of the art in dynamic power management (DPM) (at both hardware and software levels), and other types of QoS predictability by employing techniques from formal verification, probabilistic modeling and model checking, and cooperative game theory. The educational part of this project aims at building embedded systems engineering as a sub-discipline of Computer Engineering at Virginia Tech, as well as on popularizing the research results through demonstration of the techniques to more tangible engineering examples. For example, the tools developed may be used for high-way traffic modeling, analysis and controller synthesis for traffic maintenance. Such demonstrations (with appropriate animation) are being developed to illustrate the power of formal and mathematical modeling of complex systems to K12 level students and attract them to engineering. <br\/><br\/>In this project techniques for analysis of strategies and protocols employed in embedded computing systems for resource management are being investigated. The tools being developed will allow formal validation of probabilistic guarantees on performance, energy expenditure and QoS. The project also applies existing tools (whenever possible) for formal analysis to achieve the goals of predictability of such measures. In particular, the following types of questions are being dealt with. (a) How to analyze and compare power\/performance characteristics of multiple competing strategies without having to resort to expensive simulation based methods? (b) How to formally verify probabilistically quantified guarantees on the measures of interest? (c) How to guide designers of embedded system in choosing between alternative possible strategies to achieve some performance goals? (d) How to formally analyze network protocols, using energy models of the","title":"PECASE: Formal Analysis and Validation of Probabilistic Guarantees on QoS and other Power\/Performance Characteristics in Embedded Systems Design","awardID":"0237947","effectiveDate":"2003-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1674","name":"NANOSCALE: INTRDISCPL RESRCH T"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["384407"],"PO":["562984"]},"76010":{"abstract":"This is a collaborative project with Tufts University (Award No. 0226304).<br\/><br\/>This project is developing Services for a Customizable Authority Linking Environment (SCALE) to support all levels of reading in the National STEM Education Digital Library (NSDL). In particular, the project is developing two broad classes of service. First, the investigators are providing automatic linking services that automatically bind key words and phrases to supplementary information. Such services help students, professionals outside a particular discipline, and the interested public to read documents full of unfamiliar technical terms and concepts. For example, astronomy students and curious amateurs may need to see expansions of acronyms--e.g., MACHO (massive compact halo object)--or pictures of \"Kuiper belt objects\"; or the student struggling with research papers on bioluminescence may need to locate information about particular chemical processes or relevant species of echinoderms. Second, the investigators are basing automatic linking on authority control of names and terms and on links among different authority lists such as thesauri, glossaries, encyclopedias, subject hierarchies, and object catalogues.<br\/><br\/>Activities in the project include:<br\/><br\/>* creating and maintaining authority lists of technical terms and concepts harvested from Open Archives Initiative (OAI) metadata, extracted from full text, and imported from existing authority lists;<br\/><br\/>* extending current automatic hypertext capabilities to embed glosses of technical terms and links to related passages within HTML, PDF, and XML documents in the NSDL;<br\/><br\/>* providing term detection and document linking through Simple Object Access Protocol (SOAP)-based Web services;<br\/><br\/>* evaluating the interface to and functionality of SCALE in cooperation with the National Virtual Observatory;<br\/><br\/>* customizing SCALE through explicit user configuration and adaptive learning of preferences; and<br\/><br\/>* collecting annotations on the quality of links to improve precision and provide a training set for future systems.<br\/><br\/>Much of the work at the Tufts University Perseus Digital Library Project (http:\/\/www.perseus.tufts.edu\/) and the Johns Hopkins Digital Knowledge Center (http:\/\/dkc.mse.jhu.edu\/) has already focused on exploiting various kinds of authority lists (gazetteers, biographical dictionaries, dictionaries, glossaries of technical terms, and name authority files) for the automatic generation of hypertext links and for visualizations such as automatically generated dynamic maps and timelines. Such link generation complements the current practice of automatic identification and aggregation of citations. The current project augments and transfers the existing technology for managing authority lists, converting this from a research effort to an institutionalized service serving a wider community.","title":"Collaborative Project: Managing Authority Lists for Customized Linking and Visualization","awardID":"0226234","effectiveDate":"2003-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7444","name":"NATIONAL SMETE DIGITAL LIBRARY"}}],"PIcoPI":["538211","563069"],"PO":["560894"]},"77673":{"abstract":"PROPOSAL NO.: 0234112<br\/>PRINCIPAL INVESTIGATOR: Vipin Kumar<br\/>INSTITUTION NAME: University of Minnesota Twin Cities<br\/>TITLE: NIH-NSF BBSI: The University of Minnesota Summer Bioinformatics Institute<br\/><br\/><br\/>ABSTRACT<br\/><br\/>The mission of the University of Minnesota Bioinformatics Summer Institute (UMBSI) is to provide the highest quality undergraduate level education and research experiences in bioinformatics, equipping the new generation of this burgeoning professional community with the tools for a successful career in bioinformatics. Undergraduates will participate in the Institute for ten weeks during the summer.<br\/><br\/>A series of workshops, seminars and research projects will result in the participants having (i) an introductory understanding of contemporary issues in bioinformatics (ii) an ability to develop and apply information technology solutions to investigate biological systems (iv) an ability to work in multi-disciplinary teams and a realization of the importance of doing so in bioinformatics, (v) a beginning understanding of the impact of bioinformatics solutions on society, including economic, ethical and environmental impacts, and (vi) a keen interest in pursuing further studies and a career in bioinformatics.<br\/><br\/>The computer infrastructure at the Digital Technology Center, and a team of eighteen faculty position will be involved in the the University of Minnesota Bioinformatics Summer Institute for success. The UMBSI will offer the training and the skills that will spark the interest to a new generation of scientists to undertake leading careers in bioinformatics.","title":"NIH-NSF BBSI: The University of Minnesota Summer Bioinformatics Institute","awardID":"0234112","effectiveDate":"2003-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1329","name":"PLANT GENOME RESEARCH PROJECT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}}],"PIcoPI":["563608","508466"],"PO":["560483"]},"75264":{"abstract":"This is an award under the CMG program (Collaborations Between the Mathematical Sciences and the Geosciences) to support mathematical modeling of processes in the magnetosphere. It is jointly funded by the Physical Meteorology program in the Division of Atmospheric Sciences and the Research in Undergraduate Institutions (RUI) program of the Division of Mathematical Sciences. Phenomena originating in the solar wind cause magnetic pulsations upstream from the earth and inside the magnetosphere. They propagate through the magnetosheath but their source and means of propagation are not understood. The broad range of spatial scales and complex dynamics of the plasma regions affected by the pulsations have posed major obstacles to modeling the phenomenon. A new mathematical tool, called multiresolution homogenization, circumvents some of the difficulties. The method constructs mathematical models that implicitly account for a wide range of scales while requiring explicit modeling of only selected scales. It will be applied to modeling waves in the turbulent magnetosheath with the objectives of (1) understanding wave propagation in the magnetosheath and (2) gaining insight on properties of the magnetosheath itself. As society becomes more dependent on satellite communications, it is increasingly important to understand phenomena in the magnetosphere that affect electromagnetic signal propagation.","title":"RUI\/CMG: Multiscale Approach to Wave Propagation through Turbulent Regions of Earth's Space Environment","awardID":"0222148","effectiveDate":"2003-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1522","name":"PHYSICAL METEOROLOGY"}}],"PIcoPI":["509536",195728],"PO":["438085"]},"82283":{"abstract":"EIA-0307461<br\/>S. Shankar Sastry<br\/>University of California-Berkeley<br\/><br\/>The PI meeting will occur for the entire day of Friday, January 10, 2003. This PI meeting will be modeled on the one convened in Orlando, Florida, on January 14, 2002. The purpose of the one-day meeting is to bring together the Principal Investigators from around the country to discuss the intellectual merit of undergraduate research programs, report on their respective REU sites, share ideas with other PI's and discuss both challenges and successes.","title":"Directorate for Computer and Information Science and Engineering (CISE) Research Experiences for Undergraduates (REU) Principal Investigator Meeting","awardID":"0307461","effectiveDate":"2003-01-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["526900"],"PO":["289456"]},"77520":{"abstract":"The future development of space solar power systems presents immense challenges for designers of sophisticated and adaptable robotic systems capable of complex mission assignments in the difficult environment of space. In an effort to help address a subset of these problems, this project will conduct an interdisciplinary investigation integrating the diverse ranges of computer science, neurophysiology, psychology and bioengineering. It will develop a novel animal-in-the-loop robotic architecture for the efficient investigation and optimization of learning algorithms applicable to general cooperative robotic systems. The plan is to eclipse the current trend for bio-inspired robotics through the use of an actual bio-based robot. This will be accomplished by training rats to pilot mobile robots. Rats will be used in place of the traditional sensing mechanisms of robotic systems. In so doing, the researchers aim to exploit the proven superiority of embedded processing paradigms provided by real neural networks. To better understand exactly how and why mammals are such good processors of sensory input and how we might apply their strategies to robotic systems, the researchers will equip each rat with multi-electrode arrays in the sensory regions of their brain. They will collect neural spike data representing the sensory environment as the rat-robot systems complete a cooperative task. Task data and neural recordings will be used in the development and simulation of advanced learning algorithms based on approximate dynamic programming (ADP). A better understanding of sensory processing coupled with advances in ADP models will be used to design more intelligent platforms, namely animal-computer co-adaptation, in cooperative robotic systems. For the development of space solar power objectives, such robotic systems must provide the essential traits of robustness and scalability. The new generalized approach using bio-sensor based, ADP optimized solutins provides a unique high-potential to develop such powerful systems.","title":"An Animal-in-the-Loop, Approximate Dynamic Programming Based Robotic Design Paradigm","awardID":"0233529","effectiveDate":"2003-01-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1787","name":"SERVICE ENTERPRISE SYSTEMS"}}],"PIcoPI":["523723","435267"],"PO":["563109"]},"77102":{"abstract":"Network Intrusion Detection Systems (IDS) are one of several tools used by security professionals to detect and respond to security breaches. Typically an IDS is implemented by tapping a network and diverting a copy of every network message to a sensor. Usually, the sensor is a general-purpose computer running software that examines every packet that it receives. This approach to IDS is easy to implement as it relies on off-the-shelf hardware and software. However, the overhead incurred by the general-purpose operating system and the limited I\/O throughput of most PC and workstation architectures restrict such IDS to low and medium bandwidth networks. Special-purpose IDS platforms, on the other hand, can be optimized to handle high-bandwidth traffic, but the lack of flexibility and the high cost of custom hardware and software make this approach not viable in practice.<br\/><br\/>Recently, parallel and distributed IDS architectures exist that operate on high bandwidth traffic by distributing network packets over a number of general-purpose machines. This approach combines the flexibility of off-the-shelf hardware and software with the high performance of parallel processing. A systematic study of the scalability of this approach as well as an analysis of suitable packet distribution strategies has not been done. Because such clustered architectures pay a potential penalty in terms of space and power required as they are essentially a set of complete computer systems that occupy shelf or rack space, consume power, and require time consuming management and configuration they have space and power costs that are high.<br\/><br\/>The goal of this project is to develop a scalable parallel appliance-based architecture for network intrusion detection systems that is able to reliably monitor high-bandwidth network segments, yet is cost-efficient and retains the flexibility of general-purpose based IDS. High performance is achieved by distributing network traffic among an array of low-cost sensors in a way that does not impact the quality of intrusion detection, while maximizing the available concurrency and minimizing required communication among sensors. Utilizing off-the-shelf single-board computers leads to an inexpensive and compact design that requires less power than a comparable number of complete workstations or PCs.<br\/><br\/>The key component of a parallel intrusion detection platform architecture is the approach by which network packets are distributed across the sensors. As a result, the system design will by guided by a systematic analysis of network traffic characteristics which will provide input into high-level models and simulations. To verify and evaluate the performance and scalability of the resulting architecture, a prototype system will be implemented based primarily on low-cost off-the-shelf hardware and software. By addressing IDS issues using off the shelf components, a product to assist in security breaches may be quickly developed. This could have large, immediate impact on an important network topic.","title":"Scalable Programmable Appliance-based Network Intrusion Detection Architecture","awardID":"0231535","effectiveDate":"2003-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":[201147,201148,"540626"],"PO":["292741"]},"77698":{"abstract":"This award supports student participation in the \"Second International Symposium on Computational Cell Biology\" to be held March 23-25, 2003 at the Cranwell Resort and Golf Club in Lenox, MA. Computational Cell Biology is an emerging interdisciplinary field that responds to the need for computational methods to analyze and organize complex experimental data on the structure and function of the cell. Whereas other meetings in computational biology focus on bioinformatics and structural biology, this is the only meeting geared specifically to the use of computational modeling applications in cell biology and that is primarily targeted to cell biologists. The symposium is being organized by The National Resource for Cell Analysis and Modeling (NRCAM), located in the Center for Biomedical Imaging Technology (CBIT) at the University of Connecticut Health Center. The organizing committee consists of Drs. Leslie M. Loew, Director of NRCAM and CBIT, John Carson, co-Director of NRCAM, and Ann Cowan, Deputy Director of CBIT and head of dissemination and training for NRCAM, who chairs the committee. The first such symposium, held in March 2001, provided a venue for cell biologists to interact with theoreticians and computer scientists, and was highly successful both in its scientific content and in its goal of initiating a new level of communication among different groups of scientists. A major goal of this second meeting is to solidify the community of scientists in this young and expanding field. The scientific focus of the meeting is on areas of cell biology for which modeling approaches are currently being developed, or that are ripe for computational modeling approaches. Specific topics at the meetings will include a range of cellular mechanisms such as regulation of the cytoskeleton and molecular motors, membrane and protein trafficking, regulation of calcium dynamics, signal transduction pathways, and cell cycle control. In each of these areas, researcher using highly quantitative experimental approaches and\/or applying mathematical modeling approaches will be invited to speak. The meeting format includes platform sessions, poster sessions and small workshops and tutorials. The venue for the meeting is a small resort in the Berkshire Mountains that is limited to a maximum of 125 on-site participants. This setting and meeting size is ideal for encouraging individual interactions, and also encourages active participation by graduate and postdoctoral students.","title":"SYMPOSIUM: Second International Symposium for Computational Cell Biology to be held on March 23-25, 2003, in Lenox, MA.","awardID":"0234192","effectiveDate":"2003-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1114","name":"Cellular Processes"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["267562","412303","559216"],"PO":["310749"]},"79823":{"abstract":"0243796 Scott Manalis Massachusetts Institute of Technology Electric Detection of Protein Binding via Aptamer Functionalized Field-Effect Detectors<br\/><br\/>Recently, highly scalable electronic detection systems for DNA have been developed based on the molecule's intrinsic charge. Micrometer-scale field effect sensors, constructed using standard silicon microtechnology, were used to detect nanomolar DNA concentrations within minutes and to distinguish between oligonucleotides differing by a single base. Potential of tailor-made DNA and RNA aptamers for specifically capturing target proteins on the surface of a silicon field-effect sensor is being investigated under this project. In collaboration with University of Texas at Austin, aptamers are designed to translate the aptamer-target complex into a modulation of surface charge at the sensor surface. In addition, in collaboration with Molecular Sciences Institute, recognition molecules are being coupled to the sensor surface to electronically detect simulated biological agents.","title":"SGER: Electronic Detection of Protein Binding via Aptamer Functionalized Field-Effect Detectors","awardID":"0243796","effectiveDate":"2003-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":["492573"],"PO":["565223"]},"77668":{"abstract":"PROPOSAL NO.: 0234101<br\/>PRINCIPAL INVESTIGATOR: Gregory Buck<br\/>INSTITUTION NAME: Virginia Commonwealth University<br\/>TITLE: NIH-NSF BBSI at Virginia Commonwealth University<br\/><br\/><br\/>Abstract<br\/><br\/>This proposal is recommended for funding. The proposal was rated as Highly Recommended (FUND) by the panel and the program director agrees with the panel's judgment.<br\/><br\/>Specific comments about the proposal in relation to the review criteria are outlined below.<br\/><br\/><br\/>Intellectual Merit<br\/><br\/>The fields of bioengineering and bioinformatics are being redefined through technological advances, but it is clear that the most critical work will take place at the interface between classical disciplines. It is therefore essential to attract new people to the field who work well in the gray areas and who can learn to adapt easily to the different languages of molecular biology, computational and mathematical sciences, and engineering.<br\/><br\/>The VCU team has developed an integrated curriculum to provide exposure and experiences in both fields of bioinformatics and bioengineering. This Institute fits into the overall goals of VCU. They have developed a new five year Master's in bioinformatics, with three tracks: computational and engineering, genomics and biology, and quantitative and statistical. Newly created School of Engineering has a strong focus in Bioengineering with connection to MCV Hospitals of VCU Health Systems. VCU Life Sciences creates an umbrella over these entities to enhance the integration of the two fields. <br\/><br\/><br\/>Broader Impact<br\/><br\/>In order to take rising juniors with no necessary laboratory experience and evoke within them the sense that they are active and valuable members of a scientific project, the Institute will lead them through a series of highly integrated intensive research simulations, inspired by actual problems from each of their host laboratories. Core skill bases such as computational and mathematical methods will serve to integrate, across disciplines and research areas, the analytical and methodological skills of the Institute participants. While the first summer will provide students with a view of bioengineering and bioinformatics that is focused on the problems addressed by the laboratories of the institute, the second summer will offer a broader look at the fields.<br\/><br\/><br\/>I recommend funding of the proposal for a total of $660,602 for four years.","title":"NIH-NSF BBSI: Virginia Commonwealth University","awardID":"0234101","effectiveDate":"2003-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1335","name":"IGERT FULL PROPOSALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["381033","381239"],"PO":["560483"]},"77338":{"abstract":"Many large, important scientific and commercial applications use very large data sets that do not fit into available RAM. Such applications have to frequently move portions of their data sets between main memory and secondary storage (such as disks). Unfortunately, because disks are several orders of magnitude slower than RAM, many large applications spend most of their running time on disk I\/Os, resulting in a significant performance degradation.<br\/><br\/>A lot of research has been carried out to address this problem. Generally, the previous solutions include application-specific algorithms and libraries, compiler-based techniques, and limited Operating System (OS) support. While these solutions are effective, they also have some serious drawbacks. In this proposal, the PI proposes careful OS and architecture co-designs of several novel methods that can significantly improve the performance of large, memory-intensive<br\/>applications. The basic idea is to use hardware\/software to collect and analyze the runtime memory access patterns of applications. The knowledge of these patterns is then used to guide prefetching and to improve the page-replacement algorithms.<br\/><br\/>Preliminary results from the proposed systems show very promising improvements in performance. They can drastically reduce the amount of<br\/>page I\/O traffic, and hide latencies of many page I\/Os. Simulation results based on NPB (NAS Parallel Benchmarks) benchmarks show that pattern-guided prefetching and page-replacement can improve performance by up to 100 times. The proposed methods are transparent to user applications. The proposed studies, if successful, will have broad impacts on the field of high performance computing.","title":"Software: Improving Performance of Out-Of-Core Applications with Memory Access Pattern Guided Prefetching, Page Replacement and Clustering","awardID":"0232647","effectiveDate":"2003-01-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["292906"],"PO":["551992"]},"74743":{"abstract":"This project investigates new architectures for domains such as cryptography, signal processing, and error correction, where the applications are highly parallel. Traditional microprocessor architectures will not efficiently scale to exploit the parallelism present in these applications. Hardware design for these applications is too expensive, risky, and inflexible. Reconfigurable computing, which attempts to combine programmability with hardware performance, has logistical problems that will prevent its widespread adoption. This project will develop and evaluate architectures that combine the portability and abstraction of software development with the performance of reconfigurable hardware. This will be done by converting a serial representation of an application into a spatial representation, and executing the spatial representation on a fabric of locally interconnected processing elements. The conversion from<br\/>serial to spatial representation will be performed at run time, concurrently with execution. <br\/><br\/>The first phase of this project will involve the definition and prototyping of a first generation of this architecture. The second phase of the project will refine the code generation techniques for<br\/>the architecture. The third phase of the project will investigate the incorporation of various control-flow operations in the architecture.","title":"ITR: Spatial Computing Architectures","awardID":"0220214","effectiveDate":"2003-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}}],"PIcoPI":[194169],"PO":["564388"]},"80761":{"abstract":"0301027 Roger Brent Molecular Sciences Institute Developing high sensitivity epitope detection reagents for field effect devices<br\/><br\/> First a selection of \"modern\" antibody-based and peptide aptamer molecular reagents to recognize determinants (epitopes) expressed on toxins and organisms that simulate biological weapons is made. Next a selection of molecules that bind to an inert component of Bacillus anthracis toxin, the so-called \"Protective antigen\" and that bind to the surface of spores of the gram-positive organism Bacillus subtilis, which simulate spores of Bacillus anthracis is made. These recognition molecules and simulated biological agents to fabrication group, the Manalis group at the MIT Media Lab, which has recently devised and fabricated field effect devices that can detect surface effects such as binding, by changes in device capacitance. Collaboration with the Manalis group is ongoing to couple these novel molecules to their devices and to learn to use the resulting detectors to detect simulated biological warfare agents.","title":"SGER: Developing High Sensitivity Epitope Detection Reagents for Field Effect Devices","awardID":"0301027","effectiveDate":"2003-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":[210291,210292],"PO":["521045"]},"82456":{"abstract":"ABSTRACT<br\/>0308197<br\/>Thrasyvoulos Pappas<br\/>Northwestern Univ<br\/><br\/>The use of distributed sensor networks for data gathering and analysis is one of the key emerging technologies at the beginning of the 21st century. Such networks consist of a possibly large number of devices (nodes) equipped with multiple sensors (acoustic, imaging, video, seismic, magnetic, infrared, micro-radar, etc.), storage and processing capability, and wireless communication links to neighboring nodes and\/or a central location.<br\/><br\/>Distributed sensor networks offer a lot of exciting possibilities for a number of applications, ranging from environmental monitoring, to industrial process control, to military and security applications, to health monitoring. They also pose a lot of challenging problems for research that derive from the distributed nature of the network, the multimodal nature of the information collected by the sensors, the reliability of the individual nodes, the bandwidth and impairments of the communication links, the power consumption constraints, and the dynamic nature of the overall system.<br\/><br\/>Recent advances in several domains, including sensor technologies, computational speed, storage capacity, networking, and miniaturization, make the project possible and set the stage for significant breakthroughs. A substantial research effort on various aspects of the problem is already under way.<br\/><br\/>A recent issue of the IEEE Signal Processing magazine summarizes some of the ongoing research in the area of signal processing. A substantial effort is coordinated by the DARPA Sensor Information Technology (SensIT) Program, whose mission is the development of all necessary software for networked micro-sensors. SensIT was founded on the concept of a networked system of cheap, pervasive platforms that combine multiple sensor types, embedded processors, positioning ability and wireless communication.<br\/><br\/>The workshop will take place at the Allen Center on Northwestern University's Evanston campus and its duration will be two days. The goal of the proposed workshop will be to identify fundamental research directions in the signal processing and communications areas, the advancement of which will lead to major breakthroughs in the specific focus areas as well as important scientific progress, in general.<br\/><br\/>Based on the discussions of the workshop, a report will be generated that will provide advice to NSF on promising directions for near and long term research in the area of distributed communications and signal processing for sensor networks. The report will also be used to clarify the soon to be announced call for proposals under the title \"Sensors and Sensor Networks for Information, Decision and Action.\"","title":"NSF Workshop on Distributed Communications and Signal Processing for Sensor Networks","awardID":"0308197","effectiveDate":"2003-01-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["290859","467427"],"PO":["564898"]},"76968":{"abstract":"Ultra-wideband (UWB) systems portend to offer multiple communications advantages.<br\/>However, the conventional approach to UWB systems is to emit a short, possibly shaped, pulse at determined intervals. The effect is not unlike your car engine firing a spark plug at determined intervals. Advocates contend that by shaping the pulse and adjusting the interval between pulses, a robust, short-ranged communications system can be achieved. However, traditional UWB systems have only two degrees of freedom, pulse shape and pulse interval. This limits their ability to avoid interfering with critical (e.g. GPS) channels and comply with laws regarding spectrum management.<br\/><br\/>The project investigates solutions to these issues by developing, implementing, and demonstrating an ultra-wideband communications system based on hundreds to thousands of individual carrier channels. Called Hyper-Orthogonal Frequency Division Multiplexing, or HOFDM, such systems will allow the rapid deployment of new wireless Internet services by providing a platform that is flexible with respect to the ambient spectrum regulations and conditions. H-OFDM permits the mining of the existing spectrum to obtain bandwidth to support new networking services.<br\/><br\/>The H-OFDM system has the following attributes:<br\/>1. The radio frequency (RF) environment can be sensed and the system can adapt to the local environment.<br\/>2. The H-OFDM system can adjust to local (foreign) regulations regarding RF emissions.<br\/>3. The H-OFDM system can adjust to propagation conditions, using lower frequencies to penetrate foliage and\/or reach longer distances or use higher frequencies to limit range and support covert operations.<br\/><br\/>Generation of a H-OFDM signal is the combination of hundreds of individual carriers at frequencies compatible with the requirements of the propagation environment, the degree of stealth, and the limitations of the applicable government. OFDM is selected because one can move carriers with relative ease, one can move carriers very close to existing channels, and one can easily control the modulation and bandwidth.<br\/><br\/>The system proposal is based on three components:<br\/>1. Ultra-wideband radio frequency transmitters and receivers.<br\/>2. Ultra-wideband antennas, power amplifiers, and low-noise receivers to support the H OFDM system.<br\/>3. High-performance digital signal processing (DSP) algorithms and components to generate and detect H-OFDM signals.<br\/><br\/>When successful, this project will provide a technology for providing wireless Internet services with greater bandwidth.","title":"STI: Flexible Wireless Systems for Rapid Network Evolution","awardID":"0230786","effectiveDate":"2003-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["421842","250082"],"PO":["564246"]},"76979":{"abstract":"The purpose of this project is to create a high performance Open Network Laboratory (ONL) for use by the networking research community, to enable experimental evaluation of advanced networking concepts in a realistic working environment. The laboratory will be built around a set of open-source, extensible, high performance routers that have been developed at Washington University, and which will be made available to remote users through a Remote Laboratory Interface (RLI) to be developed through this program. The interface will allow users to easily configure and run experiments, using a combination of web forms and a graphical user interface. It will also allow users to extend, modify or replace the software running in the routers' embedded processors and to similarly extend, modify or replace the routers' hardware, which is implemented largely using Field Programmable Gate Arrays, which can be dynamically reconfigured to support new capabilities.","title":"STI: The Open Network Laboratory - A Resource for High Performance Networking Research","awardID":"0230826","effectiveDate":"2003-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["522381","316262"],"PO":["7594"]},"76969":{"abstract":"The tremendous explosion of bandwidth in the core of the Internet has stopped short of end-users due to the well-known \"last-mile\" problem where it has traditionally been infeasible to get a high bandwidth conduit to the home and businesses. \"Fiberless\" or Free Space Optical (FSO) networks can effectively complement unlicensed-spectrum RF-based WLAN technologies like 802.1 lb\/a, and WMAN technologies like 802.16 for the \"last mile\" problem. Free space optics offers tremendous bandwidth and potential for dense spatial reuse of the optical spectrum. Although optical networking has become popular in the wired networking world, free space optics (FSO) is still a niche technology used to provide only selected point-to-point links, and not as a general-purpose metropolitan area networking technology. Moreover, several fundamental aspects of free space terrestrial optical communication are yet to be explored. The proposal is to investigate fundamental limits of very low-cost components, and create communication systems that tap into the high bandwidth potential of FSO, while addressing its key limitations (eg: Line-of-Sight (LOS) availability, LOS discovery, LOS alignment).<br\/><br\/>An investigation of very low-cost communication systems and multi-hop optical networks using high-brightness visible spectrum LEDs (HBLEDs) that have more attractive propagation & spatial reuse characteristics compared to ordinary brightness infrared LEDs will occur. Moreover the potential size, weight, power and form-factor aspects of LED-based systems would make it ideal for use in ad-hoc infrastructures (eg: balloons, treetops, lampposts. poles on chimneys, moving vehicles etc), and novel applications like high-bandwidth mobile ad-hoc networks and future sensor networks may be found.<br\/><br\/>Using trans-receiver pairs that achieve 100 Mbps with 1-10 mW power, the proposal is to use dense integration of thousands of trans-receivers into 2-dimensional and 3-dimensional spatial structures (eg: 2-d array, 3-d spherical\/honeycomb structure). The 2-d array would provide extremely high aggregate bandwidth (100 Gbps and more) over 1-2 km. The proposed 3-d spherical structures (a.k.a. optical antenna) combined with LOS auto-discovery and LOS auto-tracking techniques to instantly discover and track LOS if it exists. This structure will allow uninterrupte4,jiltra-high-speed operation even in high velocity sway (eg: 120 mph, range over 100s of meters) or even mobile conditions.<br\/><br\/>The project will build low-cost FSO interconnection systems, complemented with relatively cheap and programmable electronic components after l0s-l00s of opto-electronic (OEO) hops. It is also proposed to investigate spatial coding and redundancy techniques at the electronic hops taking advantage of the particular spatial structures (eg: 2d array, spherical etc). An examination of fundamental network capacity limits for FSO-based fixed and ad-hoc configurations, and fundamental power-per-bit achievable in future sensor networks will be done. Evaluating the impact of such multi-hop FSO networks on the performance of TCP\/IP, VoIP and multimedia applications. Leveraging a partnership with renowned Internet entrepreneur, field trials of a mix of our prototype low-cost FSO-based systems, off-the-shelf 802.1 lx systems, IP routing and 802. ld bridging protocols will occur.<br\/><br\/>The proposed inter-disciplinary research will make significant contributions to LED-based communications, low-cost free space optical networks, and models for deploying last-mile networks in unlicensed spectra.<br\/><br\/>NSF recognizes the need to solve the lost mile problem and funds this project with the hope of a solution immediately emerging from this project, or new directions to a solution being established.","title":"STI: Multi-Hop Free Space Optics Last-Mile Networks Using Very Low-Cost Components","awardID":"0230787","effectiveDate":"2003-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["342900","557423"],"PO":["564246"]},"87419":{"abstract":"","title":"CAREER: Parallel Discrete Event Simulation: Protocols, Tools and Applications","awardID":"0330990","effectiveDate":"2003-01-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["563568"],"PO":["562362"]},"70777":{"abstract":"This research addresses the creation of efficient algorithms for incrementally re-placing and re-routing small portions of a VLSI circuit to correct problems such as signal integrity, speed and high heat density that have been discovered therein via simulation. The challenge is to quickly re-layout only the affected portion of the circuit, while minimizing any layout changes of the much larger unaffected part of the circuit in order to capitalize on the enormous resources and time already spent on the physical design of the chip, to retain the already optimized features of the design, and to meet time-to-market requirements.<br\/><br\/>Algorithms for both regular VLSI chips and field-programmable gate arrays (FPGAs) are being addressed in this project. For the incremental placement problem, a min-cost network-flow based algorithm is being investigated using both deterministic and probabilistic edge costs. In the incremental routing realm, the following areas are being researched: (a) Algorithms for constraint-driven \"bump-and-refit\" (this allows exploration of solution spaces with different sets of constraints like upper bounds on the increase in net lengths and\/or delays, on the number of vias, and on crosstalk coupling). (2) Performing incremental global and detailed routing in one consolidated framework in order to obtain better optimized routings. (3) Incremental Satisfiability (SAT) methods and their application to incremental routing. (4) Various additional issues and solution techniques needed for incremental routing of VLSI circuits.","title":"Incremental Placement and Routing Algorithms for FPGA and VLSI Circuits","awardID":"0204097","effectiveDate":"2003-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["532322"],"PO":["562984"]}}