{"143550":{"abstract":"NeTS-NECO: Some Fundamental Problems for Performance Study of Opportunistic Spectrum Utilization <br\/><br\/><br\/>Summary of Proposed Research Activities: This work will develop, design, and implement efficient wireless network protocols for better spectrum utilization and study some fundamental performance bounds for networks with opportunistic spectrum utilization. This work will study the Nash Equilibrium points of the spectrum sensing game and spectrum access game when secondary users are selfish. This work will design stable distributed link scheduling and routing methods to maximize throughput, and derive some necessary and\/or sufficient conditions on attainable flows. This work will also develop tractable and insightful metrics and models for wireless networks using SOPs; obtain upper and lower performance bounds for these metrics for a given set of models; define the negotiation between application and network for picking the operating point. <br\/><br\/>Intellectual Merit: This work not only identifies unexplored important problems (i.e., finding equilibriums of spectrum sensing and access games, studying the capacity limits of networks with SOPs) and offers methods to solve them, but also proposes novel approaches to existing interesting problems. By modeling and analyzing the interactions of secondary users, this work can improve the design of distributed radio resource management algorithms with particular interest towards characterizing the algorithms' steady-state, convergence, and stability properties. <br\/><br\/>Broader Impact: Today new wireless technologies are struggling for bandwidth. Dynamic sharing of spectrum can provide a system some flexibility. Our society will gain substantial benefits, both in the short run and in the long run, from introduction of SOP sharing. This work will greatly improve the network performance, and have broad impact on the efficient usage of scarce spectrum resource in networks and furthermore, our society. This project is expected to improve the overall wireless spectral efficiency; enable wireless devices or systems to make full use of spectral resources in an autonomous and distributed manner; stimulate new applications to take full advantage of cognitive radios for better QoS; and provide an excellent vehicle for educating students with hands-on experience.","title":"NeTS-NECO: Some Fundamental Problems for Performance Study of Opportunistic Spectrum Utilization","awardID":"0832120","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560173"],"PO":["565090"]},"145893":{"abstract":"The area of workflow and business process management is undergoing a <br\/>significant transformation, because of a shift from process-centric to <br\/>data-centric workflow design and specification. The goal of this project <br\/>is to articulate key research questions and directions that should be <br\/>explored in order to maximize and hasten the realization of the <br\/>practical and economic value of the new data-centric approach, through a <br\/>workshop that brings together leading researchers and practitioners in <br\/>the area. <br\/><br\/>Emphasis will be placed on research questions that can lead to <br\/>new advances in workflow management applicable to e-government, medical <br\/>workflow, and scientific workflow. The workshop will produce a report <br\/>which articulates (i) the fundamental reasons why the data-centric <br\/>approach can provide significant increases in the flexibility and <br\/>efficacy of workflows, (ii) key research directions that need to be <br\/>pursued to enable this approach, and (iii) ways to incrementally realize <br\/>this approach in the targeted application areas. <br\/><br\/>For further information see the project web page at<br\/>http:\/\/www.cs.ucsb.edu\/~su\/NSF\/0842993.","title":"Workshop: Research Challenges in Data-Centric Workflows","awardID":"0842993","effectiveDate":"2009-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[389214,389215],"PO":["565136"]},"143484":{"abstract":"PROJECT SUMMARY<br\/>Despite or because of the Internet?s great success, it has shown itself to be very resistant again attempts to add new functionality to the network core. This dilemma lead to the recent trend in networking to implement services using overlay networking; overlay networking provides an opportunity for end systems to collaborate with others to achieve enhanced functions without having to modify routers. However, since overlay networks operate at the application layer, they cannot effectively use the resources that are available to network services.<br\/>To address the limitations of services in the current Internet, this work presents a clean slate Internet architecture, called NetServ, based on the concepts of service virtualization. NetServ strives to break up the functions provided by Internet services and to make these functionalities available as modular building blocks for network services. A building block effectively encapsulates a network resource or function realized by a network node, such as link monitoring data or routing tables, and provides tunable parameters for easy configurability. These building blocks form a foundation for the implementation of full-fledged network services, which can then be used by applications. Furthermore, the new framework handles aspects of service discovery, distribution and management, thereby making new services more readily deployable.<br\/>This project addresses five major research challenges in the new service architecture: i) the definition of requirements for a service-virtualized Internet architecture, ii) the design of an architectural framework for modular, virtualized services, iii) the identification of an initial set of key building blocks, which together can provide a foundation for common network services, iv) the development of mechanisms and protocols for service discovery and service distribution, and v) the design and implementation of a content distribution service based on the NetServ architecture.<br\/>The feasibility of the NetServ approach will be demonstrated by building the prototype of a content distribution service. This service will interwork with two other services that are crucial for a variety of applications: a generalized naming service and a network monitoring service. The naming service is capable of naming a variety of network entities (like content, users, services, and devices), while obeying policy constraints. The network monitoring service provides makes network performance data available to applications. <br\/>Overall, the objective of this work is to develop an architecture that provides an efficient and extensible architecture for core network services, to implement a prototype of the new architecture, design and implement a prototype of a content distribution service to demonstrate the feasibility of NetServ, and to evaluate the new architecture in a simulation environment as well as on a GENI-like test bed.<br\/>Intellectual Merit: NetServ fully decouples service execution from packet forwarding on a network node. A service only assumes that a node provides packet transport and possibly offers building blocks that can be used to access resources. The new architecture for next-generation Internet services, therefore, provides an efficient and flexible foundation for network services, makes the future Internet highly evolvable, and decouples services from a specific technology.<br\/>Broader Impact: This work will make the Internet service-centric and enable services to directly utilize network resources as building blocks. NetServ can serve as an excellent container for integrating other ongoing FIND work at other institutions. This project will also contribute to both the graduate and undergraduate experimental and theoretical networking curriculum, and involve under-represented groups within its research efforts.","title":"Collaborative Research: FIND: NetSerV - Architecture of a Service-Virtualized Internet","awardID":"0831734","effectiveDate":"2009-01-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[382069,382070],"PO":["565090"]},"149930":{"abstract":"System theory plays a critical role in technological advancements in a wide array of applications: from new flight control or guidance systems for airplanes and other aerospace vehicles to advanced manufacturing techniques to systems biology and high-speed communication networks. By providing a better understanding of the underlying models, their limitations as well as their potential, different branches of system theory are emerging as instrumental tools in dealing with new challenges that have emerged especially in the areas of modeling and control of large complex systems. For example, large communication networks and power systems are particularly vulnerable to both deliberate and accidental disturbances. Their interconnected structure implies that isolated events can cascade throughout the network with disastrous effects. The systems view also shows tremendous potential in other important fields such as biology or quantum computing. <br\/>The IEEE Conference on Decision and Control (CDC) has long provided the best scientific forum for such deliberations as it brings researchers from all over the world and facilitates their interaction. This year, and for the first time ever the CDC is being held in Latin America (Cancun, Mexico). We anticipate that CDC 2008 will draw approximately 1300 participants. Many of them will be distinguished members of the scientific community, others will be seasoned researches and practitioners, while others will be graduate students who are about to launch their careers. We are particularly concerned about these younger participants as they constitute our future. Recognizing the importance of this group, the Operating Committee of CDC?08, and the leadership of the Control Systems Society (CSS) would like to support and encourage the participation of graduate students. We have already instituted a special graduate student Registration Fee that is one half that of regular attendees. In this proposal we are asking that NSF continue its long tradition of support of this Conference by providing funds that can be used for graduate student travel support. <br\/><br\/>Intellectual Merit:<br\/>Given the scope of the conference, its unprecedented international cooperation and breath, its large number of key plenary and semi-plenary lectures as well as tutorial sessions aimed at providing state of the art view to the scientific community on 4 emerging technologies, CDC 08 provides an exceptional intellectual and training opportunity for prospective control faculty and researchers. We believe that the intellectual benefits of attending this conference on student attendees and the future of the control systems research will be quite significant and worthy of substantial support by all interested parties. <br\/><br\/>Broader Impact: <br\/>Such venues are of special importance for the training of new researchers and graduate students in systems and control. This year, the large number of plenary talks, interactive sessions, tutorials, as well the depth of the international cooperation in staging of the conference will provide students with a unique opportunity for training, far beyond a typical conference. A successful Student Travel Grant will validate the commitment of current CSS leadership in continued support of student activities for future generations of students. <br\/>The National Science Foundation has consistently supported these activities over the years by providing partial travel support for graduate students participating in the Conference. In this proposal we are asking that NFS continue this long-standing tradition and provide travel support for graduate students who will be participating in the CDC 08.","title":"Workshop: CDC 2008 Student Travel Support. To be held in Fiesta Americana Hotel, Cancun, Mexico, on December 7-11, 2008.","awardID":"0901623","effectiveDate":"2009-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7607","name":"ENERGY,POWER,ADAPTIVE SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1403","name":"PROCESS & REACTION ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["465604"],"PO":["564728"]},"144375":{"abstract":"Proposal Number: 0836700<br\/>PI: Patrick H. Winston<br\/>Institution: Massachusetts Institute of Technology<br\/>Lead<br\/><br\/><br\/><br\/>Workshop on International Strategy and Policy for Cyber Security<br\/><br\/><br\/>Abstract<br\/><br\/>The PI is organizing a workshop to involve the community on research problems at the intersection of policy (International and associated with industry), individuals? privacy, and security. Future cyber threats are likely to come from nation states, terrorist organizations, organized crime, or adversaries bent on industrial espionage, all of who are likely to be well funded, aware of their targets? weaknesses, and cyber-intelligent. Defenses against attacks will be driven by the needs of the organizations the target of the attack, including Government and industry, but also must respect privacy needs. <br\/><br\/>The purpose of this workshop is to involve the communities concerned with security and privacy research, international policy (which will help determine the kinds of cyber defense needed), legal issues, economics (to help determine under what conditions security defense ? and privacy needs ? are likely to be implemented by industry). <br\/><br\/>It is anticipated that the workshop will stimulate discussions and research on technological and diplomatic options for mitigating cyber threats and reducing security-related vulnerabilities.","title":"Workshop on International Strategy and Policy for Cyber Security","awardID":"0836700","effectiveDate":"2009-01-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["536919"],"PO":["529429"]},"158587":{"abstract":"This project develops a system that improves parallel efficiency on large numbers of processors - up to tens or hundreds of thousands - without running a program at scale. This system is called MPI-PPA: MPI Performance Prediction and Advisement. MPI-PPA takes as input a scientific computing application along with the input variables, including the desired number of processors, p. With executions on fewer than p processors only - so that these executions will occur quickly - MPI-PPA will produce a list of program phases that are predicted to achieve poor scalability, allowing the programmer to quickly address and possibly re-implement these phases - as well as a prediction for the entire program run.<br\/><br\/>MPI-PPA makes these predictions using statistical regression to develop a prediction function that can be used with any number of processors. MPI-PPA will not require significant program comprehension, an important aspect when considering that computational scientists are typically experts in their scientific domain and not in computer science. The approach of MPI-PPA involves heavy reliance on statistical techniques, so the work in this project will be interdisciplinary between computer science (the PI) and statistics (the co-PI). MPI-PPA will be validated by using benchmark suites such as NAS and ASCI codes, along with large-scale applications - such as Paradis and Raptor - that are of interest to national labs.<br\/><br\/>The broader impact of this work is multifold. First, MPI-PPA will be beneficial for computational scientists as well as cluster administrators. Among the benefits will be a simple and fast performance tuning system, an increase in overall cluster efficiency, and a reduction in response times for individual applications. The technology developed in this project will be transferred, in the form of performance tuning and prediction software, and made available to the public through cooperation with Lawrence Livermore National Laboratory. Second, more interdisciplinary interaction between statistics and computer science will be fostered through the supervised statistical consulting center at the University of Georgia. Third, efforts will continue recruiting students from strong historically black colleges and universities in the area, such as Morehouse University.","title":"CSR-PSCE, SM: MPI-PPA: Improving Efficiency of Large-Scale Clusters Through Statistical Performance Prediction","awardID":"0936251","effectiveDate":"2009-01-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["517411"],"PO":["565255"]},"158268":{"abstract":"Adoption of multi-core architectures brings a shift to parallel programming as the default model for mainstream software development. Industry and academia alike are designing and implementing languages, runtime systems, and architectures to enable and leverage this shift. One of the foremost technologies to emerge from this effort is transactional memory (TM). Transactional memory offers a new paradigm for expressing general-purpose multithreaded applications safely and efficiently. Although much research effort has focused on implementing transactions, relatively less emphasis has been placed on the problem of defining appropriate programming models for transactional memory. This is a research problem of great practical interest, but also significant difficulty, as its interconnected components span the traditional areas of language implementation (compilers), language design, and software engineering.<br\/><br\/>This research explores the issue of programming models for transactional memory. First, the investigators evaluate and refine a programming model for allowing a transaction to perform irreversible operations and to coordinate with other threads. The main concept is that of \"transaction punctuation\" and supports controlled relaxation of transactional guarantees and local reasoning about the effects of other threads. Second, the research examines a hybrid programming model, where a transactional implementation is fitted on a lock-like interface. This approach is suitable both for existing lock-based applications, and for new ones where the programmer has the ability to label critical sections with specific locks. The result is an adaptive combination of the performance advantages of both locks and transactions. Finally, the inestigators study \"open-nesting\" transactional programming models. Open-nesting is a TM model offering high performance, but at the expense of significant programmer effort. The research evolves and generalizes guidelines for correct open-nesting usage, avoiding counter-intuitive behavior.","title":"CPA-CPL-T: Programming Models for Transactional Memory","awardID":"0934631","effectiveDate":"2009-01-01","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":[422657],"PO":["565272"]},"152131":{"abstract":"The 15th annual IEEE International Symposium on High Performance Computer Architecture (HPCA-15) is co-located with the 14th ACMSIGPLAN Symposium on Principles and Practiceof Parallel Programming (PPoPP 09), which is being held February 14-18, 2009. <br\/>HPCA is one of the top conferences in the field of Computer Architecture. The conference addresses a broad spectrum of concerns for computer architecture and computer design including microarchitecture, cache and memory system design, parallel computer architectures, power-efficient architectures, embedded and reconfigurable architectures, I\/O systems, and performance evaluation.<br\/><br\/>The conference organizers are requesting $10,000 to fund 20-30 student travel grants for graduate students attending the conference. Student authors who are presenting papers will receive highest funding priority, followed by non- presenting authors, followed by other students. Students must apply for a travel grant in advance of the conference and are required to write a brief summary of their experience. Grants may cover expenses related to travel to Raleigh for the dates of the conference, and hotel expenses while in Raleigh. The nominal size of the award will be in the range of $250-$500.","title":"WORKSHOP: Support for the 15th International Symposium on High-Performance Computer Architecture (HPCA-15), 2009, Feb. 14-18, 2009","awardID":"0909276","effectiveDate":"2009-01-15","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["475186"],"PO":["565272"]},"143100":{"abstract":"Collaborative Research: Next-Generation Solvers for Mixed-Integer<br\/> Nonlinear Programs: Structure, Search, and Implementation<br\/><br\/>Many scientific, engineering, and public sector applications involve<br\/>both discrete decisions and nonlinear system dynamics that affect the<br\/>optimality of the final design. Mixed-integer nonlinear programming<br\/>(MINLP) optimization problems combine the difficulty of optimizing over<br\/>discrete variable sets with the challenges of handling nonlinear<br\/>functions. MINLP is one of the most flexible modeling paradigms<br\/>available, and an expanding body of researchers and practitioners,<br\/>including computer scientists, engineers, economists, statisticians, and<br\/>operations managers, are interested in solving large-scale MINLPs.<br\/>Unfortunately, the wealth of applications that can be accurately modeled<br\/>by using MINLP is not yet matched by the capability of available<br\/>algorithms and software. This research will address the mismatch<br\/>between natural optimization models and available robust optimization<br\/>solvers, developing and delivering powerful new solvers for<br\/>mixed-integer nonlinear programs. <br\/><br\/>The research thrusts are in three main categories. In the first thrust,<br\/>the investigators study the structure of fundamental MINLP models,<br\/>developing preprocessing techniques and strong valid inequalities. The<br\/>second thrust, search, leverages the results of the structural analyses<br\/>to design search and partitioning strategies for algorithms. The third<br\/>thrust, implementation, focuses on implementing the resulting<br\/>algorithmic frameworks efficiently on modern computational resources.<br\/>The project has the transformative goal of making MINLP into an area in<br\/>which researchers and practitioners can access robust tools and methods<br\/>capable of solving a wide range of important, commonly occurring<br\/>decision support problems.","title":"Collaborative Research: Next-Generation Solvers for Mixed-Integer Nonlinear Programs: Structure, Search, and Implementation","awardID":"0830035","effectiveDate":"2009-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[381020,"431635"],"PO":["565251"]},"143342":{"abstract":"This project focuses on hardware features <br\/>to improve the security of software systems.<br\/>By refining the coarse-grained protections available in<br\/>today's architectures, the project will aim to protect<br\/>the integrity of individual software objects or components.<br\/>The hardware mechanisms force tight controls on <br\/>the execution of software components, which<br\/>programmers can define to be as large as entire<br\/>applications or as small as individual objects. <br\/>The goal is to rapidly detect and also recover from attacks that<br\/>improperly access memory or take over the CPU.<br\/>The approach also includes hardware-supervised<br\/>recovery, to enable systems to return to normal <br\/>operation after an attack and to protect the recovery <br\/>process itself from attacks.<br\/><br\/>The benefits of this project include the ability to <br\/>thwart a large class of attacks and the potential of<br\/>developing more robust software systems in the future.<br\/>Recovery, which has received somewhat less attention than<br\/>attack prevention or detection, is especially important for <br\/>embedded systems that do not have the luxury of intervention <br\/>by human operators.<br\/><br\/>The project will be used to train graduate students and to <br\/>feed material into graduate courses taught at the three <br\/>participating universities. Modules will also be developed for <br\/>use in K-12 education with the aim of drawing students into <br\/>considering careers in computer science and engineering.","title":"Collaborative Research: CT-M: Hardware Containers for Software Components - Detection and Recovery at the Hardware\/Software Interface","awardID":"0830927","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["560392"],"PO":["565327"]},"147214":{"abstract":"There has been a recent large increase in interdisciplinary research that combines work in computer science, information technology, and creativity. This workshop brings together the researchers that have been funded by the CreativeIT program at the National Science Foundation to discuss advances, research issues, and the future related to the following topics:<br\/>Understanding Creative Cognition and Computation. Research in this area leads to cognitive models that serve as inspiration for computational models of creativity, support for human creativity, and approaches for educating people to be more creative. <br\/>Creativity to Stimulate Breakthroughs in Science and Engineering. This area considers the role and performance of artists in developing new technologies, discovering new patterns in information, and in finding new ways of seeing, knowing, and doing computer and information science and engineering. <br\/>Educational Approaches that Encourage Creativity. This area considers a broad range of approaches to teaching that encourages creativity: multi-disciplinary teaching and learning, design studio teaching, skills development through making and doing, and open-ended problem-based learning. <br\/>Supporting Creativity with Information Technology. This area both develops new software and user interfaces to support users in being more creative and evaluates their performance through user studies either in controlled environments with empirical studies or in the context of a complex problem or situation with ethnographic studies.","title":"NSF Creative IT Workshop","awardID":"0848407","effectiveDate":"2009-01-15","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["550870"],"PO":["424970"]},"151230":{"abstract":"The IEEE International Conference on Pervasive Computing and Communications (PerCom) is a high quality conference sponsored by IEEE Computer Society's Technical Committee on Computer Communications (TCCC) and Technical Committee on Distributed Computing (TCDP). Since the beginning of the conference in 2003, it has established as a premier meeting on this topic and has become extremely competitive with acceptance rate below 20%. The submission has been steadily on the rise which shows the interests and level of research activity in the community. So far PerCom was held in North America and Europe, and this is the first time it's being organized in Asia and was held in North America as well as in Europe. It is expecting about 300 will attend this year in Galveston. The corporate sponsor has also been increasing annually.<br\/><br\/>IEEE PerCom is a high quality conference and the premier technical forum dedicated to addressing the key challenges in pervasive computing and networking, including wireless, mobile, mesh and sensor networks, middleware, pervasive services and pervasive applications. This year the number of submissions in response to the CfP was over 240; from which about 30 papers will be accepted (60% of them long papers, 40% short papers) by the Technical Program Committee for presentation at the conference. The proceedings will be an IEEE publication. As in the past, selected (extended) papers will be invited for publication in a special issue of Elsevier?s Pervasive and Mobile Computing (PMC) journal. In addition to the main program, 10 satellite workshops are closely associated with PerCom (PerCom?s registration includes registration to all workshops so attendees can ?mix-and-match? presentations). An additional 100+ peer-reviewed, high-quality papers will be presented under the covers of these workshops.<br\/><br\/>The travel support will enable US-based graduate students to attend and present their research results in this important IEEE conference.","title":"NeTS: IEEE PerCom 2009 Student Travel Support","awardID":"0906107","effectiveDate":"2009-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[403090],"PO":["434241"]},"143321":{"abstract":"The Internet is plagued by security problems including spam, threatening its legitimate role as the engine of growth in the new millennium. While technology makes admirable progress against cyber-security problems, the problem is not one of technology alone. Cyber security is part of a framework that encompasses technological, economic and social issues. The availability of technological solutions needs to be supplemented by service providers accepting responsibility for deploying technologies efficiently. Deployment of solutions and assignment of responsibility today tend to focus on a network provider's accountability to its own customers. In the decentralized Internet, allocation of accountability for potential impact on a remote network is important. This research seeks to direct investments to minimize impact on destination networks by efficient allocation of incentives. Security threats render the Internet a risky environment, and insurance mechanisms can seek to enhance productive and secure use of the Internet by risk management. This project uses game theoretic models to study allocation of incentives among mail service providers to reduce global incidence of spam. This project will develop incentive and insurance mechanisms with the provision for certifying providers who voluntarily accept responsibility for damage to rest of the network, conduct empirical studies of the patterns of spam observed on Internet today for refining the analytical model, and experimentally test and validate the mechanisms and model. This research seeks to start an evolution of the Internet into an accountable and well-organized environment","title":"CT-ISG: Collaborative Research: Incentives, Insurance and Audited Reputation: An Economic Approach to Controlling Spam","awardID":"0830852","effectiveDate":"2009-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":[381623],"PO":["529429"]},"143410":{"abstract":"ABSTRACT:<br\/><br\/>The Internet is plagued by security problems including spam, threatening its legitimate role as the engine of growth in the new millennium. While technology makes admirable progress against cyber-security problems, the problem is not one of technology alone. Cyber security is part of a framework that encompasses technological, economic and social issues. The availability of technological solutions needs to be supplemented by service providers accepting responsibility for deploying technologies efficiently. Deployment of solutions and assignment of responsibility today tend to focus on a network provider's accountability to its own customers. In the decentralized Internet, allocation of accountability for potential impact on a remote network is important. This research seeks to direct investments to minimize impact on destination networks by efficient allocation of incentives. Security threats render the Internet a risky environment, and insurance mechanisms can seek to enhance productive and secure use of the Internet by risk management. This project uses game theoretic models to study allocation of incentives among mail service providers to reduce global incidence of spam. This project will develop incentive and insurance mechanisms with the provision for certifying providers who voluntarily accept responsibility for damage to rest of the network, conduct empirical studies of the patterns of spam observed on Internet today for refining the analytical model, and experimentally test and validate the mechanisms and model. This research seeks to start an evolution of the Internet into an accountable and well-organized environment","title":"CT-ISG: Collaborative Research: Incentives, Insurance and Audited Reputation: An Economic Approach to Controlling Spam","awardID":"0831338","effectiveDate":"2009-01-01","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["521736"],"PO":["497499"]},"143542":{"abstract":"Explosion of wireless products and innovative use of the ISM bands lead to a very crowded spectrum space. When densely deployed, significant performance degradation may be experienced ranging from higher latency and lower data rate to starvation and service disruption. To tackle the co-existence problems, two key challenges need to be addressed. First, there exists innate uncertainty in channel quality, user location and population as well as coexisting devices and networks. Second, many emerging applications using radio technologies in the ISM bands require high availability and predictable services instead of large access bandwidth. The focus of this project is thus to develop theoretical models and algorithms for robust resource management that target at minimizing the outage and\/or disruption of desired service level under varying resource availability in 802.11 like networks. This work will result in i) new methods and measurement procedures for inferring internal and external conditions of broadband wireless networks; ii) novel concept of effective margin as a quantifiable metrics for the robustness of resource management decisions; and iii) design of an optimization framework for robust resource management with both discrete and continuous constraints. The proposed activities serve as fundamental building blocks to address wireless co-existence issues in industry, commercial and medical domains, where severe interferences can possibly cause tremendous economic loss and claim human lives. The interdisciplinary nature of this research lends naturally to a combine engineering and science curriculum development at both undergraduate and graduate levels with a significant experimental component.","title":"NeTS-NEDG: Toward Service Predictability under Uncertain Resource Availability in 802.11 Like Networks","awardID":"0832084","effectiveDate":"2009-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["486325"],"PO":["557315"]},"156303":{"abstract":"Much of human perception is driven by the visual appearance of the<br\/>world. People are captivated by the effects of natural lighting and<br\/>shading patterns, such as the soft shadows from the leaves of a tree<br\/>in skylight, the glints of sunlight in ocean waves, or the shiny<br\/>reflections from a velvet cushion. In computer graphics, it is<br\/>important to be able to accurately reproduce these appearance effects,<br\/>to create realistic images for applications like video games, vehicle<br\/>and flight simulators, or architectural design of interior spaces.<br\/>However, it is still very difficult to accurately model complex<br\/>illumination and reflection effects in interactive applications like<br\/>games, in image-based rendering applications like e-commerce, or in<br\/>computer vision applications like face recognition. In the past, the<br\/>above applications have been addressed separately, by devising<br\/>particular algorithms for specific problems. In this project, the<br\/>research focuses on the mathematical and computational fundamentals of<br\/>visual appearance, seeking to understand the intrinsic computational<br\/>structure of illumination, reflection and shadowing, and develop a<br\/>unified approach to many problems in graphics and vision.<br\/><br\/>The main thrust of the research will be to develop appropriate<br\/>mathematical representations for appearance, along with computational<br\/>algorithms and signal-processing techniques such as Clebsch-Gordan<br\/>expansions, wavelet methods with triple product expansions, and radial<br\/>basis functions. A major advantage of this approach is that the same<br\/>representations, analysis and computation tools can then be applied to<br\/>many application domains, such as real-time and image-based rendering,<br\/>Monte Carlo sampling and lighting-insensitive recognition. This<br\/>research philosophy builds on the investigator's dissertation, where<br\/>he developed a signal-processing framework for reflection, leading to<br\/>new frequency domain algorithms for both forward and inverse rendering.","title":"CAREER: Mathematical and Computational Fundamentals of Visual Appearance for Computer Graphics","awardID":"0924968","effectiveDate":"2009-01-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["485160"],"PO":["532791"]},"155038":{"abstract":"With data mining techniques it is possible to train accurate prediction models for large high-dimensional data. Unfortunately, complex prediction models per se are not easy to understand. To make them 'digestible', analysts need simpler patterns that summarize the complex functions extracted by the model. The number of such function summaries is overwhelming. Each slice of a lower-dimensional subspace of the original data space could contain an interesting function summary.<br\/><br\/>The goal of this project is to develop techniques for finding the most 'interesting' function summaries automatically and efficiently. This is done in three steps. First, by formalizing the notion of interestingness for a wide variety of pattern types. Second, by developing a declarative language for specifying these interestingness measures. With a declarative language analysts define what they find interesting, but they need not specify how to find it efficiently. Third, an optimizing compiler for a small language fragment handles the performance efficiency. A major research challenge is to strike the right balance between expressiveness of the language and making it amenable to effective query optimization.<br\/><br\/>The results of this project will pave the way for powerful exploratory analysis tools. They will also enable future research on optimizers and user-friendly interfaces for the declarative language. The approach will be validated using the rich data resources being organized by the ornithological community in the Avian Knowledge Network (AKN). This will have a tremendous impact on the ability to identify the most significant environmental variables that affect biodiversity on the planet. For example, land managers could discover the possible impact of their decisions on an ecosystem's health.<br\/><br\/>A component of the language will be available to the public through Web services on the AKN Web site (http:\/\/www.avianknowledge.net\/content). Additional results will be disseminated through the project Web site (http:\/\/www.cs.cornell.edu\/~mirek\/Projects\/FunctionSummaries). This will enable a broad audience, from researchers to land managers or bird watchers, teachers or school children to derive novel knowledge from the data resources gathered.","title":"SGER: Finding Interesting Patterns through Analysis of Complex Prediction Models","awardID":"0920869","effectiveDate":"2009-01-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["451421"],"PO":["563751"]},"145931":{"abstract":"Ubiquitous information and communication technologies (ICT) are having transformative effects on the ways in which people socialize and collaborate. In particular, \"virtual organizations\" - aggregations of individuals, facilities and resources that span geographic and institutional boundaries - are an increasingly common work structure in a range of settings. One of the most important problems faced by those working in virtual organizations, however, is that unscheduled informal interaction with colleagues can be difficult to support. When compared with face-to-face collaborations, this means unanticipated problems can take longer to solve, uncertainties and misunderstandings can persist longer, and relationships may take longer to develop.<br\/><br\/>Supporting informal interactions requires improved interpersonal awareness, that is, the ability to quickly and naturally see what colleagues are doing and whether or not they are available to talk. To date, design and research efforts have generally failed to produce novel and widely adopted technologies that overcome the problems associated with sub-optimal interpersonal awareness in virtual organizations. One problem limiting progress in the area is the implicit assumption in many awareness and interruption minimization technologies to reduce ambiguity and provide accurate information about others. There is increasing evidence, however, to suggest that such assumptions may not be valid. In communication, people frequently draw on the ambiguous properties of certain media to maintain plausible deniability about message receipt, avoid confrontation, as well as to encourage or discourage rapid response to a query. <br\/><br\/>With regard to awareness technologies, such practices can sometimes be considered deceptive in that false information about one's availability may be deliberately provided to colleagues. This leads to the following research questions: When and how do people use deception to manage interpersonal awareness with current ICTs? What is the impact of these deceptions on their self-concept and their ability to work with colleagues?<br\/><br\/>Most existing work in this area aims to either characterize people's use of deception, or eliminate deception by providing more accurate information. The long-term goal of this project, on the other hand, is to identify deception and to exploit it as a resource in designing and implementing improved awareness technologies. This SGER enables preliminary work on novel ideas about the identification and usage of deception hotspots in interpersonal awareness is the first exploratory step of a research program that could significantly impact how interpersonal awareness technologies are considered and designed, as well as our understanding of the role of deception in interpersonal awareness. Its primary contributions are: 1) a systematic examination of the conditions under which deception is used as a resource with existing awareness technologies, and 2) a conceptualization of deceptions as an indicator of a \"trouble spot\" in how a technology is supporting interpersonal awareness. <br\/><br\/>Broader Impact: The results of this project will be critical to providing the necessary social capacities in our national cyberinfrastructure that will enable effective and transformative work in various forms of geographically distributed virtual organizations.","title":"SGER: Deception as a Resource in Design to Support Interpersonal Awareness","awardID":"0843215","effectiveDate":"2009-01-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["561930","517608"],"PO":["565227"]},"143511":{"abstract":"NEDG: Efficient Protocol Design for RFID Systems<br\/><br\/>Internet revolutionized the world by connecting numerous computers together. Now people are witnessing another revolution when billions of physical items, such as clothes, folders, books, and other items are connected to the computers. This vision is becoming a reality, thanks to the supporting Radio Frequency Identification (RFID) technology, which allows a reader to read remotely information from an inexpensive tag attached to an item. To enable this technology for reading massive tags for realistic applications, it is crucial to design efficient protocols for RFID communication. The analysis to the current RFID research shows that a dichotomy exists between the high layer data consumer and the low layer wireless communication engineer -- most of the information visible to the low layer is hidden from the high layer. This restricted, throttled interface results in efficiency and security related problems. <br\/>To solve the problem, this project aims to apply cross-layer design methodology so that high layer data users may harness more information exposed from below to solve the existing problems.<br\/><br\/>Intellectual Merit: The project will design protocols and algorithms that deliver better performance for very relevant inventory control applications, help researchers in RFID industry to understand the power of \"cross-layer design\", and guide the design of RFID communication protocols to make relevant information available to the high layer.<br\/><br\/>Broader impact: This work will potentially have an impact in the industrial standard for RFID communication protocols. The project will also integrate research and education by introducing algorithm and system design in RFID to students.","title":"NEDG: Efficient Protocol Design for RFID Systems","awardID":"0831904","effectiveDate":"2009-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[382158,"551983"],"PO":["557315"]},"154247":{"abstract":"ABSTRACT<br\/>Proposal Number: CCR-0238289<br\/>Title: CAREER: Infrastructure for Software Generators and Components<br\/>PI: Ioannis Smaragdakis<br\/><br\/>Domain-specific techniques are among the most promising approaches to software construction and reuse. The research objective of this proposal is to provide advanced infrastructure for software generators<br\/>and components--the most common domain-specific implementation techniques. <br\/><br\/>Specifically, this proposal puts forward two concrete ideas, one in the area of (embedded) software generators and one in the area of component programming:<br\/>-Designing a programming language with C++-like meta-programming support, but without the problems that have plagued C++ template meta-programming.<br\/>-Implementing a component infrastructure for layered libraries of binary components. This infrastructure uses the technology of dynamic loading\/linking in modern operating systems.<br\/><br\/>Developing such infrastructure is particularly valuable because it is the only domain-independent (and thus transferable) part of the intellectual effort of building a generator or component library. <br\/>The education and outreach objectives of the proposal are to (1) develop a new course on component-based and generative software engineering; (2) enhance existing courses with the results of the proposed research; (3) author a textbook on software component technologies and generative programming; and (4) initiate efforts for social outreach and outreach to other scientific areas and software professionals.","title":"CAREER: Infrastructure for Software Generators and Components","awardID":"0917774","effectiveDate":"2009-01-01","expirationDate":"2009-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["422657"],"PO":["564388"]},"143489":{"abstract":"Project Summary<br\/>NeTS: FIND: Collaborative Research: Relationship-Oriented Networking<br\/><br\/>One of the key aspects upon which societies are and have always been built is the notion of relationships?both personal and institutional. In fact, relationships are so ingrained into people?s lives that their role as a fundamental societal fabric is often taken for granted and not explicitly considered. While powerful in one?s everyday life, establishing relationships within the electronic realm of communication networks leaves one without many of the traditional tools for building, sustaining and recognizing relationships. One cannot use visual or auditory cues to verify that they are talking to a friend. Rather, a message that is just words on the screen could just as easily come from someone they know or an imposter. One key reason for this is because often networks have based the notion of identity on the name of a resource rather than some stronger notion such as cryptography provides. The over-arching goal of this project is to consider how to design future network architecture to first pervasively incorporate cryptographic-based identities and then use those strong identities to establish relationships as first-class citizens within networks. This promises to provide better overall usability, security and trust in the system. Ultimately, this work will develop an architectural framework and components that allow users and institutions to build trusted relationships within digital communications that can be viewed and utilized much like relationships outside of the digital communications realm. This project will consider leveraging relationships for a variety of tasks, such as access control, service validation, and naming. It thus moves past a simple transaction-oriented network to a system that is able to provide general linking of activity across time and exposing legitimate assistive services.<br\/><br\/>Intellectual Merit: Computer networks were designed to serve people, but there has been little research in leveraging how people naturally behave and work in the real world. One way people generally operate is by establishing relationships and developing trust in those relationships. This project will design a new network architecture that weave this intuitive mode of operation into communications to give users more confidence in the system by allowing users to build relationships that work much like they do in the real world. This work will respect the tussle-spaces that will naturally occur within the architectural designs. A particular tussle-space that will be considered is that of the benefits of exposing relationships compared with the cost in terms of privacy of doing so. The designed architecture will not mandate how a tussle is resolved, but allow users and institutions to reason about these issues and set policy as they see fit. By enabling a network with a solid understanding of both identity and relationships, this project will empower an immense number of services, protocols and applications to use this information as part of their standard processing.<br\/><br\/>Broader Impact: Over and above its goal of building a trustworthy future Internet, this project will have a number of broader impacts. In terms of networking economics it will make two contributions: (i) added confidence in the security of the overall system will encourage even more widespread use and a broader set of applications as users will feel safe online and (ii) its envisioned new naming system will allow users to choose service providers based on merit rather than on artificial naming constructs. In addition, by putting cryptographic identity as a foundation for the network design, this project will enable cryptographic identity to be widely used within the network architecture. This will have far-reaching benefits to users? privacy by enabling easy encryption of network traffic. Finally, this research will have educational impact in the form of enhanced opportunities for undergraduate and graduate students, as well as mentoring of middle- and high-school students through an established foundation with which we are affiliated.","title":"NeTS: Find: Collaborative Research: Relationship-Oriented Networking","awardID":"0831780","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["563433","525668"],"PO":["565090"]},"139606":{"abstract":"The goal of this project is to conduct an in-depth research on a series of fundamental, open, but very important issues leading to the development of a unified theory consisting of revolutionary methods on the general relational data community discovery and learning. The specific approaches include novel methods on statistical machine learning and data mining with unified views to link to the existing literature in the areas of machine learning and data mining. The intellectual merit includes the development of comprehensive understanding of the general unsupervised relational data clustering and learning as well as the expected breakthrough in the community discovery and learning methodologies. <br\/><br\/>The broader impacts include promoting the timely and effective knowledge dissemination on relational data mining and statistical machine learning, including project?s web site (http:\/\/www.fortune.binghamton.edu\/nsf-iis-0812114.htm), as well as the technology development and transfer in a wide range of applications. Educational and outreach activities include providing educational and research experience for the university students. In addition, activities emphasize advancing and enhancing the high school education and syllabi in sciences and developing an integrated model for high schools' research and services for the local community and beyond.","title":"III-COR-Small: Relational Data Community Discovery and Learning","awardID":"0812114","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["451438"],"PO":["563751"]},"150057":{"abstract":"This award will help to support student attendance at the ACM-SIAM Symposium on Discrete Algorithms (SODA) in New York City, January 3-6, 2009. SODA is the major conference on the analysis of (discrete) algorithms in North America. Nearly half of the attendees are students, for whom the conference serves as a valuable educational experience, both in the technical content of the talks and in the opportunities for networking that it provides. This award will provide partial support to as many as thirty student attendees, covering registration fees, shared hotel rooms, and travel.","title":"Student Travel Support for SODA 2009","awardID":"0902084","effectiveDate":"2009-01-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["563333"],"PO":["499399"]},"143336":{"abstract":"This project focuses on hardware features <br\/>to improve the security of software systems.<br\/>By refining the coarse-grained protections available in<br\/>today's architectures, the project will aim to protect<br\/>the integrity of individual software objects or components.<br\/>The hardware mechanisms force tight controls on <br\/>the execution of software components, which<br\/>programmers can define to be as large as entire<br\/>applications or as small as individual objects. <br\/>The goal is to rapidly detect and also recover from attacks that<br\/>improperly access memory or take over the CPU.<br\/>The approach also includes hardware-supervised<br\/>recovery, to enable systems to return to normal <br\/>operation after an attack and to protect the recovery <br\/>process itself from attacks.<br\/><br\/>The benefits of this project include the ability to <br\/>thwart a large class of attacks and the potential of<br\/>developing more robust software systems in the future.<br\/>Recovery, which has received somewhat less attention than<br\/>attack prevention or detection, is especially important for <br\/>embedded systems that do not have the luxury of intervention <br\/>by human operators.<br\/><br\/>The project will be used to train graduate students and to <br\/>feed material into graduate courses taught at the three <br\/>participating universities. Modules will also be developed for <br\/>use in K-12 education with the aim of drawing students into <br\/>considering careers in computer science and engineering.","title":"Collaborative Research: CT-M: Hardware Containers for Software Components","awardID":"0830910","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[381672,"562052"],"PO":["565327"]},"143358":{"abstract":"This project focuses on hardware features <br\/>to improve the security of software systems.<br\/>By refining the coarse-grained protections available in<br\/>today's architectures, the project will aim to protect<br\/>the integrity of individual software objects or components.<br\/>The hardware mechanisms force tight controls on <br\/>the execution of software components, which<br\/>programmers can define to be as large as entire<br\/>applications or as small as individual objects. <br\/>The goal is to rapidly detect and also recover from attacks that<br\/>improperly access memory or take over the CPU.<br\/>The approach also includes hardware-supervised<br\/>recovery, to enable systems to return to normal <br\/>operation after an attack and to protect the recovery <br\/>process itself from attacks.<br\/><br\/>The benefits of this project include the ability to <br\/>thwart a large class of attacks and the potential of<br\/>developing more robust software systems in the future.<br\/>Recovery, which has received somewhat less attention than<br\/>attack prevention or detection, is especially important for <br\/>embedded systems that do not have the luxury of intervention <br\/>by human operators.<br\/><br\/>The project will be used to train graduate students and to <br\/>feed material into graduate courses taught at the three <br\/>participating universities. Modules will also be developed for <br\/>use in K-12 education with the aim of drawing students into <br\/>considering careers in computer science and engineering.","title":"CT-M: Hardware Containers for Software Components - Detection and Recovery at the Hardware\/Software Interface","awardID":"0831041","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["502125"],"PO":["565327"]},"146515":{"abstract":"Project Abstract<br\/><br\/>The investigator studies stochastic modeling and signal processing aspects of biosensor arrays. The biosensor arrays are time and cost efficient, and enable exciting new applications in medicine, drug discovery, defense systems, and environmental monitoring. Protein arrays, for instance, test for multiple pathogen infections by examining dozens of different antigens at once. DNA microarrays, on the other hand, are capable of screening tens or even hundreds of thousands of different gene sequences at the same time, revealing critical information about the functionality of cells, effects of drugs on organisms, etc. To fully realize the potentials of the biosensor array technology, however, several key research challenges must be addressed.<br\/><br\/>Molecular binding between the bio-molecules of interest and sensing elements, which enables detection in biosensor arrays, is a random process. Real-time biosensors can take multiple temporal measurements of this process, thus allowing observation of the binding kinetics as well as a precise characterization of its steady-state. The investigator specifically aims to: (1) Develop stochastic models and solve the estimation problems in real-time biosensor arrays. This research involves solving parameter estimation problems in discretely observed systems modeled by stochastic differential equations. (2) Determine limits of performance of estimation algorithms in biosensor arrays, characterizing them via lower bounds on the minimum mean-square estimation error. (3) Develop coding strategies that improve the performance of biosensor arrays, and study signal recovery techniques which enable economic use of the sensing resources therein.<br\/>The results of the outlined work are expected to have a major impact on the development and applications of biosensor arrays, and are expected to broaden the educational experience of engineering students at the University of Texas at Austin.","title":"CAREER: Modeling, Estimation and Coding for Biosensor Arrays","awardID":"0845730","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["550783"],"PO":["564898"]},"147538":{"abstract":"Automated telephone dialog systems rely disproportionately on accurate transcription of the speech signal into readable text. When the system has low confidence in the automatic speech transcription <br\/>(ASR) of a caller's utterance, a typical dialog strategy requires the system to repeat its best guess, and ask for confirmation. This leads to unnatural interactions and dissatisfied callers. The current project focuses on developing better dialog strategies given current ASR capabilities by learning automatically from contrasting <br\/>corpora, and comparing the results. Using a novel methodology, wizard ablation, simulated human-system dialogs are collected that vary in controlled ways. The testbed application, an Automated Readers Advisor for New York City's Andrew Heiskell Talking Book and Braille Library, has appropriately limited complexity, and <br\/>potentially broad social benefit. <br\/><br\/>The motivation for wizard ablation is that research is needed into the problem-solving strategies humans would use if the human communication channel were restricted to be more like a machine's. In conventional wizard-of-oz studies, unsuspecting users interact with human wizards \"behind-the-screen\", thus providing data on the way humans interact with (what they believe to be) machines. Unlike a conventional wizard, an ablated wizard is restricted to seeing the ASR input to the system dialog manager. Under a further ablation <br\/>condition, the wizard must choose actions from the repertoire that the system uses, but can combine them freely. The book-borrowing scenarios for the wizard interactions have been designed to be realistic, and Heiskell Library patrons participate in the studies. The collected dialogs will be made available to the community.","title":"REU Supplement to Incremental Wizard Ablation: A Novel WOz Paradigm for Learning, Testing and Evaluating Human-Machine Dialogue using Parameterized Corpora","awardID":"0849666","effectiveDate":"2009-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["528943","472076"],"PO":["565215"]},"150640":{"abstract":"Virtual organizations (VOs) are increasingly significant to research and teaching. Traditional tools to support VOs (e.g., electronic mail) enable communication and coordination at a distance and across institutional barriers. In such cases, the organizational work of forming and sustaining VOs focuses on the use of these tools to foster trust and to negotiate equitable and efficient resource utilization. More recently, research in computer science has sought to delegate such organizational work to a new class of VO tools, collectively termed ?Grid? technologies. Grid technologies are envisioned to provide new modes of collaboration, improved allocation of scarce resources, and novel pathways for discovery and innovation. While past research has successfully addressed questions of long-distance communication and coordination involving traditional tools, much less is known about how new tools may transform VOs. Open questions include: the consequences of delegating trust, access and resource distribution to Grid-based systems; the challenges of sustaining computationally-supported VOs; and the new kinds of organizational roles and responsibilities necessary for the upkeep and maintenance of VOs. <br\/><br\/>This project undertakes a comparative study of VO formation and maintenance in two leading collaborative science networks: the Long Term Ecological Research Network (LTER) and the Open Science Grid (OSG). Both LTER and OSG are mature enterprises for supporting multidisciplinary scientific research; however, they differ in the nature of their VO tool use. Whereas LTER uses a broad variety of conventional tools to augment organizational communication (exhibiting the communicational paradigm, or a 'weakly technically delegated' VO), OSG delegates key components of organizational life and maintenance to Grid-based mechanisms (i.e., a ?strongly technically delegated VO, exemplifying the computational paradigm). Using ethnographic and comparative methods, and drawing on theories from science and technology studies (STS), organization science, and human-computer interaction, this study will compare the different approaches taken by LTER and OSG to: i) provide a better and more sophisticated mapping of the characteristics of individuals, groups and organizations that embrace VOs; and ii) develop rigorous comparative models for the differential human and technical work which sustain VOs.","title":"VOSS: Delegating Organizational Work to Virtual Organization Technologies: Beyond the Communicational Paradigm","awardID":"0904145","effectiveDate":"2009-01-15","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7642","name":"VIRTUAL ORGANIZATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["560633"],"PO":["565342"]},"143513":{"abstract":"PROJECT SUMMARY<br\/>Despite or because of the Internet?s great success, it has shown itself to be very resistant again attempts to add new functionality to the network core. This dilemma lead to the recent trend in networking to implement services using overlay networking; overlay networking provides an opportunity for end systems to collaborate with others to achieve enhanced functions without having to modify routers. However, since overlay networks operate at the application layer, they cannot effectively use the resources that are available to network services.<br\/>To address the limitations of services in the current Internet, this work presents a clean slate Internet architecture, called NetServ, based on the concepts of service virtualization. NetServ strives to break up the functions provided by Internet services and to make these functionalities available as modular building blocks for network services. A building block effectively encapsulates a network resource or function realized by a network node, such as link monitoring data or routing tables, and provides tunable parameters for easy configurability. These building blocks form a foundation for the implementation of full-fledged network services, which can then be used by applications. Furthermore, the new framework handles aspects of service discovery, distribution and management, thereby making new services more readily deployable.<br\/>This project addresses five major research challenges in the new service architecture: i) the definition of requirements for a service-virtualized Internet architecture, ii) the design of an architectural framework for modular, virtualized services, iii) the identification of an initial set of key building blocks, which together can provide a foundation for common network services, iv) the development of mechanisms and protocols for service discovery and service distribution, and v) the design and implementation of a content distribution service based on the NetServ architecture.<br\/>The feasibility of the NetServ approach will be demonstrated by building the prototype of a content distribution service. This service will interwork with two other services that are crucial for a variety of applications: a generalized naming service and a network monitoring service. The naming service is capable of naming a variety of network entities (like content, users, services, and devices), while obeying policy constraints. The network monitoring service provides makes network performance data available to applications. <br\/>Overall, the objective of this work is to develop an architecture that provides an efficient and extensible architecture for core network services, to implement a prototype of the new architecture, design and implement a prototype of a content distribution service to demonstrate the feasibility of NetServ, and to evaluate the new architecture in a simulation environment as well as on a GENI-like test bed.<br\/>Intellectual Merit: NetServ fully decouples service execution from packet forwarding on a network node. A service only assumes that a node provides packet transport and possibly offers building blocks that can be used to access resources. The new architecture for next-generation Internet services, therefore, provides an efficient and flexible foundation for network services, makes the future Internet highly evolvable, and decouples services from a specific technology.<br\/>Broader Impact: This work will make the Internet service-centric and enable services to directly utilize network resources as building blocks. NetServ can serve as an excellent container for integrating other ongoing FIND work at other institutions. This project will also contribute to both the graduate and undergraduate experimental and theoretical networking curriculum, and involve under-represented groups within its research efforts.","title":"Collaborative Research: FIND: NetSerV - Architecture of a Service-Virtualized Internet","awardID":"0831912","effectiveDate":"2009-01-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["518545"],"PO":["565090"]},"146615":{"abstract":"Internet systems perform suboptimally because of selfish user behavior; examples include email spam, freeloading, link spam, and packet flooding. How should a multi-user system such as a computer network be designed such that it operates well in the presence of selfish user behavior? The field of mechanism design lays the economic foundations for the design and analysis of protocols, services, and applications in computer networks where users may act selfishly in their own best interest. With varying degrees of clarity, the classical mechanism design literature gives rigorous mathematical tools from which optimal mechanisms can be derived. Unfortunately, except for a few cases, optimal mechanisms are complex, highly dependent on the details of the setting, and impractical. Dr. Hartline addresses each these critiques in detail, and his project includes a well connected research agenda for developing a theory of mechanism design that is relevant to computer systems.<br\/><br\/>This project will develop a theory for the design of mechanisms that are universal, simple, and practical. Mechanisms for computer systems must be universal -- indeed the success of the Internet is owed in part to the fact that most Internet protocols function under a wide range of workloads. Mechanisms for the Internet must be simple, if they are parameterized by more than a few dimensions, they are too difficult to optimize. Note in contrast that the classical economic theory gives complicated mechanisms that are inextricably dependent on the the setting. Finally, mechanisms for the Internet must be practical; this project addresses the disconnect between theory and practice in the computer science literature on mechanism design.","title":"CAREER: Mechanism Design","awardID":"0846113","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":["516986"],"PO":["565251"]},"143129":{"abstract":"Collaborative Research: Next-Generation Solvers for Mixed-Integer<br\/> Nonlinear Programs: Structure, Search, and Implementation<br\/><br\/>Many scientific, engineering, and public sector applications involve<br\/>both discrete decisions and nonlinear system dynamics that affect the<br\/>optimality of the final design. Mixed-integer nonlinear programming<br\/>(MINLP) optimization problems combine the difficulty of optimizing over<br\/>discrete variable sets with the challenges of handling nonlinear<br\/>functions. MINLP is one of the most flexible modeling paradigms<br\/>available, and an expanding body of researchers and practitioners,<br\/>including computer scientists, engineers, economists, statisticians, and<br\/>operations managers, are interested in solving large-scale MINLPs.<br\/>Unfortunately, the wealth of applications that can be accurately modeled<br\/>by using MINLP is not yet matched by the capability of available<br\/>algorithms and software. This research will address the mismatch<br\/>between natural optimization models and available robust optimization<br\/>solvers, developing and delivering powerful new solvers for<br\/>mixed-integer nonlinear programs. <br\/><br\/>The research thrusts are in three main categories. In the first thrust,<br\/>the investigators study the structure of fundamental MINLP models,<br\/>developing preprocessing techniques and strong valid inequalities. The<br\/>second thrust, search, leverages the results of the structural analyses<br\/>to design search and partitioning strategies for algorithms. The third<br\/>thrust, implementation, focuses on implementing the resulting<br\/>algorithmic frameworks efficiently on modern computational resources.<br\/>The project has the transformative goal of making MINLP into an area in<br\/>which researchers and practitioners can access robust tools and methods<br\/>capable of solving a wide range of important, commonly occurring<br\/>decision support problems.","title":"Collaborative Research: Next Generation Solvers for Mixed Integer Nonlinear Programs: Structure, Search, and Implementation","awardID":"0830153","effectiveDate":"2009-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["511940","523900","493094"],"PO":["565157"]},"146308":{"abstract":"CAREER: Approximation Algorithms and Hardness of Network Optimization Problems<br\/>Julia Chuzhoy<br\/><br\/>Network optimization problems play a central role in combinatorial optimization, and they arise in virtually every area of computer science. Since many such problems are NP-hard, a natural approach is to settle for efficient algorithms that produce near-optimal, or approximate, solutions. Many powerful algorithmic paradigms, and techniques used in proving lower bounds on approximability, have been developed in the context of network optimization problems, leading to a better understanding of many important problems in this class. Despite this progress, some of the most fundamental network optimization problems remain poorly understood. This research will focus on central open problems in the areas of graph partitioning, graph coloring, network design and network routing. One goal of this research is to advance the understanding of the approximability of these problems. The PI would also like to explore the connections between algorithm design and hardness of approximation proofs, and to combine tools developed in the areas of approximation algorithms, graph theory, hardness of approximation and probabilistically checkable proofs in exploring the approximability of network optimization problems.<br\/><br\/>Better approximation algorithms for network optimization problems will lead to improved performance for many applications, and will most probably require the development of new algorithmic paradigms. Understanding and isolating features that make problems intractable will help in finding better formulation for practical problems in the framework of combinatorial optimization, when such features can be avoided. The educational component of this project includes introducing a new course on approximation of network optimization problems. The PI will also participate in activities aimed at encouraging a broader involvement of women in research in theoretical computer science. These activities include participation in workshops and mentorship programs whose target audience is advanced undergraduate and graduate female students.","title":"CAREER: Approximation Algorithms and Hardness of Network Optimization Problems","awardID":"0844872","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["549808"],"PO":["565251"]},"147408":{"abstract":"This grant provides funding for the Foundations of Molecular Modeling and Simulation (FOMMS) 2009 conference to be held in Blaine, Washington July 12 ? 16, 2009. The conference will promote the applications and development of computational quantum methods, molecular science, and engineering simulation. The funds will be used to support participant costs for the meeting, facilitating attendance by young researchers, including junior faculty, postdoctoral researchers, and graduate students, as well as under-represented minorities. The conference features an outstanding and diverse slate of 19 renowned innovators in and practitioners of molecular modeling and simulation from the US, Europe, and Japan who have accepted invitations to present plenary talks over the 4.5 day conference. Additionally, workshops on the development of open source molecular simulation code and on the use of molecular simulation modules in the classroom, and a tutorial and related plenary session on multicore and graphics processor chips for molecular-based simulation, are new highlights of FOMMS 2009. <br\/>The FOMMS 2009 conference will broadly impact researchers and students who develop or use molecular-based modeling and simulation tools in academia and industry. The conference format and venue provide ample time and opportunity for interaction among participants, cross-fertilization of disciplines, and mentoring of young researchers.","title":"Request for Participant Support for Fourth Triannual Conference on Foundations of Molecular Modeling and Simulation (FOMMS 2009); Washington State; July 12-16, 2009","awardID":"0849145","effectiveDate":"2009-01-15","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1954","name":"QUANTUM CALCULATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1403","name":"PROCESS & REACTION ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1633","name":"MATERIALS AND SURFACE ENG"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1417","name":"CHEMICAL & BIOLOGICAL SEPAR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0708","name":"Division of EMERGING ENGINEERING TECHNOLOG","abbr":"EET"},"pgm":{"id":"1414","name":"INTERFAC PROCESSES & THERMODYN"}}],"PIcoPI":["527668"],"PO":["492552"]},"146507":{"abstract":"The amount of existing and newly appearing data accumulated by scientific, governmental and business organizations around the world is daunting. As data of all types gets easier to obtain and cheaper to store, data sets are becoming increasingly large. Consequently, there is a need to perform computational tasks on massive data sets: comparing genomes, compressing media files, searching through and clustering large sets of documents, studying the Internet graph, and compiling census data, to name just a few. This research project has its roots in the following question, fundamental to several fields:<br\/><br\/>* Can we still compute something useful about a data set when reading all of it is prohibitively expensive? In other words, what can we do in time sublinear in the length of the input?<br\/><br\/>For most interesting problems, an exact algorithm provably has to read the entire input, and thus requires at least linear time. However, sublinear algorithms hold the promise of extremely efficient approximate computations.<br\/><br\/>This award integrates research activities aimed at broadening the scope and extending the applicability of sublinear algorithms, with educational activities aimed at building a strong theoretical computer science group at Penn State and broadly disseminating new findings. It pursues three general directions for investigating the power of sublinear algorithms: (1) designing and analyzing new sublinear algorithms for concrete tasks that are used in a variety of applications and require new techniques, (2) building the foundations for a coherent theory of sublinear computation, with the focus on generic techniques for algorithm design and analysis, and new models for data access, (3) exploiting the special structure of problems solvable with sublinear-space algorithms in contexts (e.g., data privacy), where extreme efficiency is not a requirement per se, but helps to guarantee other properties, such a robustness to small changes in the data. A theme common to all three directions is to encompass new problems and models of practical relevance.","title":"CAREER: Sublinear Algorithms --- Theory and Applications","awardID":"0845701","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["426508"],"PO":["565157"]},"163755":{"abstract":"ABSTRACT<br\/><br\/>0829548 ZHAO, Wei- RPI<br\/><br\/>?Complementarities between the United States and China Workshops in Science Research and Education?<br\/><br\/>This award supports up to 10 deans representing the natural and computer sciences from a broad diversity of U.S. universities to undertake a 10-day structured visit (October 20-31, 2008) to meet peers at major scientific research organizations in three cities in China, namely, Beijing, Xi?an and Shanghai. Participants are selected based on demonstrated leadership in their respective science communities, and from institutions which have a strong interest, but less experience with China at the institutional level. Half the participants are women or minorities. <br\/><br\/>The U.S. PI is Dr. Wei Zhao, Dean of Science at Rensselaer Polytechnic Institute. The counterpart organizers are Dr. LIN, Jiahua, Office of the Provost, Peking University, Ms. CHEN, Huai, International Office of the National Natural Science Foundation of China, and Dr. ZHANG, ShengSheng, International College of Shanghai Jiaotong University. The objectives of the visit include developing insight into challenges in science education, developing targeted exchange programs that complement research strengths of U.S. and Chinese institutions, and assessing the complementarities of China?s scientific infrastructure with the research interests of U.S. early-career researchers and students from the fields of science represented in the delegation.","title":"Insightful Understanding of China's Science Education and Research","awardID":"0963985","effectiveDate":"2009-01-09","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["453727"],"PO":["553073"]},"151920":{"abstract":"The Workshop on Social Computing, Behavioral Modeling, and Prediction provides an interdisciplinary platform to encourage researchers of traditionally disjoint fields such as sociology, psychology, behavioral science, cognitive science, mathematics, computer science, religious studies, and engineering to exchange ideas and findings, enhance mutual understanding of state&#8208;of&#8208;the art development in individual fields, develop cross&#8208;discipline awareness, promote collaborative research opportunities, and offer a conducive environment for graduate students. <br\/><br\/>In the last few years, the emergence of the social web has had a profound influence on computing and on society. A pertinent example stems from social networks where individuals from various cultural and social backgrounds interact and exchange information. In such a scenario, it will be useful to understand the development of such social networks and the behavior of individuals who are part of such networks to gain insight into different cultures and patterns of social behavior that can form the basis for predictive models. The focus of this workshop is not only on applications pf social computing but also on the encompassing research from varied areas that can provide insight. Computer scientists are key members of this community of researchers but social scientists are integral as well. <br\/><br\/>This workshop provides a training ground for budding researchers in the area. This workshop will create awareness among the community about the uses of such research to various areas. The workshop will be webcast to include people that are unable to attend, and will result in a proceedings published as a book by Springer.","title":"NSF Workshop Sponsorship for the Second International Workshop on Social Computing, Behavioral Modeling, and Prediction","awardID":"0908506","effectiveDate":"2009-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["517806"],"PO":["565227"]},"150206":{"abstract":"The design of efficient graph algorithms continues to be one of the central problems of computer science. Graphs can be used to model everything from social networks to biological systems to boolean circuits. There are currently many approaches to the design of graph algorithms, but there still remain many open problems. The proposed research studies a new algebraic approach to the design of efficient graph algorithms that is based on the Jacobian of a graph. Every graph has an abelian group?the Jacobian? that is associated with it. This group is the same for isomorphic graphs, although it does not uniquely determine the graph. However, the Jacobian does contain a great deal of important information about the graph. The plan is to exploit the Jacobian to design new efficient algorithms for important graph problems. Some of the problems that will be studied include: sampling random sub-graphs with specific properties, graph isomorphism for new classes of graphs, and many other problems. The success of the proposed research will significantly increase our understanding of graph algorithms. It will not only discover new algorithms, but will open the door on an entirely new approach to the creation of additional algorithms.","title":"SGER: A Proposal For Research Into The Jacobians Of Graphs","awardID":"0902717","effectiveDate":"2009-01-15","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":[400310],"PO":["565251"]},"143291":{"abstract":"Proposal: CCF- 0830734<br\/>Title: Geometric Data Structures<br\/>PI: Souvaine, Diane L.<br\/>Institution: Tufts University<br\/><br\/>Geometric Data Structures<br\/>Abstract<br\/>A data structure is a repository of information; the goal is to organize the data so that it needs less storage (space) and so that information can be retrieved quickly (query). A geometric data structure handles data which has locations attached to it (e.g. addresses of fire stations in the state of Massachusetts). Geometric data structures have become pervasive and an integral part of life; and can be queried to produce driving directions or the name of the nearest Italian restaurant. Since the space and query time of a data structure depend upon the type of queries it has to support, it is important to study which tools and techniques are suitable for which data structures. The ongoing quest for better data structures sometimes results in improved methods and sometimes results in entirely new techniques. The goal is to determine optimal data structures with the best possible performance.<br\/><br\/>This research project focuses on creating new and efficient data structures for geometric queries and geometric decision problems that close the gaps between known lower and upper bounds. Particular problems include planar simplex emptiness queries, relative convex hull queries in dynamic subdivisions, and dynamic vertical ray shooting queries, and the implementation of the resulting data structures in both the real RAM and word RAM models. The project also addresses key problems in computational geometry such as computing spanning trees with low crossing number, constructing minimum size cuttings in 3-space, and generating convex subdivisions from disjoint line segments in such a way as to solve plane reconfiguration problems such as the compatible geometric matching problem. Solutions to these problems will contribute to the creation of efficient data structures for geometric queries such as multi-point location, ray shooting, and range searching. These data structures are fundamental to the field of computational geometry, and have broad applications in computer graphics, robotics, CAD\/CAM, motion planning, collision detection, and geographic information systems.","title":"Geometric Data Structures","awardID":"0830734","effectiveDate":"2009-01-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["426503",381541],"PO":["565157"]},"146063":{"abstract":"This project focuses on the application of geometric and analytic techniques from pure mathematics to the study of fundamental questions in the theory of algorithms.<br\/><br\/>The principal investigator aims to develop two sets of mathematical tools and their applications to algorithm design: integral geometry and spectral\/differential graph theory. In the former, he aims to study the use of geometric concepts such as lengths and volumes in configuration spaces to understand the complexity of combinatorial algorithms and the diameters of polytope graphs. In the latter, he proposes to work on understanding the right way to employ structures on graphs analogous to those of continuous differential geometry and harmonic analysis, such Laplacians, Green's functions, Hodge structures, and connections.<br\/><br\/>The principal investigator intends to apply these techniques to a variety of algorithmic pursuits, including:<br\/>* the search for a strongly polynomial time algorithm for linear programming;<br\/>* new algorithms for nonconvex optimization;<br\/>* a faster algorithm for finding (1+epsilon)-approximate maximum flows in undirected graphs;<br\/>* the development of a general set of tools for designing nearly linear time graph algorithms; and<br\/>* distributed routing protocols and other decentralized and local graph algorithms.<br\/><br\/>In addition to advancing the theoretical study of several central questions in the theory of algorithms, this research holds the potential for broad practical impact. In recent years, it has increasingly become the case that much of the world can be effectively modeled by very large graphs, whether they be interconnected computers, social networks, or collections of roads. These graphs are often so large that even a quadratic algorithm would be impractically slow. For this reason, effective tools for designing algorithms that run in nearly linear time are becoming more and more important. In addition, there is an increasing focus now on having collections of loosely coordinated computers work together to solve large algorithmic tasks. In both cases, the development of spectral\/differential graph theory holds great promise. Differential geometry and the analogous discrete theory that the principal investigator intends to develop aim to synthesize pieces of local information to deduce global properties. As such, spectral and differential graph theory provide a general approach to developing both nearly-linear time algorithms and distributed ones. Furthermore, linear programming is applied to solve a vast array of practical problems in a wide variety of fields, inclding economics, operations research, combinatorial optimization, and logistics. Any algorithmic improvement for it would broaden the set of such problems that can be practically solved.","title":"CAREER: Geometric Techniques for Algorithm Design","awardID":"0843915","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["483418"],"PO":["565157"]},"158563":{"abstract":"This research will evaluate the potential of a new generation of electronic document readers that present information across multiple displays - a design that anticipates the future availability of fast, bi-stable, display technology. Despite the fact that e-book readers have been available to the general public for several years, paper remains far more popular as a medium for reading and annotating documents. Although electronic devices for reading can provide unique affordances such as a large storage capacity, keyword search, indexing, and some interactivity, they remain unpopular probably because they fail to offer several core affordances of paper such as efficient page-to-page navigation, quick access to multiple documents, and efficient handling of annotations.<br\/><br\/>Starting from an existing proof of concept, this project will design a fully functional prototype that addresses a large spectrum of reading activities that include: reading a book or magazine, lateral reading, and active reading. A set of deployable prototypes will be used to evaluate the potential of the design through a series of longitudinal studies. In producing prototypes of a next generation electronic document reader, this project will systematically study the design parameters that might enhance the reading experience on such devices in a wide variety of scenarios encompassing a diversity of reading activities. <br\/><br\/>It is possible that digital displays will become the predominant technology for<br\/>consuming text information. However, digital reading devices will be used only if they combine physical design, software infrastructure, and interface features that support a wide variety of reading patterns. Increasing amounts of reading material (both classic and modern) are available through digital distribution. By making it convenient and enjoyable to access this wealth of digital content, this project will spur new interest in reading both for work and pleasure.","title":"HCC-Small: Collaborative Research: Design and Evaluation of the Next Generation of E-book Readers.","awardID":"0936105","effectiveDate":"2009-01-01","expirationDate":"2012-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["475376"],"PO":["564456"]},"145540":{"abstract":"ABSTRACT<br\/>Advances in medical imaging technology have allowed clinicians to generate vast amounts of shape data describing various parts of the human body. In doing so, the goal is to obtain precise statistical notions of what a \"normal\" morphology looks like, and what the different types of \"abnormal\" morphology look like, so that clinicians can target treatment to patients based on these classifications.<br\/><br\/>Developing tools for the statistical analysis of morphology (i.e. shape) has the potential to transform medical imaging processes in a fundamental way, allowing us to understand at a large scale the normal and abnormal variations in human organs and provide a statistical \"map\" of the human body. In this research, the PI develops new tools for the statistical analysis of shape by combining the mathematics of non-Euclidean shape spaces with techniques for approximating and efficiently manipulating such spaces.","title":"SGER: Scalable Shape Analysis in Non-Euclidean Spaces with Provable Guarantees","awardID":"0841185","effectiveDate":"2009-01-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["542076"],"PO":["565157"]},"143494":{"abstract":"Project Summary<br\/>NeTS: FIND: Collaborative Research: Relationship-Oriented Networking<br\/><br\/>One of the key aspects upon which societies are and have always been built is the notion of relationships?both personal and institutional. In fact, relationships are so ingrained into people?s lives that their role as a fundamental societal fabric is often taken for granted and not explicitly considered. While powerful in one?s everyday life, establishing relationships within the electronic realm of communication networks leaves one without many of the traditional tools for building, sustaining and recognizing relationships. One cannot use visual or auditory cues to verify that they are talking to a friend. Rather, a message that is just words on the screen could just as easily come from someone they know or an imposter. One key reason for this is because often networks have based the notion of identity on the name of a resource rather than some stronger notion such as cryptography provides. The over-arching goal of this project is to consider how to design future network architecture to first pervasively incorporate cryptographic-based identities and then use those strong identities to establish relationships as first-class citizens within networks. This promises to provide better overall usability, security and trust in the system. Ultimately, this work will develop an architectural framework and components that allow users and institutions to build trusted relationships within digital communications that can be viewed and utilized much like relationships outside of the digital communications realm. This project will consider leveraging relationships for a variety of tasks, such as access control, service validation, and naming. It thus moves past a simple transaction-oriented network to a system that is able to provide general linking of activity across time and exposing legitimate assistive services.<br\/><br\/>Intellectual Merit: Computer networks were designed to serve people, but there has been little research in leveraging how people naturally behave and work in the real world. One way people generally operate is by establishing relationships and developing trust in those relationships. This project will design a new network architecture that weave this intuitive mode of operation into communications to give users more confidence in the system by allowing users to build relationships that work much like they do in the real world. This work will respect the tussle-spaces that will naturally occur within the architectural designs. A particular tussle-space that will be considered is that of the benefits of exposing relationships compared with the cost in terms of privacy of doing so. The designed architecture will not mandate how a tussle is resolved, but allow users and institutions to reason about these issues and set policy as they see fit. By enabling a network with a solid understanding of both identity and relationships, this project will empower an immense number of services, protocols and applications to use this information as part of their standard processing.<br\/><br\/>Broader Impact: Over and above its goal of building a trustworthy future Internet, this project will have a number of broader impacts. In terms of networking economics it will make two contributions: (i) added confidence in the security of the overall system will encourage even more widespread use and a broader set of applications as users will feel safe online and (ii) its envisioned new naming system will allow users to choose service providers based on merit rather than on artificial naming constructs. In addition, by putting cryptographic identity as a foundation for the network design, this project will enable cryptographic identity to be widely used within the network architecture. This will have far-reaching benefits to users? privacy by enabling easy encryption of network traffic. Finally, this research will have educational impact in the form of enhanced opportunities for undergraduate and graduate students, as well as mentoring of middle- and high-school students through an established foundation with which we are affiliated.","title":"NeTS: Find: Collaborative Research: Relationship-Oriented Networking","awardID":"0831821","effectiveDate":"2009-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["409444"],"PO":["565090"]},"147267":{"abstract":"Wireless networks play a key role in national critical information infrastructure. Mainly due to lack of a protected physical boundary, wireless communications are inherently less secure than its wired counterpart. Privacy has been ranked as the top security concern of wireless users. Inadequate privacy protection can result in significant network information retrieval that enables the adversaries to perform destructive denial-of-service (DoS) attacks, or even paralyze the entire wireless networks. While confidentiality of the message can be ensured through content encryption, it is much more challenging to provide privacy service for wireless networks. In fact, privacy is one of the most notable challenges looming on the horizon that threatens successful deployment of WSN. <br\/>In this research, we propose to design efficient cryptographic algorithms and network security protocols that can achieve privacy-preserving communications for both MANET and WSN. More specifically, we plan to: (i) Develop efficient cryptographic algorithms that can achieve unconditional privacy-preserving communications even in the presence of local eavesdropper while reconciling communication accountability; (ii) Develop efficient anonymous authentication schemes and protocols for secure user access control and anonymous routing in MANET and WSN. That is, while each user is being authenticated, the user's real identity and location will remain secret for adversaries. (iii) Establish a scientific foundation for theoretical characterization and quantitative measurement of privacy in secure network communications. <br\/>Our research is expected to have a significant impact on personal privacy, national critical information security as well as homeland security.","title":"SGER: Privacy-Preserving Communication in Wireless Networks","awardID":"0848569","effectiveDate":"2009-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["523780"],"PO":["565327"]},"148037":{"abstract":"The Research Experience for Undergraduates (REU) Site in the Department of Computer Science at Jackson State University (JSU) provides research experience for students in Wireless Ad Hoc Networks and Sensor Networks. This department at JSU produces one of the largest groups of African-Americans with computer science BS and MS degrees in the US. This project is one of the few REU programs in Computer Science located at a US Historically Black College and University (HBCU). JSU invites ten highly-talented students who have completed their sophomore year in Computer Science or other closely related field each year. These student participants reside on the JSU campus, spend a minimum of 40 hours per week on research and other related activities for a 10 week period. Students are trained to conduct both individual and collaborative research in a common laboratory. They are mentored in groups and individually by a well coordinated group of computer science and computer engineering faculty members, graduate students, and visiting scholars. <br\/><br\/>Intellectual Merit: The research projects are on advanced state-of-the-art research areas in wireless networks. The proposed projects are designed to spark the student?s interest in research. Student participants learn the basics of conducting research such as literature search, problem formulation, algorithm design and analysis, performance modeling, and simulations. Students are also actively trained in communication skills through a seminar series and by preparing and delivering a talk, writing a paper (in standard ACM format) and presenting a poster on their work at the conclusion of the summer program. Student participants are strongly encouraged to publish their work in regional, national and international conferences and journals. <br\/><br\/>Broader Impact: The REU site mainly recruits underrepresented women and minority African-American student participants from HBCUs and instruction-oriented institutions. Thus, the REU site encourages and motivates a student population that would otherwise have limited opportunities to participate in research during undergraduate studies. JSU prepares a cohort of undergraduates with skills necessary to pursue a successful research career. In addition to working on specific research projects with faculty mentors, students take a series of weekly seminars to help them to apply to graduate school, understand the advantages of having a graduate degree, and realize the wide range of career opportunities available for MS\/PhD graduates in Computer Science and related disciplines. The REU students return to their home institutions with research experience and knowledge, and they are strongly encouraged to stay in touch with their research mentors and continue to do research work under the supervision of instructors at their home institutions. This REU program provides a model for a successful undergraduate research program that can be developed at other institutions.","title":"REU Site: Undergraduate Research Program in Wireless Ad hoc Networks and Sensor Networks","awardID":"0851646","effectiveDate":"2009-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["527650","426719"],"PO":["564181"]}}