{"57091":{"abstract":"0090959 <br\/>Sera <br\/><br\/>This award is to Texas A&M University to support the activity described below for 24 months. The proposal was submitted in response to the Partnerships for Innovation Program Solicitation (NSF 0082).<br\/><br\/><br\/>Partners<br\/>The partners for this award include Texas A&M Engineering Extension Service; Edgewood ISD, San Antonio School District; Our Lady of the Lake University; TEKSA Innovations Corporation; San Antonio Day Care Providers.<br\/><br\/>Proposed Activities<br\/>The award supports the following activities: formation of minority-lead entrepreneurial teams to form and assist small businesses; provide e-commerce capability for small business; job training (computer training) for at-risk students; provide business management tools, including incubation support, to small minority-owned small businesses.<br\/><br\/>Proposed Innovation<br\/>The innovation goals of this award include formation of minority-led entrepreneurial teams to assist formation and growth of small business in the San Antonio area; enablement of economic growth by providing e-commerce capability of small businesses, especially minority owned businesses; providing incubator services where needed; providing workforce training for at-risk under-represented groups and providing job opportunities for them in small companies.<br\/><br\/>Potential Economic Impact<br\/>The potential economic benefits from this award includes a wide range of outcomes, such as job training and job placement for under-represented, at-risk of poverty groups by creation of new business and new jobs.<br\/><br\/>Potential Societal Impact<br\/>The potential benefits to society include education and training for at-risk under-represented minorities; creation of business opportunities for minority-owned small businesses; creation of new employment opportunities for minorities.","title":"Synergistic Electronic Commerce (SynreCom) Partnership for Innovation","awardID":"0090959","effectiveDate":"2001-02-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"1662","name":"PARTNRSHIPS FOR INNOVATION-PFI"}}],"PIcoPI":["538637",146921],"PO":["565053"]},"57590":{"abstract":"This integrated research and education proposal describes a new<br\/>server-centric approach to computing based on the premise that<br\/>advances in network speed and ubiquity have created the conditions in<br\/>which a computer utility can be used to deliver computational services<br\/>over the Internet to end users. The computer utility model described<br\/>is one in which users' entire computing environment, including all<br\/>applications, data, and the window system, reside on<br\/>professionally-managed servers. Users can then access their computing<br\/>environments from any Internet-enabled client device. The proposed<br\/>research will focus on three areas: (1) remote display technologies to<br\/>enable remote graphical access to applications without requiring any<br\/>application modifications, (2) server resource management mechanisms<br\/>to deliver guaranteed levels of performance to large numbers of<br\/>interactive users, and (3) server cluster resource management that<br\/>will effectively load balance, allocate, and reliably provide<br\/>computing resources from a cluster of servers to users and groups of<br\/>users. The proposal also describes how the research will be applied<br\/>and integrated with curriculum development efforts to develop an IT<br\/>distance learning education laboratory for teaching systems courses,<br\/>particularly operating systems.","title":"CAREER: Delivering Computational Services over the Internet","awardID":"0093047","effectiveDate":"2001-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["508477"],"PO":["309350"]},"58690":{"abstract":"This project is to establish an international center for research on giga-scale system-on-a-chip (SOC) designs. It involves researchers from U.S., Taiwan, and China. The center is being supported by the National Science Council (NSC) in Taiwan and the Chinese National Science Foundation (CNSF) to support the activities by researchers from Taiwan and China respectively.<br\/>Focus of the project is on innovative design methodologies, tools, and algorithms that enable efficient giga-scale SOC integration in nanometer technologies. Research activities include investigation and development of efficient SOC synthesis tools and methodologies, SOC verification, test, and diagnostic technologies, and an SOC design driver that motivates and validates various synthesis, verification, and test techniques developed during the course of this research project. The design driver is a SOC design of a network processor, which includes embedded CPUs, DPSs, FPGAs, and various kinds of memory components. The research on SOC synthesis tools and methodologies includes design specification, design partitioning, synthesis and optimization for embedded DPSs and FPGAs, physical synthesis for full-chip assembly, and synthesis techniques for design re-use. The research on verification and test focuses functional verification, self-test using on-chip programmable logic, analog and mixed-signal self-test, and test for embedded memories.","title":"Giga-Scale System-On-A-Chip Design","awardID":"0096383","effectiveDate":"2001-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["558485","287642"],"PO":["562984"]},"57690":{"abstract":"This project studies new architectures for verifiably safe execution of software. The first area of research is the production of a new generation of<br\/>compilers, called verifying compilers, that can only compile safe code according to pre-determined safety policies, such as protection of private information and resource-bounded computation. The second area is the production of code accompanied by formal proofs guaranteeing that code's compliance with<br\/>pre-determined safety policies, in the style of Proof-Carrying Code (PCC).<br\/><br\/> Typed languages guaranteeing different notions of safety criteria, including assembly languages and machine code, will be defined, studied, and modeled. These languages will be relevant to both the design of verifying compilers and the PCC project. One approach will be using dependent type systems to define powerful intermediate and assembly languages. Furthermore, a prototype verifying compiler will be built by extending an existing compiler with a verifying module, using a type-theory based approach to program safety. Representative safety policies will be implemented, and examples developed to show that malicious code cannot be certified. The research component will be adapted for inclusion in the graduate curriculum. Furthermore, a student will be supervised towards a PhD in state-of-the-art compiler technology.","title":"CAREER: A Formally Verified Environment for the Production of Secure Software","awardID":"0093362","effectiveDate":"2001-02-15","expirationDate":"2010-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["546946"],"PO":["564388"]},"57361":{"abstract":"Advanced database applications like Decision-Support Systems (DSS) and data mining use existing database technology (relational databases and their query language, SQL) to extract high-level information from large amounts of data. Since SQL is a declarative language (it allows the user to specify what is needed, not how to obtain it), and most SQL queries can be implemented in different ways, a process of optimization is carried out which chooses the most efficient implementation known to the system for each query. However, as both the amount of data to be processed and the complexity of the queries used grow, optimization is becoming more difficult and more important. This project explores a novel approach to the optimization of complex SQL queries, called the For-loop approach, which goes beyond the relational framework to try to find more efficient implementations. The results of this project will provide insight into the strengths and limitations of optimizations for SQL. The new approach has the potential to provide significant performance improvements over current techniques for a restricted (but important) class of queries, including queries with subqueries where the FROM and WHERE clause of query and subquery exhibit significant overlap (these queries are not uncommon in DSS environments). The results of this research will be actively disseminated by the PI in order to attract collaboration with industry and with other researchers.","title":"Non-Relational Implementation of a Class of Decision-Support Relational Queries: the For-loop Approach","awardID":"0091928","effectiveDate":"2001-02-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["237056"],"PO":["563751"]},"57582":{"abstract":"Future generation wireless systems and data storage systems will certainly take advantage of the recent developments in coding theory and signal processing. In the last decade, concatenated coding and iterative processing have emerged as powerful paradigms in coding theory and signal processing. Both wireless communications and magnetic recording systems place particular constraints and limitations. In wireless communications, maintaining high power and spectral efficiency is key. In addition, in some systems, it may be necessary to maintain a constant envelope for the transmitted signals. Digital magnetic recording systems can tolerate very little redundancy and require very low end to end bit error rates. It is crucial to develop an understanding of the potential and limitations of concatenated coding and iterative processing<br\/>for use in these systems. While exact analysis of concatenated codes with iterative decoding is difficult, a recently proposed technique called density evolution is a powerful tool that permits analysis of iterative decoding and offers considerable insight. Using this technique or, a variation thereof, this research aims at furthering the design and analysis of iteratively decodable codes with applications to wireless communications systems and digital magnetic recording<br\/>systems.<br\/><br\/>This research emphasizes two main ideas - irregular codes and the design of codes matched to iterative decoding. Based on these ideas, three specific areas are addressed. They are 1) Design and analysis of irregular parallel and serial concatenated codes including non-binary codes and irregular turbo trellis coded modulation, 2) A comprehensive study of concatenated coding and decoding strategies for modulators with memory (such as CPM), their performance analysis for AWGN, flat Rayleigh fading and inter-symbol interference channels, 3) Design and analysis of codes for digital magnetic recording - particular emphasis is given to the design of concatenated codes in the presence of an outer Reed-Solomon code, evaluating novel<br\/>high rate codes and on low complexity receiver structures when the overall desired bit error rates are of the order of 10^{-15}.","title":"CAREER: Design and Analysis of Iteratively Decodable Codes for Wireless Communications and Digital Magnetic Recording","awardID":"0093020","effectiveDate":"2001-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["551055"],"PO":["348215"]},"57670":{"abstract":"As the interconnect characteristics dominate in deep-sub-micron regime, we are developing an interconnect-centric high-level synthesis (HLS) framework in which delay, power, and routability, can be optimized. We are investigating two approaches: (1) Incremental approach: HLS is performed iteratively by taking into account net-level estimates obtained from a detailed floorplan and global route information; and (2) Composite Approach: HLS tasks (scheduling, allocation, and binding) as well as physical design tasks (placement and routing) are unified into one composite step. The novel features of the HLS framework are: (1) use of detailed interconnect timing models (moment-based, Elmore-delay based) in HLS flow; (2) routability driven HLS; and (3) usage of Rent's exponent as a routability metric. As part of education plan, we are: (1) developing a two course sequence (dual-level); (2) experimenting in VLSI education with the case-based (Harvard Business school) teaching style (popularly used the MBA field); (3) involving undergraduate minority students in VLSI EDA research; and (4) exposing K11-12 students to the field of VLSI chip design automation.","title":"CAREER: Interconnect-centric High-Level Synthesis in DSM Regime","awardID":"0093301","effectiveDate":"2001-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["479049"],"PO":["562984"]},"57594":{"abstract":"Despite the growing complexity of the storage landscape, tools to architect new storage systems are practically nonexistent. The purpose of this CAREER grant proposal is to develop a long-range program of research and education in design and performance analysis of storage systems, with a specific emphasis on emerging probe-based storage technology. The main question this research proposal asks is: \"How do we design probe-based storage to give optimal performance for a workload with certain characteristics?\" Answering this question requires a long-range research plan with thrusts in several areas, including creating physical models for the device, developing tools and methodologies for optimizing design based on a specific workload, and novel research in workload characterization to generalize our conclusions. Although our initial focus is on probe-based storage, we envision creating a parameterized, plug-and-play performance environment in which many other models may be used.<br\/><br\/>The education component of this proposal represents a philosophy of curriculum development to increase awareness of storage systems, and a general emphasis on fostering active learning skills.","title":"CAREER: A Program of Research and Education in Storage Systems Design for New Technologies","awardID":"0093051","effectiveDate":"2001-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["555419"],"PO":["325495"]},"57463":{"abstract":"This is a high performance scientific computing project. It will develop a class of robust scalable preconditioning techniques for solving large sparse linera systems, using multilevel recursive incomplete LU factorization techniques preconditioning techniques to achieve robustness. This research will benefit sectors of American industry using large scale numerical simulations, such as aerospace engineering and nuclear reactor simulation.","title":"CAREER: Develop Robust Scalable Linear System Solvers with Scientific, Engineering and Industrial Applications","awardID":"0092532","effectiveDate":"2001-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["94260"],"PO":["381214"]},"49972":{"abstract":"0001441<br\/>Kitanidis<br\/><br\/>The accurate quantitative evaluation of transverse dispersion is crucial in hydrogeology, environmental engineering, and other fields because of the way this process affects solute dilution and mixing of reactants. In many cases, the rate of biochemical reactions depends on the transverse dispersion coefficient. The primary objective of this research is to develop and test a new laboratory method for measuring transverse dispersion. Although there are methods for the laboratory measurement of transverse dispersion in porous media they all are based on the concept of measuring this quantity directly, which is very difficult because transverse dispersion coefficients are small. The proposed method is based on the inference of transverse dispersion from measurements of a quantity is inversely proportional to it. This work will develop and test a device for measurement of the transverse dispersion in homogeneous isotopic porous media. We will measure the Taylor dispersion coefficient in a spiral flow field. A small transverse dispersion means a large Taylor dispersion coefficient that is easy to infer with satisfactory accuracy from the breakthrough curve. The flow and transport in the device will be evaluated through experiments and mathematical modeling. Additionally, we will perform experiments with several unconsolidated porous media in order to evaluate the behavior of dispersivity with grain size and distribution, type of packing, and other variable.","title":"Mathematical and Experimental Studies of Dispersion in Porous Media","awardID":"0001441","effectiveDate":"2001-02-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1579","name":"HYDROLOGIC SCIENCES"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1580","name":"INSTRUMENTATION & FACILITIES"}}],"PIcoPI":["521208"],"PO":["376131"]},"56990":{"abstract":"0090474 <br\/>Scott<br\/><br\/>This award is to Ilisagvik College to support the activity described below for 36 months. The proposal was submitted in response to the Partnerships for Innovation Program Solicitation (NSF 0082).<br\/><br\/><br\/>Partners<br\/>The partners for this award include California Virtual Campus, Bay Area Region 1; Lewis-Clark State College; Northwest Indian College; Phillips Community College; Arctic Slope Regional Corporation; North Slope Borough Office of the Mayor; Alaska Growth Capital; Arctic Development Council; Central Council Tlingit Haida Indian Tribes of Alaska; Interior Athabascan Tribal College; Tanana Chiefs Conference. <br\/><br\/>Proposed Activities<br\/>The activities for this award include delivery of post-secondary education to Alaska Natives living in intensely rural villages, typically far off the road system, with unemployment rates 3-5 times the national average; develop, test, and refine a situational model for distance education that takes into account variables for indigenous communities; combine distance learning with technical assistance for entrepreneurs and job placement services to develop Alaska's rural economy; assess occupational demand in the region; determine the skill levels of the workers; design and deliver two rounds of distance learning; provide small business training and technical assistance; assess the emerging model and disseminate the learnings.<br\/><br\/>Proposed Innovation<br\/>The innovation goals for the award include providing distance training to prepare workers for job demands in remote Alaska; providing small business training and technical assistance; research and development of models for remote education in rural indigenous populations; enablement of increased business and job opportunities in rural Alaska.<br\/><br\/>Potential Economic Impact<br\/>The economic outcomes for this award include increased skills and technical assistance for small business in rural Alaska, as well as increased jobs and business training and opportunity.<br\/><br\/>Potential Societal Impact<br\/>The potential benefits to society from this award include involvement of indigenous tribal population in a rural environment in job training and opportunity, plus creation of increased wealth in remote Alaska.","title":"Distance Education Delivery for Isolated Rural Communities: A Contingency Approach","awardID":"0090474","effectiveDate":"2001-02-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"1662","name":"PARTNRSHIPS FOR INNOVATION-PFI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1401","name":"Division of ARCTIC SCIENCES DIVISION","abbr":"ARC"},"pgm":{"id":"5208","name":"ARCTIC RESEARCH AND EDUCATION"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1402","name":"Division of ANTARCTIC INFRASTRUCTURE & LOG","abbr":"AIL"},"pgm":{"id":"5205","name":"ARCTIC RESRCH SUPPRT & LOGISTI"}}],"PIcoPI":[146648,"168683",146650,146651,"168685"],"PO":["565053"]},"57683":{"abstract":"This CAREER computational geometry project will conduct<br\/>research in several areas: <br\/><br\/>- kinetic data structures for collision detection, <br\/><br\/>- geometric range searching data structures for both static<br\/>and moving points, <br\/><br\/>- Delauney and other triangulations for well-spread point<br\/>sets, and <br\/><br\/>- intersection and convex decomposition of smooth polyhedra.","title":"CAREER: Realistically Efficient Geometric Algorithms","awardID":"0093348","effectiveDate":"2001-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["468851"],"PO":["532791"]},"57585":{"abstract":"As more and more people use computer networks to exchange confidential data and perform business transactions, public key cryptography is rapidly becoming one of the most critical tools in today's electronic world. Using cryptography it is possible to perform many important tasks ranging from electronic voting, to digital contract signing, secure virtual conferences on public networks and many more. All these applications ultimately rely on the security of the underlying cryptographic primitives (i.e. the fundamental building blocks using which all other more complex cryptographic applications are built). This research involves the study of computational problems from an area of mathematics called geometry of numbers that can be used both to design new cryptographic primitives, and to test old ones and assess their security.<br\/><br\/>The investigators study the complexity of point lattices. These are geometric objects that can be described as the set of intersection points of a regular n-dimensional grid. This research involves both the identification of hard lattice problems, and the search for better algorithms to solve lattice problems that admit efficient solution. Hard lattice problems are subsequently used to design new cryptographic functions, while new lattice algorithms are used to design new cryptanalytic attacks against existing cryptographic primitives.","title":"CAREER: Geometric Methods in Cryptography","awardID":"0093029","effectiveDate":"2001-02-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["486529"],"PO":["499399"]},"69366":{"abstract":"","title":"BIOCOMPLEXITY: Collaborative Research: Oceanic N2 fixation and Global climate","awardID":"0196186","effectiveDate":"2001-02-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1366","name":"BIOCOMPLEXITY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5415","name":"OCEANOGRAPHIC TECHNICAL SERVCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["531018"],"PO":["565335"]},"57684":{"abstract":"CCR-0093349<br\/><br\/>ABSTRACT<br\/><br\/>This project investigates aspects of reliable communications for very<br\/>different types of network variability.<br\/>The first part of the project is concerned with capacity and robustness of<br\/>networks to permanent failures such as removal of a link or node. The<br\/>approach in this project moves away from a pure graph-theoretic approach,<br\/>based purely on routing, to consider network capacity using an algebraic<br\/>framework. Capacity is considered as the characterization of the set of<br\/>connections that can be supported by a network in which the nodes are not<br\/>only capable of traditional routing functions, but can also perform<br\/>processing of the data that arrives to them. Such processing is considered<br\/>as a code over the network. Coding is also applied to recovery to maintain<br\/>certain connections in a network even after failure of a portion of the<br\/>network, for instance after the disappearance of a link in the network. The<br\/>second part of the project considers robustness in channels where fading<br\/>varies over both time and frequency, especially over ultra wide frequency<br\/>bands. The goal of this part of the project is to establish theoretical<br\/>results that relate capacity, peak power, energy, bandwith and probability<br\/>of error in such a way as to characterize the practical achievable<br\/>performance in wide band wireless systems.<br\/><br\/>The first part of this project investigates the reliability of networks<br\/>under normal and failure conditions when coding is used to ensure<br\/>continuity of connections. This project shows that traditional methods of<br\/>recovery in networks, such as rerouting, are subsets of network coding and<br\/>establishes coding methods to increase the realibility of networks under<br\/>failure conditions. Moreover, the projects investigates the issue of network<br\/>management, where network management represents the information needed to<br\/>modify the behavior of the network, defined as the code of the network, in<br\/>response to failures. The algebraic approach taken in this project allows<br\/>some characterization of the fundamental limits of the number of bits<br\/>required to effect changes on the network code and of the portions of the<br\/>network that require knowledge of failures. The second part of the project<br\/>considers capacity of very wide band channels and the applicability of<br\/>different types of signals and codes to achieve performance at or near the<br\/>theoretical maximum. In particular, it explores to what extent very high<br\/>peak power symbols, which are known to achieve capacity in the limit of very<br\/>large bandwidths, are necessary to achieve capacity. The project also<br\/>explores the ranges of bandwidth in which ultra-wideband results are<br\/>achievable. This work bridges the theoretical limits of the channel<br\/>(capacity) with the applicability of the techniques that achieve capacity by<br\/>providing an explicit bound to the probability of error in terms of rate,<br\/>bandwidth and peak power of the signal. Finally, the project consider the<br\/>applicability, in the range of moderate to large bandwidths, of traditional<br\/>spread spectrum approaches, such as direct-sequence code-division multiple<br\/>access, that perform poorly in the limit of very large bandwidths.","title":"Career","awardID":"0093349","effectiveDate":"2001-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["316455"],"PO":["348215"]},"57696":{"abstract":"Complex geometry becomes increasingly common in applications<br\/>arising in diverse areas. Plastic surgeons use computer<br\/>models to plan and perform operations. Mechanical engineers<br\/>virtually assemble and test cars and planes. Animators<br\/>create complex characters and effects indistinguishable from<br\/>reality. Geometric modeling has found its way into art<br\/>conservation: it is now feasible to create computer models<br\/>of sculptures capturing the most subtle of details.<br\/>Increasing complexity of geometric data calls for new<br\/>efficient representations and algorithms. The goal of our<br\/>long-term research plan is to study representations of<br\/>complex geometric data, surfaces in particular. We plan to<br\/>launch a broad and fundamental program to explore three<br\/>types of representations: piecewise-smooth surfaces,<br\/>multiscale surfaces and combined volume-surface<br\/>representations. Our approach to designing complex surface<br\/>representations is based on the concept of subdivision, a<br\/>powerful technique for modeling smooth surfaces. Subdivision<br\/>algorithms, while being more flexible and general, retain a<br\/>number of useful properties of splines. Most importantly,<br\/>the surfaces generated by these algorithms have a natural<br\/>hierarchical structure and are computed using efficient<br\/>local rules; subdivision algorithms can be easily extended<br\/>to represent multiscale data. The general goal of our<br\/>research is to design representations supporting efficient<br\/>algorithms for construction, rendering, manipulation,<br\/>processing, transmission and storage of surface data. We<br\/>will explore in close coordination both theoretical<br\/>properties of these representations (regularity, convergence<br\/>rates, fairness, stability) and their practical<br\/>applications. The specific goal of the proposed project is<br\/>to generalize to surfaces the signal processing tools that<br\/>were designed and are extensively used for images. The<br\/>research program is integrated with the education plan,<br\/>which has three main goals: (1) prepare graduate students<br\/>for research in computer graphics and related areas, (2)<br\/>incorporate the latest advances in research into curriculum<br\/>at all levels, including undergraduate, and engage motivated<br\/>undergraduate students in research (3) transfer knowledge<br\/>about latest research advances to professionals in the<br\/>industry.","title":"CAREER: Signal Processing for Surfaces","awardID":"0093390","effectiveDate":"2001-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["550936"],"PO":["532791"]},"59952":{"abstract":"An international seminar on deduction - organized by Prof.<br\/>Ulrich Furbach (University of Koblenz, Germany), Prof.<br\/>Harald Ganzinger (MPI Saarbrucken, Germany), Prof. Ryuzo<br\/>Hasegawa (Kyushu University, Japan), and Prof. Deepak Kapur<br\/>(University of New Mexico, Albuquerque, NM, USA)- will be<br\/>held March 4-9, 2001 at the Dagstuhl Seminar Center in<br\/>Wadern, Germany. About 75 automated deduction researchers<br\/>from around the world have been invited to participate. This<br\/>award pays for travel funds for American invitees to attend<br\/>the seminar.","title":"2001 Dagstuhl Seminar on Deduction to be held March 4-9, 2001 at the Dagstuhl Seminar Center in Wadern, Germany","awardID":"0100448","effectiveDate":"2001-02-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["531861"],"PO":["201974"]},"57687":{"abstract":"Energy consumption is a key constraint in the design of modern microprocessors, limiting battery life in portable devices and achievable performance in high-performance systems. Modern instruction set architectures such as RISC or VLIW are based on extensive research into how instruction set design affects<br\/>performance, and provide a purely performance-oriented hardware-software interface. Implementations of these ISAs perform many energy-consuming microarchitectural operations during execution of each user-level instruction and these dominate total power dissipation. Because modern architectures pipeline and parallelize this microarchitectural work, it has little effect on the latency and throughput of user instructions, thus there is no incentive to expose the micro-operations in a purely performance-oriented<br\/>hardware-software interface: energy consumption is hidden from software. The project will develop new energy-exposed microprocessor architectures that give software much greater control over the<br\/>microarchitectural components used to execute each operation. The research will develop new integrated hardware and software energy-saving techniques by simultaneously considering all levels of processor design, including VLSI circuits, microarchitectures, instruction sets, compilers, and operating systems. The project will also be used to bring energy-efficiency into the curriculum of existing undergraduate and graduate computer architecture courses.","title":"CAREER: Energy-Exposed Instruction Sets","awardID":"0093354","effectiveDate":"2001-02-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["292937"],"PO":["325495"]},"56841":{"abstract":"Institution: University of Maryland College Park<br\/>Proposal Number: EIA 0089941<br\/>PI: Kathryn M. Bartol<br\/>Title: Understanding Female and Minority Retention and Success in the IT Workplace: Total Rewards and Social Networks Perspectives <br\/><br\/>This CISE Information Technology Workforce (ITW) proposal requests funds for a research program aimed at addressing fundamental issues underlying the effective utilization, retention, and upward mobility of women and minorities in the IT workplace. The project takes a multidisciplinary approach to the design and implementation of three studies aimed at better understanding these issues. The first study adopts a total rewards perspective in analyzing the IT workplace success and retention of women and minorities. The second study uses social network analysis to study interaction patterns among members of an IT organization and their impact on women and minorities. The third study longitudinally tracks students graduating from undergraduate programs in IT to learn more about how early perceptions and subsequent experiences influence career success and retention for women and minorities. This project has the potential to provide valuable insights about the retention and advancement of women and underrepresented minorities in IT careers.","title":"ITW: Understanding Female and Minority Retention and Success in the IT Workplace: Total Rewards and Social Networks Perspectives","awardID":"0089941","effectiveDate":"2001-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["455489",146255,146256],"PO":["564181"]},"64233":{"abstract":"This contractual award is to provide jacket assembly for 287 ITR Pre-proposals.","title":"Processing ITR Pre-Proposals","awardID":"0118469","effectiveDate":"2001-02-28","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["169508"],"PO":["565227"]},"57622":{"abstract":"The focus of this project is the investigation of the performance limits and the devel-opment of an algorithmic framework for resource-efficient encoding, communication, and fusion of measurements in wireless networks of distributed sensors and actuators. Such networks are attractive solutions for a broad spectrum of applications due to the inherent sensor\/actuator mobility, the spatial flexibility these networks allow in taking actions and collecting measure-ments, and consequently the quality of the data they can provide. In particular, they find use in \"smart-space\" type applications, target tracking and surveillance for robot navigation and radar applications, and data gathering for weather forecasting and environmental applications. <br\/><br\/> The research focus of the project is the development of low-power minimal-delay algo-rithms for encoding noisy information-bearing signals at the sensors, bandwidth-efficient tech-niques for communicating the encodings over the common RF bandwidth to a host, and reliable methods for host data fusion. A key component of this effort involves the development of a hierar-chy of sequential encoding algorithms at each sensor for a large class of signal-in-noise models and under various processing complexity and delay constraints. These are to be complemented with the development of resource-efficient algorithms for synchronous and asynchronous multisensor communication of the sensor encodings to the host over fading channels, and associated signal estimation algorithms for data fusion at the host. The teaching component of the work uses the project investigation as a vehicle for encouraging the involvement of students into research while exposing them to the fields of wireless communication and data fusion. In particular, it involves incorporation of various components of the proposed research objectives into graduate and un-dergraduate education through the development of an experimental wireless simulation testbed, whose role is to allow students to implement and test a select subset of the algorithms developed<br\/>in the research part of the project.","title":"CAREER: Efficient Encoding Communication and Data Fusion Strategies for Wireless Networks of Sensors and Actuators","awardID":"0093137","effectiveDate":"2001-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[148178],"PO":["564924"]},"57556":{"abstract":"Digital information has become an inseparable part of our daily life due to significant advances in affordable high-speed internetworking technologies, high performance computer and peripherals, and the World-Wide Web. The explosive growth of the Web has imposed a heavy demand on networking resources and Web servers, resulting in long delays when requesting remote Web services.<br\/><br\/>This project will develop an integrated research and education program that investigates various effective and efficient strategies for caching information on distributed system such as Web caching to reduce service delays and wide-area-network bandwidth consumption. The research work will focus on (i) gaining a deep understanding of important and unexplored characteristics of Web usage; (ii) developing accurate performance models of these characteristics to measure the effectiveness of existing and newly developed caching strategies; (iii) designing novel load-balancing techniques that best utilize the aggregated capabilities of distributed systems including cache servers and client machines; and (iv) developing scalable technologies for video caching. Performance of these techniques will be measured via simulation and experimentation. The research efforts will have a significant impact on the evolution of the Web.<br\/><br\/>The education part of the program is centered around various strategies to motivate and retain potential students for the graduate program that emphasizes quality research. Through a healthy synergy of both research and education efforts, the PI will influence students through teaching and student mentoring, contribute to the research community, and impact the general public.","title":"Strategies for Caching Information on Distributed Systems","awardID":"0092914","effectiveDate":"2001-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["433896"],"PO":["309350"]},"57677":{"abstract":"This research investigates the creation and use of configurable adaptable components as Intellectual Property (IP). The research proposes novel algorithms for: (1) choosing an optimal configurable component composed of one or more configurable fabrics, and for (2) synthesizing hardware-independent run time managers. The algorithms are explored in the context of a minimal adaptive component that provides on-demand services to clients (algorithms). This minimal component is comprised of hardware synthesized from different configurable fabrics, and a run time manager. The manager provides on-demand services, such as security checks, buffering, configuration caching, and an API that facilitates utilizing and programming the configurable component.","title":"CAREER: Tools for Designing and Integrating Configurable Components","awardID":"0093324","effectiveDate":"2001-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["539728"],"PO":["562984"]},"52761":{"abstract":"Over the past decade the growth in the use and capabilities of communication networks has transformed the way we live and work. As we progress further into the information age, the reliance on networking will increase. With the expected explosive growth in data traffic, networks will be strained in terms of both transport and processing requirements. Wavelength Division Multiplexing (WDM) is emerging as a dominant<br\/>technology for use in backbone and access networks. With WDM, the capacity of a fiber is significantly increased by allowing simultaneous transmission on multiple wavelengths (channels), each operating at the maximum electronic rate. Systems with between 40 and 80 wavelengths are presently being deployed for point-to-point transmission. With tens of wavelengths per fiber and transmission rates of up to 10 Gbps per wavelength, capacities that approach a Tera-bit per second can be achieved. While these WDM systems are likely to meet future transport demands, electronically processing all of this traffic at network nodes will present a significant bottleneck. Fortunately, it is not necessary to electronically process all traffic entering and leaving each node. For example, much of the traffic passing through a node is neither sourced at that node nor destined to that node. To reduce the amount of traffic that must be electronically processed at ntermediate nodes, future WDM systems will employ WDM Add\/Drop multiplexers (WADMs) and cross-connects, that allow each wavelength to either be dropped and electronically processed at the node or to optically bypass the node's electronics.<br\/> This project will develop mechanisms for providing optical bypass to the electronic layer thereby reducing the size and cost of electronic switches and routers in the network. A number of techniques will be explored, each of which is appropriate for different traffic scenarios. For the case of low rate stream traffic, grooming algorithms will be developed to selectively multiplex multiple low rate traffic streams onto wavelengths such that the number of wavelengths that must be processed at each node is minimized.<br\/>For bursty packet traffic, topology reconfiguration algorithms will be developed to reduce the load on the electronic switches and routers via dynamic load balancing. Lastly, for large data transfers, Optical Flow Switching protocols that bypass all of the electronics in the network using all-optical end-to-end connections will be developed. The combination of the above mechanisms will reduce the size, cost and complexity of electronic switches and routers and will lead to a dramatic increase in the traffic capacity that can be<br\/>supported by the Next Generation Internet (NGI).","title":"Mechanisms for Providing Optical Bypass in WDM-based Networks","awardID":"0073730","effectiveDate":"2001-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["517543"],"PO":["565090"]},"57524":{"abstract":"Dynamic optimization is a newly emerging area of computer systems research that offers good potential for large advances in computer performance. The crux of dynamic optimization is the incorporation of dynamic information available only at execution time into the optimization process. Examples of potentially useful dynamic information include the likely behavior of branches and the likely values of operands. More immediate access to run-time information gives dynamic optimizers a notable edge over traditional static optimizers.<br\/><br\/>The rePLay Framework is a set of microarchitectural components for supporting dynamic optimization. RePLay contains hardware that allows the dynamic optimizer to run in parallel with program execution thereby reducing the large overheads associated with dynamic optimization. RePLay contains hardware for identifying candidate regions, for optimizing these regions, fetching regions, and sequencing between them. Furthermore, this microarchitecture creates a tight coupling between the optimizer and hardware that detects run-time events. Initial results indicate that dynamic information can be used to create very long (approx 100 instructions) atomic, single entry, single exit regions of code for optimization.<br\/><br\/>The research focuses on the development of the rePLay Framework, specifically in the development of<br\/>hardware-based optimizations and hardware schemes to support potentially speculative value-based optimizations.","title":"CAREER: rePLay: a Microarchitecture to Support Dynamic Program Optimization","awardID":"0092740","effectiveDate":"2001-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["322427"],"PO":["325495"]},"64235":{"abstract":"EIA-0118471<br\/>Quinn, Syndey<br\/>Allied Technology Group<br\/><br\/><br\/>Title: NSF Contract No. DAS-9816737-Task Order No.33<br\/><br\/>This award is to provide jacket assembly for 165 ITR pre-proposals.","title":"NSF Contract No. DAS-9816737-Task Order No.33","awardID":"0118471","effectiveDate":"2001-02-28","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["169508"],"PO":["241298"]},"55303":{"abstract":"This award will partially support the Second IMACS International Conference on Nonlinear Evolution Equations and Wave Phenomena to be held at the University of Georgia, April 9-12, 2001. IMACS is the International Association for Mathematics and Computers in Simulation. This award will support six invited speakers, students, and some direct costs. The conference will focus on the computational and theoretical aspects of nonliner waves and optical solitons.","title":"The Second IMACS International Conference on: Nonlinear Evolution Equations and Wave Phenomena: Computation and Theory","awardID":"0084505","effectiveDate":"2001-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["563571"],"PO":["179846"]},"57613":{"abstract":"Pollak ABSTRACT<br\/><br\/>This research addresses various problems of extracting information from digital signals and images. A prototypical example is that of image segmentation: given a picture stored on a computer as an array of numbers (e.g., a medical image), the objective is to design an algorithm to automatically partition the image into meaningful regions (e.g., into a tumor and healthy tissue). More generally, this research is motivated by many applications---for example, in the areas of medical imaging and remote sensing---which are characterized by high complexity and poor quality of images (due to, for instance, noise, blurring, or clutter, which are caused by imperfections of the imaging process).Extracting and restoring objects from such images are challenging and important problems. Since good models of the intervening degradations are often very complex or even unavailable, these problems must be addressed in such a way that the resulting algorithms are insensitive to the precise structure of degradations. When precise modeling is possible, however, the algorithms should be flexible enough to take advantage of it. In addition, the large quantity of data in many applications of interest makes methods that are fast particularly valuable.<br\/><br\/>This project is developing develop a novel scale-space estimation framework applicable to such problems. Built on the foundation of recent non-linear scale-space approaches to image analysis, it is making important links with optimal estimation and sliding-mode control, thereby producing efficient methods for segmentation and restoration of 1-D signals and 2-D images. Theoretical analysis of these methods reveals their robustness, their applicability to a wide range of problems, and the fact that they admit fast numerical schemes. A number of practical image processing problems are being pursued, in particular, analysis of dermatoscopic imagery (magnified pictures of skin lesions used to improve the accuracy of screening for skin cancer).","title":"CAREER: Robust and Efficient Restoration and Segmentation of Signals and Images: A Non-linear Scale-Space Approach","awardID":"0093105","effectiveDate":"2001-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["228065"],"PO":["564898"]},"57426":{"abstract":"This project is an investigation of methods for assisting with the navigation of large, complex<br\/>information spaces. Although results from these studies are relevant to a number of research areas, interest will be focused on construction of a navigation system designed to help viewers visualize,<br\/>explore, and analyze large, multidimensional datasets. Methods to assist with the analysis and navigation of these types of datasets was specifically cited as an<br\/>important open problem by the joint DOE\/NSF panel on future research in visualization.<br\/><br\/>The work will combine a detailed local display and a high-level global overview of the locations and structure of areas of interest within the dataset. The local view will use perceptual cues to harness the abilities of the low-level human visual system. The global overview will be built in two separate stages. First, elements of interest will be identified using a combination of: (1) explicit rules provided by the viewer, and (2) implicit rules built by watching what viewers select, where they move, and what they examine. Next, the elements will be clustered into one or more areas of interest. The use of graph construction techniques like planar triangulations and minimum spanning trees will be investigated to link the elements together. An underlying graph that: (1) supports efficient navigation via the application of graph traversal algorithms, and (2) provides an effective global overview to visualize the areas of interest and the relationships that exist between them will be sought.<br\/><br\/>A set of validation experiments will be designed to identify the strengths and limitations of our navigation<br\/>techniques. Datasets from the oceanography and e-commerce domains will be used to test the system in a<br\/>practical, real-world environment. The first set of experiments will work with domain experts, in part to provide anecdotal feedback on our system, and in part to identify fundamental navigation and exploration tasks performed during visualization. These tasks will then be integrated into a controlled experiment that studies the performance of our system vis-a-vis a system without navigation aids, and existing focus+context visualization techniques specifically designed to display these types of large, complex datasets.<br\/><br\/>The research in visualization, navigation, perception, and automated inference of viewer<br\/>preferences provides a unique opportunity to design a multidisciplinary course curriculum that includes instruction in computer graphics and scientific visualization, cognitive psychology, and a variety of real-world application areas.<br\/><br\/>The education plan includes the construction of an instructional visualization laboratory, the identification of collaborators from academia and industry, the design of a self-contained course curriculum, and the creation of a collection of real-world visualization projects to encourage student participation in our research programs. The laboratory will include state-of-the-art graphics workstations, as well as visualization-specific hardware and software.The priority is to expose students to emerging<br\/>research issues and real-world visualization problems. This will be accomplished in part by building course projects that introduce students to active research programs, both in our visualization laboratory and in academic and industrial research centers located on our campus.The curriculum will instruct students in areas of cognitive and perceptual psychology that impact scientific visualization, computer graphics, computer vision, and artificial intelligence.<br\/><br\/>The result will be a collection of courses that introduce students of psychology, egineering, natural science and other disciplines to both the theoretical and practical issues of perception and assisted computation techniques, and their relationship to scientific visualization and computer graphics.","title":"CAREER: Assisted Navigation in Large Visualization Spaces","awardID":"0092308","effectiveDate":"2001-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["530056"],"PO":["532791"]},"50651":{"abstract":"The project will explore and demonstrate the possibilities and advantages of international cooperation for the creation and delivery of complex literary and linguistic documents as encoded XML files. The University of Trier brings strong computer science, lexicographical, and philological expertise to the project. The University of Virginia Library and other departments have a long and successful record of applying SGML and XML encoding to humanities and other textual material, along with considerable capabilities for online delivery for tens of thousands of text. This particular project will bring these strengths to bear on Middle High German Interlinked, a full-text archive and Medieval German Dictionaries collaboratory. Prior efforts at Virginia to interlink the Oxford English Dictionary with texts of Early American fiction have been of value in examining the influence of pre-1850 American fiction on the development of the modern English language and usage. Part of the project will be focussed on evaluation and implementation of web interfaces for multiple user communities.","title":"Middle High German Interlinked: A Full-Text Archive and Medieval German Dictionaries Collaboratory","awardID":"0003214","effectiveDate":"2001-02-15","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[129387,129388],"PO":["433760"]},"57669":{"abstract":"The design and implementation of a national computing systems grid has become a<br\/>reachable goal for both computer and computational scientists. In order to better use this<br\/>suite of resources, consisting of geographically disperse machines, instruments, and data<br\/>storage, better scheduling and resource management techniques are needed.<br\/><br\/>This project concentrates on the issue of matching the requirements of an application<br\/>to the capabilities of a resource or set of resources on the grid. This is often referred <br\/>to as determining the affinity of an application for a resource. The research will formalize<br\/>the folklore currently used in order to increase the accessibility of the grid to those<br\/>application scientists that have less experience than current users. Work will<br\/>continue in the development of a language specification to describe both applications<br\/>and resources as needed today, but with the extensibility needed for future applications as<br\/>well. This will then be used as an indexing structure into a case-based reasoning expert<br\/>system.<br\/><br\/>This project also has an extended educational portion to it. As a part of the effort to<br\/>expand Northwestern's Computer Science education in the systems area and a cross-school<br\/>initiative, we plan to offer a course in experimental systems using ideas in parallel<br\/>distributed scheduling as the basis for a larger view into practical systems,<br\/>experimentation, and teamwork. This project-oriented class will be focused around<br\/>teaching students about current parallel distributed scheduling efforts and applications.<br\/><br\/>In addition, a new seminar series will be started featuring women researchers in<br\/>computer science to help encourage female students to continue with careers in computer<br\/>science.","title":"CAREER: Affinity and Scheduling for the Computational Grid","awardID":"0093300","effectiveDate":"2001-02-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["547712"],"PO":["551992"]},"57649":{"abstract":"Error correcting codes (channel codes) are on e of the key elements to optimize digital communications systems. Traditionally, the design of good error correcting codes assumes memoryless channels. In this context, turbo codes and the rediscovery of low-density parity check (LDPC) codes represent two of the most significant advances in channel coding in recent years: Iterative decoding of these codes makes it possible to achieve performance close to the theoretical limits for memoryless channels. However, in most of the applications, the channel is not so simple. This research focuses on the study of iterative decoding for more realistic channels, such as wireless communications channels, characterized by having memory. The objective is to achieve reliable communications, close to theoretical limits, for these types of channels. This will have a direct application in the design of realistic communications systems (including wireless communications), allowing a reduction in the transmitter power requirements for a given quality of service, and a better use of the available bandwidth.<br\/><br\/>In order to achieve the best possible performance when the channel has memory, the statistical properties of the channel must be exploited in the decoding process. This will be accomplished in a two-fold process: First, statistical models, such as hidden Markov models and stochastic grammars, the iterative decoding schemes will be modified to incorporate the statistical models in the decoding of turbo codes, LDPC codes, and concatenated space-time codes. Both steps are completely interwined. The idea is to jointly design the statistical models and the decoding modifications, taking the decoding performance for the real channel as the real channel as the optimization criterion. Moreover, when possible, this process should work adaptively, with no a priori knowledge of the channel required: when the communications system is used in an unknown channel, a convenient statistical model of the channel should be obtained jointly with decoding (in either a completely blind fashion if possible or by using pilots). In every iteration such a model should be used for the decoding and be conveniently refined.","title":"CAREER: Iterative Decoding Schemes For Channels With Memory: Application To Fading Channels","awardID":"0093215","effectiveDate":"2001-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["409074"],"PO":["348215"]},"61721":{"abstract":"This project is aimed at developing a VLSI-like design methodology for Nano-electro-mechanical Systems (NEMS). Specifically, computer-aided design (CAD) tools are being developed for functional and compact modeling of nano-electro-mechanical devices. Unlike macroscopic and some microscopic devices, where continuum physical principles are valid, at nanoscales it is important to account for granular nature of the devices. A multiscale approach combining the lowest level atomistic approaches to the highest-level continuum theories are being developed for functional modeling of NEMS. The development of compact models is being investigated to enable design of large and interconnected-array of NEM devices. Finally, carbon nanotube based NEMS are being investigated as basic building blocks for nanoscale sensors, actuators, devices and systems.","title":"SGER: A VLSI-Like Design Methodology for Nanoelectromechanical Systems","awardID":"0107623","effectiveDate":"2001-02-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["539633"],"PO":["562984"]},"61985":{"abstract":"EIA 0108973<br\/>Clemson University<br\/>R.L. Dooley <br\/><br\/>Title: Special Projects: Biological Information Processing and Systems Workshop <br\/><br\/>This is a workshop proposal in biological computation and data with an emphasis on new methods in single cell and multi-cell information processing, including hardware and systems aspects. The workshop is interdisciplinary, involving engineers, neuroscientists, cell biologists, computer scientists, chemists, and material scientists.","title":"Special Projects: Biological Information Processing and Systems Workshop","awardID":"0108973","effectiveDate":"2001-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["491422"],"PO":["329035"]},"60204":{"abstract":"EIA-0101335<br\/> Aspray,William<br\/> Computing Research Association<br\/><br\/>Special Projects: Graduate Students in Computing Travel Support for Career Workshops<br\/> <br\/>This award to the Computing Research Association (CRA) provides funds to support advanced graduate students to attend the CRA career workshops in 2001, 2002, and 2003. The workshops are held in Washington, DC and are open to all recent doctorates and advanced graduate students in computing disciplines. Topics incorporated in the workshops include development of effective teaching practices, research programs, and developing a successful academic career overall. Senior computer scientists and engineers conduct the workshops and program managers from NSF and DARPA discussing how their research funding programs are organized are also part of the workshops.","title":"Special Projects: Graduate Students in Computing Travel Support for Career Workshops","awardID":"0101335","effectiveDate":"2001-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["208531","209556"],"PO":["289456"]},"57619":{"abstract":"Combinatorial optimization is concerned with finding optimal arrangements from within some finite space of arrangements. The theory of NP-completeness has shown that numerous combinatorial optimization problems that arise frequently in computer science and other fields are not likely to have polynomial time algorithms. One approach to overcome this fundamental intractability has been to shift focus from computing exact solutions to approximate solutions. This CAREER project involves research and teaching efforts aimed at developing our understanding of the approximability behavior of combinatorial optimization problems.<br\/><br\/><br\/>The research component of this project has two broad directions. One direction is to obtain tight bounds on the approximability of some basic problems in the areas of graph optimization, network design and routing, and scheduling theory. Some representative examples include the graph k-coloring problem and the preemptive weighted flow time problem. The second direction is to build on our understanding of central problems and develop unifying frameworks that highlight inherent connections among seemingly unrelated techniques and results. The goal here is to identify minimal characteristics that determine the approximability of optimization problems. The educational component of this project will introduce an advanced undergraduate\/graduate course on Approximability of Combinatorial Optimization Problems. Such problems routinely arise in almost all areas of computer science, including databases, networking and systems. Practitioners and researchers in these areas would benefit from learning the various powerful theoretical techniques and results for optimization problems. The PI will also introduce a freshman course on Mathematical Thinking and Reasoning to help undergraduate students develop their ability to write concise formal proofs","title":"CAREER: Approximability of Combinatorial Optimization Problems","awardID":"0093117","effectiveDate":"2001-02-15","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["497006"],"PO":["499399"]}}