{"26091":{"abstract":"9727866 This project will organize and run a US-Brazil Workshop on Formal Foundations of Software Systems at Tulane University, November 9- 12, 1997. The workshop is a follow up to a similar activity held in Rio de Janeiro, Brazil in May of 1997. The workshop will further the establishment of collaborative research projects between computer scientists in Brazil and their counterparts in the United States. It will be composed of plenary sessions in two broad areas: theory of programming language design and analysis and formal tools for software verification, validation, and refinement. In addition, there will be smaller sessions for the presentation of detailed research interests, as well as interest- group planning sessions for laying out common research goals. There will be approximately twenty participants from each of Brazil and the US, selected by a Program Committee of three individuals from each country on the basis of position papers stating their research interests and aims for collaboration. One outcome of the workshop will be a report to NSF giving the results of an open discussion planned during the workshop focusing on promising areas of potential collaboration and future research, as well as ideas for promoting such collaborations in the future. The workshop is jointly sponsored by CCR and CDA at NSF and by the Brazilian counterpart agency, CNPq. ***","title":"US-Brazil Workshop on Formal Foundations of Software Systems: Tulane University, New Orleans, LA, November 1997","awardID":"9727866","effectiveDate":"1997-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["536741"],"PO":["150697"]},"14190":{"abstract":"9619787 Software testing is a critical part of software development. A new approach to software testing based on AI Planning is investigated. The similarity of plans to test cases for some systems (e.g., command language and transaction based systems) makes the representation well suited for test generation. The representation encourages testers to think at a higher level when designing tests. To exploit these potential advantages, an automated test generator is constructed with an AI planning system at its core. This generator allows representation of testing goals and testing criteria to support a variety of testing tasks. The project's contribution to Software Testing is to extend how testing goals are articulated. Its contribution to AI planning is developing new search strategies for efficient planning, and determining how to generate goals that conform to tester's intent, and evaluating the efficacy of using AI planners during software testing. Tasks include 1) improve planning efficiency for generating large tests; 2) include representation of test focus and various test criteria to make the approach flexible; 3) represent high level testing goals to reduce tedium for testers; 4) evaluate the efficacy of the new approach to identify strengths and weaknesses of using AI Planning for testing. ***","title":"Flexible Automated Software Test Generation Using AI Planning Technology","awardID":"9619787","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["554621","424402"],"PO":["150697"]},"22090":{"abstract":"9708913 Complex, evolved software is constructed from a tight-knit composition of computational structures, called strands, each of which is responsible for achieving some requirement, goal, or subset of system functionality. Program strands are interwoven and sometimes even merged in order to share resources. This phenomenon is called interleaving, and understanding how interleaved strands compose is the purpose of the proposed work. There are two key objectives to the research: to formulate a rigorous characterization of the compositional relationships among interleaved strands and to design a new representation for expressing their composition. To form a rigorous characterization, a case study of an existing corpus of software will be performed in which interleaving of design patterns will be investigated and compositional mechanisms will be classified. Existing formalisms for representing strands and their relationships will be surveyed and extended to create a new formalism that expresses strand composition. The understanding gained will suggest what types of documentation, programming language features, and design abstractions are needed to enable software engineers to make interleaving decisions explicit. This will alert future maintainers of interleaved software to the fact that the interleaving was intentionally introduced and mitigate problems with understanding it. ***","title":"Software Evolution and Interleaving","awardID":"9708913","effectiveDate":"1997-08-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y171","name":"DARPA-SOFTWARE EVOL & INTERLEA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y639","name":"DARPA-SOFTWARE EVOLUTION & INT"}}],"PIcoPI":["393313","397849"],"PO":["150697"]},"22091":{"abstract":"9708915 This research focuses on applying formal methods to the problem of certification of imported software. Formal systems such as set constraints, Kleene algebra and Kleene algebra with tests, and the modal mu-calculus have been shown to provide potent tools for practical program analysis and verification. It is proposed to develop these systems further with special focus on efficient practical algorithms and to investigate their use as tools for software certification. The goals are (i) to make it easy for a software vendor to construct a certificate to be downloaded along with a compiled object that ensures that certain safety conditions are met; and (ii) to make it easy for a client to check the certificate to verify that the foreign code is safe to run locally. It is hoped that this work will contribute to the elimination of untrustworthy software. ***","title":"Formal Methods for Software Certification","awardID":"9708915","effectiveDate":"1997-08-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y234","name":"DARPA-FORMAL METHODS FOR SOFTW"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y634","name":"DARPA-FORMAL METHODS FOR SOFTW"}}],"PIcoPI":["320931"],"PO":["150697"]},"38690":{"abstract":"","title":"Runtime Incremental Parallel Scheduling for Solving Irregular and Dynamic Applications","awardID":"9896004","effectiveDate":"1997-08-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["351588"],"PO":["250083"]},"23181":{"abstract":"This project continues investigation of the cylindrical algebraic decomposition (CAD) technique. This technique, developed in 1975 for quantifier elimination in the elementary theory of real- closed fields, has been continually improved in the last twenty years. A vast number of mathematical problems can be expressed in this theory and, potentially, solved via quantifier elimination. CAD has many applications, including control engineering, connectivity and path finding problems. Major improvements are also being made to the algebraic algorithms needed for CAD, including polynomial resultants and greatest common divisors, polynomial factorization, polynomial root isolation and refinement, and computations with algebraic numbers.","title":"Cylindrical Algebraic Decomposition and Quantifier Elimination","awardID":"9712246","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["512650"],"PO":["179846"]},"14051":{"abstract":"This research project employs a knowledge-based approach to retrieve medical images by feature and content with spatial and temporal constructs. Selected objects of interest in a medical image (e.g. x-ray, MR image) are segmented, and contours are generated from these objects. Features (e.g., shape, size) and content (e.g., spatial relationships among objects) are extracted and stored in a feature and content database. Knowledge about image features can be expressed as a hierarchical structure called a Type Abstraction Hierarchy (TAH). A knowledge-based semantic image model is developed which consists of four layers (raw data layer, feature and content layer, schema layer, and knowledge layer) to represent the various aspects of an image objects' characteristics. The model provides a mechanism for accessing and processing spatial, evolutionary, and temporal queries. A knowledge-based spatial temporal query language (KSTL) is formed which supports operators for approximate matching via feature and content, conceptual terms, and temporal logic predicates. Further, a visual query language is also developed that accepts point-click-and-drag visual iconic input on the screen that maps into KSTL. The results from this research are applicable to a variety of multimedia information systems.","title":"Knowledge-Based Image Retrieval with Spatial and Temporal Constructs","awardID":"9619345","effectiveDate":"1997-08-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["218209","320635",35701],"PO":["563751"]},"19683":{"abstract":"This project is investigating applications of dihedral sequence comparison (DISCO) to protein structure comparison and protein folding problems. DISCO transforms atomic coordinates into one-dimensional dihedral sequences, then applies the BioSCAN sequence alignment computer to find segments with similar three-dimensional folds. The goals of the DISCO project include: (1) exploring new algorithms and representations of the three-dimensional structures of folded proteins by one-dimensional sequences; (2) exploring the use of the BioSCAN system to compare these sequences; (3) developing statistically-based scores for measuring the structural similarity of folded protein segments by comparing their dihedral sequences; (4) developing a robust computational system based on BioSCAN for protein structure analysis; and (5) making the DISCO system available over the Internet to the scientific community.","title":"Finding Similar Folds Between Three-Dimensional Protein Structures by Dihedral Sequence Comparison","awardID":"9701577","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["522312","98002"],"PO":["549626"]},"25690":{"abstract":"Viruses have shells made of repeated protein subunits surrounding their genetic information. Many viruses, including polio, herpes, and influenza, have icosahedraloshaped shells. It is not understood how these shells self-assemble from hundreds of similar protein subunits. A resolution to this question is important because it allows us to better understand biological phenomena in general and provides a paradigm for nano- and meso-scale self- assembling systems which will become increasingly important in materials and manufacturing. It might also eventually result in mechanisms for interrupting shell formation and interfering with the infection process. Drs. Berger (MIT) and Prevelige (Univ. of Alabama at Birmingham) are using cutting edge high performance computing and biotechnology to design a realistic computer \"toolkit\" that will allow biologists to study virus shell assembly on a computer screen more easily and less expensively than comparable laboratory work. The synergy of computational and biochemical approaches promises rapid advances in our understanding of virus assembly and self-assembling systems in general. This work is supported by the Computational Biology Activity (BIO), the Computational Mathematics Program (MPS), and the Office of Multidisciplinary Activities (MPS).","title":"Collaborative Research: Building an Experimentally Constrained Local Rules Based Simulator of Virus Shell Assembly","awardID":"9726698","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["468857"],"PO":["565136"]},"25470":{"abstract":"Rapid expansion of wireless communication services during the last decade is expected to continue at an even faster pace in the future. This growth creates a demand for novel modulation, coding, and detection methods suitable for the rapidly varying multipath fading channels encountered in mobile radio. We propose to investigate a new approach to the estimation and prediction of the fading channel which does not rely on statistical characterization. In this method, the physical nature of the flat fading signal is exploited to yield a deterministic model that predicts the channel for an entire block of data. Specifically, the mobile radio signal is decomposed into several scattered components distinguished by their Doppler shifts; the slowly varying parameters associated with these components are determined and tracked, and the composite fading signal is predicted. This approach may potentially result in the ability to anticipate and compensate for the \"deep fades that severely limit the performance of wireless communication systems and will aid in the development of low-power mobile radio systems.","title":"Prediction of Fast Fading Parameters by Resolving the Multipath Interference Pattern","awardID":"9726033","effectiveDate":"1997-08-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["451742","476274"],"PO":["150411"]},"20070":{"abstract":"This research project focuses on two important areas in tolerating resource dynamicism: architecture- independent checkpointing (AIC) and primitives for high availability. Architecture-independent checkpointing is the ability to save the execution state of a program in a machine independent manner so that it may be restored on a different processing platform. This could be on a different machine, or for a parallel program, a different parallel processing environment. The PI is attacking AIC from different angles. These are applicationspecific AIC in ScaLAPACK, semi-transparent to transparent AIC for C and Fortran programs, AIC of Java applications, and AIC of HighPerformance Fortran applications. The result will be a collection of methods for and implementations of AIC for a variety of widely used computing tools. The second portion of this research project is to design and implement primitives for high availability in three currently popular tools for distributed computing: ScaLAPACK, MPI, and Java. Currently, each is limited in its support. Occurrences such as failures, processor revocation and subsequent availability, network partitions, and planned shutdowns are not accommodated. The PI plans to address these deficiencies. The result will be more robust tools for distributed computing, plus methodologies that may be incorporated into the design of future tools.","title":"CAREER: Algorithms and Tools for Fault Tolerance and Migration in Distributed Computing Environments","awardID":"9703390","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["450864"],"PO":["250083"]},"20191":{"abstract":"The wireless and high speed data communications industry is driven by the ability to achieve high levels of integration in electronics. The ever increasing circuit complexity and demands to reduce power consumption have pushed available technology to its limits. These limits have been acceptable in the case of the circuitry needed to realize the digital signal processing functions, but these same limits are not at the threshold of compromising the performance of the necessary analog signal processing circuitry which must be exist at the front end of most systems. The research here involves the development of a new concept in the design of this analog circuitry that allows very low voltage operation of high frequency circuits. The \"Log Domain\" filters studied here permit the development of next generation electronics that will operate using less power, which translates, for example, to fewer batteries in portable equipment. Log Domain, and more generically Exponential State Space (ESS), filters are the result of a new paradigm in linear filter synthesis. Specifically, the nonlinearity of the transistors which comprise the active circuitry is designed explicitly into the circuit formulation. The investigators are studying the mathematics of this design approach more fully so as to improve our understanding of these circuits. This research effort explores the effects of transistor parasitics, such a finite beta, Early effect, and bulk resistance, on Log Domain filter performance. In addition, the state space mappings used to generate the design equations for these filters are being studied to generalize the formulation to include both class A and class AB filters. Results on noise and distortion performance of these filters is also being examined. Finally, the practical performance of these filters is being investigated using a test IC fabricated by Analog Devices, Inc.","title":"Log Domain Filtering For Low-Voltage High-Frequency Integrated Circuits","awardID":"9703773","effectiveDate":"1997-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["251326"],"PO":["564898"]},"23172":{"abstract":"Symbolic computation is exact -- the result of a computation is guaranteed correct. This comes at a cost -- the computations are sometimes very slow and\/or memory intensive; at times, the correct results of a computation are too huge to be of use. Numerical computation, on the other hand, is faster, and, on well conditioned input problem instances, one can expect correct solutions in the sense of backward error analysis. The numerical approach has been very successful in solving a wide spectrum of computational problems in science and engineering. However, there are situations where this approach is not completely satisfactory. In several applications of polynomial system solving arising in areas such as geometric modeling and kinematics, one needs the exact answer to a given problem instance and not to a near-by instance. On the flip side, in many application problems, the input polynomial system is not known exactly but to within small error bounds. This changes the nature of questions that can be asked of a solver. For instance, a question such as ``does a given system of polynomial equations have a root of multiplicity r?'' changes to ``is the given system of polynomial equations near a system that has a root of multiplicity r?'' with respect to some appropriate measure of nearness. Existing symbolic\/numeric algorithms are not equipped to handle such questions well. Some of the issues that need to be addressed in this framework are: characterization of the solutions to a system of polynomial equations\/inequalities in the presence of small input errors; design of efficient algorithms for solving polynomial systems that work in limited (or adaptive) precision; understanding the factors that affect the stability of these algorithms; investigation of ways to arrange the sometimes independent symbolic phase and numerical phase in polynomial system solving to take maximum advantage of the strengths of each other. This project investigates some specific instance s of polynomial system solving in the above framework with particular focus on approximate polynomial greatest common divisors and several special families of systems of polynomials. A new parametric minimization technique is being studied and applied to the approximate GCD problem and several of its variants. The concept of generic Groebner bases is introduced and in combination with eigenvalue computations, their effectiveness in the approximate solving of certain special families of polynomial systems is being investigated. The investigation of generic Groebner bases throws fresh light on some well-known unresolved issues in Groebner base theory. The new techniques will be applied to polynomial systems arising in geometric modeling and kinematics.","title":"Approximate Polynomial System Solving and Generic Groebner Bases","awardID":"9712219","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[58200],"PO":["179846"]},"14086":{"abstract":"9619456 Traditional debuggers allow stepping along the forward execution path of a computer program and monitoring the program's state as it executes. They are a crucial tool in the process of program development, however they also can be frustrating in many situations when the user wishes to see not what the program is going to do in the future, but rather what happened in the past to bring it to where it currently is. This research will investigate and develop algorithms and mechanisms that can be used in constructing a bidirectional program debugger. Efficient backwards movement algorithms will be investigated for all traditional forward movement operations: step, next, finish, and location breakpoints. The underlying techniques expected to be utilized and developed in this research are code augmentation, transparent re-execution, I\/O replay, and checkpointing. In addition, this research will investigate efficient bidirectional algorithms for conditional breakpoints and data breakpoints, which are currently often inefficient operations or unavailable even in the forward direction. Debuggers are widely used from introductory programming students trying to understand why their program has gone astray, to professional programmers trying to find bugs in large and complicated systems. Development of better debugging tools will benefit all who are involved in program development and maintenance. ***","title":"A Fully Capable Bidirectional Debugger","awardID":"9619456","effectiveDate":"1997-08-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["503733"],"PO":["150697"]},"23085":{"abstract":"This project investigates combined visual and haptic (touch) interfaces to display multi-dimensional data generated by computer models of physical systems. The focus is on data features that are difficult to convey visually, such as scalar data which fills volumes, vector fields, and tensor fields. First, tests are conducted to better understand the perception of haptic rendering elements: virtual surfaces and constraints, forces and torques, and mechanical impedances. Second, new haptic rendering modes are developed which can convey multi- dimensional data via combinations of haptic rendering elements. These modes are tested using representative visualization problems in fluid dynamics, electromagnetics, and solid mechanics. Third, visualization puzzles are developed which quantify the perceptual added value of haptic rendering modes. Both cooperative and complementary visual\/haptic rendering are explored. The project seeks to discover synergistic rendering modes which produce understanding more easily than visual rendering alone. An improved visual\/haptic interface enables intuitive debugging of computer models, efficient visualization of modeling results, and improved physical understanding. Such a capability benefits the conduct of scientific research in many fields, the design and analysis of engineered systems, and the education of future scientists and engineers.","title":"Synergistic Visual\/Haptic Computer Interfaces","awardID":"9711936","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[57974,"507816","524820","373369"],"PO":["246649"]},"29432":{"abstract":"","title":"SGER: Heterogeneous Function-Based Human\/Robot Cooperation","awardID":"9796300","effectiveDate":"1997-08-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["550894"],"PO":["179262"]},"19400":{"abstract":"This research will address a number of different topics in the design and implementation of algorithms. The common theme of the research is application of advanced algorithmic techniques techniques to practical problems. Four specific problem areas are under investigation: (1) N-body Simulation: This is a collaborative project with the UW Department of Astronomy studying N-body simulation. The basic objective is to improve the algorithms and data structures used for massive simulations. The scale of simulations raise quite a few interesting computational geometry problems. (2) Constraint Satisfaction: One method of developing graphical user interfaces is to use a system of constraints to specify the behavior of the interface. Algorithms will be developed to solve the types of constraint systems which arise in this domain. There will be particular emphasis on constraint hierarchies, and on the efficiency of solutions. (3) The Traveling Tourist Problem: The problem is to visit a set of cities in minimum time where travel is restricted to a periodic timetable. In other words, it is the traveling salesman Problem restricted to public transportation. Heuristic and exact algorithms for this problem will be developed and implemented. (4) Model Checking Software Specification: A technique from hardware verification will be applied to a major problem in software engineering. In the last several years, symbolic model checking has become a very important tool for hardware verification. This project is to investigate whether model checking can also be applied successfully to evaluate software specifications. The specification of TCAS, a collision avoidance system used in commercial aircraft will be a major case study for the project.","title":"Applications of Algorithmic Techniques","awardID":"9700660","effectiveDate":"1997-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["24192"],"PO":["150516"]},"29443":{"abstract":"","title":"Finding Images Intensity Boundaries","awardID":"9796311","effectiveDate":"1997-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[74418],"PO":["475621"]},"14197":{"abstract":"9619808 The core technology used in this project is called \"model checking,\" a term embracing a large family of automated analysis methods. To date, these methods have been primarily used in domains like VLSI and protocol verification, i.e., problems which possess an inherent finite-state structure. Model-checking has proved less useful for analyzing general, concurrent programs realized in software, where many basic properties are undecidable. The PIs are developing algorithms to help attack this problem, by combining a variety of techniques used in model-checking, program analysis, constraint-solving and graph theory. The resulting methods guarantee convergence by allowing false negatives; often, these conservative approximations are sufficient to prove the properties under investigation. To date, the tools developed in the project have automatically verified some classical infinite-state programs. Examples are (1) the well known Bakery Algorithm which handles fair mutual-exclusion between multiple processes; and (2) FIFO queuing via circular, N-place buffers, where N is not bounded a priori. The analysis tools proved relevant safety and liveness properties in a matter of seconds; the same properties usually take several hours for advanced students to prove by hand. The PIs are now developing strategies for scaling these results. Methods under investigation are (1) finding more precise approximation techniques, specifically for abstracting path relations as transitive closures of infinite programs; (2) developing compositional strategies to help conquer state-explosion due to concurrency; and (3) unifying the automatic tools with a \"proof shell,\" to let the user combine automatic verification results into a higher-level, global proof structure. ***","title":"Constraint-Based Analysis of Infinite-State Programs","awardID":"9619808","effectiveDate":"1997-08-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["152351","78173"],"PO":["150697"]},"19312":{"abstract":"This project focuses on three problem areas concerning linear constraint query languages. Constraint database systems integrate database technology with constraint solving techniques to deal with applications involving spatial or geographical datasets and arithmetic computations. Linear constraint databases are generally represented by quantifier-free logical formulas over some arithmetical domain such as the real numbers (the real closed field) with addition. Conceptually, constraint queries are evaluated in closed form using quantifier elimination algorithms. The first part of this project aims at developing efficient query evaluation algorithms for linear or dense order constraint queries and syntactic forms for representing constraint databases so that efficient query evaluation becomes possible. The second part aims at showing the complexity of properties of constraint query languages including query containment, equivalence, satisfiability, and disjointness using a new technique based on abstract machines. The third part aims at developing incremental evaluation techniques for recursive (non-first-order) and topological queries. This project will provide complexity results and efficient algorithms as a theoretical foundation for the design of constraint database models, query languages, and systems.","title":"Complexity and Optimization Issues in Constraint Query Languages","awardID":"9700370","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["499391","389215"],"PO":["563751"]},"19257":{"abstract":"This project investigates algorithmic techniques for optimization, with an emphasis on problems related to graphs. The goal is faster and more space-efficient algorithms. A special focus is the use of semidefinite programming for modelling graph optimization problems. A new approach to approximately solving semidefinite programming problems is being pursued. Using the work on semidefinite programming as a guide, the project studies improving the efficiency of a broad class of approximation algorithms for optimization.","title":"Algorithmic Techniques for Optimization in Graphs","awardID":"9700146","effectiveDate":"1997-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["438410"],"PO":["543507"]},"21051":{"abstract":"This research develops new fast adaptive filtering algorithms and structures, which are characterized by a low computational complexity, and is applying them to a broad class of applications, including modern communications systems and advanced sensor array processing. For the communications application, this study demonstrates that such adaptive signal processing can effectively mitigate interference in satellite and terrestrial CDMA spread spectrum wireless communications as well as provide cross-talk cancellation in dense WDM fiberoptic links. The benefits of this new technology include power savings and increased data throughput, leading to newer generations of receiver processing hardware that are being developed from this study. In the sensor array processing application, it is demonstrated that low-complexity, reduced-dimension adaptive CFAR detectors are capable of outperforming all existing detectors for modern radar systems. The technology developed from this research permits space-time adaptive processing on platforms which are limited in terms of size, weight and power; such as airborne and space-segment surveillance systems. The key underlying innovation in all of these applications is the use of transform domain adaptive signal processing utilizing the cross-spectral metric and low-complexity filtering structures. This metric permits a lower-order adaptive filter to converge to a solution which is either identical or very close to the optimal solution. Since this filter has a smaller number of adaptive weights, it converges faster and requires a lower computational complexity. This new technology represents a generalization of multiresolution and time-frequency basis representations. The full-dimensional transform domain representation (realized using a filterbank, DFT\/DCT, or wavelet) is then compressed to keep only the most important information as selected by the cross-spectral metric.","title":"Reduced-Rank Adaptive Filtering for Spread Spectrum Communications, Array Processing and Detection","awardID":"9706215","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["134414","279768"],"PO":["564898"]},"23174":{"abstract":"This project will investigate algorithmic solutions to several geometric problems arising in layered manufacturing, where a physical prototype of a 3D object is built directly from its computer model by orienting and slicing the model into parallel layers and manufacturing the layers successively. The problems considered include finding orientations of the model that optimize one or more design criteria (e.g., number of layers, surface finish, amount of support structures needed), and algorithms for model decomposition, packing, slicing, support generation, and computation of offsets and tool-paths. The scope of the project includes the design and analysis of efficient and practical algorithms, their implementation in software, and, furthermore, the evaluation of this software via actual fabrication of parts on a layered manufacturing machine. The project will draw upon combinatorial, algorithmic, and data structuring techniques from computational geometry. The project will also benefit considerably from the input and practical expertise of engineers at a leading company specializing in layered manufacturing, with whom a collaboration is already underway. It is expected that the proposed work will result in significant design and performance improvements in layered manufacturing and will also open up interesting new directions for research in computational geometry.","title":"A Geometric Investigation of Layered Manufacturing: Algorithms, Software, and Fabrication","awardID":"9712226","effectiveDate":"1997-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["279596"],"PO":["179846"]},"10480":{"abstract":"This two-year award for US-Spain cooperative research in PDE-based image processing involves research groups headed by Tony Chan at UCLA and Gene Golub at Stanford University and by two Spanish researchers, Antonio Marquina and Pep Mulet at the University of Valencia, Spain. The objective of the research is to investigate the following problems: the design of computational techniques for total variation (TV) image restoration, the use of spatial adaptivity to better recover local details in TV image restoration, and combining the advantages of nonlinear diffusion models and wavelet denoising models. The collaboration takes advantage of the complementary expertise of the US and Spanish groups.","title":"U.S.-Spain Cooperative Research: Total Variation Methods in Image Processing","awardID":"9602089","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["320271","306467",26493,26494],"PO":["214302"]},"23384":{"abstract":"9712921 G. H. Bernstein University of Notre Dame CISE Educational Innovation : From Bits to Chips: A Multidisciplinary Curriculum for Microelectronics Systems Design Education This CISE Educational Innovation award supports the development of an interrelated set of courses from the Computer Science and Engineering (CSE) and Electrical Engineering (EE) departments that will emphasize both the technical and human aspects of microelectronics system development. As a part of the project, students will work in interdepartmental teams to design and fabricate a working microelectronics system, specifically a microprocessor. The project builds on particular strengths of the EE and CSE departments at Notre Dame and the educational plan is symbiotic with ongoing collaborative research between the two departments in the areas of nanotechnology, processing-in-memory computer architectures, and circuit and fabrication process optimization. In addition to bringing research results into the curriculum, it is expected that ideas from development and implementation of the new courses will also assist the ongoing research.","title":"Educational Innovation: From Bits to Chips: A Multidisciplinary Curriculum for Microelectronics System Design Education","awardID":"9712921","effectiveDate":"1997-08-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0601","name":"Division of edDATA NOT AVAILABLE","abbr":"EDNE"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["557409",58726,"507932","489796","336016"],"PO":["289456"]},"26013":{"abstract":"This is in support of the International Leadership Forum for Women with Disabilities to be held June 15-20, 1997 in Bethesda, Maryland. One of the daily themes is Communications and Technology which includes discussion of universal design and accessibility, accessing the Internet, small-budget publications, and improving outreach. All of the world's cultures and regions are to be represented in this follow-up to the UN 4th World Conference on Women held in Beijing in 1995. Daily proceedings of the forum are to be made available to off-site participants via the Internet, where discussions are to be continued after the forum meetings.","title":"International Forum on Women with Disabilities","awardID":"9727641","effectiveDate":"1997-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[65567],"PO":["565227"]},"29445":{"abstract":"","title":"CAREER: A Compiler-Assisted Approach to High Performance Memory Architectures","awardID":"9796313","effectiveDate":"1997-08-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["408878"],"PO":["74434"]},"22570":{"abstract":"Columbia College will use this grant to connect three of it's remote sites to the Internet. These include campus sites at Aurora, CO, Lake Ozarks, MO and Salt Lake City, UT. Columbia College is made up of twenty-one remote educational sites. Six of these sites are currently connected to the Internet. This grant will help three more sites connect. The college sites needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Columbia College Site Wide Area Networking","awardID":"9710419","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["309750","67221"],"PO":["121202"]},"24880":{"abstract":"9724281 Akansu, Ali New Jersey Institute of Technology Laboratory for Multimedia Signal Processing and Communication New Jersey Institute of Technology (NJIT) is acquiring a high speed computing, data storage and retrieval facilities for processing, compressing and displaying real-time image and video sequences. This equipment will support research projects in image\/video processing and compression, and transmission over wired and wireless networks. Additional image and video communication equipment will be acquired to support research projects on channel characterization, performance analysis and simulation for image and video communication. NJIT, Princeton University and Rutgers University are founding partners of a recently established New Jersey Center for Multimedia Research (NJCMR). NJCMR has been designated as a Research Excellence Center by the New Jersey State Commission of Science and Technology with a funding level of over $1 million per year for the coming 5 years. The MRI-funded equipment will form part of a new laboratory for Multimedia Signal Processing and Communication to support research projects within this Research Excellence Center. NJIT has a leading position in the State as a distance learning provider and the requested equipment will also be used to support multimedia technologies research and their application for educational and learning environments, as well as in advanced-level graduate course work on multimedia signal-processing, compression and communication.","title":"Laboratory for Multimedia Signal Processing and Communication","awardID":"9724281","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[62564,"87052",62566,"541892"],"PO":["297837"]},"20051":{"abstract":"The goals of this project are four-fold: (1) to investigate ways to support distributed searching agents for the Web; (2) to evaluate the effectiveness of ontology-based Web browsing agents; (3) to study the use of of visualization agents for the Web; and (4) to keep a record of changes to the ontology to study how information changes on the Web. This approach has the following advantages: First, distributing the search process makes more equitable use of computing and network resources and allows search agents to be customized to reflect local interests and preferences. Second, an ontology-based browsing agent allows for more serendipitous access to Web resources. Unlike the current browsing structures (e.g., Yahoo), these browsing agents associate appropriate resources with each concept automatically. The ontology may adapt over time at individual sites, allowing the browsing structure to evolve as the Web itself evolves. Third, the ability to visualize large portions of the Web in a more abstract way allows users to quickly get an impression of what type of information is available. Fourth, by keeping a history of changes to the local ontologies, the ebb and flow of the importance of concepts locally and globally can be presented. Finally, undergraduate and graduate students are being exposed to a truly interdisciplinary research through their involvement in a long term project that combines expertise from several fields, primarily computer graphics, artificial intelligence, distributed processing and information science. The World Wide Web (WWW) offers the promise of unlimited access to electronic information. However currently, the reality is electronic access to unlimited anarchy. This project is addressing the use of conceptual ontologies to bring order to the chaos.","title":"CAREER\/EPSCoR: Cooperative Agents for Conceptual Search and Browsing of World Wide Web Resources","awardID":"9703307","effectiveDate":"1997-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["468587"],"PO":["563751"]},"25541":{"abstract":"Software tools are defined as abstract tools that can be programmed to vector field systems to perform a desired task, such as centering, rotating and filtering field configurations. Hardware tools are defined as generic objects that can interact with other objects being manipulated by the vector field system, in manners that are suitable for mechanical assembly operations. Examples of hardware tools include grippers, sliders, compliant fixtures, etc. These tools can be viewed as basic building blocks of micro-assembly manipulation tasks, that together define an API for the development and specification of micro manipulation strategies in a modular way, using a \"high level language\". This research will investigate utility tools on both sensorles and sensor-based frameworks. Path planning in a compliant accommodating vector force field system will also be investigated.","title":"SGER: Hardware and Software Tools for Micro Assembly using Intelligent Motion Surfaces","awardID":"9726251","effectiveDate":"1997-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["212108",64400],"PO":["475621"]},"23275":{"abstract":"The objectives of this planning grant are to identify important human-interface design issues associated with complex multisensory interface, to identify quantitative measures to assess performance in environments that use these interfaces, and to develop projects using advanced interfaces in the rehabilitation community. Possible applications include virtual reality therapy, web-based quantitative assessment, and the interfacing of medical devices with telecommunications to provide care in the home (tele-care). The methodology will be to explore potential advanced interfaces from a human computer interface design perspective and also to explore methods for quantifying performance in such environments. Two tasks will be accomplished during the time frame of the planning grant, assessing interface hardware and designing evaluation tasks. Theoretical models of the human as an information processor can help to approach the evaluation of input and output devices for 2D and 3D tasks. A conceptual model will be developed to identify and assess the important parameters of these devices. In particular, the human control loop will be focused on to optimize human performance. Advanced interface devices may include 3D mice, hand\/finger trackers, head and eye trackers, and haptic interfaces. Haptic interfaces are of particular interest such as the interaction of force and visual feedback on human performance. Classic human performance methods will be used to test the interface devices. A test battery will be developed to evaluate the appropriateness of using simple tasks for assessment of performance. Measures of motor control will be tested using a movement time task based on Fitts law and classic teleoperator tasks such as \"peg in the hole\" will be used to test manipulation capabilities of the interface devices.","title":"RPG: Quantitative Assessment of Performance in Complex Multisensory Human-Interface Environments","awardID":"9712526","effectiveDate":"1997-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["205200"],"PO":["183208"]},"19843":{"abstract":"This project aims at the advancement of the ability to extract spatial information from digital aerial imagery by taking advantage of geospatial databases to support and guide object extraction operations. It deals with aerial images representing scenes for which prior or complementary information already exists. Examples of such information are pre-existing digital maps, digital terrain models, and spatial information systems in general. The research plan involves: (1) matching images to existing databases for change detection; (2) analysis of scale differences between database information and image; and (3) developing metadata structures to convey accuracy information for objects contained in geospatial databases. By embedding object extraction processes within the framework of spatial information systems, digital image analysis will be able to exploit the advantages offered by the availability of spatial data from various sources and in diverse formats, and, in turn, contribute to the improvement of the temporal and quantitative quality and completeness of the data contained in those sources. The educational aspect of the project includes initiatives designed to take advantage of and incorporate the project research advancements in the graduate and undergraduate curriculum, as well as in the high-school outreach program of the Department of Spatial Information Engineering. A 3-day workshop, with participation of U.S. and international experts is also planned. Combined, the issues addressed in this project will substantially advance science in digital image processing and analysis, and will complement parallel advancements in a variety of related disciplines, most notably digital libraries, geographic information systems, and remote sensor technology.","title":"CAREER\/EPSCoR: Geospatial Database-Driven Extraction of Information from Digital Aerial Imagery","awardID":"9702233","effectiveDate":"1997-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["391834"],"PO":["563751"]},"49026":{"abstract":"","title":"Advanced Constraint Techniques for User Interface Implementation","awardID":"9996001","effectiveDate":"1997-08-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["518043"],"PO":["565227"]},"29369":{"abstract":"","title":"RUI: High Frequency Analog Telecommunications Circuits","awardID":"9796233","effectiveDate":"1997-08-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["182743"],"PO":["321058"]},"24980":{"abstract":"9724567 Sawchuk, Alexander McLeod, Dennis University of Southern California High Performance of Processors and Networks for Video Compression, Distributed Visualization, Database Systems and Collaborative Telepresence USC has received a Major Research Instrumentation award for the acquisition of processing hardware; a special purpose high-speed-resolution digital video storage and display hardware; and miscellaneous data communications hardware; for an Integrated Media Research Network (IMRN) to support research and training programs in high-performance multimedia, graphics, visualization, and database systems. Research projects to be supported include the generation, compression and transmission of real-time video over shared networks; processing of remote high resolution 3-D visualization and computation-intensive graphics; robust distribution and networking of interactive multimedia data within a heterogeneous distributed computing environment; distributed database management techniques for video and audio servers; and utilization of multiprocessor computers for collaborative telepresence over long physical distances. Besides making the enhanced facilities available to students pursuing research in high-performance graphics, visualization and database systems, USC plans to connect the IMRN to the Institution's School of Engineering's Instructional Television network which supports two-way live interactive broadcasts of regular credit courses from engineering, computer science and mathematics. It is envisaged that this connection will allow students to work on research projects anywhere on the main campus, medical school campus and USC's Information Sciences Institute and will allow classroom demonstrations over these locations as well as the local Los Angeles area. Research results on database management for video data and distance learning will contribute directly to these distance learning activities.","title":"High Performance Processors and Networks for Video Compression, Distributed Visualization, Database Systems and Collaborative Telepresence","awardID":"9724567","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1480","name":"ENGINEERING RESEARCH CENTERS"}}],"PIcoPI":["293075",62976,"193983","275413","451991","233683","550740"],"PO":["297837"]},"20086":{"abstract":"CDA-9703470 Huttenlocher, Daniel Cornell University A Next Generation Computing and Communication Substrate This award is to support researchers at Cornell to develop technologies for a new computing and communications substrate that provides \"access to anything, anytime, anywhere\". To achieve this goal Cornell researchers plan to: (1) do fundamental new research, (2) develop integrated systems to demonstrate the power of their results, and (3) test these systems. In order to develop the proposed systems, it is critical to test them with real systems and real users. These researchers plan to use their teaching activities as a ready source of users to test their systems, as well as using the systems to disseminate their research results and to provide experimental information services. Cornell University is moving towards a campus-wide hybrid ATM and switched ethernet communications network, which will eventually enable them to test their systems with campus-wide network of 20,000 users. They also expect to release their systems for use by other academic institutions and businesses.","title":"CISE Research Infrastructure: A Next Generation Computing and Communications Substrate","awardID":"9703470","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["495285","166043","420975","84110",50776],"PO":["150490"]},"14014":{"abstract":"9619219 The goal of the project is to advance the state of the art in static analysis of programs that perform destructive updating on heap-allocated storage. The work will address problems that can be looked at --- depending on one's point of view --- as pointer- analysis problems, alias-analysis problems, sharing-analysis problems, storage-analysis problems (also known as shape-analysis problems), or type-checking problems. The information obtained is useful for generating efficient sequential and parallel code. It is also useful in certain kinds of software-engineering tools. The project aims to make contributions in the following areas: (1) Develop further the theoretical foundations of shape abstractions and their use in abstract interpretation. (2) Develop a tool for creating a shape-analysis algorithm from a specification of a shape abstraction. (3) Extend the range of applications for shape-analysis techniques, for example, by (i) generalizing them so that questions can be answered of the form \"Can accesses through the structure that x points to at program point p ever reach any of the elements of the structure that y points to at program point q?\", and (ii) combining shape-analysis with array-subscript analysis. (4) Create, experiment with, and evaluate shape-analysis implementations. ***","title":"Shape-Analysis for Languages with Destructive Updating","awardID":"9619219","effectiveDate":"1997-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["401760"],"PO":["397849"]},"19624":{"abstract":"The goal of this research is to investigate extensions of a design methodology for a class of low noise integrated oscillators in the applications areas of telecommunications, high speed microprocessors, and oversampled data conversion. The goal of the teaching plan associated with this research is for the Analog Microelectronics Laboratory to become an integral resource for educating both undergraduates and graduate students in the complete integrated circuit design process. This project will improve the design of analog and mixed signal integrated circuits for telecommunication systems in which system-level performance is ultimately limited by fundamental circuit-level considerations. A critical component in any integrated communication system is an oscillatory that provides a time\/frequency reference for the data transmission and detection process. The broad class of ring oscillators offer many advantages for integrated oscillator design, but until recently there were no procedures available to design for a desired level of noise performance. This project is based on a new design methodology for ring oscillators that has been proven successful to the frequencies up to 155 MHz in a bipolar IC process. The goal is to extend and broaden the low jitter oscillator design techniques to higher speed in the GHz range, reduced supply voltage of 3.3V and below, and other fabrication technologies including CMOS.","title":"CAREER: Research in Low Noise Integrated Circuit Design for Telecommunication Systems","awardID":"9701408","effectiveDate":"1997-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["523630"],"PO":["549626"]},"29447":{"abstract":"","title":"High Performance Computing for Large Scale Systems","awardID":"9796315","effectiveDate":"1997-08-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["538628","225569"],"PO":["179846"]},"38721":{"abstract":"","title":"Processor Specialization in Fault-Tolerant Distributed Systems","awardID":"9896040","effectiveDate":"1997-08-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["492042"],"PO":["250083"]},"23244":{"abstract":"The award will support a program of research on the emergence and support of distributed collaborative communities, particularly those that are centered around specific business or educational objectives. The key issues and questions to be explored include: (a) How virtual communities differ from face-to-face communities; (b) How individuals signal membership and what are the mechanisms for and barriers to entry or exit (c) How particular technological characteristics enable or obstruct group work and community building (d) How virtual communities are forged across computer-based networks and across the physical-virtual divide; and (e) What are the implications of breaking down divisions between 'home' and 'work,' for individual 'lifescapes' and broader community infrastructures. The methods to be used in this project include ethnographic studies and joint analysis of videotape data.","title":"Collaborative Work in Distributed Communities","awardID":"9712421","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["139604"],"PO":["564456"]},"38732":{"abstract":"","title":"Visual Query Languages for Database Systems","awardID":"9896052","effectiveDate":"1997-08-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["554456"],"PO":["563751"]},"14213":{"abstract":"This research studies robot motion planning for tasks involving rolling and sliding contact with friction (generalized manipulatimn planning). The goal is to derive and use new results in multi-rigid-body mechanics and mathematical programming to develop techniques for the automatic generation of robust feedback control strategies. These strategies will guarantee correct execution of manipulation tasks with contact despite uncertainty in the parameters of the geometric, kinematic, and dynamic models, and sensing errors. When correct task execution cannot be guaranteed, the secondary goal is to specify a set of tighter, but widest possible, bounds on the uncertain parameters and sensing errors, which if satisfied, would guarantee correct execution. Application domains for the expected results include industrial assembly, grasp acquisition and dexterous manipulation, visual serving, medical assembly (e.g., hip replacement), virtual reality, and mechanical design. To test the practicality of the proposed approach and the validity of the underlying mathematical models, a CAD-based, manipulation planning system will be implemented. Automatically generated plans will be executed with real devices (i.e., an industrial robot and a planar dexterous manipulation testbed available at Texas A&M). In addition, real problems and associated data will be provided by colleagues from General Electric, Boeing, and the Amarillo National Resource Center for Plutonium. The work involves a collaboration with Prof. Jong-Shi Pang, of the Department of Mathematical Sciences at the Johns Hopkins University.","title":"COLLABORATIVE: Planning Manipulation with Contact Under Uncertainty","awardID":"9619850","effectiveDate":"1997-08-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["534411","561154"],"PO":["179262"]},"13245":{"abstract":"Lawson State Community College requested support from NSF to connect it's campus to the Internet. Lawson State Community College is one of the twenty community colleges in the State of Alabama and the only predominantly black supported state colleges in Central Alabama. It is located in the southwestern section of Birmingham, Alabama and serves a student body of over 2000. Lawson State Community College intends to connect through the Alabama Super Computer Authority. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connections to the Internet","awardID":"9616877","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33517],"PO":["121202"]},"19966":{"abstract":"9702805 This project investigates the task of automatically determining properties of the run-time behavior of computer programs before the programs are actually executed. Optimizing compilers have long motivated research in this area, commonly known as static program analysis. More recently, there has been interest in using program analysis to verify correctness or safety properties of software before it is put into service. However, due both to the phenomenon of accumulated imprecision, which is akin to accumulated rounding error, and to the inadequacy of invariant properties in the presence of loops and recursion, useful and accurate program analysis is hard to achieve in practice. This project examines a new methodology for program analysis designed to address these problems. This methodology is distinctive in that it does not analyze execution states, but instead analyzes the changes, called transfer relations, between those states, thus enabling previously unsolved analyses of programming constructs such as first-class functions, concurrency, pointers and references, assignment, mutable data structures, and arrays. The research investigates the application of these analyses to urgent issues such as ensuring safety of untrusted foreign code and increasing reliability of large software systems. The project applies this research to an educational plan including course development, mentoring of masters students, and the development of an annual summer school on program analysis, including a new text. ***","title":"CAREER: Semantics-based Program Analysis via Symbolic Composition of Transfer Relations","awardID":"9702805","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[50486],"PO":["150697"]},"21770":{"abstract":"In an urban cellular environment, the data pulses employed in digital communications typically travel through multiple paths from transmitter to receiver due to reflections from buildings and other structures. This multipath propagation causes each pulse to be corrupted by pulses transmitted before and after it; the deleterious effects of this \"intersymbol interference\" (ISI) necessitate signal processing in the form of an \"equalizer\". As a further complications, the projected explosion in the number of cellular users will almost certainly require two users in the same of adjacent cells to occupy the same frequency band. This leads to \"co-channel interference\" that manifests itself as cross-talk amongst users. The use of antenna arrays, which enables discrimination amongst signals arriving from different directions, offers a means of suppressing co-channel interference. This research focuses on the development of spatiotemporal signal processing schemes to effect both equalization and interference cancellation for mobile narrowband digital communications in an urban cellular environment. The equalizer design problem is reformulated as a convex optimization problem based on linear matrix inequalities and solved numerically. Equalization is effected with sample-spaced taps at each antenna, encompassing a time duration roughly equal to the multipath time delay spread. This facilitates better tracking of time-varying multipath channels as compared to conventional equalization schemes employing symbol-spaced taps. Interference cancellation is effected by forming beams with directions of maximum gain steered towards the desired user's multipath, and nulls steered towards strong co-channel interferers. This is achieved by processing a short training signal via a novel extended correlator that highly localizes in time the contribution of the desired user's signal, thereby allowing one to estimate the spatial correlation matrix of the interferers. The equalization an d interference cancellation schemes developed in this research hold the greatest promise in terms of the trade-off amongst convergence rate, computational complexity, robustness to model mismatch, and symbol error performance for Time Division Multiple Access (TDMA) systems where the multipath time delay spread is less than the null-to-null mainlobe of the pulse symbol waveform, as is the case with cellular systems based on the IS-136 TDMA standard.","title":"Space-Time Processing for Digital Comm: Nonparametric Channel ID & Interference Cancellation & Multichannel Equalizer Design Based on Linear Matrix Inequalities","awardID":"9708309","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["434205","332293"],"PO":["564898"]},"20472":{"abstract":"This project plans to investigate how to best use multiple workstations to support modern, highly interactive applications. The initial focus is on the real-time rendering of 3D computer generated scenes. These applications present two key new problems in the use of multi-computers: they stress resources in the machines (e.g., memory bandwidth and outboard video processing capability) other than just processor speed and network bandwidth, and \"good performance\" means meeting the short time deadline by which the next frame must be produced rather than minimizing the duration of a fairly long execution. The focus of this project is on resource allocation: how to divide system-wide resources among the components of the problem that must be done so that performance objectives can be met. The current effort is aimed at solving this problem in an environment where both the work to be performed and the total resources that are available are relatively constant from frame to frame. A longer term goal of the work is to investigate the use of replication to help assure that deadlines will continue to be met in more dynamic environments.","title":"Resource-Controlled Parallel Execution of Real-Time Applications in Networks of Workstations","awardID":"9704503","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[51686],"PO":["250083"]},"21594":{"abstract":"A variety of problems in both medical diagnostics and nondestructive testing of materials requires the reconstruction of a portion or cross section of an object without directly viewing its interior. Tomographic imaging techniques allow noninvasive\/nondestructive studies which minimize patient trauma and cost in the medical domain, and reduce manufacturing and maintenance expenses for many industries by transforming external measurements into images of the interior of the patient or object. The established methods for computing tomographic images in common examples such as x-ray CT scanning are inadequate for difficult cases involving a shortage of data or great uncertainty in their precise values due to inherent error in measurements. For these problems, algorithms are needed which explicitly take into account the characteristics of the measurement errors as well as common behavior of the tissue or materials under study. Much improvement has resulted from statistical methods such as Bayesian tomographic estimation, but conventional estimation techniques, based on homogeneous random field models and fixed optimization strategies, seem to be approaching their limits of improvement. This project is developing three principal innovations to improve the capabilities of tomographic systems, with particular focus on three-dimensional applications: (1) nonhomogeneous image cross section models which allow spatially varying image characteristics to be accurately estimated using a simple multiscale estimation procedure; (2) fast nonlinear optimization algorithms for minimizing the nonquadratic functions that result from MAP estimation with nonGaussian prior models; (3) a novel approach to tomographic reconstruction based on nonlinear, non-iterative estimation from back projection data. This research is applicable to the full range of emission and transmission tomographic problems, with particular experimental focus on 3D medical emission tomography.","title":"Nonhomogeneous and Nonlinear Methods for Tomographic Estimation","awardID":"9707763","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["263577"],"PO":["564898"]},"19934":{"abstract":"The award supports research on a collection of projects, all of which address the problem of individuals or groups learning to be more productive in an environment containing other individuals and groups. The gamut of multi-agent learning scenarios covered ranges from completely cooperative groups, where the sole goal of each individual is to server group interests, to purely competitive situations in which individuals learn to exploit the weaknesses of competitors. On another dimension, the award treats both individualistic learning schemes, where each agent learns by itself, and shared learning approaches, where two or more agents actively participate in learning about each other. To enable shared learning in cooperative groups, a group infrastructure is necessary. Work under this award will study a group architecture and a flexible commitment framework that allows agent to make sensible decision about predictability-versus-responsiveness tradeoffs as necessitated by environmental dynamics.","title":"CAREER: Learning to Cooperate and Compete","awardID":"9702672","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["362927"],"PO":["565227"]},"20022":{"abstract":"We propose to develop a statistical framework for nonlinear signal processing for communications by using a recent extension of maximum likelihood estimation, the maximum partial likelihood (MPL) theory. MPL allows for dependent and missing observations and sequential processing of data using only the information that is available at the time of processing. The inclusion of the dependent data in the framework allows development of techniques for joint detection and estimation in the presence of sources and channels with memory, for example to combine maximum likelihood sequence detection with adaptive equalization. The proposed research includes development of a new class of real-time adaptive signal processing algorithms based on MPL estimation by using both gradient optimization and information-theoretic alternating projections, study of their statistical and dynamic properties, incorporation of order\/complexity determination into the scheme, and implementations in equalization, joint equalization and sequence estimation, and variable rate speech coding. The educatimn goals of the PI are shaped by the commitment to equip the students with the necessary theoretical and practical facilities to solve real-world problems; to help them mature into resourceful and creative engineers who could meet the challenges of a discipline rapidly growing in complexity. Information on projects in this area and on maximum partial likelihood research can be found at http:\/\/engr.umbc.edu\/~adali.","title":"CAREER: Maximum Partial Likelihood Methods for Communications","awardID":"9703161","effectiveDate":"1997-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["486076"],"PO":["223414"]},"25511":{"abstract":"The 1997 ACM SIGCOMM Conference on Communications Architectures, Protocols and Applications will be held in Nice, France, from September 16-18, 1997. This conference is the premier technical meeting that examines the state-of-the-art in computer networks and communications. This proposal requests funding to assist ten United States-based graduate students in attending this meeting. Participation in conferences such as Sigcomm is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and be exposed to leading edge work in the field. The support requested in this proposal will enable the participation of students who would otherwise be unable to attend SIGCOMM'97.","title":"Travel Support for ACM SIGCOMM '97 Conference","awardID":"9726175","effectiveDate":"1997-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["550429"],"PO":["150490"]},"23389":{"abstract":"9712929 Parrish, Allen Cordes, David University of Alabama CISE Educational Innovation: Integrating Software Architecture into an Interdisciplinary Software Engineering Curriculum This CISE Educational Innovation award supports the development of a new software engineering concentration involving students from the Departments of Computer Science, Computer Engineering, and Management Information Systems. The concentration involves two major parts: a sequence of fundamentals courses, and a year-long capstone project course sequence. The fundamentals courses will present concepts from the research areas of software component engineering and software architecture, while the project course sequence will involve interdisciplinary teams of students developing a realistic industrial product while applying the novel concepts learned within the fundamentals courses. The project also involves assessment and dissemination of the resulting curriculum.","title":"Educational Innovation: Integrating Software Architecture into an Interdisciplinary Software Engineering Curriculum","awardID":"9712929","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["426940","543613",58741,"394731","563023",58744,"559029","289841","504299"],"PO":["551712"]},"14127":{"abstract":"9619584 This project is a renewal of NSF Grant CCR-9303383 with the same title. Motivated by the tremendous variety of deductive systems of interest in computer science and logic, general meta-languages for their specification, often referred to as logical frameworks, have been investigated by the researcher and others. Work on the previous grant includes the design of the logical framework LF and the logic programming language Elf based on LF. Extensive case studies have confirmed the wide range of applicability of the methodology underlying LF and Elf and also pointed towards certain limitations, which this project will address. The work includes a language for modular presentation of deductive systems and meta-programs, and refinements of the framework to permit subtyping, linearity, and internal equational reasoning. The project will implement these language refinements, building on current prototypes and the core and module language implementations for LF and Elf. It will also continue to explore the use of LF and Elf and their refinements as vehicles for representing proofs of meta theorems about deductive systems; that is, their use as a meta-logical framework. A number of case studies under the previous grant indicate the feasibility of such representations, but more theoretical and implementation work remains to be done. In longer term plans, the project will increase the degree of automation of carrying out such proofs, taking advantage of the high level of abstraction of the representations and the expressive type system of LF. ***","title":"Design, Implementation and Application of a Framework for the Formalization of Deductive Systems","awardID":"9619584","effectiveDate":"1997-08-01","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["339844"],"PO":["150697"]},"19704":{"abstract":"Many computer systems are multi-threaded. Traditional on-line problems abstract away the existence of multiple threads, either by collapsing multiple threads into a single thread or by reducing each thread to a single request. This project studies a new class of problems: on-line systems with multi-threaded inputs. To model multi-threaded inputs, multiple client input model where each client (thread) is represented by a directed acyclic graph (DAG) are introduced. Three practical problems investigated are the multi-threaded paging problem, where processes compete for both central processing unit (CPU) time and fast memory locations; the multi-threaded disk scheduling problem where processes and\/or database transactions compete for access to the disk; and the multi-threaded operating system problem, the natural combination of these two problems. These problems generalize into the k-client problem, a dual version of the well-studied k-server problem, and the k-server l-client problem. One important goal of this research is to learn how to design a complex system such as a fast memory manager, a CPU scheduler, and a disk scheduler. In particular, determine if the algorithms and results obtained by considering each system component in isolation can be easily combined to produce new algorithms and results for the complete system. In education, there are two complementary projects. The first project deals with the process of learning how to teach. The PI applied for and received a highly competitive MSU Lilly Endowment Teaching Fellowship. In this intensive year-long program, the PI will work together with a group of five promising young faculty to learn fundamental educational principles taught by leading education scholars from around the University and around the country. The second project is to build a more cohesive curriculum emphasizing the practical importance of all topics, especially theory. This is achieved by leading a departmental effort to wr ite a comprehensive computer science textbook written in hypertext markup language (HTML). This HTML textbook will utilize hyperlinks to highlight the connections between and within courses. For example, links will connect a module on stacks and queues from a data structures course with modules from an operating systems course where these structures are used. This HTML textbook project may also supplement departmental efforts to offer distance learning courses to nontraditional students.","title":"CAREER: Multi-threaded Research and Education","awardID":"9701679","effectiveDate":"1997-08-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["562295"],"PO":["543507"]},"29439":{"abstract":"","title":"Wide-Angle Symmetry","awardID":"9796307","effectiveDate":"1997-08-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["74418"],"PO":["335186"]},"23411":{"abstract":"9713032 Rice University R. Cartwright CISE Educational Innovation: Exploring A Safe Approach to Software Engineering This CISE Educational Innovation award supports the development of a new undergraduate course sequence in software engineering that focuses on emerging principles of program design and validation applicable to type-safe languages. These courses are built on the high-level design principles incorporated in the new introductory programming sequence at Rice and draw on recent research in algorithmic verification through soft typing and modular program composition. Two courses, targeted at upper-level undergraduates, are being developed. The first course is a foundations course using safe languages that focuses on the principles of program and module design, verification, debugging, and performance tuning and the second is an interdisciplinary studio course that applies the principles of the foundations course to writing innovative networking software. These courses have the potential to make major impact on course work in software engineering in the future.","title":"Educational Innovation: Exploring a Safe Approach to Software Engineering","awardID":"9713032","effectiveDate":"1997-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["495364","475166","193837","282239"],"PO":["551712"]},"22685":{"abstract":"This project is in the area of computational topology, which is the application of topological algorithms to problems traditionally in the domain of computational geometry. The project will employ topological methods to develop and implement algorithms for various applications in the areas of 1) geometric modeling, 2) robot motion planning, and 3) computer graphics. Algorithms will be coded on graphics workstations. Particular effort will be put on algorithms for geometric objects that are modeled as simplicial complexes in low- dimensional Euclidean space. Further, the underlying theory of computational topology will be systematically investigated in the context of applications.","title":"Computational Topology: Algorithms and Applications","awardID":"9710711","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[56979],"PO":["179846"]},"20034":{"abstract":"CDA-9703217 Grupen, Roderic A. University of Massachusetts A Facility for Cross Disciplinary Research on Sensorimotor Development in Humans and Machines This award is for supporting research activities in Computer Science and Psychology at UMass in assembling an infrastructure for experimental work on the development of conceptual structure from sensorimotor activity. An interactionist theory is advanced in which the origin of knowledge is interactive behavior in an environment. By this account, the nature of the environment and the agent's native resources (sensors, effectors, and control) lead directly to appropriate conceptual structures in natural and artificial systems. The central claim of this research is that the first task facing an intelligent, embodied agent is coordinated sensory and motor interaction with its environment and that this task leads to policies and abstractions that influence the subsequent acquisition of higher cognitive abilities. An interdisciplinary team specializing in robotics, cognitive development, and motor development, learning, planning and language lead the effort. The infrastructure incorporates robot hands and arms, binocular vision, binaural audition, haptic and kinesthetic information in a common framework to provide a rich sensory and motor encoding of interaction with the world. In addition to the robotics facilities, the infrastructure includes tools for gathering precise, quantitative observations of postures and rates of movement in human subjects. These facilities are designed to support analogs of nontrivial human processes so that computational models of development may be compared to data from infant subjects.","title":"CISE Research Infrastructure: A Facility for Cross Disciplinary Research on Sensorimotor Development in Humans and Machine","awardID":"9703217","effectiveDate":"1997-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}}],"PIcoPI":["524130","425667","60534","391847","513288","189869"],"PO":["297837"]},"21024":{"abstract":"This project is studying software development methods to develop general techniques that can be used to parameterize specific instances of these methods into general methods. These general methods will be evaluated in a series of experiments in order to develop an experience base of such knowledge. Software development in the future will be based upon reuse of existing products in a variety of forms. This work provides insight into the relationships between reading and writing, analysis and construction. The research focuses on: 1. Developing families of techniques based upon understanding the various documents used in a software development in order to (a) evaluate the document itself, e.g., to report defects in the document, and (b) construct other documents using an original document as a baseline, e.g., to develop a new product based upon reuse of prior products using the earlier documentation as a guide to the new development. 2. Developing a set of evaluation methods that can be used to assess technologies in the laboratory and in industrial settings. 3. Building an Experience Base of technique evaluations that can be accessed by others, who can append their own experiences with those techniques.","title":"The Experimental Validation and Packaging of Software Technologies","awardID":"9706151","effectiveDate":"1997-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["262266","142819"],"PO":["179487"]},"13347":{"abstract":"This project undertakes a systematic study of cognitive processes that support students in learning important concepts and skills concerning practical ethical reasoning in a professional domain. The investigators will build a corpus of cases, strategies, and analyses from three general sources: (1) the case examples and exercises taken from leading textbooks in engineering ethics (2) the knowledge, reasoning skills and case examples provided by engineering ethicists and professional engineers as revealed in protocols which the investigators will acquire and analyze, and (3) the findings of the investigators' previous empirical study of different strategies for analyzing practical ethical dilemmas employed by novice and more experienced ethical reasoners. As a result of that study, the investigators found that experienced ethical reasoners are careful to identify issues and to specify conditions under which specific professional role obligations recommend particular actions, that they elaborate conditions which would affect the moral analysis of a problem, in part through posing hypothetical variations of the problem, and that they justify resolutions in terms of those conditions which they conclude apply in the problem. The investigators will develop techniques for using the corpus to challenge and instruct novices in a manual tutoring intervention and assess the pedagogical value of those techniques. They will present an experimental group of novices aspects of the experienced analyses and invite them to compare those conclusions with their own reasoning. The goal will be to assess how novices understand the use of hypothetical variations and their moral significance for the analysis of the problem. A control group will not be exposed to the experts' reasoning and conclusions, and their conclusions will be compared with the experimental analysis of the same problems. The experimental design will also allow investigators to contrast the protocols of novices analyzing problems from the corpus and compare them to the experienced or expert analyses of the same problems. Results will be reported in journals and at meetings and can form the basis for developing a computational model and designing an interactive tutoring system. The significance lies in the development of a better understanding of a pedagogical strategy widely used in practical ethical instruction. The study will shed light on how experts' analyses comparing problems to variations can assist students in learning the process of ethical reasoning.","title":"Collaborative Research: Practical Ethical Instruction with Expert-Analyzed Cases","awardID":"9617071","effectiveDate":"1997-08-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}}],"PIcoPI":["488662"],"PO":["288903"]},"25238":{"abstract":"This award will enable Old Colorado City Communications (OCCC) and the Institute of Applied Space Research (IASR) of George Washington University (GWU) to hold a workshop highlighting the promise of terrestrial wireless and next generation communication satellite technology for the research and education (R&E) community. The workshop will be held at GWU's Marvin Center at the Washington, D.C. campus on October 22-25, 1997.","title":"Emerging Wireless Communications Workshop","awardID":"9725334","effectiveDate":"1997-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["201347",63643],"PO":[63644]},"22972":{"abstract":"97-11582 Rishe, Naphtali Barton, David Florida International University (FIU) CISE MII: Infrastructure for Research and Training on High-Performance Heterogeneous Distributed Database Management. This award is to be used to attract and retain minority students, encouraging high-performance database research. Planned is a special mentoring program modeled after the \"Affinity Groups\" of the University of Texas at El Paso. The groups, consisting of undergraduate and graduate students, post-docs, and faculty members, provide the framework that enables deepening knowledge of a field by procuring a physical setting in a cooperative research-engaging environment. Structured activities facilitate knowledge transfer and serve to ascertain progress. Summer internships for undergraduates are budgeted to involve them in research projects. The affinity groups, within the FIU High Performance Database Research Center at FIU performs research towards the development of a heterogeneous distributed database management system (HDBMS) providing fast integration of disparate data sources and efficient interoperability through the application and utilization of a semantic database management system to define a global schema of the heterogeneous data. A semantic interpretation of SQL is used for efficient interoperability of relational and object-oriented databases. Dynamically-dispatched agent technology is used to interface the distributed heterogeneous databases. Query optimization techniques in the presence of heterogeneous networks are being evaluated and investigated.","title":"MII: Infrastructure for Research and Training on High -Performance Heterogeneous Distributed Database Management","awardID":"9711582","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":[57685,"558108",57687,"508452",57689,"497035",57691],"PO":["150490"]},"21674":{"abstract":"9707973 Aspray, William Computing Research Association Special Project: History of the Academic Discipline of Computer Science\/Engineering 1945-1980 This grant provides support for work toward the development of a history of computer science and engineering as an academic discipline in the United States in the years 1945 to 1980. This period begins with the completion of the first computer and ends at a time when most research universities had established a Ph.D. program in computer science and many colleges and universities had opened undergraduate programs. This project will result in drafts of some of the chapters of the history, will include several oral history interviews and will culminate in a proposal for completion of the overall effort.","title":"Special Project: History of the Academic Discipline of Computer Science\/Engr, 1945-1980","awardID":"9707973","effectiveDate":"1997-08-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["208531"],"PO":["329035"]},"20475":{"abstract":"Coleman 9704509 The investigator and his colleagues focus on the efficient numerical computation of global solutions of problems of nonlinear elastostatics in a high-performance computational environment. Particular attention is paid to the global post-critical behavior of symmetric imperfection-free elastic shell structures --- the analysis of which has great significance in understanding the large deformation response and ultimate collapse scenario of realistic engineering structures. A major theme of the work is to exploit the natural parallelism, via group theoretic techniques, in an important class of engineering problems characterized by underlying symmetries. They also investigate the use of automatic differentiation software in the context of those problems. Finally, they study the effectiveness of symmetry-motivated preconditioners, within the context of Krylov iterative subspace methods, for a class of ``almost-symmetric'' problems in structural mechanics. Due to their high strength-to-weight ratios, thin shell structures have been used extensively in aerospace, civil, mechanical and nuclear engineering applications, e.g., dome roofs, aerospace vehicles, pressure vessels, containment vessels, etc. Yet the ability of engineers to predict the ultimate failure of such systems has heretofore been more of an art than a science (relying heavily upon costly experimental verification -- see \"Computerized Buckling Analysis of Shells\", by D. Bushnell, Martinus Nijhoff 1985). The investigators combine new mathematical ideas of symmeytry and nonlinear analysis with high-performance computing methodology to analyze such systems efficiently and systematically. A long-term goal is to provide engineers with useful tools for the sytematic analysis (and ultimately better design) for this important class of structures. Funding for the project is provided by the Computational Mathematics program and the Office of Multidisciplinary Activities in MPS and b y the New Technologies program in CISE.","title":"Efficient Algorithms for Large-Scale Linear and Nonlinear Finite Element Computations with Applications to Thin Shell Structures","awardID":"9704509","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["322423","547208"],"PO":["562372"]},"11422":{"abstract":"This three-year award supports continuation of a US-France cooperative research project involving Stephen L. Campbell, North Carolina State University, Francois Delebecque and Ramine Nikoukhah, at the French National Institute for Research in Information Science and Applied Mathematics (INRIA), Rocquencourt and Rennes, France. The objectives of this project are to develop algorithms for implicitly modeled dynamical systems and a computer environment employing symbolic, graphic and numerical software for analysis of the algorithms. The current project extends previous work on stabilization, optimization and trajectory tracking of constrained mechanical systems. The new research focuses on design, failure detection, estimation and fault isolation in control systems. These are important issues for industry. The US investigator brings to this collaboration expertise in numerical and analytical mathematics. This is complemented by French expertise in computer design, control and failure detection.","title":"U.S.-France Cooperative Research (INRIA): Analysis, Implementation, and Application of Differential Algebraic Equations Based Observer and Filter Design","awardID":"9605114","effectiveDate":"1997-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["513793"],"PO":["323582"]},"23412":{"abstract":"This research studies robot motion planning for tasks involving rolling and sliding contact with friction (generalized manipulation planning). The goal is to derive and use new results in multi-rigid-body mechanics and mathematical programming to develop techniques for the automatic generation of robust feedback control strategies. These strategies will guarantee correct execution of manipulation tasks with contact despite uncertainty in the parameters of the geometric, kinematic, and dynamic models, and sensing errors. When correct task execution cannot be guaranteed, the secondary goal is to specify a set of tighter, but widest possible, bounds on the uncertain parameters and sensing errors, which if satisfied, would guarantee correct execution. Application domains for the expected results include industrial assembly, grasp acquisition and dexterous manipulation, visual serving, medical assembly (e.g., hip replacement), virtual reality, and mechanical design. To test the practicality of the proposed approach and the validity of the underlying mathematical models, a CAD-based, manipulation planning system will be implemented. Automatically generated plans will be executed with real devices (i.e., an industrial robot and a planar dexterous manipulation testbed available at Texas A&M). In addition, real problems and associated data will be provided by colleagues from General Electric, Boeing, and the Amarillo National Resource Center for Plutonium. The work involves a collaboration with Profs. Nancy Amato and Jeffrey Trinkle of the Department of Computer Science at Texas A&M University.","title":"COLLABORATIVE: Planning Manipulation with Contact Under Uncertainty","awardID":"9713034","effectiveDate":"1997-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[58814,58815,58816],"PO":["234178"]},"20035":{"abstract":"CDA-9703218 Andrew Black Oregon Graduate Institute A Wide-Spectrum Infrastructure for Software Research This award is for the construction and evolution of an integrated, realistic software and hardware infrastructure for software research. The infrastructure consists of a high bandwidth network backbone, reliable disk storage service, and machines running appropriate software such as commercial database management systems, communications software such as CORBA, and other production software used in experimental software research. The research supported includes both systems software (e.g., database systems, distributed systems, software generation) and applications software (e.g., speech recognition, neural nets, human-computer communications, computational finance). These projects enhance their practical impact by applying their methodology and results to realistic software platforms with the major components chosen from the market place, e.g., the NT operating system and several Unix flavors. The wide-spectrum infrastructure reflects the heterogeneity in the practical world and it enables realistic experiments from the above areas, which would otherwise be considered curiosities.","title":"CISE Research Infrastructure: A Wide-Spectrum Infrastructurefor Software Research","awardID":"9703218","effectiveDate":"1997-08-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["284472","341680","532971","539504","551122"],"PO":["551712"]},"38801":{"abstract":"","title":"Scaling Reinforcement Learning by Adaptive Task Selection and Linear Solution Merging","awardID":"9896122","effectiveDate":"1997-08-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["544475"],"PO":["565227"]},"12797":{"abstract":"Artificial neural networks based upon probabilistic models have been recognized as an important approach to learning, information processing, and problem solving. This research seeks to develop a new neural model with an internal probabilistic learning framework. A number of improvements over pervious probabilistic neural networks are devised. First, prior rules can be built into the neural network and used in conjunction with the data for posterior probability density estimation. Second, lateral inhibition following subsumption relationship between patterns is introduced for improving probability estimates. Third, the backpropagation learning heuristic is applied to optimize the interconnection weights and the system parameters. Forth, a minimal description length criterion is added to penalize complex structures for maximizing generalization. Finally, a weight Euclidean distance function is used so that if the distance function involves multiple attributes then each will carry a different weight reflecting the degree of importance that can then be optimized.","title":"Probabilistic Learning Neural Networks for Knowledge and Data Acquisition","awardID":"9615909","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":["552321"],"PO":["563109"]},"22995":{"abstract":"The Compass project is charting a course towards cooperative compiler and run-time support for applications that manage large bodies of long-lived, shared, structured data. The project integrates programming language and database functionality to provide orthogonal data persistence, enabling the construction of more reliable data-intensive applications, but without compromising performance. Performance is obtained through application of modern compilation techniques to the problems of persistence, including static analysis and run-time profiling, to derive knowledge of application-specific behavior which can then be exploited by both the compiler, for program optimization, and the run-time system, for efficient data management. Compass project goals include development, integration and evaluation of new language-independent compiler analyses and optimizations for persistence, with associated run-time strategies for persistent object management. These techniques are being evaluated empirically through development of prototype persistent languages and systems, compilation of benchmark persistent applications, and measurement of application performance. The compilation and run-time strategies derive much of their power from treatment of the entire persistent application system, consisting of both stored persistent code and data, for \"whole-application\" analysis and optimization.","title":"Compiling with Persistence","awardID":"9711673","effectiveDate":"1997-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["562118"],"PO":["250083"]},"21444":{"abstract":"This research is on automating the extraction of behavioral models from natural language descriptions of digital systems such as specifications, proposals and U.S. patents. The behavioral models are necessary for simulation in new system design and test generation on legacy system replacement. Often, only the natural language descriptions are available. An information extraction approach is being taken to develop an interactive system to help the modeler. The system will scan source documents, perform syntactic and semantic analysis to identify behavioral elements (actions, states, events) and their relationships, and instantiate conceptual templates from which augmented control dataflow graph models may be generated. A central research issue is the correct selection and filling of behavioral templates. Performance of the system is being evaluated on how much of the behavioral information is discovered automatically and how accurately the information is inserted into the templates.","title":"Automating Behavioral Model Generation by Information Extraction","awardID":"9707317","effectiveDate":"1997-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[53996],"PO":["201974"]},"23413":{"abstract":"9713039 Fred Taylor University of Florida CISE Educational Innovation: Synergy: A CISE Learning Environment This CISE Educational Innovation award, involving both the University of Florida and the University of Texas at El Paso, supports the development of a new activity-based learning environment called Synergy. Synergy provides undergraduate students with the opportunity to engage in hands-on research-centric digital signal processing (DSP) studies within a simulated professional engineering framework. A significant part of the project includes development of a new capstone laboratory which is designed to provide students with an experience which requires demonstrated unstructured problem solving skills, clear and concise communications, planning and scheduling discipline, Internet utilization, and personal accountability. The laboratory is being developed with input from DSP projects from across areas of the institution including engineering, medicine, education, architecture, computer science, and others, and from industrial partners as well.","title":"Educational Innovation: Synergy: A CISE Learning Environment","awardID":"9713039","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["487249",58819,"438490"],"PO":["551712"]},"24876":{"abstract":"9724271 Geist, Robert Dawson, Darren Clemson University Acquisition of a Silicon Graphics Workstation for Modeling, Simulation, and Virtualization of Physical Phenomena Clemson University is acquiring a graphics supercomputer to support modeling, visualization and simulation of physical phenomena research conducted by the departments of computer science, electrical and computer engineering, and mechanical engineering. Specific research projects include materials research, wireless communications, mechatronics and design, visualization and geometric computation. The supercomputer facilities will be available to both undergraduate and graduate students pursuing research in all of the areas described above. Clemson University also has plans to distribute information on research results regionally via a Web site, VHS video and a Supercomputer information brochure.","title":"Acquisition of a Silicon Graphics Workstation for Modeling, Simulation, and Virtualization of Physical Phenomena","awardID":"9724271","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["424300","490673","530256"],"PO":["173164"]},"22478":{"abstract":"9710160 A formal software architecture specification makes the analysis, design, and construction of a complex system intellectually tractable by characterizing the system at a high level of abstraction. This project focuses on revealing defects in the dynamic interaction and communication behavior of system components through testing techniques applied at the architectural level. While testing has historically concentrated on the implementation as the target of inquiry, this research instead considers the architectural specification of the system as the target. There are five major contributions to software architecture and software testing technology arising from this research. First, a set of architecture-based integration test criteria are defined to provide requirements for testing architectural aspects of a system; methods are also developed for applying these criteria to architectural styles and domain- specific architectures. Second, methods are developed for testing an implementation in terms of its conformance to a specified architecture via architecture conformance oracles. Third, architecture-level slicing techniques are defined for localizing architectural defects and minimizing regression testing. Fourth, methods are developed for using feature tests to discover the architecture of a system from its implementation. In addition, various approaches to formal architecture specification are evaluated with respect to their suitability to testing technologies. ***","title":"A Formal Architecture-Based Approach to software Integration Testing","awardID":"9710160","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y172","name":"DARPA-ARCH BASED APPR TO SOFTW"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y637","name":"DARPA-FORMAL ARCH BASED APPROP"}}],"PIcoPI":["272419"],"PO":["150697"]},"21037":{"abstract":"This three year project is developing and making available on the web a collection of curricula and resources for teaching undergraduate and graduate networking engineering courses. Project personnel are establishing an advisory board, identifying existing materials and soliciting new contributions from authors, developing appropriate formats and editing the materials as required, soliciting corporate and university partners to assist in making the project self-sufficient, and expanding the existing web site and defining the feedback\/review process.","title":"Internet Engineering Repository","awardID":"9706181","effectiveDate":"1997-08-15","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["521741",53017],"PO":["198445"]},"21158":{"abstract":"Even in today's increasingly digital world, analog continuous time circuits are needed in many applications. Current approaches to analog processing are running up against fundamental limitations. Log-domain filtering is a relatively new approach that offers wide dynamic range and excellent high-frequency response using simple, low-voltage circuits. Log-domain filters exploit the translinear current-voltage characteristics of bipolar transistors or weak-inversion MOSFETS to achieve overall linearity. The basic signal processing elements can be quite simple in form and their high-frequency performance can be excellent while distortion can be low because most of the transistor non-linearities are cancelled within the circuit. This research has three major thrusts: The first thrust is toward fundamental, design-oriented analysis of log-domain circuits. Design methodologies and fundamental understanding of the limitations of log-domain filters are in an early stage. Fundamental analyses allow development of figures of merit for evaluating and comparing log-domain circuits. The second thrust focuses on developing new log-domain circuit topologies. Based on an understanding of fundamental limitations, new circuits are being designed to improve performance. The third thrust is toward applications of log-domain circuits. Integrated circuits are being built and tested to demonstrate the usefulness of log-domain circuits in practical applications. Initial focus is on two application areas: low-voltage wireless communications, to exploit the performance potential of log- domain circuits and adaptive and biologically inspired circuits, to build on their fundamental simplicity.","title":"Design-Oriented Analysis and Practical Applications of Log-Domain Filtering","awardID":"9706558","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["456658","104340"],"PO":["564898"]},"38703":{"abstract":"","title":"Distributed Manipulation Algorithms for Massively Parallel Microfabricated Actuator Arrays","awardID":"9896020","effectiveDate":"1997-08-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["213293","244163"],"PO":["475621"]},"21863":{"abstract":"9708643 The goal of this research is to devise and perform component integration experiments at the software architectural level that determine (1) what component interoperability problems exist, (2) what are solutions to those problems, and (3) which strategies for integration can perform those solutions. The value of this research is that it can provide developers with early knowledge of potential interoperability problems among software components. With this knowledge, developers can treat integration as a design decision, instead of only an implementation task. With the increased use of COTS applications, developers can choose between applications with similar functionality but fewer interoperability problems with in-house components, speeding productivity. Using research on software architecture, design patterns, and reports on integrating actual applications, the proposed research will define a catalog of architectural characteristics of software that contribute to interoperability problems. Integration strategies will be associated with their respective solutions to the conflicts that result from interleaving component characteristics. A knowledge based system will serve as an experimental testbed to determine the best integration strategy based on predefined conflict resolutions among characteristics. The research results, i.e., characteristics, conflicts, solutions, and strategies, will be provided to the developer to enhance design decisions and to formulate implementations. ***","title":"Experimentation Platform for Detecting and Resolving Interoperability Problems","awardID":"9708643","effectiveDate":"1997-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["362926"],"PO":["150697"]},"20785":{"abstract":"9705410 Bodenschatz This is a renewal project, the aim of which is the experimental and numerical investigation of non-linear, non-equilibrium pattern- forming phenomena in extended dynamical systems. It is proposed to study the thermal convection of pressurized gases confined between two parallel plates, a system which has been a paradigm for a wider class of pattern forming phenomena. In particular the program will focus on the investigation of the following two topics: (1) The continued quantitative study of the bifurcation diagram of inclined layer Rayleigh-Benard convection over a range of Rayleigh numbers and inclination angles. (2) The detailed experimental and numerical investigations of Spatio- temporal chaos in horizontal and inclined situations. Details in the research can be found at http:\/\/www.milou.msc.cornell.edu. %%% This is a renewal project to study locally ordered patterns, many of which abound in nature. Examples are from cloud streets to ripples in the windblown sand. When observing these pattern over time it becomes obvious that they are constantly changing. We call this behavior spatio-temporal chaos. The aim of this research project is the experimental and numerical investigation of spatio-temporal chaos in patterns of thermal convection. When heating a shallow fluid layer at the bottom and cooling it at the top, above a certain temperature difference convection sets in form of convection rolls: hot fluid is rising at the bottom and cold fluid is descending from the top. To realize a system that has many convection rolls we are using pressurized gases. We investigate the pattern evolution by using digital imaging and image processing techniques and also large scale numerical investigations using the latest supercomputer technology. ***","title":"Complex Spatio-Temporal Dynamics in Convection of Fluids","awardID":"9705410","effectiveDate":"1997-08-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["362485"],"PO":["189016"]},"23304":{"abstract":"This research aims to develop a domain-independent computational model to support, in a uniform manner, many complex issues that arise in multi-agent contracting, such as modeling commitment flexibility in a contract, valuing a contract under assumptions of uncertainty, risk reduction, making decisions in situations of asymmetric information, or situations of sequential subcontracting where each agent must decide to subcontract part of its current contract to others. The approach is based on financial option pricing theory. This research will extend this theory to model contracts that have no analogs in financial options, such as contract quality guarantees and multiple sequential subcontracting. To evaluate the research, a multi-agent simulation testbed will be developed and utilized to conduct empirical studies that can answer significant theoretical questions. Questions to be studied for evaluation include the effects on the overall multi-agent society of different model assumptions such as stationary vs. non-stationary stochastic processes for modeling environmental uncertainty, different contracting strategies, and examinations of the value of information especially for asymmetrical information scenarios. Real world domains of theoretical and practical significance such as supply contracting and electronic commerce will be used to provide realistic problem scenarios. It is expected that the proposed research will contribute to the development of general computational models of multi-agent contracting that can answer fundamental research questions and can serve as a basis for designing efficient automated contracting systems.","title":"Using Option Pricing to Value Commitment Flexibility in Multi-Agent Systems","awardID":"9712607","effectiveDate":"1997-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["553661"],"PO":["495796"]},"20037":{"abstract":"CDA-9703228 Prithviraj Banerjee Northwestern University A Distributed High-Performance Computing Infrastructure This award is for the acquisition of 20 high-end UNIX workstations, 50 low-end UNIX workstations, three UNIX fileservers, an 8-processor distributed shared memory multiprocessor, and a 64-ported ATM switching hub. The machines would be networked together using high-speed OC-3 ATM networks with bandwidths of 155 Mbps. As the use of high-speed networking moves from the laboratory to the workplace, new opportunities arise for the design and implementation of a high-speed distributed computing environment. The goals of this project are: (1) to explore the use of high-speed networking and computing to investigate file systems and data management issues for high-performance distributed computing, (2) to investigate the parallel programming support of networks of high-speed workstations and personal computers as an alternative to stand-alone parallel computers, (3) to study high-performance computer-aided design of electronic systems in a heterogeneous environment, and to develop a Web-based CAD computing center, that takes advantage of high-speed networking, (4) to explore new instructional techniques that take advantage of the high bandwidth and high speed.","title":"CISE Research Infrastructure: A Distributed High-Performance Computing Infrastructure","awardID":"9703228","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["547185","433427","406694","295247","560392","541641","485671"],"PO":["565090"]},"23799":{"abstract":"The National Research Council (NRC) proposes to assess the problems that face the Internet over the next decade, identifying factors and issues that must be resolved in order to ensure that the Internet can continue to grow and evolve. The project will address how the Internet relates to other network complexes (particularly the telephone and video delivery infrastructures) on which it builds and to which it interconnects. It will use that examination to consider broader issues posed by interoperation of networks operated by different providers, using similar and different technologies and providing similar and different services. This integrated analyis can help to inform technical design, development, deployment, operation, and management decisions relevant to the evolving networks of networks. Leveraging expert input, an authoritative report and web site will be produced.","title":"The Internet in the Evolving Information Infrastructure","awardID":"9714374","effectiveDate":"1997-08-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["234699"],"PO":["198445"]},"20632":{"abstract":"Recent research indicates that approaches employing automated learning and training are the most promising methods for developing robust, efficient systems for processing natural language. The goal of this research project is to develop symbolic learning methods to aid the construction of natural language systems. Learning algorithms are being developed for constructing systems requiring extraction of information from natural-language documents and subsequent natural-language querying of the resulting database. A method for learning to parse natural language database questions into a formal query language has been developed and is being extended to automate the acquisition of the requisite lexicon of word meanings. Techniques are also being developed for automatically learning rules that locate relevant pieces of data in natural-language documents. Together, these methods can be used to automate the construction of systems requiring natural-language information extraction and querying. Methods for intelligently selecting informative training examples are also being developed in order to reduce the amount of annotated training data required. The resulting methods are being applied to automate the construction of systems that build a database from messages posted to an electronic newsgroup and then respond to natural language queries, resulting in more natural and effective access to electronic information.","title":"Symbolic Learning for Natural Language Processing: Integrating Information Extraction and Querying","awardID":"9704943","effectiveDate":"1997-08-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["450689"],"PO":["564456"]},"22733":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to connect ten educational sites to the Internet using a microwave technology known as Multichannel Multipoint Distribution Service (MMDS). NYSERNet is working with CAI Wireless Systems, Inc. for this trial.","title":"Wireless Internet Connectivity Trial","awardID":"9710939","effectiveDate":"1997-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["478563",57093,"535422"],"PO":["121202"]},"20005":{"abstract":"CDA-9703080 Wolf, Lawrence Johns Hopkins University A Networked Computing Environment for the Manipulation and Visualization of Geometric Data This award is for the acquisition of an infrastructure for geometric computing providing a unified environment for five research laboratories in the Department of Computer Science at Johns Hopkins University (and one researcher at Brown University) having a large commonality in interests. This infrastructure will be used primarily as follows: The Center for Geometric Computation will be developing an interactive interface for geometric computation over the internet which will be used by the participating research laboratories and made available to other laboratories; the Computer Graphics Laboratory will focus on interactive visualization of large and complex geometric environments which also includes efficient utilization of network and distribute computing resources; the Computer Vision Laboratory is working on computational techniques for the visualization of the differential geometry of surfaces, visualizing and matching of signatures for Automatic Target Recognition, and real-time image understanding techniques for medical imaging; The Computer Integrated Surgery Laboratory will be conducting a number of projects in medical robotics including the development of techniques for minimally invasive surgery using navigation and guidance during neurosurgery and lung surgery, and, image and model registration techniques that use various 2D imaging modalities. The Natural Language Processing Laboratory will be studying document-space visualization in a high-dimensional space for information retrieval as well as clustering algorithms for high-dimensional word and document spaces.","title":"CISE Research Infrastructure: A Networked Computing Environment for The Manipulation and Visualization of Geometric Data","awardID":"9703080","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["328532","521484","207142","521367","553223","339946","445169","218093"],"PO":["150490"]},"22667":{"abstract":"In systems wherein information is represented and processed digitally, the level of overall system performance that can be achieved is often limited by the speed and dynamic range of the interfaces between analog and digital representations of that information. Since digitally encoded signals can be processed with virtually arbitrary precision, continued progress in the scaling of integrated circuit technology is accomplished by corresponding demand to improve the precision and speed of so-called data conversion interfaces. This pressure is, in turn, accompanied by two constraining factors: the desire to embed data conversion interfaces within large digital signal processing circuits and explosive growth in the demand for portable electronic systems. The integration of data conversion circuits in VLSI technologies imposes severe constraints on the dynamic range available to implement those circuits, while the concern for battery life in portable systems often dictates substantial reductions in power dissipation in comparison to traditional applications. The principal objective of this research is to discover circuit design techniques for digitizing signals with bandwidths of several MHz using standard digital CMOS technologies. The research focuses on the use of oversampling methods to encode MHz-bandwidth radio signals centered at IF frequencies in the range of a few tens of MHz and on methods of increasing the resolution of Nyquist-rate converters for digitizing baseband signals with bandwidths on the order of 10 MHz. A complementary theme of the research is operation from a low supply voltage with minimum power dissipation.","title":"High-Resolution, Broadband VLSI Data Conversion Interfaces","awardID":"9710647","effectiveDate":"1997-08-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["213464"],"PO":["564898"]},"38717":{"abstract":"","title":"Sian Ka'an 97 Second Joint Mexico-US International Workshop on Neural Networks and Neurocontrol, August 19-29, 1997, Playa del Carmen, Quintana Roo, Mexico","awardID":"9896036","effectiveDate":"1997-08-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":[98338],"PO":["563109"]},"22855":{"abstract":"Viruses have shells made of repeated protein subunits surrounding their genetic information. Many viruses, including polio, herpes, and influenza, have icosahedraloshaped shells. It is not understood how these shells self-assemble from hundreds of similar protein subunits. A resolution to this question is important because it allows us to better understand biological phenomena in general and provides a paradigm for nano- and meso-scale self- assembling systems which will become increasingly important in materials and manufacturing. It might also eventually result in mechanisms for interrupting shell formation and interfering with the infection process. Drs. Berger (MIT) and Prevelige (Univ. of Alabama at Birmingham) are using cutting edge high performance computing and biotechnology to design a realistic computer \"toolkit\" that will allow biologists to study virus shell assembly on a computer screen more easily and less expensively than comparable laboratory work. The synergy of computational and biochemical approaches promises rapid advances in our understanding of virus assembly and self-assembling systems in general. This work is supported by the Computational Biology Activity (BIO), the Computational Mathematics Program (MPS), and the Office of Multidisciplinary Activities (MPS).","title":"Collaborative Research: Building an Experimentally Constrained Local Rules Based Simulaator of Virus Shell Assembly","awardID":"9711234","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["257844"],"PO":["216753"]},"22657":{"abstract":"This project is building and experimenting with a prototype video server, which extends the Stony Brook Video Server (SBVS). Developed over the past two years, SBVS provides an end-to-end performance guarantee for digital video delivery from the server's disk, through multi-hop Ethernet-based networks, to the client's display. The extended server, called Stonehenge, will eventually store lectures for use on all 64 SUNY campuses. Stonehenge has three unique aspects: (1) it provides software tolerance to disk failures, maintaining performance guarantees in the presence of faults; (2) it integrates disk and tape arrays, and includes dynamic striping and load balancing; (3) detailed performance and traffic statistics from the running video server will be collected and analyzed.","title":"Highly Available Large-Scale Video Server","awardID":"9710622","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["202714"],"PO":["549626"]},"22448":{"abstract":"9710078 A formal software architecture specification makes the analysis, design, and construction of a complex system intellectually tractable by characterizing the system at a high level of abstraction. This project focuses on revealing defects in the dynamic interaction and communication behavior of system components through testing techniques applied at the architectural level. While testing has historically concentrated on the implementation as the target of inquiry, this research instead considers the architectural specification of the system as the target. There are five major contributions to software architecture and software testing technology arising from this research. First, a set of architecture-based integration test criteria are defined to provide requirements for testing architectural aspects of a system; methods are also developed for applying these criteria to architectural styles and domain-specific architectures. Second, methods are developed for testing an implementation in terms of its conformance to a specified architecture via architecture conformance oracles. Third, architecture-level slicing techniques are defined for localizing architectural defects and minimizing regression testing. Fourth, methods are developed for using feature tests to discover the architecture of a system from its implementation. In addition, various approaches to formal architecture specification are evaluated with respect to their suitability to testing technologies. ***","title":"A Formal Architecture-Based Approach to Software IntegrationTesting","awardID":"9710078","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y170","name":"DARPA-ARCH BASED APPR SOFTWARE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y636","name":"DARPA-FORMAL ARCH BASED APPROP"}}],"PIcoPI":["290193"],"PO":["150697"]},"22239":{"abstract":"The trend in electronic design is toward smaller, more powerful electronic systems composed of many VLSI chips, and their design requires new automation capabilities. This research is on the specific problem of modeling and synthesizing electronic system level interconnect, and developing algorithms and techniques that will be applicable to design automation of even broader systems. The approach is to develop a general, but approximate, capability for modeling inductive coupling of large scale system-level interconnect that is suitable for front-end design. For example, the representation of inductance coupling as a function of interconnect dimensions and spacing is being determined so that performance vs. cost trade-off analysis can be obtained. Measures of interconnect design goodness based on controlling the response damping, coupling noise, and delay are being explored. Moreover, a general approach, which addresses the complex problem of coupled lines, and includes a means of exploiting extraction capabilities is being pursued. The results of this work will also be considered for design automation of more general problems, such as electro-mechanical system design.","title":"Design Automation of System-Level Interconnect","awardID":"9709380","effectiveDate":"1997-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["549747"],"PO":["321058"]},"23747":{"abstract":"There are three objectives for this workshop, the most important of which is the articulation of emerging interdisciplinary research domains, called organizational informatics and social informatics, that focus on the social dimensions of the integration of computerization and networked information into social and organizational life, including the roles of information technologies in social and organizational change. Organizational informatics is viewed as a subarea of social informatics. Findings and theories belong to organizational informatics when they can be characterized in terms of the participants of organizations. Using this criterion scholarOs and researchers understandings of the adoption, use, and impacts of groupware fall well within organizational informatics. In contrast, the Internet is used by millions of people outside of their worklives, and the character and consequences of the public's use of the Internet is a topic outside of organizational informatics, but within social informatics.","title":"Advances in Organizational and Social Informatics Workshop","awardID":"9714211","effectiveDate":"1997-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["118941","497802"],"PO":["433760"]},"20007":{"abstract":"CDA-9703090 Paul Franzon North Carolina State University CISE Research Infrastructure: Experimental High Performance Computing and Communications Systems This award is for the North Carolina State University to establish two facilities for test and verification of complex digital systems. The first, larger, facility, to establish as part of the Electronics Research Laboratory, will include wide bandwidth logic oscilloscopes, logic analyzers, and signal sources, as well as technician support. This facility will support our ongoing research in Experimental Systems building including Multi-Chip Modules (MCM) based systems, complex ICs, VLIW and other processors, DSP processors and communications system building. The second facility will become the ECE Graduate Design Center. In this center, graduate students will build and test systems in tight synergy with the ongoing research projects. These students will work on these projects as part of a year long graduate design courses.","title":"CISE Research Infrastructure: Experimental High Performance Computing and Communications Systems","awardID":"9703090","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["541775","210031",50585,"475429","553865","517778","344345"],"PO":["565090"]},"22559":{"abstract":"Abstract ATM-9710391 Lorenz, Edward Massachusetts Institute of Technology Title: Predictability of the Atmosphere and Other Systems at Longer Ranges This proposal is to continue investigations into the fundamental aspects of predictability of the atmosphere and other complex non- linear dynamical systems at longer ranges. This will be done by taking recourse to simple forced, non-linear, dissipative, dynamical system equations as before. Some of the scales are undoubtedly more predictable than the others in some systems and the PI will examine this property and the conditions under which such predictability exists at longer ranges. This research will certainly shed new light on predictability problem and may reinvigorate national effort in exploiting the predictability of certain features in the highly complex climate system.","title":"Predictability of the Atmosphere and Other Systems at Longer Ranges","awardID":"9710391","effectiveDate":"1997-08-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}}],"PIcoPI":["192265"],"PO":["434790"]},"13605":{"abstract":"The Inter-university Consortium for Political and Social Research (ICPSR) archives the world's largest collection of quantitative data for social and behavioral science research and teaching. Complete, well-structured documentation is essential to effective use of these data; today, that documentation must be electronic and must be search-able on the World Wide Web. This award will assist ICPSR to complete a major program of research and development that is intended to produce the next generation of electronic documentation of social and behavioral science data. Employing the Standard Generalized Markup Language (SGML), ICPSR is developing a new methodology for producing structured documentation. This Data Documentation Initiative involves documentation experts from data archives around the world, representatives of U.S. statistical agencies, and experts in SGML. During the term of this award, ICPSR will beta-test this methodology at several locations, develop guidelines and reference manuals, and integrate the SGML methodology with existing methodologies. The product of this effort will be a publicly-available Document Type Definition that may be widely adopted by social science researchers and statistical agencies around the world. It will materially assist researchers in preparing their data for public release and will improve the standard of archived data sets. This award will, in addition, aid ICPSR in producing the electronic text that underlies structured documentation. As much of ICPSR's archive is currently documented solely by paper records, ICPSR is investing considerable resources in the preparation of electronic documentation, to which NSF is contributing an increment in order to accelerate the conversation of documentation from paper to electronic forms.","title":"Electronic Data Documentation: Complementary SGML and Image Capture Approaches","awardID":"9617813","effectiveDate":"1997-08-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1320","name":"ECONOMICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1331","name":"SOCIOLOGY"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1333","name":"METHOD, MEASURE & STATS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["285098","176112"],"PO":["553193"]},"38806":{"abstract":"","title":"Parallelization of Scheduling Algorithms","awardID":"9896127","effectiveDate":"1997-08-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[98543],"PO":["250083"]},"13649":{"abstract":"This project focuses on design and fabrication for a novel class of mechanical system known as compliant mechanisms. Compliant devices replace elements traditionally assembled using joints and springs with compliant flexible members that use elastic deformations to transmit motions and forces. This allows the research to concentrate more on representation, translation, and interface issues of design and fabrication, and less on issues such as assemble and manufacturability. The domain of compliant mechanisms allows design and optimization to be performed on devices at both the macro and micro level (e.g., SFF and MEMS-type fabrication processes, respectively), and so will afford a unique opportunity to study the clean separation of design and fabrication analogous to the VLSI paradigm. This research targets three primary areas of compliant mechanism design and fabrication. Fundamental to this study is the optimal synthesis of compliant devices, both macro and micro. This includes the design and analysis of 3-D structures and the nonlinearities associated with large deformations. The ability to form more complex objects based on a library of standardized parametric components will also be explored. As the processes are generally not the same, the issue of designing and refining translation tools to move between representations is a critical component in this research. The choice of intermediate representations will be critically examined, and the appropriate translation tools will be developed. The goal here will be to push towards intermediate formats that are suitable to multiple fabrication processes, at both the micro and macro scales. Finally, the ability to test and refine designs for micro structures by the use of macro prototypes fabricated from the same initial model will be developed, and its utility in the design of MEMS devices will be carefully examined.","title":"Design and Rapid Prototyping of Customized Micro and Macro Compliant Mechanisms","awardID":"9617997","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["563532","553286","554983","252838"],"PO":["564898"]},"24429":{"abstract":"This proposal requests support for the third annual German-American Frontiers of Science Symposium (GAFOS) to be held in Munich, Germany, June 19-22, 1997. Sponsored by the German-American Academic Council (GAAC) (founded March 26, 1993 by German Chancellor Helmut Kohl and President Bill Clinton), the GAFOS is designed to bring together the best young researchers from Germany and the United States to hear lectures and engage in discussions on cutting edge issues in science and engineering, and possible future development. The Symposia bring not only bring together researchers from the two countries, but also researchers form different disciplines in the expectation of being able to apply techniques of problem solving from one field to other fields.","title":"Third German-American Frontiers of Science Symposium","awardID":"9722767","effectiveDate":"1997-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":[61443,"257193"],"PO":["290800"]},"24308":{"abstract":"This international collaboration between the PI and Gerhard Michler at the Universitªt Gesamthochschule Essen will develop a better fit between network-based parallel architectures and applications. The U.S. personnel are experts in computer architectures, while the German group's expertise is in algebraic applications. The interaction collaboration between the two groups will result in ways to restructure underlying algorithms and better support software for parallel computations, as well as generate methods to reduce the current communications overhead between workstations. Lessons learned in solving problems associated with applications for parallel and distributed systems will benefit many other applications areas. In addition, flexible, stable, efficient, and user-friendly parallel systems will greatly benefit the computational infrastructure of science and engineering. Through this project, the U.S. group will gain access to a highly respected computer algebra group, and to the knowledge in the German national computer-algebra focus program administered by the German equivalent of NSF.","title":"U.S.-German Cooperative Research in Computational Algebra and High-Speed Networks","awardID":"9722439","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["521812"],"PO":["290800"]},"21702":{"abstract":"This research is on techniques to support early system-level exploration of memory-intensive behaviors for multimedia applications such as video and image processing. In addition to memory, system performance, power consumption and total cost are constraints being considered. Techniques and tools being developed under this approach are for: (1) estimation of memory requirements from the system's specification under resource, performance and power constraints, enabling a tradeoff of computation time against estimation accuracy by system designers; (2) optimization of the embedded system's specification under area, performance and power constraints using a combination of coarse-grain and fine-grain transformations; and (3) partitioning, organization, and mapping of memory structures, including arrays, records and pointers, for implementation of the system specification into hardware and software. These techniques and tools are being integrated into an exploration environment which permits system designers to evaluate feasible hardware\/software implementations of memory-intensive embedded applications.","title":"Design Exploration for Memory-Intensive Embedded Systems","awardID":"9708067","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["532656","541836"],"PO":["564898"]},"23814":{"abstract":"This project undertakes a systematic study of cognitive processes that support students in learning important concepts and skills concerning practical ethical reasoning in a professional domain. The investigators will build a corpus of cases, strategies, and analyses from three general sources: (1) the case examples and exercises taken from leading textbooks in engineering ethics (2) the knowledge, reasoning skills and case examples provided by engineering ethicists and professional engineers as revealed in protocols which the investigators will acquire and analyze, and (3) the findings of the investigators' previous empirical study of different strategies for analyzing practical ethical dilemmas employed by novice and more experienced ethical reasoners. As a result of that study, the investigators found that experienced ethical reasoners are careful to identify issues and to specify conditions under which specific professional role obligations recommend particular actions, that they elaborate conditions which would affect the moral analysis of a problem, in part through posing hypothetical variations of the problem, and that they justify resolutions in terms of those conditions which they conclude apply in the problem. The investigators will develop techniques for using the corpus to challenge and instruct novices in a manual tutoring intervention and assess the pedagogical value of those techniques. They will present an experimental group of novices aspects of the experienced analyses and invite them to compare those conclusions with their own reasoning. The goal will be to assess how novices understand the use of hypothetical variations and their moral significance for the analysis of the problem. A control group will not be exposed to the experts' reasoning and conclusions, and their conclusions will be compared with the experimental analysis of the same problems. The experimental design will also allow investigators to contrast the protocols of novices analyzing problems from the corpus and compare them to the experienced or expert analyses of the same problems. Results will be reported in journals and at meetings and can form the basis for developing a computational model and designing an interactive tutoring system. The significance lies in the development of a better understanding of a pedagogical strategy widely used in practical ethical instruction. The study will shed light on how experts' analyses comparing problems to variations can assist students in learning the process of ethical reasoning.","title":"Collaborative Research: Practical Ethical Instruction with Expert Analyzed Cases","awardID":"9714411","effectiveDate":"1997-08-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}}],"PIcoPI":["382745"],"PO":["288903"]},"21306":{"abstract":"The goal of this project is to determine the feasibility of several technologies and associated design techniques in the development of an end-to-end optical data path for use in interconnecting processors and a massively-parallel processing system. Some of the optical components proposed for use in the data path, such as polymer waveguides, optical switches, and fiber\/waveguide couplings, have been shown to operate individually. This project will construct and characterize several end-to-end systems using these components. The work will proceed in phases, in which a data path is first built up from discrete purchased components, then individual components are replaced with an integrated substrate that uses polymer waveguides to interconnect sources, switches, and detectors.","title":"Study of Optical Data Paths for Multicomputer Interconnections","awardID":"9706918","effectiveDate":"1997-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["511555","511556","210179"],"PO":["549626"]},"22815":{"abstract":"This grant provides travel funds for about 40 US students from different institutions to attend ACM's 16th SIGOPS Symposium on Operating Systems Principles, to be held in France in October 1997. This symposium is being held for the first time outside of US. This symposium is well recognized as the premier conference for the leading-edge research in the field. In the past it has been attended by a large number of US students, as it has served in broadening the experience of promising young researchers and enriching their careers. The students will be selected through an open competition based on their research performance, potential to enrich the symposium, and diversity considerations.***","title":"U.S. Student International Travel Support to Attend the 16th Annual Symposium on Operating System Principles; October 5-8, 1997; San Malo, France","awardID":"9711153","effectiveDate":"1997-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["353750"],"PO":["250083"]},"22859":{"abstract":"This project continues research in discrete and computational geometry, developing new combinatorial ideas for the study of algorithms in real algebraic geometry. The algorithm studied include the existential theory of the reals, quantifier elimination over real closed fields and constructing roadmaps of arbitrary semi-algebraic sets. An important development comes from considering the situation in which these problems live on an algebraic variety of dimension lower than the dimension of the ambient space. In this situation it has been possible to find algorithms and structural bounds for which the combinatorial complexity depends on the dimension of the variety rather than on the dimension of the ambient space. These ideas will be used to: (1) Develop more efficient algorithms to compute a semi- algebraic description of the connected components of a semi- algebraic set. (2) Investigate the complexity of a Whitney stratification of a semi-algebraic set. (3) Develop more efficient algorithms to compute the real dimension of a semi-algebraic set. (4) Investigate other parameters of complexity such as the input fewnomial bound (the number of input monomials) and explore broadening the class of input functions to Pfaffian functions. (5) Remove the genericity hypotheses in the recent breakthrough result of Sharir, which gives nearly sharp bounds on the complexity of the lower envelope of a family of hypersurfaces (or patches of such surfaces) in general position. (6) Investigate whether the classical zone theorem can be further extended to bound the complexity of an algebraic variety in the midst of a family of algebraic sets. The solution of these problems would have significant impact on problems in motion planning and computer algebra.","title":"Combinatorial Algorithms in Real Algebraic Geometry","awardID":"9711240","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["381203"],"PO":["179846"]},"22639":{"abstract":"9710575 Software evolution is an important creative process, but it carries serious perils, particularly when the software is embedded in a critical enterprise and must evolve within its operational context. Since even a small change in the software can cause a large change in the behavior of the system, an enterprise that incorporates an evolving software system is susceptible to destructive and potentially disastrous effects, caused by inadvertent errors or by malicious attacks by programmers employed to maintain the software. The project attempts to tame such perils by ensuring that some of the architectural principles of a given system be maintained as invariants of its evolution. Invariants of this kind, which include permanent \"firewalls,\" access-control regimes, and internal control discipline that ensure auditability, should be invaluable for safety-critical systems and, more generally, for systems that play some sensitive societal roles. The work will start from previously created systems Darwin-E and Moses, integrating the capabilities of the two, scaling up the approach, and exploring its use in a particular application domain. ***","title":"Architectural Invariants of Evolving Systems","awardID":"9710575","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y169","name":"DARPA-ARCH INVAR OF EVOL SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Y638","name":"DARPA-ARCHITECTURAL INVARIANT"}}],"PIcoPI":["406322"],"PO":["150697"]},"11518":{"abstract":"Information Retrieval (IR) research involves computer programs to organize, classify, retrieve, evaluate, and display databases and search results. The IR field has a long history of rigorous evaluation in narrowly defined test environments. However, the current trend is toward more realistic test environments with larger databases, more sophisticated search engines, and evaluation of the human-system contribution to the search process. The focus of this workshop is to begin development of a toolkit of programs, environments, and tasks to be made widely available to researchers. The goal of the toolkit is to provide a more uniform basis for comparison of research by different groups and under different circumstances. Workshop presentations are devoted to identifying the available tools, their limitations, and the needs of current and future research. Reports from smaller working groups are to be integrated into a plan that will guide toolkit development in the near future. Furter information about the workshop and the workshop reports is available at <http:\/\/www.pitt.edu\/~korfhage\/ir-tools.html>.","title":"Invitational Workshop on Information Retrieval Tools","awardID":"9610070","effectiveDate":"1997-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[29286,29287],"PO":["563751"]},"20407":{"abstract":"Run-time monitoring provides an effective means for aiding in the difficult tasks of developing, testing and maintaining distributed computations. However, monitoring activities introduce intrusion, which can potentially alter the behavior of the computation being monitored. This project is investigating techniques to accommodate the effects of monitoring intrusion such that a computation will exhibit the same behavior while being monitored as it would have exhibited in the absence of monitoring. This project focuses on a variety of approaches, which encompass processor scheduling, communication protocols, time maintenance and process synchronization. The techniques developed will be incorporated into a system for the on- line monitoring of distributed computations, for experimentation and evaluation. This project is conducted jointly by Madalene Spezialetti of Trinity College, CT and Rajiv Gupta of University of Pittsburgh under grant CCR 9704350.","title":"On-line Avoidance of Monitoring Intrusion in Distributed Systems","awardID":"9704332","effectiveDate":"1997-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[51536],"PO":["250083"]},"24928":{"abstract":"CDA-9724422 Sarkar, Sudeep University of South Florida Acquisition of a Cyberware 3D Scanner to Facilitate State of Art Research in Computer Vision and Graphics The University of South Florida is acquiring range scanner and graphics workstations to support research in computer vision and computer graphics. Specific research projects include performance characterization for range segmentation algorithms, color-texture analysis for range and color images, non-rigid motion estimates from range images, and algorithms for processing digitized data using non-uniform rational B-splines. A number of graduate and undergraduate students will be using the proposed equipment in research projects. The University is also considering using the equipment in courses such as Computer Vision, Image Processing, Pattern Recognition, and Computer Graphics.","title":"Major Research Instrumentation: Acquisition of a Cyberware 3D Scanner to Facilitate State of Art Research in Computer Vision and Graphics","awardID":"9724422","effectiveDate":"1997-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["353592","363477","522400","173374"],"PO":["297837"]},"24939":{"abstract":"9724462 Swets, Daniel L. Augustana College Major Research Instrumentation: Acquisition of Laboratory Equipment for Parallel Algorithm Research Image Processing A Major Research Instrumentation award has been made to Augustana College to support the acquisition of a cluster of high-powered Pentium machines to develop a parallel processing laboratory for use in academic instruction and research. The parallel processing equipment will allow Augustana faculty and students to study parallel implementation of computer vision and image processing algorithms for the production of real-time, cost-effective image processing systems. Augustana College has existing ties to the US Geological Survey EROS Data Center, Sioux Falls, South Dakota which makes available data from remote sensing sources including satellite, airplane, and ground radiometers. Three senior personnel and eight undergraduates will be developing parallel algorithms for the processing and analysis of satellite images that include parallel cloud-cover data detection and extraction, parallel statistical data smoothing, and parallel land cover analysis.","title":"Acquisition of Laboratory Equipment for Parallel Algorithm Research Image Processing","awardID":"9724462","effectiveDate":"1997-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["445915"],"PO":["188393"]},"20959":{"abstract":"The objective of this project is to deploy the latest advances in concurrency research and in logic programming systems to build a software environment called LMC for system specification and verification. LMC's main function is model checking: determining whether a software system possesses a particular formally specified property. LMC is built from two independently developed systems, each of significant interest in its own domain: the Concurrency Factory verification toolkit (developed jointly by Stony Brook and NC State), and the XSB tabled logic programming system (developed by Stony Brook). The anticipated benefits of this research include the following: a model checker in XSB is specified at the level of semantic equations, meaning a system for a specific specification language and logic can be coded in several hundred lines of XSB code rather than in tens of thousands of lines of C++ code; the programmability of XSB allows for direct encoding of important model checking optimizations; in XSB it is possible to interleave arbitrarily model checking computational steps with deduction steps without penalizing the performance of the former. These features are expected to make LMC a practical tool for formally assuring the correctness of critical software systems such as network protocols.","title":"LMC: A System for the Specification and Evaluation of Logic-Based Model Checking","awardID":"9705998","effectiveDate":"1997-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["509519","451745","518366",52829,"477226",52831],"PO":["179487"]}}