{"1001":{"abstract":"9503413 O'Brien This proposal requests funds for Indian River Community College to establish a direct connection between its campus wide network and NSFNET via SURANET, a regional network. These connections will provide operations management and information services and it will give the college a 56 thousand bits per second connection to the NSFNET, a high speed (1.5 - 45 million bits per second) National Backbone network. The benefits of this NSFNET connection include e-mail between local and remote researchers and educators, file transfer capability and the ability to use remote computer resources. Also the college will have the ability to investigate innovation in educational resources and incorporate them into their curricula.","title":"Connection of IRCC Campus-Wide Network to NSFNET Via SURANET","awardID":"9503413","effectiveDate":"1995-05-01","expirationDate":"1996-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2275,2276],"PO":["43608"]},"1166":{"abstract":"9503922 Beall This project connects St. John's College to the Internet over a 56 kbps line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"St. John's College Connection to the Internet","awardID":"9503922","effectiveDate":"1995-05-01","expirationDate":"1997-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2672],"PO":["57343"]},"1661":{"abstract":"This Small Grant for Exploratory Research (SGER) will allow the investigator to pursue the use of data-parallel computers to determine the intons and exons in DNA sequences. In particular, the main tasks of this award include the use of an intermediate representation of DNA, the directed acyclic graph, to perform parallel parses to recognize more complex DNA subsequences. The investigator will begin collaborations with biologists to complete the exploration. This award is jointly funded by the Computational Biology Activity and the Theory of Computing programs.","title":"Parallel Parsing of DNA Sequences","awardID":"9505537","effectiveDate":"1995-05-15","expirationDate":"1997-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":[3859],"PO":["125630"]},"4985":{"abstract":"This is a proposal to hold a workshop involving about a dozen leading researchers from academia and industry to discuss: 1. The type of part description for use in SFF definition; 2. the nature of design tools to support SFF fabrication; and, 3. the formats for data interchange in solid free-form fabrication.","title":"Workshop on Solid Freeform Fabrication, Pittsburgh, PA","awardID":"9522091","effectiveDate":"1995-05-01","expirationDate":"1995-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["492191"],"PO":["50058"]},"1543":{"abstract":"To carry on effective, natural, spoken dialogue,computers will need to do more than recognize and interpret spoken words -- they will also need to be sensitive to the prosodic information encoded in how the words are spoken. To investigate the hypothesis that detecting and exploiting prosodic cues can help computers guide spoken dialogue, this case study focuses on an educational task that combines intrinsic national importance with compelling methodological advantages: listening to a child read aloud, and providing spoken assistance. The research focusses on improving four aspects of dialogue -- taking turns, handling speech repairs, preventing dialogue breakdown, and modelling the speaker. In the reading task, these aspects include detecting a number of pedagogically significant events, such as when readers complete a passage, correct themselves, or encounter difficulty in identifying a word or comprehending a passage. The goal is to use prosodic cues to help detect these events in order to make the dialogue between student and computer more effective in achieving its educational objectives . Expected outcomes include improvements in the automated reading assistant, the discovery of robust prosodic phenomena, methods for detecting them, and principles for using them to achieve graceful, effective spoken dialogue between humans and computers.","title":"Guiding Spoken Dialogue with Computers by Responding to Prosodic Cues","awardID":"9505156","effectiveDate":"1995-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551746"],"PO":["565227"]},"4832":{"abstract":"A workshop to consider future directions of research in theoretical computer science was held June 1-2, 1995 in Las Vegas, Nevada immediately following the STOC`95 Conference. Researchers representing a cross-section of the theory of computing community were invited to participate. The workshop focused on: (1) the direction of future research; (2) fostering communication within the area and with other areas; and (3) broadening the educational experiences of theoretical computer science students. The results of this meeting are summarized in a report prepared by the PI and Co-PI, in consultation with the workshop participants.","title":"Theory of Computing Workshop: Las Vegas, Nevada, June 1-2, 1995","awardID":"9521643","effectiveDate":"1995-05-01","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["217595",11788],"PO":[11789]},"4514":{"abstract":"The project is to host a conference to provide a forum on user centered evaluation for people involved in the creation or management of digital libraries of all kinds. The impetus for the conference arose from the desire of sponsors and awardees associated with the six NSF\/ARPA\/NASA Digital Library Initiative (DLI) projects to improve the effectiveness of the evaluation programs associated with the projects. At the first joint meeting of project participants, the Evaluation Working Group recommended organizing a conference such as that described here. Upon further discussion, that recommendation gained the support of DLI participants and sponsors, and led to this proposal. There is the need for a methodological plenary of those involved in digital library projects. It is beneficial to find out how others are collecting and analyzing data, framing problems, what is working and what has proved to be a dead end. It is important to gather together people for such a conference just as major digital library initiatives are getting underway; because of the interdisciplinary nature of the work no regula rly scheduled scholarly conference specifically focusses on usage in this way.","title":"Conference on User-Centered Evaluation of Digital Libraries; November 1995; Champaign, Illinois","awardID":"9520473","effectiveDate":"1995-05-15","expirationDate":"1996-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["43711"],"PO":["503214"]},"1127":{"abstract":"9503794 Isaac This proposal requests funds for Lourdes College to connect to NSFNET through OARnet. This connection will provide operations management and information services and it will give the college a 56 thousand bits per second connection to the NSFNET, a high speed (1.5 - 45 million bits per second) National Backbone network. The benefits of this NSFNET connection include e-mail between local and remote researchers and educators, file transfer capability and the ability to use remote computer resources. Also the college will have the ability to investigate innovation in educational resources and incorporate them into their curricula.","title":"Connection of Lourdes College to OARnet and NSFNET","awardID":"9503794","effectiveDate":"1995-05-15","expirationDate":"1996-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2584],"PO":["43608"]},"4647":{"abstract":"NCR-9520963 Kenneth Young Bellcore, Tektronix, the Joint Interoperability Test Command (JITC), and the University of Pennsylvania will implement an ATM Interoperability Testbed to develop tools, procedures, and standards that promote interoperability among ATM products. The project will include three key areas of ATM technology for the development of interoperability testing systems. These areas are 1) ATM signaling Interoperability, 2) ATM traffic management interoperability, and 3) higher-layer protocol interoperability. These areas are chosen because standards for signaling, traffic management and higher layer protocols (e.g. Internet Protocol- IP) as they related to ATM are maturing rapidly and will be implemented in products in a time frame that is consistent with this project's research and development.","title":"TRP: An ATM Interoperability Testbed for the National Information Infrastructure","awardID":"9520963","effectiveDate":"1995-05-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"Z141","name":"ARPA-TRP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"Z692","name":"ARPA-ATM INTEROPERABILITY TEST"}}],"PIcoPI":["555160"],"PO":["150490"]},"4807":{"abstract":"This is an attendance and travel grant for the 22nd Annual International Symposium on Computer Architecture on June 22-24, 1995 in Santa Margherita Ligure, Italy. It is co-sponsored by the Association for Computing Machinery and the Institute of Electrical and Electronic Engineers. The symposium, through a combination of invited talks, panel sessions, tutorials, workshops and refereed paper presentations, continues to serve the various needs of the computer architecture research community. It is an important conference in the computer architecture area. This grant provides support to help several graduate students attend the symposium.","title":"Travel Support for ISCA '95, June 22-24, 1995, Santa Margherita Ligure, Italy","awardID":"9521566","effectiveDate":"1995-05-01","expirationDate":"1995-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["133935"],"PO":["108468"]},"2809":{"abstract":"9509983 Miller This project organizes and presents an intensive multidisciplinary survey conference on the implications for privacy and freedom of interaction of computers, computer databanks, and computer networks. This conference will bring together individuals from academia, government and industry to focus on information technology issues in the area of legislation, regulation, security, law enforcement, civil liberties, freedom and privacy. The award provides partial support for speaker travel expenses, publication of materials and audio visual equipment rental for this conference.","title":"Partial Support for the ACM Fifth Conference on Computer, Freedom, and Privacy: Burlingame, CA","awardID":"9509983","effectiveDate":"1995-05-15","expirationDate":"1996-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["539936"],"PO":["43608"]},"760":{"abstract":"Over the past 15 years, processor speeds in modern computers have increased at a much faster rate than main memory speeds. Thus, relative memory latencies in both sequential and parallel computers have become quite large, and continue to increase rapidly. Such trends form the motivation for this research, which attacks the issues of how to monitor, analyze and improve computer performance in the face of a large processor-memory performance gap. Because of this performance gap, it becomes increasingly important to develop performance monitoring systems that allow programmers, compiler writers, and system designers to identify and tune portions of their design where memory overhead is limiting performance. To accomplish these goals, this project focuses on several area: (i) exploring hybrids of compile-time and run-time software-based techniques for application memory performance analysis, (ii) combining these hybrid monitoring techniques with dynamic compilation to implement flexible, low-overhead, detailed performance tools, (iii) designing and implementing novel, software-aware, hardware performance monitoring techniques, and (iv) designing software tools based on this novel hardware support. By studying both hardware and software solutions concurrently, one gains insights into the strong and weak points of each approach. The end result of this research is a suite of performance tools that span a range in the level of monitoring detail provided and the level of hardware support required.","title":"CAREER: An Integrated Hardware and Software Performance Monitoring System","awardID":"9502516","effectiveDate":"1995-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["495323"],"PO":["74434"]},"464":{"abstract":"Commodity software differs in fundamental ways from the workloads typically used in academic research to measure hardware and software behavior in computer systems research. In this project the behavior of commodity software systems will be studied. The project will develop tools for measuring behavior in commodity software, then apply them tools to important problems in computer systems design.","title":"CAREER: Understanding Behavior in Commodity Software Systems","awardID":"9501365","effectiveDate":"1995-05-01","expirationDate":"1998-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[1074],"PO":["250083"]},"212":{"abstract":"This project is exploring the possibility of a parallel programming paradigm that is data-distribution independent (DDI) in the sense that the user would not be required to program or even invoke data communication routines (hereon called modules). The need for data redistribution would either be eliminated or transparent to the user. The emphasis this work is on the systematic design of computational modules so that either there is no need to redistribute input data or, when this cannot be achieved, the cost of (automatic) redistributionis minimized. In this context, source-to-source program transformations, called modular mappings, and properties that allow commutative parallel processing are being explored as techniques and concepts that enable DDI computation. The extent to which a DDI paradigm could replace existing approaches, complement them or merely apply to special application domains is unclear and this is one of the issues under investigation. In addition, hardware and architecture features that support DDI computation on both general and special purpose aprallel processors are being investigated. The experimental validation is being done in the context of three application areas and program implementations on a fine-grain distributed memory SIMD machine (Maspar MP-1 with 16 thousand processors) and a coarse- grain distributed memory MIMD machine (Intel Paragon with 140 processors). The areas of interest are dense linear algebra, sparse linear algebra and symbolic compute algebra which can be applied to numerous scientific and engineering computing problems. For these three areas, DDI modules are being developed as well as entire programs built of several modules. Performance comparisons are being made between DDI implementation and their non-DDI counterparts.","title":"Data Distribution Independent Parallel Processing","awardID":"9500673","effectiveDate":"1995-05-01","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["540130"],"PO":[524]},"852":{"abstract":"Energy conservation is an important problem in battery powered portable computers. The objective of this project is to investigate software system techniques for conserving energy, using the knowledge about current workload and application requirements. More specifically, the project will: (1) Develop a systematic approach for evaluating energy conservation techniques whether they are implemented in hardware or software. The evaluation will guide the energy driven hardware and software design. (2) At the operating system level, develop techniques to control the devices using the mechanisms provided by the hardware to modify the behavior of common services for lower energy consumption. (3) At the architecture level, design memory architectures to permit trade-off between performance and energy consumption. (4) Develop file systems that exploit information about applications' usage patterns and the availability of low- power solid-state memory. (5) At the application level, design program interfaces for conveying information to operating system about the usage patterns and performance requirements. A combination of simulation and actual implementations will be used to evaluate the techniques described above. The educational component of this CAREER project will include the development of laboratory-oriented operating systems courses for both undergraduate and graduate students. In addition, undergraduate students enrolled in independent studies will be encouraged to participate in the research and development of software tools.","title":"CAREER: System Software Design for Energy Conservation","awardID":"9502933","effectiveDate":"1995-05-01","expirationDate":"1998-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[1912],"PO":["250083"]},"589":{"abstract":"The research project will investigate operating system and application issues in a network that includes mobile and wireless hosts. Recent advances in wireless technologies and light-weight computers make it attractive to build networks that combine traditional workstations and servers with portable computers. But portables will not achieve equivalence to stationary hosts unless the portables can remain continuously connected to the network, even when changing locations or communication devices. The project, called MosquitoNet, will increase the connectivity of mobile hosts using the following approaches. (1) Enable portable computers to move seamlessly from one communications medium to another; for example, from an Ethernet connection to a wireless modem, without rebooting or restarting applications. (2) Determine the feasibility of hiding the resulting changes in throughput, latency and other network characteristics from applications. (3) Design a simple interface to expose these changing characteristics to applications as necessary. (4) Examine communication device usage patterns for use in implementing battery life extension policies. (5) Develop new file data consistency algorithms for use in a distributed mobile environment where disconnection is allowed but not mandatory. The educational component of the CAREER project will modernize and vitalize the teaching of operating systems and distributed systems at the Stanford University. In particular a new course on wireless and mobile computing will be introduced along with the introduction of new teaching tools, topics and projects into the current curriculum on opepating systems and distributed systems.","title":"CAREER: The MosquitoNet Mobile Computing Project","awardID":"9501799","effectiveDate":"1995-05-01","expirationDate":"1998-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["355467"],"PO":["250083"]},"723":{"abstract":"This research will investigate fault injection techniques for the evaluation and validation of dependable protocols. The project will focus on techniques that can be used to demonstrate three aspects of a target protocol: (i) detection of design or implementation errors, (ii) identification of violations of protocol specifications, and (iii) insight into design decisions made by the implementors. The end goal of the project is the investigation of techniques for testing the fault-tolerance capabilities of dependable protocols and the development of a tool for the experimental evaluation of commercial and prototype protocols. The approach will center around a technique called`script-driven probing and fault injection.` A distributed protocol can be viewed as an abstraction through which a collection of participants communicate by exchanging a set of messages. Hence, no distinction is made between application-level protocols, communication protocols, or device layer protocols. A probe\/fault injection (PFI) layer is inserted below a target protocol to filter and to manipulate the messages that are exchanged between participants. The fault injection layer supports the execution of deterministic or randomly-generated test scripts to probe the participants and inject various faults into the system. In particular, by intercepting messages between two layers in a protocol stack, the fault injection layer can delay, drop, reorder, duplicate, and modify messages. Furthermore, it can introduce spontaneous messages into the system to probe the participants and to orchestrate the system execution into a particular path. Since timing constraints are often an important component of the dependability requirements on a system, the intrusiveness of a fault injection mechanism on a target system is a key issue which will be addressed by this research. The educational component of this CAREER project will include `undergraduate mentoring` and `learning via experimentation.` Mentoring exposes students to one-on-one technical interactions with instructors and more senior students. Learning via experimentation has a two pronged effect. It allows students to `practice` how to apply knowledge and to`learn` how to obtain new information. These two aspects of the plan will be formalized into the curriculum with the following educational activities: (1) Refocus the Undergraduate Directed Study to involve junior and senior-level students in some of the ongoing prototyping activities in research projects and in various laboratories on campus; (2) Develop a curriculum track that emphasizes experimentation to enhance learning of software systems concepts.","title":"CAREER: Probing and Fault Injection of Distributed Systems","awardID":"9502341","effectiveDate":"1995-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["464147"],"PO":["250083"]},"899":{"abstract":"While hardware issues are important, it is ultimately the software that will determine the success of virtual environment applications. One important new area of virtual environment software research is in 3D interaction: how should such applications behave interactively and what software architectures should they use? Since user input is relatively low-bandwidth, future solutions to these problems will have enormous processing power to draw upon. Recently, several developments have emerged in various fields which hold great promise for advancing 3D interaction research. Examples are: object-oriented frameworks, incremental hierarchical constraint solvers, automatic recognition of hand gestures, inverse kinematics algorithms, and physically-based models of rigid or deformable objects. Because of the complexity of developing 3D interaction software, reusable software libraries are clearly needed. While some virtual environment software libraries are currently available, there are no higher-level toolkits available which incorporate these newer ideas, are publicly available and written in a standar d object-oriented language. This research project will investigate what form of software architecture a modern, high-level 3D interaction toolkit should take, build an implementation of one in C++, and make a documented version publicly available for researchers and developers of virtual environment applications. Such a high-level software framework would serve as a catalyst for researchers developing highly interactive virtual environments in the sciences, medicine, engineering and industry.","title":"CAREER: An Object-Oriented 3D Interaction Toolkit for Virtual Ennvironment Research","awardID":"9503093","effectiveDate":"1995-05-01","expirationDate":"1998-06-15","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[2033],"PO":["183208"]},"1181":{"abstract":"9503976 Dietterich The goal of this research is to develop and prototype methods for the automatic calibration and validation of computer models of complex systems. The platform for this research is an ecosystem model called MAPSS (Mapped Atmosphere-Plant-Soil System). The purpose of the MAPSS model is to predict the biosphere impact of global climate change. This project aims to improve the development, maintenance, calibration, and accuracy of MAPPS by combining and extending ideas from three areas of computer science: (a) declarative programming, (b) parallel computing, and (c) machine learning. Together the proposed methods will provide model developers with significant speedup through a more efficient representation and parallel implementation, a system for automatic model calibration, and a system for model validation designed to maximize predictive power. These methods will improve the efficiency of model development as well as help to ensure that the finished product is as accurate as is possible. Further, these methods should generalize beyond the MAPSS project, providing a set of tools for the development of many computer models of complex systems.","title":"Develop and Protype Methods for the Automatic Calibration and Validation of Computer Models of Complex Systems","awardID":"9503976","effectiveDate":"1995-05-15","expirationDate":"1997-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["554550","451518"],"PO":["224490"]},"537":{"abstract":"Recent improvements in speech recognition technology has made spoken natural language dialog a viable means of human-computer interaction. An important unresolved issue is the handling of miscommunication. By studying previously recorded human-human and human-computer dialogs, the following strategies for reducing miscommunication in natural language dialog will be investigated: ( 1) extending an expectation-driven model for input understanding; (2) developing a context-based model for selective verification of user inputs; and (3) developing methods for engaging in subdialogs for resolving miscommunications. These theories will be implemented and evaluated under both simulated and experimental conditions. The results from this project will provide a new benchmark in evaluating the adequacy of current dialog theory as well as provide further data on the characteristics of spoken human-machine dialog. The project will also develop several enrichment educational programs in support of the predominantly rural and less economically developed eastern part of North Carolina.","title":"CAREER: Prevention, Detection and Repair of Miscommunication in Spoken Natural Language Dialog Processing Systems","awardID":"9501571","effectiveDate":"1995-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[1235],"PO":["565227"]},"758":{"abstract":"The difficulty in developing reliable software has been an obstacle in using distributed systems. This project will study and advance the use of formal techniques in distributed protocol design. The objective is to develop a framework which allows a complex protocol to be structured as a composition of simpler protocols. The project will develop notations for specifying the interactions between the component protocols, develop a proof system, and build a software tool supporting our methodology. The framework will be applied to various domains such as design of adaptive protocols, reconfigurable protocols, and structuring of control protocols. The educational component of the CAREER prooject will involve students in the protocol development. This will include emphasis of formal techniques in courses, increasing laboratory component to provide experience and forming alliances with the industry to re-train computer professionals (via television courses), and involving undergraduates in research.","title":"CAREER: Modular Design of Protocols","awardID":"9502506","effectiveDate":"1995-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["528451"],"PO":["250083"]},"726":{"abstract":"The research goal of this CAREER project is the formal specification and verification of algorithms that support the implementation of programming languages. Such formal systems can aid the development of new languages and efficient implementation of these languages. This support arises from both the verification of algorithms, which increases confidence in the correctness of a compiler, and from the improved understanding of compilation techniques allowed by formal specification. Recent work has focused on using logical frameworks and mechanized proof assistants to specify deductive systems representing aspects of compilation and to verify the correctness of these specifications. This research project extends these results by considering advanced, state-of-the-art algorithms found in current compilers, formalizing theories for these algorithms, and verifying the correctness of these algorithms. One specific problem area to be addressed involves closure conversion algorithms and the concept of `safe-for-space complexity.` An important aspect of this project is extending the use of mechanized proof assistants to support the verification of complex flow analyses and optimizations of programs. The goal of the education plan is to provide both a general, but rigorous, introduction to the study of programming languages at the undergraduate level and would introduce, at both the undergraduate and graduate level, the recently emerging field of logic and computation which studies the relationship between constructive logics and typed lambda calculi. Although this is typically considered advanced material and not suitable for undergraduates, it can be made accessible to students.","title":"CAREER: Specification and Verification of Compiler Algorithms","awardID":"9502356","effectiveDate":"1995-05-01","expirationDate":"1998-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["99886"],"PO":["150697"]},"6298":{"abstract":"NCR-9528184 George Whitehead Bellcore, Tektronix, the Joint Interoperability Test Command (JITC), and the University of Pennsylvania will implement an ATM Interoperability Testbed to develop tools, procedures, and standards that promote interoperability among Asynchronous Transfer Mode (ATM) products. The project will focus on three key areas of ATM technology and include relevant research and development of interoperability testing systems. These areas are 1) ATM signaling Interoperability, 2) ATM traffic management interoperability, and 3) higher-layer protocol interoperability. These areas are chosen because standards for signaling, traffic management and higher layer protocol interoperability.","title":"An Atm Interoperability Testbed For The National Information Infrastructure","awardID":"9528184","effectiveDate":"1995-05-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"Z141","name":"ARPA-TRP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"Z692","name":"ARPA-ATM INTEROPERABILITY TEST"}}],"PIcoPI":[15465],"PO":["150490"]},"902":{"abstract":"This project will design, implement and experiment with an operating system that satisfies the requirements of emerging applications such as multimedia, parallel computing, and distributed information retrieval. These performance critical applications can be characterized by their intense use of communication, and by their need for tight control of the machine's resources. Existing operating systems often limit the performance of such applications, thereby preventing users from reaping the power of high-performance computer systems. As a result, lagging operating system technology threatens to delay the acceptance of parallel computing, multimedia, and other services in the emerging national information infrastructure. The major themes of the project are (1) designing OS communications support that delivers performance close to that provided by the network; (2) achieving OS performance that scales with the underlying computer system's performance; and, (3) investigating open service implementations that allow customization of OS services to match precisely an application's requirements. The goal is to deliver the resources provided by high-performance computer systems to applications, without sacrificing functionality, fairness, safety, and portability. Methods include the re-evaluation of current operating systems in light of changing application requirements and hardware performance characteristics; design, implementation, and experimentation with appropriate solutions; and, dissemination of results through publication and distpibution of software artifacts. Education plans of this CAREER project include the development of an interactive teaching style, introduction of a hands-on course in parallel programming using networks of workstations, and the organization of a summer program designed to expose junior high students to computer and information technology.","title":"CAREER: A Communication-Oriented Operating Systems for the National Information Infrastructure (Career Development Program)","awardID":"9503098","effectiveDate":"1995-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["282239"],"PO":["250083"]},"2463":{"abstract":"This workshop will be held on June 19, 1995, in conjunction with the ICCV conference at MIT in Cambridge, Mass. The objective of the workshop is to bring together researchers who in the last few years have started addressing problems in Visual Information Management (VIM). Most of these efforts, however, were focussed either on only a small aspect of the problem or a very narrow application. Clearly, visual information management systems encompass central aspects of databases, image processing and image understanding, very sophisticated interfaces, networks and storage systems, knowledge based systems, compression and decompression, and object oriented systems. Without addressing most of these issues, one may either address only theoretical issues, or may work in a microcosm that will, at best, be extremely narrow in its utility and extensibility. Considering the growing need and interest in the organization and retrieval of visual and other non-alphanumeric information, and the insufficient number of academic projects in this area, the workshop on visual information management systems will provide a much needed platform. While VIM is a very broad area, the focus of the workshop is on what researchers in computer vision could contribute. The challange for vision researchers is to develop tools for analyzing the semantic content of video and image, and then representing that content in a way that can be efficiently searched and compared, and finally delivering that content to users in the form a of useful, focused presentation. Computer vision can contribute techniques for semiautomatically and automatically extracting features that will be essential for indexing and query formulation in image and video databases. Computer vision researchers have addressed problems in human and robotic vision for several applications, but very little attention has been given to this new emerging field. This workshop will be exploring computer vision techniques which are going to prov ide the basic foundation for visual information management systems.","title":"NSF\/ARPA Workshop on Visual Information Management Systems","awardID":"9508593","effectiveDate":"1995-05-01","expirationDate":"1996-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["472187"],"PO":[5745]},"4674":{"abstract":"NSF Workshop on Database Research in the Era of Information Infrastructure The objective of this planning workshop is to discuss issues of current concern regarding database research. Participants are selected from a broad range of database interests and viewpoints, including both industrial and academic research. Additional participants are chosen to represent important related areas, such as the artificial intelligence, information-infrastructure, and computer architecture communities. Issues of concern include the role of databases in the information infrastructure, the relationship of research to industrial database requirements, and the likely impact of new research directions. Following the workshop a report of conclusions will be written and widely disseminated, including on-line world-wide access. ***","title":"NSF Workshop on Database Research in the Era of Information Infrastructure","awardID":"9521026","effectiveDate":"1995-05-15","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["142610"],"PO":["530053"]}}