{"30828":{"abstract":"Wireless ATM (Asynchronous Transfer Mode) has been proposed for the next generation multimedia wireless networks. Originally developed for channels with wide bandwidth at high signal-to-noise ratio, ATM in a wireless environment faces the difficult challenge that wireless channels are time varying. The success of wireless ATM, to a great extent, hinges upon the design of adaptive receivers that are able to mitigate time varying channel impairments. This research focuses on adaptive signal processing techniques for channel estimation and equalization in an asynchronous time division multiple access (TDMA) network. The objective of the investigation is to explore new approaches that minimize the overhead associated with the transmission of training signals. By exploiting jointly the structure of the data packet (e.g. ATM cell), the protocol of medium access control, and spatial-temporal diversities of the signal, the investigators are developing new channel estimation and equalization algorithms that have rapid convergence rates and low power VLSI implementation.","title":"Adaptive Signal Processing in Wireless ATM and Other Asynchronous Packet Networks","awardID":"9804019","effectiveDate":"1999-04-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["531874"],"PO":["564898"]},"38270":{"abstract":"Wireless networks provide treacherous environments for digital communication. They are bandwidth-limited and error-prone. Their characteristics are unpredictable and time-varying. Transmitting interactive video over wireless mobile networks is even more challenging because of the bandwidth-hungry nature of video and the susceptibility of compressed video to data losses. Frequent data losses introduce an error (i.e., distortion) into displayed images which propagates to following images. The propagation is due to the temporal<br\/>dependency of encoded video frames to their previously decoded images. The timing-varying nature of the networks further aggravates the problem as network characteristics (e.g., available bandwidth, latency,<br\/>and loss rates) may undergo rapid and dramatic variations.<br\/><br\/>In this proposal, the project director proposes to study a new class of error recovery techniques that focuses on eliminating error propagation. Prior work has mainly taken an approach that prevents display errors from occurring from the first place. This existing approach is not effective for wireless interactive video transmission because data losses inevitably occur in wireless communication, and repairing them tends to introduce the delays in video playout. The approach is to isolate errors when they occur by preventing them from propagating. The delays in repairing data losses affect only the duration of error propagation. The project calls the approach, Recovery from Error Spread using Continuous Updates (RESCU). RESCU does not introduce any delay in video playout, and has potential to achieve good error resilience. A similar approach is<br\/>adopted in several recovery techniques stipulated in H.263+, an International Telecommunication Union (ITU) low-bit rate standard. However, they are limited in that they require feedback channels and<br\/>are not suitable for multicast. The proposed techniques, in contrast, have potential to work well with or without feedback channels, and to be scalable for multicast. Encouraging preliminary results indicate that such potential is highly realizable.<br\/><br\/>The research plan centers on making RESCU highly adaptive to timing-varying environments, and on evaluating its utility for interactive video transmission over wireless mobile networks. Four four major research components have been identified which comprehensively cover research issues arising from developing highly adaptive robust transmission and coding techniques.<br\/><br\/>* Adaptable video codecs.The first plan is to design adaptable coding schemes incorporating RESCU. The schemes are combined with transport-level recovery techniques to produce powerful recovery mechanisms which overcome the shortcomings of previous approaches.<br\/><br\/>* Adaptation. Given adaptable RESCU schemes with adjustable coding parameters, the research will tackle the problem of determining the values of these parameters appropriate for the maximum robustness under given network conditions. The approach is to apply rigorous Markovian modeling and analysis of the impact of these parameters to the final image quality and resource utilization.<br\/><br\/>* Transport-level services. Adaptable RESCU techniques require several transport-level functions: (1) accurate report on the current traffic characteristics; (2) efficient deadline-driven automatic repeat request (ARQ) techniques; and (3) flow and congestion control for robust interactive video communication. Ttechniques will be investigated to support these functions in the transport layer.<br\/><br\/>* Multicast support. Finally, the project will study the issues of robust video multicast including scalability for many receivers, receiver-driven control of adaptability, and fairness among heterogeneous receivers.<br\/><br\/>Education plan:<br\/>The primary objective in education is to create a new generation of computer scientists who can accelerate the deployment of video technology into homes and workplaces. To realize the goal, the following activities are planned: (1) using videoconferencing as a primary means for instruction; (2) participating in multi-university initiative for deploying video technology in campus for instructional purpose;<br\/>(3) extending opportunities for women, under-represented minorities, and undergraduate in research; and<br\/>(4) developing a series of course dealing with video technology, multimedia, computer networking, and<br\/>distributed systems.","title":"CAREER: Investigation of Error Recovery Techniques for Interactive Video Transmission over Wireless Networks","awardID":"9875651","effectiveDate":"1999-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["450636"],"PO":["565090"]},"38250":{"abstract":"The research component of this project will address theoretical and practical issues in the development and implementation of continuous optimization algorithms and their application to problems in mathematical finance and chemical process engineering. Algorithm design efforts will focus on interior-point methods, including the study of semidefinite<br\/>programming, complementarity, general nonlinear programming, and robust optimization problems. Particular attention will be devoted to the development and analysis of potential-reduction methods and algorithms that reliably detect infeasible problems, as well as to the efficient implementation of these methods. Implementation efforts will include the continuation of the improvement of SDPT3, a research code for semidefinite<br\/>programming. Robust optimization problems will be studied through saddle-point formulations and polynomial-time interior-point algorithms for this class of problems will be developed. <br\/><br\/>The applications in mathematical finance will focus on the study of pricing of financial derivative securities in the presence of transaction costs through optimization models, and on the development of methods to find robust and low turn-over solutions to portfolio selection problems. This project will also continue the investigator's current collaboration with chemical engineers on the study of optimization models and<br\/>methods to solve chemical process engineering problems. <br\/><br\/>The integrated educational activities of this project include (1) further development of graduate courses in optimization, portfolio theory, and interior-point methods already introduced by the investigator; (2) participation in outreach activities through project direction at CMU's Summer Undergraduate Institute; (3) facilitation of active involvement of <br\/>undergraduate students in local industries through the introduction and running of a new project course; (4) a long-term plan for the preparation of a graduate-level textbook on portfolio optimization. <br\/><br\/>The theoretical insights gained from this research will lead to<br\/>design of more efficient optimization algorithms. The models, methods, and software resulting from this project has the potential to produce improved decisions and performance on several application areas in science and technology.","title":"CAREER: Theory and Applications of Optimization Algorithms","awardID":"9875559","effectiveDate":"1999-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["258749"],"PO":["321058"]},"38240":{"abstract":"This research focuses on storage management systems that support multiple media types (video, audio, animations, graphics, images). The framework conceptualizes a multimedia presentation as a collection of objects with arbitrary temporal constraints. The participant objects and their constraints can be defined statically (prior to the display of the presentation) or dynamically (during the display). The main goal of this research is to exploit these temporal constraints to significantly improve the performance of the storage system. This project devises techniques to: (1) place data on disks, (2) store redundant information for fault tolerance, and (3) schedule the retrieval of data from disks to display statically and dynamically defined presentations during normal operation and during disk failures. On the educational front, the objective of this project is to: (1) enhance the information systems curriculum to incorporate evolving multimedia technology; (2) promote collaboration between researchers and practitioners in the field; (3) reach students constrained by time, location, and\/or physical disability; and (4) mentor women pursuing careers in computer science and engineering. An undergraduate course on Multimedia Systems and a graduate course on Multimedia Database Management Systems are being developed. Also, establishment of industrial connections and research seminars are being planned. This research has the potential to significantly improve the design of multimedia storage systems supporting applications such as: computer animation, virtual reality, video games, digital video editing, and authoring tools for education.","title":"CAREER: A Unified Storage System for Multiple Media Types","awardID":"9875528","effectiveDate":"1999-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[97172],"PO":["563751"]},"38351":{"abstract":"During the past few years, many data-intensive applications have posed new challenges concerning storing, searching, querying, and retrieving large-scale complex data such as medical or satellite imagery, geographical and scientific data. With the increasing popularity of the Internet and the World Wide Web (WWW), there is a fast growing need to make such data accessible through the Internet. The Distributed Cooperative Digital Archives (DCDA) research builds a framework to make such scientific and geospatial data discoverable and retrievable on the Internet. This approach is to enable a collection of independent data archives to share the load in order to enhance their collective system performance, while allowing individual archives to remain under the control of the corresponding data producers. This approach also integrates database support and web servers to provide scalable data retrieval and indexability. The issues being addressed in this research include: dynamic migration and replication of web documents, automated processing of web documents for database support, fast web-database connection, and web-enabled declustering of large-scale scientific and geospatial data. The results of this research include new algorithms, software tools and prototype system implementations for significant performance improvements in data delivery, searchability and scalability of servers. The educational goal of this research is to integrate the research tasks into a curriculum for teaching Web\/Internet information processing to support meaningful research training for students. Additional effort is to develop and strengthen project-driven learning and web-enabled teaching environment to stimulate students' motivation for self-learning and problem solving skills.","title":"CAREER: Distributed Cooperative Digital Archives for Scientific and Geospatial Data","awardID":"9876037","effectiveDate":"1999-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["392322"],"PO":["563751"]},"35591":{"abstract":"As information technologies are becoming important tools in schools and in mainstream society, families and schools will bear an important responsibility to assist young people in gaining the moral reasoning, motivation, and control to engage in ethical behavior while using these new technologies. The objective of the proposed study is to investigate how high school students analyze issues related to the ethical use of information and communication technologies, including the Internet. The study will examine ethical issues pertaining to copyright infringement, computer security violations (hacking), disrespectful speech (flaming, harassment, violation of privacy), and accessing or publishing potentially harmful material (pornography and hate literature). The study will seek to determine the factors that influence students' analyses of scenarios that describe inappropriate acts, such as students' developmental characteristics, life situations (gender, amount of computer use), knowledge of the law, the nature of the act (type of victim or amount of harm), and the reasoning process that students engage in, in making their determinations. Knowledge gained through the study will provide the basis for the development of effective environmental, instructional, and intervention strategies to assist students in gaining the moral reasoning, motivation, and control to engage in ethical behavior while using new technologies. The subjects for the research will be 200 high school students who have had Internet access through home or school for a period of at least one year. The study will make use of three standardized measurement instruments for the measurement of cognitive-moral development, empathic tendencies, and self-understanding. An information technology ethics questionnaire will be developed for the purposes of this study. The questionnaire will be designed to investigate various aspects of students' evaluation of the appropriateness of the acts that involve the use of information technologies, their knowledge of rules, and their reasoning process. Both quantitative and qualitative data will be gathered through the questionnaire. The analysis of the data will reveal potential relationships between cognitive moral development, empathic tendencies, self-understanding and the subjects' analysis of various information technology-related acts.","title":"Analysis of Information Technology Ethics Issues by High School Students","awardID":"9818211","effectiveDate":"1999-04-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7300","name":"TEACHER ENHANCEMENT PROGRAM"}}],"PIcoPI":[89506,89507],"PO":["563704"]},"38485":{"abstract":"The confluence of computing and communication has produced an explosion of network-based applications. Numerous examples can be drawn from web-based applications, interactive simulations, gaming,<br\/>visualization, and collaborative environments. Current approaches to the development of network-based applications are still based on a CPU-centric model using node architectures optimized for uniprocessor<br\/>or small-scale multiprocessor applications. This can lead to significant inefficiencies for distributed applications.<br\/><br\/>This project explores an architecture for the support of emerging network-based applications whereby selected application-level computations are executed within network interfaces (NIs). The focus is on<br\/>networks of workstations (NOW) that have emerged as a viable high performance computational vehicle. Within this context the project will support applications with substantial computation and data manipulation<br\/>requirements. Such high performance programs are drawn from three different application domains: scientific simulation, computer vision and image processing, and computer graphics. The unique aspect of the<br\/>approach to supporting these classes of programs is the use of extensible network interfaces, where extension concerns programs executed both on the low cost microprocessors resident on NIs and on additional, programmable and NI-associated hardware in the form of field programmable gate arrays (FPGAs). Specifically, the project will demonstrate (1) the use of FPGAs to implement data-intensive<br\/>computations and (2) the use of the NIs' microprocessors to handle associated meta-information and perform computationally non-intensive operations best performed \"close\" to the network. Extensibility for NIs will be attained by development of a flexible and extensible virtual communication machine. The project refers to such enhanced networks as Active System Area Networks (ASANs).<br\/><br\/>The key research issues are (1) to understand and demonstrate an ASAN's ability to perform selected computations and services more efficiently than host CPUs and to explore the effects and trade-offs of off-loading certain functionality from host CPUs to the ASAN, (2) to develop the programming model that enables the efficient and application-specific use of the ASAN's computational resources, and (3) to create an ASAN software architecture that is low overhead and easily extensible.<br\/><br\/>The approach to the proposed research is experimental. It includes construction of a testbed, implementation of selected NI extensions for use by the three classes of parallel\/distributed applications investigated in this work and performance evaluation of the resulting system\/application performance. Successful demonstration of the>approach will have a major impact the way future multimedia network applications are designed, optimized, and supported.","title":"Computing in Networks: Active System Area Networks","awardID":"9876573","effectiveDate":"1999-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["523077","556660","112837","126227",97716],"PO":["155235"]},"38200":{"abstract":"Advances in digital camera and optical technology are rapidly changing the face of computer graphics and computer-aided geometric design. Just a few years ago, these domains were primarily driven by painstaking user interaction. Objects and their surface properties were modeled almost exclusively by hand <br\/>or were reconstructed from real measurements using scanned color textures, fragile computer vision techniques, and slow shape measurement methods based on touch probes. In the past decade, largely due to the availability of geometrically stable imaging technology such as charge-coupled devices (CCD's), compact light sources such as laser diodes, and cost-effective custom optics, the ability to bring the real world into the computer has grown at an explosive rate. Using these technologies we can acquire the shape and appearance of objects large and small. This capability has applications in numerous fields including<br\/>mechanical design, reverse engineering, industrial inspection, medicine, special effects and games, and dissemination of museum artifacts.<br\/><br\/>This project will investigate a number of methods for bringing the shape and appearance of the real world into the computer. In the area of shape capture, the research will span the 3D scanning pipeline: from improved range finding methods, to faster and more concise registration and reconstruction algorithms. Further, traditional 2D images will be used to augment the pipeline at all stages. In the area of appearance <br\/>capture, two novel directions will be explored: modeling and rendering radiance functions over surfaces and sample-based methods for representing the manner in which objects of unknown geometry reflect and refract light. The first direction promises to overcome some of the limitations of current, purely image-based rendering methods, while the latter represents a new paradigm for modeling light transport among real and synthetic objects. The educational goals of the project include involving graduates and particularly undergraduates in both teaching and research. In addition, a new \"3D photography\" course will be <br\/>developed. Through lectures and hands-on projects, students will learn the principles and practice of capturing the shape and appearance of real world objects and then converting them into representations suitable for industrial design and computer animation.","title":"CAREER: Capturing the real world for computer graphics","awardID":"9875365","effectiveDate":"1999-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["438138"],"PO":["201974"]},"38498":{"abstract":"EIA-9876604<br\/>Findler, Nicholas V.<br\/>Arizona State University<br\/><br\/>This planning propoal will develop the preliminary work and cement the partnerships necessary to develop a fully-fleshed proposal to devise an ontology for geographic knowledge. The proposed Federal partners would be the US Coast Guard and the National Oceanic and Atmospheric Administration. The ontology proposed would encode entities such as shorelines, tide tables, and other domain objects.","title":"Digital Government: An Ontology for Geospatial Knowledge","awardID":"9876604","effectiveDate":"1999-04-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["121233","121234"],"PO":["371077"]},"35343":{"abstract":"IIS-9817430<br\/>Johns Hopkins University<br\/>Sayeed Choudhury<br\/>$186,984 - 12 mos.<br\/><br\/>DLI-Phase 2: Digital Workflow Management: The Lester S. Levy Digitized Collection of Sheet Music, Phase Two.<br\/><br\/>This project will seek to enhance the use and usability of the Eisenhower Library's Lester S. Levy Collection of Sheet Music and similar collections located elsewhere. The Eisenhower Library previously digitized this collection of more than 29,000 pieces of American popular sheet music spanning the years 1780 to 1960. The sheet music in this collection provides a social commentary on American life and a distinctive record of<br\/>their time.<br\/><br\/>The project will create sound renditions and enhanced search capabilities for the collection. Audio files and full-text lyrics are being created using optical music recognition software written by staff from the Peabody Conservatory at Hopkins. Workflow managing tools will be developed to reduce and focus human labor. The activities will result in a tested process, framework, and set of tools transferable for use with other large-scale digitization projects.","title":"DLI-2: Digital Workflow Management: The Lester S. Levy Digitized Collection of Sheet Music, Phase Two","awardID":"9817430","effectiveDate":"1999-04-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["563069",88850],"PO":["564456"]},"45123":{"abstract":"Baumslag<br\/>9973233<br\/> The principal investigator and his colleagues continue<br\/>developing the software package Magnus, which has been designed<br\/>to carry out computations in and experiments with, in the main,<br\/>finitely presented groups. This software has been set up so that<br\/>it can be used remotely, via the internet. This means that<br\/>researchers world-wide can use the software by logging on to the<br\/>Magnus server. The project uses Internet-based facilities to<br\/>maintain a list of outstanding open problems and to set up<br\/>several discussion groups focusing on related mathematical areas.<br\/>These support collaboratory interactions among users, including<br\/>researchers in Europe, Australia, New Zealand, Hong Kong, and<br\/>China. Software development includes the introduction of genetic<br\/>algorithms as well as measures to allow users to add their own<br\/>routines to Magnus, extending the scope of the tool. The<br\/>investigators also use Magnus to study problems in pure group<br\/>theory and in commutative algebra. The project includes the<br\/>training of students.<br\/> In mathematics, group theory aims to capture and study the<br\/>essence of symmetry, particularly in patterns. Such patterns<br\/>occur frequently in nature, for instance as crystals. Its<br\/>connection with symmetry makes group theory important in physics,<br\/>in biology, and in the study of our physical world, as well as in<br\/>geometry and other mathematical fields such as the theory of<br\/>computation and cryptography. The investigators' goal in this<br\/>project is to build an easy-to-use computational tool that makes<br\/>it possible for a user to carry out experiments and solve<br\/>problems about the most ubiquitous of the mathematical objects<br\/>involved here, the so-called finitely presented groups. These are<br\/>groups that can be described completely by a finite set of rules;<br\/>examples include the group of rigid geometric motions of an<br\/>object and the groups of quantum mechanics. The computational<br\/>tool, Magnus, has a simple but limited interface. Nevertheless,<br\/>Magnus has already been used to explore and solve a number of<br\/>difficult problems in group theory. The present project focuses<br\/>on algorithmic developments and techniques to allow users to add<br\/>their own routines to Magnus, extending the scope of the tool.<br\/>The project also provides Internet-accessible computation and<br\/>information resources in a collaboratory setting, fostering<br\/>Internet-based interchanges and collaborations among researchers.<br\/>Finally, the project helps train students in both computation and<br\/>mathematics.","title":"Computational Group Theory","awardID":"9973233","effectiveDate":"1999-04-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["486388","550040"],"PO":["562372"]},"35333":{"abstract":"This Project is a component of the InterLib collaboration between University of California at Berkeley, the University of California at Santa Barbara, and Stanford University. The combined interLib technologies will be demonstrated on the emerging California Digital Library (CDL), and on a testbed developed by the San Diego Supercomputer Center.<br\/><br\/>The Project will attempt to develop tools and technologies that support highly improved models of information dissemination and access. A goal is to facilitate moving from the current centralized, discrete publishing model, to a distributed, continuous, self-publishing model, while at the same time preserving and enhancing the best aspects of the current model. In the envisioned model, information can be disseminated prior to publishing; it can be disseminated and composed continually; it will also have a significant non-textual data component. The model is consistent with the changing economics of academic publishing, yet has the potential to drastically alter the cost structure of scholarly information dissemination.<br\/><br\/>To promote such an improved paradigm, it is planned to (i) develop a set of enabling technologies, (ii) develop related technologies that exploit the paradigm to support functionality not readily available in the traditional model, (iii) experimentally develop publishing models and digital collections in line with the new paradigm, (iv) conduct studies on economic models of alternative information paradigms, and (v) conduct user studies to help evaluate the impact of the work.","title":"DLI-Phase 2: Re-inventing Scholarly Information Dissemination and Use","awardID":"9817353","effectiveDate":"1999-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["211895"],"PO":["433760"]},"35355":{"abstract":"This proposal is to build, maintain and evaluate a a software and data<br\/>library for experiments, simulations, and archiving primarily for the<br\/>social and economic sciences. It will serve as a \"Web-Lab Library,\" and<br\/>multi-functional knowledge center. There will be a library of software for<br\/>experiments at the Website to support theoretically driven experimentation<br\/>and a library of simulation programs for research and education. Data from<br\/>current experiments will be recorded and automatically archived. The<br\/>archiving format will be extensible to support inclusion of data from prior<br\/>experiments. Innovative data retrieval and display systems will be<br\/>developed.<br\/><br\/>The Web-Lab Library will be developed by a Hub at the University of South<br\/>Carolina and two associated Collaboratories at the University of Iowa and<br\/>Georgia State University. The Hub supports programmers with substantial<br\/>knowledge and experience of social science research. The social scientists<br\/>at the Hub and Collaboratories will develop designs for the Web-Lab<br\/>Library. All will conduct experiments-at-a-distance to test software as it<br\/>is developed","title":"DLI- Phase 2: A Software and Data Library for Experiments, Simulations, and Archiving","awardID":"9817518","effectiveDate":"1999-04-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1921","name":"COLLABORATORIES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1331","name":"SOCIOLOGY"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["432932","309953","394101"],"PO":["564456"]},"34388":{"abstract":"In this study the researchers consider a large population of mobile stations which are interconnected by a multihop wireless net. The applications of this wireless infrastructure range from ad hoc networking (eg, collaborative, distributed computing) to disaster recovery (fire, flood, earthquake), law enforcement (eg, crowd control), search and rescue and battlefield. Key characteristics of this system are the large number of users, their mobility and the ability to operate without the support of a fixed (wired or wireless) infrastructure. The last feature sets this system apart from existing cellular systems and in fact makes its design much more challenging.<br\/><br\/>In this environment, the researchers propose to develop routing and multicast strategies which scale well to a large number of nodes and which can handle mobility. The combination of large number and mobility makes the problem very hard. In fact, large networks can be effectively handled with hierarchical routing, if nodes are stationary. When nodes move, the hierarchical partitioning must be dynamically changed - a significant challenge. Mobile IP solutions work well when there is a fixed infrastructure supporting the concept of fixed \"Home Agent\". When all nodes move, the Home Agent strategy is less obvious. In addition to large number and mobility, we address also the need to support multimedia communications, with low latency requirements for<br\/>interactive traffic and QoS support for real time streams (voice\/video).<br\/><br\/>In the wireless routing area, several schemes have already been proposed and implemented (eg, hierarchical routing, on-demand routing etc). The researchers will discuss the pro's and con's of the existing schemes, and will introduce two new schemes - hierarchical, mobile routing and Fisheye routing - which overcome some of the limitations of the existing schemes. In the wireless multicast area, we review the traditional schemes used in wireline networks (eg, Source Trees, Core Based Tree, etc) and show how they perform poorly in highly mobile networks. We then introduce a new concept, Forwarding Group Multicast, in which the Tree is replaced by a mesh of Forwarding Nodes - the latter being much easier to maintain than the tree in the face of mobility. The researchers propose to extend the on-demand routing strategy to such structure to handle large scale.","title":"Scalable Routing and Multicast in Mobile Ad Hoc Wireless Networks","awardID":"9814675","effectiveDate":"1999-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["558959"],"PO":["234222"]},"36203":{"abstract":"EIA-9819880<br\/>Li, Rongxing<br\/>Bedford, Keith W. <br\/>Ohio State University<br\/><br\/>Digital Government: Digitalization of Coastal Management and Decision-Making Supported by Multi-Dimensional Geospatial Information and Analysis<br\/><br\/>With continuing trend of population and economic growth in coastal areas, a sustainable environment becomes more threatened. Global warming, climate change, coastal erosion, and pollution are common problems. Geospatial information and analysis can be used to coordinate policies related to coastal resource management, surveying, shoreline mapping, change detection, and natural hazards mitigation.<br\/><br\/>This grant will support a workshop and ancillary activities to develop plans for research to enhance operational capabilities of government agencies for coastal management and decision making. Management decisions would be informed by the use of multiple spaceborne, airborne, and in-situ remotely sensed measurements, spatio-temporal databases, and geospatial analysis tools.","title":"Digital Government: Digitalization of Coastal Management and Decision-Making Supported by Multi-Dimensional Geospatial Information and Analysis","awardID":"9819880","effectiveDate":"1999-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["311348","559849","147217","311350"],"PO":["371077"]},"49238":{"abstract":"","title":"1999 Dagstuhl Seminar on Deduction; March 1-5, l999; Wadern, Germany","awardID":"9996217","effectiveDate":"1999-04-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["531861"],"PO":["187585"]},"38415":{"abstract":"The World-Wide Web has the potential of being the world's largest knowledge base if its unique characteristics are properly utilized. While superficially similar to early hypertext and other information retrieval domains, the Web has important quantitative and qualitative differences that necessitate new tools and techniques. The quantitative differences are obvious: The tremendous size of the Web precludes storing a complete and up-to-date copy in a conventional database. The qualitative differences between the Web and earlier information retrieval domains are more subtle but no less important, including the various types of semi-structured information on the Web. Unifying the Web with relational databases, so it can be accessed through Structured Query Language (SQL) and other database tools, would apply one of the most popular data management tools to this challenging and important domain. A prototype implementation of just-in-time databases and the Squeal query environrnent appeared in the investigator's dissertation, proving that the Web could be queried as though it were in a local relational database. This was achieved by automatically retrieving information from the Web only when needed, allowing the construction of several simple but powerful structure-based information retrieval applications.<br\/><br\/>This proposal is to build a powerful and efficient relational database interface to the Web that will be a valuable tool for the information retrieval community, supporting uniform access to many types of structural and other information on the Web, including inter-document structure, intra-document structure, forms, cookies, and new features as they arise. Efficient performance will require developing query optimization techniques, pre-fetch and refresh strategies, and techniques for sharing data among multiple users. As the system progresses, novel information retrieval applications will be developed and evaluated, to gain a better understanding of the benefits and limitations of using different types of available information toward various information retrieval problems. Throughout the process, the system itself will be evaluated, to better understand the powers and limits of providing a relational database interface to the Web.<br\/><br\/>The primary educational goal is to increase computer science opportunities for women, an area in which the investigator has extensive experience and is well-positioned as a faculty member at a women's college with a strong undergraduate program and two graduate programs: a certificate program for people with college degrees who wish to change fields and an interdisciplinary master's program for combining computing with another area of experience. The investigator's plans (already in progress) include:<br\/><br\/> Supervising undergraduate research, with the goal of preparing and motivating students for graduate education.<br\/><br\/> Completely revising the architecture and operating systems sequence, including the creation of a hardware laboratory.<br\/><br\/> Taking advantage of the school. Bay Area location to forge ties with industry leading to speakers, internships, permanent employment, and possible donations.<br\/><br\/> Running a mentoring program for Mills students to prepare them for graduate school and employment. <br\/><br\/> Recruiting transfer students from nearby community colleges, which has the added benefit of reaching economically underprivileged women.<br\/><br\/> Improving the interdisciplinary master's program to more fully integrate students' other areas of interest with computer science.","title":"CAREER: A Relational Database Interface to the World-Wide Web","awardID":"9876309","effectiveDate":"1999-04-15","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["139113"],"PO":["565227"]},"44872":{"abstract":"This project will bring together a committee of experts from industry and academia to examine basic research and technological innovations, with the dual goals of: (1) Determining the financial impact of technological innovations in communications and information theory, and (2) Ascertaining the research model that was used in developing these innovations. The committee will be convened for a one-day meeting on the campus of Southern Methodist University in Dallas, TX, to develop the findings. A draft report will then be prepared and submitted to the committee for comments. A final report will then be submitted to NSF, posted on the SMU web site, and distributed via hardcopy upon request. The report will contain a succinct summary of what are considered the most significant technological advances in communications, their estimated financial impact, and the basic research environment that lead to these advances. The report will also include recommendations for future research planning, with the goal of increasing or sustaining the influence of basic research in communications and information theory on technological innovations.","title":"Workshop: Technological Innovations and Basic Research in Communications and Information Theory Workshop, Dallas, TX","awardID":"9972410","effectiveDate":"1999-04-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["410030"],"PO":["150411"]},"34323":{"abstract":"The integrity of the data stored on magnetic disk and tape drives must be protected from error-inducing noise and distortion using error control codes. The most exciting discovery in quite some time in the area of coding is the so-called turbo code which involves a concatenation (cascading) of <br\/>two distinct codes in a manner which facilitates iterative (\"turbo\") decoding. This coding technique has enabled performance near theoretical limits on simple communications channels unlike any code before its discovery. This research investigates the design of turbo codes and related codes for error protection in magnetic recording devices, which may be modeled as a (very difficult) communication channel. <br\/><br\/>The goals in this research involve the design of high performance concatenated codes and their iterative decoders for magnetic recording. Both parallel and serial concatenated codes will be considered. Error control code design for magnetic recording has focused in the past on the design of trellis-oriented codes to maximize the minimum free Euclidean distance between pairs of received sequences. This has been a notoriously difficult problem since, by adding coding and its concomitant overhead, intersymbol interference is increased, hampering the <br\/>intended benefits of the code. Concatenated codes, on the other hand, are capable of achieving gains not just by increasing overhead (lowering code rate) to increase minimum distance, but via interleaver gain. Early work has shown that unprecendented <br\/>gains are achievable with concatenated codes and iterative decoding.","title":"Concatenated Codes and Iterative Decoders for Magnetic Recording Channels","awardID":"9814472","effectiveDate":"1999-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["537051"],"PO":["188393"]},"38526":{"abstract":"EIA-9876697<br\/>Cammarata, Stephanie<br\/>J. D. Eveland<br\/>RAND Corporation<br\/><br\/>Digital Government: Regulatory Compliance Reporting at EPA: Moving to Digital Information Acquisition, Exchange and Dissemination<br\/><br\/>This collaborative proposal between RAND and the US Environmental Protection Agency would explore the potential for use of networked digital technologies in the regulatory agency arena, in particular the requirements, both insitutional and technical, for electronic collection, exchange, and dissemination of regulatory data. The regulatory program under study is the National Pollutant Discharge Elimination System under the Clean Water Act. Under examination will be the key stakeholders and their roles and relationships, the types ofhe heterogeneous data to be exchanged among stakeholders, the technologies for carrying out electronic acquisition, integration, sharing and dissemination of such information, and the criteria, legal and other, for satisfying the regulatory compliance.","title":"Digital Government: Regulatory Compliance Reporting at EPA: Moving to Digital Information Acquisition, Exchange, and Dissemination","awardID":"9876697","effectiveDate":"1999-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[97831,97832],"PO":["371077"]},"38317":{"abstract":"Image-based rendering (IBR) is a new approach to computer graphics in which the underlying mode used to represent an environment is composed of a set of images rather than a collection of geometric primitives with associated surface properties. IBR offers several advantages over traditional computer graphics approaches. First, image-based representations allow users to graphically explore objects and scenes that are captured from the real world. Second, these representations may be captured directly using digital cameras that exist today and which will become more prevalent in the future. Finally, the display algorithms for IBR require modest computational resources, making them practical on desktop computers.<br\/><br\/>This research plan will address several major challenges in image-based rendering. The first is the development of new algorithms to overcome the limitations of existing image-based rendering techniques including: reducing the dependence of these algorithms on correspondence information, extending IBR techniques to accommodate dynamic environments, devising techniques to support immersive scene representations, and devising compact view-dependent representations. A second set of challenges that will be addressed is the automatic acquisition of image-based scene representations. This will be done by tightly coupling an array of randomly accessed image sensors with the computational elements required to generate the desired rendering. The benefit of this approach is that it can be architected to handle real-time scenes while making optimal use of available communication bandwidth and performing the minimum computation necessary. The third challenge addressed by this research is the need for high-performance image-based rendering hardware. The history of computer graphics has taught us that getting systems into the hands of early application developers is crucial to the field's development because it provides important feedback that shapes the future research agenda. High-performance hardware is a key step toward placing IBR techniques into the hands of application developers.<br\/><br\/>The results of this research will benefit many different areas such as remote telepresence for deep-water or interplanetary exploration and medical applications. The research will also provide a new generation of tools for special effects in the motion picture industry, visual impact studies, architectural visualizations, military simulators, and video games.","title":"CAREER: Image-Based Methods and Technologies for Three-Dimensional Computer Graphics","awardID":"9875859","effectiveDate":"1999-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["371221"],"PO":["201974"]},"36502":{"abstract":"IIS-9820687<br\/>Jelinek, Frederick; Khudanpur, Sanjeev & Byrne, William J.<br\/>Johns Hopkins University<br\/>$500,000 - 12 mos. in FY99<br\/><br\/>1999 Language Engineering Workshop for Students and Professionals: Integrating Research and Education (WS99)<br\/><br\/> This is a one-year standard award. Automated systems that interact with human users in spoken and written communication will greatly enhance productivity and program usability. These systems will allow friendly access to information services and are essential for people with disabilities, or for accessing databases while performing intricate tasks. Unfortunately, current technology is inadequate for the tasks at hand, and there is a need to make progress. The numbers of available personnel trained in the field must be vastly increased and solutions to long standing problems must be found. At this time, relatively few universities educate students capable of performing the required tasks. Leading professionals are scattered in various industrial, adademic, and governmental institutions, often duplicating each other's work. A six-week workshop on language engineering will be conducted in which mixed teams of leanding professionals and students would fully cooperate to advance the state of the art. The professionals would normally be university professors and industrial and government researchers working in widely dispersed locations. Graduate and undergraduate students will join these teams. The participation of undergraduate students is intended not only as an educational opportunity but also to broaden the appeal of the language engineering field amongst students considering graduate studies.","title":"1999 Language Engineering Workshop for Students and Professionals: Integrating Research and Education (WS99)","awardID":"9820687","effectiveDate":"1999-04-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X080","name":"DEFENSE-1999 INTENSIVE SUMMER"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y980","name":"DARPA-JOHNS HOPKINS UNIV WORKS"}}],"PIcoPI":["445172","445173","168075"],"PO":["565227"]},"35898":{"abstract":"This award supports a two-day interdisciplinary workshop on Automated Control of Distributed Instrumentation. The workshop will be held on April 22-23, 1999 in the Beckman Institute for Advanced Science and Technology at the University of Illinois at Urbana-Champaign. The workshop aims to provide an interdisciplinary forum for the exchange of information on automated control of distributed imaging instrumentation (microscopy, robotics, machine vision, etc.) as well as the enabling technologies (distributed computing, networking and operating systems) necessary to support remote instrumentation and its automated control. The proceedings will be printed by the Beckman Institute. The printed proceeding will be supplemented with the Internet access to a WWW server containing speakers' slides, images, and animations.","title":"First Workshop on Automated Control of Distibuted Instrumentation; April 22-23, 1999; Urbana-Champaign, IL","awardID":"9819004","effectiveDate":"1999-04-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["239244","239245","561784"],"PO":["150490"]},"35438":{"abstract":"This Project is a component of the InterLib collaboration between University of California at Berkeley, the University of California at Santa Barbara, and Stanford University. The combined interLib technologies will<br\/>be demonstrated on the emerging California Digital Library (CDL), and on a testbed developed by the San Diego Supercomputer Center.<br\/><br\/>The Stanford Project will attempt to develop base technologies to overcome critical barriers to effective digital libraries. These include: heterogeneity of information and services; lack of powerful filtering<br\/>mechanisms that let users find truly valuable information; insufficient availability of interfaces and tools that effectively operate on portable devices; and lack of a solid economic infrastructure that encourages<br\/>providers to make information available, and gives users privacy guarantees.","title":"DLI-Phase 2: Stanford InterLib Technologies","awardID":"9817799","effectiveDate":"1999-04-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["447448"],"PO":["433760"]},"34746":{"abstract":"9815645<br\/>Miller<br\/><br\/>This three-year award for US-France cooperative research in computer programming languages involves Dale Miller and Catuscia Palamidessi of Pennsylvania State University and Francois Fages and Marible Fernandez of the Ecole Normale Superieure in Paris, France. Their collaboration addresses the foundational aspects of concurrent computation from the direction of linear logic programming, proof nets, and concurrent constraint programming. They will apply proof theory and linear logic to these different directions. The US investigators bring to this collaboration expertise in linear logic and concurrency theory. This is complemented by the French investigators' expertise in constraints and interaction nets. The collaboration will advance linear logic and proof theory and their application to concurrent programming.","title":"U.S.-France Cooperative Research: Logic-Based Specification and Verification Tools for Concurrent Languages","awardID":"9815645","effectiveDate":"1999-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["364876","135321"],"PO":["323582"]},"39708":{"abstract":"The IEEE Information Theory Workshop in any specific area is held annually either in the United States of America or abroad. In l999, there will be two workshops to be held abroad. The first one is in the area of information theory and communications and will be held in Kruger National Park, South Africa, June 20-25, l999. The second one is in the area of information theory and networking and will be held in Metsovo, Greece June 27-July 1, l999. The organizers of both workshops are coordinating their arrangements such that all interested participants will be able to attend both events.<br\/><br\/>Papers presented in these twin workshops will be of particular importance to research and applications of interest to the National Science Foundation. The areas covered in these twin workshops are:<br\/><br\/>Information Theory and Communications: Identification; Cryptology and communications security; Source coding theory and techniques; Modeling and performance of high speed networks; Multi-user communications; Coding and modulation for fading channels; Spread-spectrum communication theory and techniques; New results in information theory and coding.<br\/><br\/>Information Theory and networking: Network Shannon information theory; Source coding; Information theory and queuing; Fundamentals of networks; Cryptography and security; Coding and communications; Role of information theory in multimedia; Role of information theory in networking; Pricing in networks.","title":"1999 IEEE Information Theory and Communications Workshop and 1999 Information and Networking Workshop, Kruger National Park, South Africa,6\/20-25\/99 & Metsovo, Greece, 6\/27-7\/1\/99","awardID":"9901835","effectiveDate":"1999-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["425343","450215"],"PO":["150411"]},"31469":{"abstract":"EIA-9806184<br\/>Seitzer, Jennifer<br\/>University of Dayton<br\/><br\/>POWRE\/CISE Computational Induction and Deduction<br\/><br\/>The objectives of the PI are to extend the ongoing study of logic and computer science to the application of these disciplines to real-world problems. The work proposed here is a three-faceted pursuit continuing the inclusion of the well-founded and stable logic programming semantics in the realm of inductive logic programming. First, the questions of the benefit of this synthesis will be further explored. Second, the computer system which the PI has developed in her dissertion work will be improved and augmented. Lastly, and most importantly, stable inductive logic programming will be applied to the real-world problems of Lyme disease diagnosis and the classification of the secondary structure proteins.","title":"POWRE: Computational Induction and Deduction","awardID":"9806184","effectiveDate":"1999-04-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":[79285],"PO":["173164"]},"41568":{"abstract":"","title":"Conference on Understanding the Digital Economy (Washington, D.C., May 25-26, 1999)","awardID":"9907665","effectiveDate":"1999-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1320","name":"ECONOMICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[105204],"PO":["352775"]}}