{"4983":{"abstract":". Circuits are a fundamental model of computations. Communication complexity and polynomial approximation have yielded many advances in the last decade; yet many important theoretical and practical problems are unsolved. This investigates the relative power of threshold, mod, and binary gates as computational devices. This project provides support postdoctoral associates to work with the PI to address these problems. ***","title":"Small-depth Circuit Complexity","awardID":"9522084","effectiveDate":"1996-05-15","expirationDate":"1997-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["499399"],"PO":["74434"]},"6656":{"abstract":"The Recursive Auto Associative Memory (RAAM) architecture for compositional neural encoding has been the basis for numerous studies and prototype models for neural network algorithms applied to linguistic and symbolic reasoning tasks. However, to date, the scale and understanding of the representational model has been very limited. This is due to several logical conundrums inherent in the original model, related to the separation of terminal from non-terminal patterns. A deeper understanding of the logical structure of recursive encoding, and a new mathematical understanding of the fractal limit dynamics of recurrent networks, results in a novel and powerful revision of the RAAM architecture which resolve the logical problems and allows for potentially infinite structures to be cleanly and precisely represented by fixed-dimensional neural activity patterns. In this grant we will be exploring, refining, and exploiting this new architecture and building larger-scale models, using both serial and massively parallel implementations, which will increase the applicability of neural network learning systems to areas with stronger data structure requirements. Scientifically, this work builds strong connections between traditional cognitive science capacities, nonlinear dynamics, and neurally plausible computational models.","title":"High Capacity Recursive Neural Coding","awardID":"9529298","effectiveDate":"1996-05-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["362937"],"PO":["565227"]},"4446":{"abstract":"The purpose of this project is to investigate high level models for the performance and performability analysis of distributed computing systems hosting replicated programs and data files. The high level models studied rely on Stochastic Petri Nets (SPN) used hierarchically to model the behavior of the system in the presence of several types of hardware faults as well as software failures. Systems targeted include real-time systems where critical jobs are deadline constrained. These jobs are partitioned into tasks with precedence relations depicted via a task graph. Although task graphs can be evaluated directly, the evaluation assumes the existence of an unlimited number of processing units. Using Stochastic Petri Nets (SPN) the evaluation of task graphs can include other constraints such as a limited number of processors and existing allocation schemes static or dynamic. At the SPN level, state reduction can be achieved by generating only those states that satisfy functional as well as performance requirements specified in the form of symbolic boolean expressions. A synergistic approach will be investigated to predict the effect of hardware failures on the performance of a system running a single or multiple tasks, that may require access to distributed data files. The combination of SPN models and previously proposed reliability models such as those used to evaluate multiterminal reliability, has the objective of reducing the state space of the underlying Markov model (failure\/repair models) even though hardware failures include nodes and links. Once the failure\/repair model is generated, performance reward levels can be associated with each structural state of the system. This work will contribute to the systematic design of distributed systems. Design requirements such as delay, network throughput, load, task completion time, cost, etc., will be analyzed in terms of their susceptibility to failures in the hardware support for a particular applica tion. It will also contribute to the evaluation of existing systems in order to detect bottlenecks or weak points and suggest appropriate remedial course of action (to either update or replace existing equipment). The systematic prediction of performance and reliability in terms of selective critical tasks, will aid in the process of updating currently saturated computer systems. In particular, the performance models of partitioned jobs will be useful in predicting the average completion times under userselected allocation schemes via a single SPN-based model of a given task graph. Thus, giving users a rapid assessment on the suitability of particular schemes in a real-time distributed computing environment. ***","title":"Performance and Reliability\/Availability Models for the Analysis of Distributed Systems","awardID":"9520226","effectiveDate":"1996-05-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[10889],"PO":["150516"]},"6558":{"abstract":"This is a collaborative effort among three universities (Columbia, Rochester, and Pittsburgh) to construct, evaluate, and disseminate a package of Corpus Analysis Resources for Discourse (CARD). The goal is to provide the means for a large-scale, robust analysis of language use, both within and across distinct types of discourse corpora. The three components of CARD are a Discourse Annotation Language (DAL) to encode information pertaining to language use directly within discourse corpora; reliability measures of the degree of variability in DAL annotations; and a library of DAL-annotated corpora, varying in modality, number of participants, domain, and communicative task. DAL follows the Text Encoding Initiative guidelines and is implemented in Standard Generalized Markup Language to facilitate common authoring and editing utilities. DAL is a modular language with five layers of linguistic representation: morpho-syntactic, prosodic, anaphoric, lexical, and segmental.","title":"CARD: Corpus Analysis Resources for Discourse","awardID":"9528998","effectiveDate":"1996-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z644","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z989","name":"ARPA-HLT CONTRAT"}}],"PIcoPI":["517044","423553","472076"],"PO":["565227"]},"6207":{"abstract":"This research is developing formal frameworks and methodologies for the verification and development of reactive systems: systems that maintain an ongoing interaction with their environment. The research concentrates on two tasks: modular verification, so that the correctness of an entire system can be derived from the correctness of its smaller components, and refinement, so that a high-level functional specification can be refined repeatedly, where each refinement step is formally proven to be a correct implementation of the former one. The techniques are being integrated into the STeP (Stanford Temporal Prover) system. ***","title":"Tools for the Modular Verification and Refinement of Reactive Systems","awardID":"9527927","effectiveDate":"1996-05-01","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["309451"],"PO":["150697"]},"4229":{"abstract":"Description: This award is to support collaborative research by Dr. Terry Kammash, Department of Nuclear Engineering, and Dr. Phillip Roe, Department of Aerospace Engineering at the University of Michigan and Dr. Necdat Aslan, Department of Physics at Marmara University in Istanbul, Turkey. The thrust of the research is to produce a generalized computer code that solves the magnetohydrodynamic (MHD) equations in two dimensions on the structured or unstructured quadrilateral grids using a higher order Godunov type scheme. The code is to be developed so that it will accept different initial and boundary conditions to model different physical problems of interest to plasma physics and controlled fusion as well as to astrophysical problems. Scope: This award is to fund visits by the two U.S. P.I.'s, as well as one of their graduate students at the U. of Michigan, to Marmara University, and the visit of the Turkish scientist and a graduate student to the University of Michigan. The project brings these very experienced scientists in the fields of MHD, fusion and computational fluid dynamics to collaborate on developing a new powerful two-dimensional computer code to solve MHD problems in various physical applications. The project also allows for the initiation of a long-term collaboration between the two teams at the two schools in the United States and Turkey. It also provides an international experience for a U.S. graduate student, by working at a dynamic foreign institute in Istanbul. Partial funding of this project is being provided by the Division of Mathematical Sciences. The project fits well with the objectives of the Division of International Programs.","title":"U.S.-Turkey Cooperative Research: Computational Magnetohydrodynamics (MHD)","awardID":"9514848","effectiveDate":"1996-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":[10349,"159082"],"PO":["540599"]},"15192":{"abstract":"In order for compilers of fine-grain parallel architectures to be as effective as possible, compiler writers must understand the interactions between the phases of the compiler. These phases include instruction scheduling which rearranges code in order to increase available fine-grain parallelism. In addition, code transformations to increase memory performance are applied, such as tiling and loop interchange to increase cache performance, prefetching to prefetch values from memory in order to eliminate the memory latency, and scalar replacement which changes array references to scalar references to decrease memory accesses. The compiler also performs register allocation, which allocates registers to values so as to minimize the number of memory accesses. The goal of this proposed work is to investigate the interactions of these phases. This effort is being undertaken along two directions. The first direction is to continue previous work in cooperative register allocation and instruction scheduling by (1) incorporating cooperative software pipelining and performing the cooperative register allocation and scheduling optimizations over a single framework, the program dependence graph (2) performing a thorough analysis and experimental study of the effects of register assignment strategies on scheduling to increase fine-grain parallelism. The second direction is to investigate the interactions between code transformations improving memory performance and other compiler phases. In particular, the proposed work will investigate (1) the impact of scalar replacement and software prefetching on instruction scheduling to increase fine-grain parallelism and on register allocation (2) strategies for enabling communication between code transformations to increase memory performance, register allocation, and instruction scheduling. ***","title":"CAREER: Cooperative Compiler Optimizations for Fine-Grained Parallel Architectures","awardID":"9625219","effectiveDate":"1996-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["537266"],"PO":["250083"]},"5925":{"abstract":"Imagining an event and watching it unfold in the mind's eye is a common experience of most people. It has often been proposed that this is one basis for thinking about events and predicting their outcomes, and that thereby it is an important method of reasoning, planning, communicating, and understanding. This research attempts to place such imagistic reasoning on a firm theoretical footing by characterizing it as precisely defined computations performed on mental representations. The research focuses on the use of diagrams as a vehicle for reasoning about spatial relations and mathematical concepts that can be understood by spatial analogies. Spatial reasoning and diagram interpretation are important abilities of humans, and machines with similar abilities have advantages over machines without them, including a more natural mode of interaction with people. The goal of this research is a better scientific understanding of human cognitive psychology, and the basis of a technology for machines that can think directly in images. Potential applications of spatial reasoning programs and theory include automated navigation systems, improved computer-human interfaces, improved methods for clearly presenting scientific data and control panel information, methods of diagnosing faults in machines, and improved methods of technical instruction.","title":"Qualitative Geometric Reasoning: Thinking with Diagrams","awardID":"9526942","effectiveDate":"1996-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[14530],"PO":["565227"]},"15030":{"abstract":"This project focuses on two lines of research: (1) program correctness and (2) the problem of learning deterministic and probabilistic finite automata:(1) Because the simplest of programs can be full of elusive errors, the study of program checkers, self-testing programs and self correcting programs, was introduced, in order to permit the use of a program without trusting that it works correctly. In this area, the goal of this project is to develop a core of algorithmic techniques for writing fast and simple checkers, self-correctors, and self-testers;(2) The goal in the area of learning deterministic and probabilistic finite automata is to study the applications of automata learning algorithms to on-line page replacement strategies, reinforcement learning, game theory, part-of-speech tagging, phoneme modeling, and parsing. The Integrated Educational Plan of this CAREER Grant includes designing new projects to facilitate undergraduate and graduate student involvement in the research process and mentoring undergraduates. ***","title":"CAREER: Algorithms for Self-testing\/Correcting Program and Learning","awardID":"9624552","effectiveDate":"1996-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["517766"],"PO":["150516"]},"17870":{"abstract":"This workshop is on evaluating priorities for academic electronic design automation (EDA) research, with the intention that the results of the meeting aid in refocusing the field on its roots. Both future priorities for research and education, as well as areas that are already well-served by the EDA industry and are unlikely to require major new methodological or technological breakthroughs are considered. The workshop report includes: (1) a statement of the most pressing problems to solve within the next decade, (2) recommendations regarding the style and kind of research to be conducted and suggestions to the community as to how to implement these suggestions, and (3) viewpoints on increasing the impact of the EDA field on education in electrical and computer engineering.","title":"Workshop on Future Research Directions in CAD for Electronic Systems: \"Putting the 'D' Back in CAD\"","awardID":"9634523","effectiveDate":"1996-05-01","expirationDate":"1997-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["483628"],"PO":["321058"]},"15131":{"abstract":"The goal of this research project is to develop a set of Virtual Environment Readaptation Mechanisms (VERM) that facilitate user recovery to normative conditions after exposure to a virtual environment (VE). While considerable work is being done to characterize motion sickness and identify the potential maladaptive aftereffects from human-virtual environments, there are currently few efforts focusing on the actions to be taken when post-exposure aftereffects are identified. This research focuses on demonstrating the feasibility of developing provocative activities conducive to visual and visuomotor recalibration of known post-exposure disturbances, including ataxia (i.e., postural instability), vestibulo-ocular reflex gain\/phase changes, and degraded eye-hand coordination. The approach consists of testing the effectiveness of three post-exposure readaptation mechanisms (locomotion activities, visual tracking tasks, and peg-in-hole tasks) to facilitate user readaptation under varying degrees of exposure duration, user initiated control, and visual scene complexity. The results of this research will provide an understanding of post-exposure readaptation, as well as provide mechanisms that facilitate a timely recovery from VE exposure. The VERM have possible application by VE system developers in specifying post-exposure protocols that verify when the aftereffects from VE exposure have dissipated, thereby maintaining the safety of users and minimizing the liability of developers.","title":"CAREER: Human-Virtual Environment Interaction: Development of a New Area of Study Within Interactive Systems","awardID":"9624968","effectiveDate":"1996-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["259894"],"PO":["565227"]},"15122":{"abstract":"Acceptance of an object-oriented approach to scientific computing is being hindered by the performance differential between programs written in traditional languages and those written in object-oriented languages. These performance issues stem from the limitations on static dependence analysis and compiler optimization posed by the presence of objects. An approach to increasing the degree of optimization in object-oriented environments is incorporating information about the object semantics and performing runtime optimizations. As proved true for compiler optimization using static dependence information,informal semantics and intuition are inadequate. A semantic foundation for optimization which includes support for dynamic dependence and for the richer data types exploited in object-oriented languages provides an important foundation for advancing compiler research. The semantic model studied in this research is intended to unify reasoning both in the compiler (static) environment and the runtime (dynamic)environment. Support for dynamic object creation and even dynamic class definition can be considered in a setting exploiting both static and dynamic dependence information. The resulting model, utilizing tools such as denotational semantics and equational calculi, will allow the creation of automated tools to assist in the development of advanced compiler optimizations with the additional formal assurances that these optimizations do not alter the meaning of the program. The computational demands posed by computational biology provide another realistic setting within which to study the complexities of object-oriented parallel and distributed program development and the concomitant optimization needs for language systems. The educational goals of this research are to both alter the programming languages and compiler curricula to address, at all levels, issues of semantics, optimization, and the degree to which each affect the other. The computational biology work provides a promising framework within which to study these issues. Thus, the computational biology curricula is being developed in parallel with the languages work. This research is expected to contribute to an understanding of the nature of program dependences; how different language constructs and program usage contribute to different patterns of dependence; and how these patterns can be exploited in language design or in language translation. Work in this area has already uncovered unsuspected connections between lazy evaluation and imperative languages. Further study should provide insight into relationships among languages in the context of their interactions at runtime. A goal of this research is to support the mixing of languages without sacrificing the performance of the program, allowing the programmer to select the most appropriate language for the individual parts of a problem. The fundamental notion of program dependence is a natural basis on which to construct a system supporting this style of programming. ***","title":"CAREER: A Semantic Framework for Static and Dynamic Optimization","awardID":"9624932","effectiveDate":"1996-05-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2877","name":"PROGRAMMING LANGUAGES &COMPILR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["122795"],"PO":["150697"]},"15189":{"abstract":"In recent years, there has been a great deal of attention in the software engineering community on the development of techniques and tools that provide support for the design and implementation of applications to be distributed across networks of workstations. Some of this focus has been on support for initial development and configuration of applications while other research has focused on techniques to support these types of applications at run-time. One novel aspect of workstation environments is that the number of processors available for use tends to grow and shrink over time. This aspect has caused increased interest in dynamic reconfiguration techniques that allow applications to adapt to their changing environment. Much of the current research in dynamic reconfiguration has focused on reconfiguration environments and heterogeneous process migration. This research is developing techniques for supporting dynamic structural and implementation changes. The work has three parts: 1) studying general approaches to implementing dynamic structural and implementation changes to applications, including those changes that require process participation, 2) determining what aspects of this task can be automated, and 3) building tools to support dynamic structural and implementation changes. The most promising approach is one that enables mapping the old global state of an application to a new global state based on the structural changes to be made. This CAREER project includes teaching initiatives geared towards introducing undergraduate students to issues in the design and implementation of distributed applications. The goal is to improve training in an area where many students get inadequate preparation for industry positions that require knowledge in this domain. ***","title":"CAREER: General Support for Dynamic Reconfiguration","awardID":"9625202","effectiveDate":"1996-05-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[38392],"PO":["150697"]},"17434":{"abstract":"Over the past decade, artificial intelligence concepts and techniques have been productively applied to diverse aspects of manufacturing decision-making, ranging from product and process development, to production management, to process diagnosis and quality control. Artificial intelligence techniques will continue to impact design and manufacturing. In fact, they are an important - even necessary - part of the dreams shared by concepts such as lean manufacturing, agile manufacturing, virtual manufacturing, computer-integrated manufacturing and design. Because artificial intelligence is still a field in which there is much fundamental research required to bring to fruition exciting developments that will prove useful in these fields and because this research might as well be focused on the most productive areas, it is a good time to bring together experts and practitioners in both artificial intelligence and manufacturing, to bridge gaps between problem and solution perspectives, build better mutual understanding of important research challenges and technical potential in the field, break down cultural barriers that now exist, and foster future interaction and collaboration between the two communities. Together, manufacturing and artificial intelligence researchers and practitioners will work to facilitate the realization of truly intelligent manufacturing systems.","title":"A Research Planning Workshop in Artificial Intelligence and Manufacturing","awardID":"9633075","effectiveDate":"1996-05-01","expirationDate":"1996-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["563502"],"PO":["54008"]},"17832":{"abstract":"The last decade has seen extraordinary technological, intellectual, and market developments that have shifted many assumptions underlying research in computer architecture. Promising avenues for future research will doubtless lead in directions different from those of the past. This project will convene a group of approximately 15 experts from industry and academe, who will discuss this and related issues in a one-day workshop. The proposed date is May 21, 1996, the day before the start of the ACM\/IEEE international Computer Architecture Symposium to be held in Philadelphia, PA. The product of the workshop will be a final report published on the World Wide Web.","title":"Workshop on Critical Issues in Computer Architecture Research, May 21, 1996, Philadelphia, Pennsylvania","awardID":"9634380","effectiveDate":"1996-05-01","expirationDate":"1996-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["489472"],"PO":["549626"]},"17546":{"abstract":"This research is on adiabatic logic design for very low energy consumption circuits and systems. The primary idea is to use principles of adiabatic switching as the basis for circuit design. Energy recovery using this notion is a relatively new idea, although the concept of reversible logic and zero-energy computing can be tracked back to he early 1970s, the attempt to realize the concept in electronic circuits is a new endeavor. An adiabatic logic, using both fully reversible and partially reversible logic, is being developed. It is based on standard CMOS technology with a switching power supply. Basic logic gates, registers, and memories for recovered energy operations, are being developed. Tools for power management, such as techniques to utilize the redundant signals generated from reversible logic gates, are being developed. The newly designed circuits and the corresponding power supply are being fabricated and tested.","title":"Logic and Circuit Synthesis for Low-Energy Computing Using Principles of Adiabatic Switching","awardID":"9633516","effectiveDate":"1996-05-01","expirationDate":"1997-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["551012"],"PO":["321058"]},"17758":{"abstract":"9634183 Perez-Luna This project will examine the implications of the intersection of art, science, and technology as revealed by the events occurring around the celebration of the fiftieth anniversary of the first general electronic computer, ENIAC-50. The finished product will be radio programming and audio material that presents the coming together of scientists, artists, and other participants in Philadelphia. It will build on the previous research and explorations in both of these fields toward finding commonalties and ways in which each has influenced the other. The finished product will be broadcast for the general public and also can be made available to scientists and educators in the field as resource material for courses, seminars, and lectures as they explore the intersections of science and art and implications this has for research and education.","title":"Intersections: Art, Science and Technology -- A Radio Project","awardID":"9634183","effectiveDate":"1996-05-01","expirationDate":"1997-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0601","name":"Division of edDATA NOT AVAILABLE","abbr":"EDNE"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7259","name":"INFORMAL SCIENCE EDUCATION"}}],"PIcoPI":[44625],"PO":["196383"]},"7380":{"abstract":"9531730 Murphy, Robin Martinez, Julian Colorado School of Mines Research Experiences for Undergraduates: Multiple Autonomous Mobile Robots For Search And Rescue Applications This Research Experiences for Undergraduates project will support ten students per year in programs carried out both during the Summers and the academic years, for two years. Activities will include technical (e.g., hands-on laboratory skills), intellectual (e.g., problem-solving skills), and on professional and personal development (e.g., communication and management skills). The project targets both CSM resident students and students from traditionally minority institutions. In the first year and a half, the students will use two identical mobile robots certified for search and rescue activities in underground mines and will demonstrate and test their results in the CSM Edgar Experimental mine. During the second year, the participants will transfer their software to small robots suitable for SAR work in collapsed buildings. The use of two sets of robots and two variations of the same task will reinforce the development of general purpose solutions and basic software engineering skills. Analysis and design procedures will be emphasized at each step of the project and the project also entails significant written and oral presentations during the year. ***","title":"REU Site: Multiple Autonomous Mobile Robots for Search and Rescue Applications","awardID":"9531730","effectiveDate":"1996-05-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["211390","565226"],"PO":["329035"]},"16208":{"abstract":"CDA-9628591 Aiken, Robert Association for Computing Machinery Special Project: U.S. Attendance at the 14th IFIP World Computer Congress This award provides partial support for 20 representatives from the U.S. to attend the 14th IFIP World Computer Congress, in Canberra, Australia, September 2-6, 1996. The International Federation for Information Processing (IFIP) is a multinational federation of technical organizations concerned with information processing. The Federation on Computing in the U.S. (FOCUS), a joint activity of the ACM and the IEEE Computer Society, serves as the U.S. representative to IFIP and is administering this project. The participants in the project are selected on a competitive basis by a committee of reviewers, with emphasis given to young researchers doing outstanding work and to applicants who have been accepted to present papers or are otherwise significantly involved in the conference.","title":"Special Project: U.S. Attendance at the 14th IFIP World Computer Congress","awardID":"9628591","effectiveDate":"1996-05-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["128206"],"PO":["297837"]},"16109":{"abstract":"The Federated Computing Research Conference (FCRC) is an ensemble of 16 small computer science research conferences, symposia and workshops, sponsored by four different professional societies and colocated in Philadelphia, PA from May 20 through 28, 1996. Many of the constituent meetings are held on an annual basis. The purpose of the Federated Conference is to stimulate interaction among scientists in sub-disciplinary areas who might otherwise not communicate with one another. Registrants at FCRC are allowed and encouraged to attend any and all sessions of the constituent meetings. The first FCRC was held in 1993 in San Diego, CA and proved to be successful. The content of FCRC will be enriched by five plenary sessions featuring internationally distinguished, invited speakers. ***","title":"The 1996 Federated Computing Research Conference, Philadelphia, PA","awardID":"9628276","effectiveDate":"1996-05-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["507752"],"PO":[40586]},"4081":{"abstract":"9514202 Wolf This U.S.-Argentina collaborative research project will continue the development of a framework for the formal specification and analysis of the behavioral properties of software architectures. Together with Daniel Yankelevich of the Universidad de Buenos Aires in Argentina, the PI at the University of Colorado Boulder will extend his work on a formal specification method based on the Chemical Abstract Machine (CHAM) model. CHAM provides operational semantics which may be more easily understood by a wide audience than competing mathematical formalisms. The collaboration established in this project connects the PI with an existing effort between Argentina and Italy on specification and verification of concurrent systems. It also combines the systems orientation of the U.S. group with the theoretical orientation of the Argentines to understand the potential of the CHAM model for software architecture. ***","title":"U.S.-Argentina Cooperative Research on Software ArchitectureFormal Specification","awardID":"9514202","effectiveDate":"1996-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["290193"],"PO":["193077"]},"5185":{"abstract":"The University of Southern California (USC) is collaborating with two institutions in Mexico City (ITAM and CINVESTAV) to advance the methodology of simulating complex systems, with especial application to neural models at different levels of analysis. To provide multi-level simulation we integrate our present neural simulation language NSL with the facilities for object-oriented management of hierarchical structures called schemas provided by the abstract schema language ASL. This will be linked to work in databases for the representation of biological data underway at USC as part of the Human Brain Project supported by several US agencies. Additionally, the project complements a second NSF-CONACyt collaboration, between Georgia Tech and ITAM, that studies the technological issues of `Ecological Robotics: A Schema-Theoretic Approach`. The methodology will provide simulation tools which will help neuroscientists gain a better understanding of the dynamical processes associated with biological phenomena, and a technology with implications far beyond the brain research community.","title":"Multi-Level Simulation Methodology: A Computational and Experimental Approach To Neural Systems","awardID":"9522999","effectiveDate":"1996-05-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["560350"],"PO":["565227"]},"5142":{"abstract":"The primary objective of the project is to enhance and port a software simulation package, SIMARC, to a Sun workstation network. The purpose of the SIMARC package is to enable the user to quickly develop Modularly Configured Attached Processor (MCAP) architectures and simulate the execution of various algorithms on these architectures. The SIMARC package has already been developed at the University of Texas at El Paso (UTEP) for IBM PC compatible computers. The simulator and assembler portions of SIMARC would be ported by a group at UTEP and the architecture editor portion would be ported by a group at the Instituto Technologio de Estudios Superiores Monterrey Campus Ciudad de Mexico. Also both groups would use the package to develop high-performance architectures for executing signal processing and communications algorithms. The principal result of the project would be a software package that could be used for the fast prototyping of customized attached processors designed to efficiently execute specified sets of algorithms. ***","title":"Porting and Enhancement of an Architecture Simulation Package to a Workstation Environment","awardID":"9522810","effectiveDate":"1996-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["139538",12579],"PO":["250083"]},"6375":{"abstract":"Use of database systems for non-traditional applications has prompted the development of new transaction models whose semantics vary from the traditional model, as well as from each other. This project is concerned with the development of a framework for supporting various transaction models in an extensible manner. ECA (event-condition-action) rules are defined at the system level, in contrast to the ECA rules currently supported at the application level. The rules apply to significant operations of a transaction and\/or data structures and are used to support both traditional and extended transaction models. Formalization of the interaction among various transaction models allows the use of different transaction models by different applications on the same database management system (DBMS). The results of this project will further enhance the use of database systems -- for new classes of applications (e.g., workflow and enterprise modeling) that cannot be currently supported directly by traditional DBMSs.","title":"Flexible Transactions in DBMS: Formalism and Support Using Active Capability","awardID":"9528390","effectiveDate":"1996-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["553596"],"PO":["563751"]},"7311":{"abstract":"Psarris 9528330 In the past decade much progress has been made in developing high performance large scale parallel architectures. The development of fast restructuring compilers for the automatic parallelization of sequential programs requires efficient data dependence analysis techniques in order to obtain exact data dependence information. The proposed techniques in data dependence analysis fall into two categories, either efficient and approximate tests or exact and exponential. The proposed research will attempt to show, though, that exact data dependence information can be computed efficiently in practice. The GCD test and the Banerjee inequality are the two tests most widely used to detect data dependencies between pairs of array references inside loop nests. These tests are approximate in the sense that they are necessary but not sufficient conditions for data dependence and, therefore, they may introduce artificial dependences which limit parallelization. Their major advantages is their low computation cost. A recent study provided necessary and sufficient conditions for the accuracy of the GCD and Banerjee tests. This study has also led to the development of the I (Interval) test, an improved dependence analysis test. The I Test is more accurate than a combination of the GCD and Banerjee tests and is able to provide exact data dependence information in practice, unlike the classic tests, at no additional computation cost. The original work considered only the case of loops with constant loop limits. In scientific applications though, inner loop limits may be linear functions of the outer loop iteration variables (these iteration spaces are termed trapezoidal regions). This project develops an efficient and accurate dependence analyzer. The research has four objectives. The first objective is to derive conditions for the accuracy of the GCD and Banerjee tests in general trapezoidal regions and perform and empirical stud y of how often these conditions occur in practice. The second objective is to extend the I test to the general trapezoidal regions and to assess its performance benefits on a suite of benchmark codes. The third objective is an analytical and empirical comparison of the I test with all the other tests, such as the Omega test, Power test, etc. An analytical and experimental evaluation of all the data dependence analysis tests is essential to determining which tests should be performed in practice. The fourth and principal objective is to integrate the above research work and develop an improved dependence analyzer as a part of the Paraphrase-2 parallelizing compiler. It is expected that the completion of the proposed research will improve the understanding of data dependence analysis, demonstrate the effectiveness and practical importance of the proposed techniques, and significantly improve the state of the art in parallelizing compilers. By providing efdicient and exact dependence analysis techniques a number of compiler optimizations for high performance computer architectures can be performed in practice. ***","title":"REU: Intelligent Structures Group Research Experiences for Undergraduates Site","awardID":"9531543","effectiveDate":"1996-05-01","expirationDate":"1998-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[17939],"PO":["297837"]},"5166":{"abstract":"IRI-9522930 Tesar, Delbert University of Texas-Austin $60,000- 24 mos CONACyT: Advanced Communication Technology in Robotics and Flexible Manufacturing Cells This is the first year of a two-year standard award. The field of manufacturing is on the verge of a revolution in the level of intelligence which will become possible and necessary during the next decade. This award under the NSF\/CONACyT Initiative funds a collaboration between robotics investigators at the University of Texas at Austin and researchers at the Instituto Tecnologico y de Estudios Superiores de Monterrey (ITESM) laboratories at Cuernavaca and Mexico City to develop foundation technologies needed for high performance, reconfigurable, and fault tolerant robots and manufacturing cells for the next generation production facilities. The laboratory at Austin will concentrate on the foundation technologies for highly reliable, fault tolerant, and reconfigurable communications within production systems. This includes the creation of the best software structure and standardized reconfigurable interfaces at all connections in the system. The appropriate level of granularity, multiplexing, protocols, etc. will be developed to provide configuration management schemes to most rapidly and reliably avoid a fault in the data transfer including buffers to allow for transition time without loss of control information. The ITESM labs at Mexico City and Cuernavaca will focus on hardware and operational software for the manufacturing cells.","title":"Advanced Communications Technology in Robotics and Flexible Manufacturing Cells","awardID":"9522930","effectiveDate":"1996-05-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["228470","557898"],"PO":["475621"]},"5354":{"abstract":"The PIOUS system is an experimental software architecture for efficient data management and I\/O in heterogeneous parallel and distributed computing environments. PIOUS offers scalable concurrency control with standard consistency semantics, presents global or segmented views of parallel files to applications, and declusters physical data for improved performance. Concurrency control in PIOUS is based on transactions, and permits either volatile or stable file access semantics for increased throughput or resilience to system failures. The goal of this project is to complete and implement the PIOUS prototype system on the PVM message passing substrate. The system will consist of an API library that is designed to present familiar file system syntax and semantics, while permitting multiple concurrent accesses and declustering across multiple disk devices. The PIOUS infrastructure will then be further enhanced by designing appropriate file system primitives that will enable the efficient implementation of high level file access semantics and permit large structured and heterogeneous data sets to be efficiently stored and accessed in distributed networked environments. An appropriate file model will be defined, based on an extensible and flexible, multilayered architecture, and will specify a set of access interfaces; these methods will be realized as a suite of portable and efficient runtime libraries and support software. ***","title":"Interfaces for Parallel and Distributed I\/O","awardID":"9523544","effectiveDate":"1996-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["489599"],"PO":["250083"]},"3881":{"abstract":"This award supports Professors Lane and Edith Hemaspaandra, of the University of Rochester and Le Moyne College, respectively, to collaborate in computer science with Professor Gerd Wechsung of the Friedrich Schiller University of Jena, Germany. Together they will study several topics of current interest in computational complexity theory These include (1) rigorous studies of the effect of query order on complexity (i.e., whether and when the order of access to multiple information sources matters) and (2) certificate complexity (calculating the conditions that control the size of classes of sets which always have acceptance certificates that can be easily computed.) The U.S. and German participants in this collaboration bring to bear complementary strengths in the creative theoretical aspects and the rigorous mathematical aspects of computational complexity. The joint effort of these talented and prolific researchers should produce significant contributions to the study of structural aspects of complexity theory. Results will have implications in many aspects of computer and information science.","title":"U.S.-Germany Cooperative Research on Structure in ComplexityTheory","awardID":"9513368","effectiveDate":"1996-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["478022","478001"],"PO":["290800"]},"6632":{"abstract":"This project explores through several inter-related activities the uses and abuses of anonymous communications on the internet. The benefits and drawbacks of anonymous computer communication are just now beginning to be examined, an examination rendered more difficult by the fact that the value of anonymous communication in a non-networked environment is itself a matter of debate. Nevertheless, a growing number of computer and network professionals, lawyers, social scientists, and ethicists agree that anonymity is an important issue that needs to be addressed from a variety of perspectives. Building on an earlier project focusing on the ethical, legal, and technological aspects of computer and network use and abuse, the American Association for the Advancement of Science (AAAS) plans to develop 1)criteria setting forth contexts in which anonymous communications are desirable (to be encouraged), permissible (to be tolerated), or undesirable (to be discouraged), and 2) preliminary guidelines for those situations where anonymity is to be either encouraged or tolerated. AAA will conduct several interrelated activities: 1) background information and guidance will be provided through commissioned papers on such topics as the individual and social uses and ramifications of anonymous communications, legal issues regarding anonymity, and the current and anticipated technical capabilities pertinent to anonymity on the net; 2) development of case studies based on individual experiences with anonymity; 3) convening of focus groups to frame issues for a two-day conference at which invited individuals from a variety of professional backgrounds and perspectives will discuss criteria and guidelines that can form the basis for normative and legal standards regarding anonymity. Results will be disseminated in a number of forms, including the World Wide Web page.","title":"Anonymous Communications on the Internet: Uses and Abuses","awardID":"9529238","effectiveDate":"1996-05-01","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["503705","390118"],"PO":["288903"]}}