{"58052":{"abstract":"Lerch<br\/>0094781<br\/>This regional award provides support from the Division of International Programs and the Division of Materials Research for a workshop organized by Dr. Irving A. Lerch of the American Physical Society and Dr. Cylon Goncalves da Silva, Director of the Brazilian Association for Synchrotron Light Technology (ABTLuS). This workshop on the Use of Synchrotron Radiation for Research will be held at the National Synchrotron Light Laboratory (LNLS) in Campinas, Brazil in February 2001 and includes a Symposium on Nanotechnology. The scientific participants come from the U.S., Canada, Mexico, Brazil, Venezuela, Argentina, as well as from countries outside the Western Hemisphere. The workshop will be short, focused and research-oriented in specific areas of synchrotron research and nanotechnologies. Two or more specialized symposia are organized around atomic and molecular spectroscopy, surface physics and catalysis, soft matter and polymers, x-ray structural studies, and nanotechnologies. The symposium will be used to train several postdoctoral students from the hemisphere and also bring in more users to the LNLS facility. <br\/>Workshops such as this nurture future international collaborations and help unify the global community. They also expose young scientists to international science and expand their horizons. This workshop will help increase the user base in Latin America for the seven major synchrotron facilities in the U.S.","title":"Regional Workshop on the Use of Synchrotron Radiation for Research including a Symposium on Nanotechnologies, Campinas, Brazil, February 10-13, 2001","awardID":"0094781","effectiveDate":"2001-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["215008"],"PO":[149151]},"59197":{"abstract":"The Department of Physics at the University of California, San Diego proposes to offer summer research training to fifteen undergraduate students per year for the next 5 years. Applications will be considered from students across the nation. Students will participate in an individual research project supervised by a Physics Department faculty member. Student projects will include experimental, theoretical, and computational research in high energy physics, condensed matter physics, biophysics, plasma physics, astrophysics and nonlinear physics. The research projects will be designed to guide students from a dependent research status to one that will allow each student to become as independent as their research skills and abilities permit. On arriving, students will work with their faculty advisor to prepare and present a proposed project. At the end of the summer, they will write a final research report and give a presentation at a campus wide Undergraduate Research Conference run by the UCSD Academic Enrichment Office. The REU program includes physics seminars by faculty, regular meetings with one of the program directors, seminars\/workshops on computer usage, laboratory safety and library research, and joint scientific seminars and meetings with groups from other departments. Students will have the opportunity to attend workshops on graduate school admission and fellowship procedures, how to write a research paper, public speaking, instructional technology and GRE training.","title":"REU Site: Physics Research Experience for Undergraduates at the University of California, San Diego","awardID":"0097854","effectiveDate":"2001-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["404042","303104","298301",152070,"446082","556768"],"PO":["561720"]},"57482":{"abstract":"This research will explore computer algorithms capable of the same sorts of spatial reasoning demonstrated by humans. The models constructed will in turn further a deeper understanding of how humans process space and how that processing is sensitive to different kinds of domains. The PI has proposed a model of cognitive mapping called PLAN (Prototypes, Locations, and Associative Networks) which has been partially implemented on an advanced mobile robot. This project will develop versions of the PLAN architecture that can be implemented on low cost robots using off-the-shelf technology. The goal is to develop a general-purpose spatial architecture independent of implementation details such as pattern recognition. Such an architecture should be applicable to non-visual environments as well (e.g., music), and even to completely abstract domains. The algorithms developed in the proposal will be aimed at constructing a general methodology for parsing complex domains into generic spatial structures in a fashion similar to how humans break up large-scale spaces into smaller regions. Humans appear to rely on special places called \"gateways\" to provide clues as to how to parse environments and the gateway structure has the capability of generalizing even to abstract domains. In music, for example, long pauses serve as a kind of gateway denoting a change in movements. The PI, who first introduced the gateway construct, has proposed that the kinds of gateways found in an environment can significantly impact human performance within the environment. A deeper understanding of this relationship will impact the evaluation and design of environments ranging from music to web sites to courses. The research will take place at an undergraduate liberal arts college, and will provide students with the opportunity to participate in advanced research and to gain hands-on experience with robots.","title":"Computational Models of Space in Navigation and Other Domains","awardID":"0092605","effectiveDate":"2001-04-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["451518"],"PO":["387198"]},"57570":{"abstract":"This project investigates how informal collaboration in the workplace can be supported by calendar information available via personal digital appliances. The goal is to retain the flexibility and individual usability of personal devices while also enabling collaborative sharing of data, such as schedule and location information. However, the leap from personal use to group collaboration is not trivial, as individuals must assess what information they are willing to share, how they currently use that information, and how they value the benefits of collaboration. To explore these issues, the research will use probabilistic reasoning techniques to ascertain the likelihood of finding a colleague at a scheduled event. The system will analyze and distribute personal calendar information to faculty, staff and students at the PI's institution. Different visualization techniques offer trade-offs among precision, privacy, self-explanation, aggregation and effort in obtaining information. By analyzing the feasibility, adoption, use and social norms formed in response to these new capabilities, we contribute to the growing interest in informal collaboration, interfaces for serendipitous information, and the use of Bayesian networks.","title":"CAREER: Leveraging Personal Digital Appliances to Support Informal Collaboration","awardID":"0092971","effectiveDate":"2001-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["506686"],"PO":["564456"]},"62093":{"abstract":"The AES (Advanced Encryption Standard) is to become the new encryption standard. In contrast with the development of the DES (Data Encryption Standard) and the EES (Escrow Encryption Standard), the development process of AES was open. The motivation was that a new scheme would be easily accepted by the community and widely used by the government and by industry. The outdated DES has been used extensively to protect industrial secrets, protect financial transactions in the billions of dollars, to protect internet security, etc. It is therefore expected that the new AES will also be used in such applications and new ones. After 3 years, a finalist for the AES has recently been chosen. Seeing the critical application of AES an analysis of the security of the AES finalist before it becomes a standard is primordial.<br\/><br\/>After DES was developed, scientific research lead to new cryptanalytic techniques (such as Differential Cryptanalysis and Linear Cryptanalysis). These techniques are currently used when evaluating new cryptosystems. The goal of the research on the AES finalist is to develop new cryptanalytic techniques that can be used in the future to analyze the AES finalist, its variants, and other future cryptographic algorithms. The ultimate goal is to attempt to break the AES finalist. If this goal would be unachievable, the new techniques may contribute to the scientific understanding of the design of secure ciphers.","title":"Cryptanalytic study of the AES finalist and its variants","awardID":"0109425","effectiveDate":"2001-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["218583"],"PO":["188393"]},"69486":{"abstract":"","title":"Digital Government: Social Processes and Content in Intelink Online Chat Data","awardID":"0196374","effectiveDate":"2001-04-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[179862,"451739"],"PO":["371077"]},"59367":{"abstract":"To meet rapidly increasing demand for satellite communications and broadcast services, there is a need for more bandwidth efficient techniques, and the use of higher level modulations is a natural choice. However, higher level modulations suffer relatively more performance degradation from satellite amplifier nonlinearity. This research focuses on the design and analysis of digital transmission for the nonlinear satellite channel, especially as regards the combination of highly efficient coded modulation, signal processing and decoding algorithms. <br\/><br\/>The research involves a comprehensive plan to develop and compare coded modulation, predistortion, equalization, and decoding algorithms for high-rate bandwidth-efficient nonlinear satellite channels (3 bits\/symbol information rate and higher). Previous results of the investigator showed that with effective predistortion, the nonlinear channel is well-approximated by a peak power constrained but otherwise linear channel, and suitably optimized (12,4) PSK is superior to 16 QAM trellis coded modulation (TCM). The present work is focused on the following topics: (1) Higher rate TCM and multidimensional TCM for the predistorted channel; (2) Combined equalization and decoding of TCM in the nonlinear channel; (3) Turbo trellis coded modulation (TTCM) in the nonlinear channel, which may be powerful enough to not require predistortion or equalization; and (4) Hierarchical coded modulation in the nonlinear channel, which is suitable for variable error rate protection and\/or backward compatibility. Although the focus is on ground-based transmitter or receiver techniques with a high power travelling wave tube amplifier (TWTA) transponder, the work is also applicable to on-board linearization of low power satellite amplifier or even in-hand linearization of a cell phone provided that a digitally generated signal is amplified (versus analog combining), because there is still the fundamental problem of bandwidth and power-efficient coded <br\/>modulation design subject to a peak power constraint.","title":"High Performance Coded Modulation and Decoding Algorithms for the Nonlinear Satellite Channel","awardID":"0098324","effectiveDate":"2001-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["226023"],"PO":["348215"]},"57113":{"abstract":"EIA 0091076<br\/>National Academy of Sciences<br\/>Marjorie S. Blumenthal<br\/><br\/>Title: Special Projects: Support for the Core Research Activities of the Computer Science and Telecommunications Board<br\/><br\/>This projects requests support for the core activities of the Computer Science and Telecommunications Board. The Board conducts a variety of activities such as: monitoring and promoting the health of computer science including research, human resources, and infrastructure; initiating studies involving computer science and national economic strength; responding to requests from government for expert input; fostering interactions between computer science and other areas of science and technology; and providing a forum for the exchange of information related to computer science, computer technology, and telecommunications.","title":"Special Projects: Support for the Core Research Activities of the Computer Science and Telecommunications Board","awardID":"0091076","effectiveDate":"2001-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["298189","234699"],"PO":["289456"]},"55047":{"abstract":"RUI: Query Optimization for Multi-Database and Data Warehousing<br\/><br\/> In multi-database systems, similar information may be represented under different structures (schemas). Current database languages are suitable for querying a single database, but are not powerful enough to reconcile such \"schematic heterogeneity\" among databases. New languages have been proposed to achieve interoperability among multiple databases. This research project is concerned with query optimization for such languages, in particular \"schemaSQL\", a recently proposed extension of the industry-standard database language SQL. The restructuring capabilities provided by schemaSQL and similar languages have applications far beyond multi-database systems. For example, operating data over possibly many years of operation are summarized and stored in a data warehouse. The warehouse data can then be analyzed for patterns and trends to improve the operations. Restructuring of the warehouse data can potentially result in a significant increase in query processing efficiency. This research project involves a team of graduate and undergraduate students, and will enhance the development of human resources in science and engineering both at graduate as well as undergraduate level. The results of this project will provide a new approach to querying and query optimization using restructuring and will have applications in multi-database systems interoperability and efficient query processing, data warehousing efficiency, and physical database structuring for optimized operation. <br\/>URL: http:\/\/www.uncg.edu\/~sadrif\/nsf\/query-optimization.html","title":"RUI: Query Optimization for Multi-Database and Data Warehousing","awardID":"0083312","effectiveDate":"2001-04-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[140730],"PO":["563751"]},"52561":{"abstract":"Indexing and Reorganization in Parallel Database Systems<br\/><br\/>The goal of this research project is to design, analyze and simulate restartable algorithms for on-line reorganization in parallel database management systems (DBMSs). The growing need for 7\/24 (7 days a week\/24 hours a day) database access for web applications makes development of these algorithms urgent. Applications such as those found in telecommunications and web-based businesses (for example, eBay or AOL) require very large highly available databases. These are or will soon be managed by parallel DBMSs (i.e., DBMSs on clusters of workstations, each managing its own collections of disks, connected by Local Area Networks (LANs)), so parallel algorithms to maintain availability in the face of logical and physical changes to the database as well as unexpected growth are important. The approach deployed in the project includes the description of explicit logging operations to assure consistency and preserve incremental improvements in the face of possible system failures at any node of the parallel system. Collaboration with industry is part of the project. Ms. Xiaowei Sun, a supported Ph.D. student on the project, has completed an internship at Clustra, Inc., whose product is a parallel replicated DBMS designed for high availability. She is also doing an internship with IBM Toronto on online reorganization for IBM's DBMS, DB2. The close contact with industry and the current importance of the problem of online reorganization will strengthen the impact of this project's results, including the expected technology transfer.<br\/><br\/>http:\/\/www.ccs.neu.edu\/home\/salzberg\/nsfproj2000.html","title":"Indexing and Reorganization in Parallel Database Systems","awardID":"0073063","effectiveDate":"2001-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["289452"],"PO":["563751"]},"54992":{"abstract":"Target-Based Document-Independent Information Extraction<br\/><br\/> With ever-growing volumes of data in widely varying formats, there is a need to sift and funnel information to users to meet their own specific requirements. This project addresses the challenge of finding, extracting, and delivering appropriate data by developing a versatile framework that is target-based (i.e., based on a user's description of the desired information) and document-independent (i.e., robust, not failing whenever documents change or when new documents of interest are encountered). A combination of document-related clues regarding textual content as well as geometrical and organizational layout enables processing across various document formats. Developers and users specify areas of interest via descriptive ontologies (i.e., declarations of information types and concept relationships). These ontologies facilitate reformulating, matching, and merging retrieved information. The result of these efforts will be a comprehensive infrastructure to extract expertly, organize automatically, and summarize succinctly critical information in a queriable personalized view. An online repository will contain research results, downloadable software (including source code), and a Web interface enabling user access to the various tools and engines developed. Potentially, this technology can be embedded in personal agents; leveraged in customized search, filtering, and extraction tools; and used to provide tailored views of data via integration, organization, and summarization. http:\/\/www.deg.byu.edu","title":"Target-Based Document-Independent Information Extraction","awardID":"0083127","effectiveDate":"2001-04-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["250003","532055",140587,"250004",140589],"PO":["469867"]},"59338":{"abstract":"Software bugs currently cause the large majority of computer failures.<br\/>Unfortunately, the current culture of software development tolerates the<br\/>release of software with numerous bugs. The best solution to this phenomenon<br\/>is more thorough testing. This project seeks to increase the amount of testing<br\/>and effective debugging undergone by modern software. This research enables<br\/>end users to serve as effective testers by tracing a program's execution<br\/>automatically and submitting the trace as a bug report. Such traces contain<br\/>all information needed for the software developer to reproduce the failure,<br\/>even if that failure is non-deterministic. The goals of this trace-and-replay<br\/>system reflect the end-user environment it is targeted for. The tracing system<br\/>should have low-enough overhead to be left on during normal use. The tracing<br\/>system should translate or encode the trace to maintain the user's privacy.<br\/>The trace-and-replay system should be easy to use by the end user; for example,<br\/>it should not need to modify the kernel or system libraries. If successful,<br\/>the resulting system will dramatically increase the base of effective testers<br\/>and hopefully result in more reliable software.","title":"End-User Tracing for Software Replay","awardID":"0098229","effectiveDate":"2001-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["556912"],"PO":["309350"]},"52694":{"abstract":"This project studies the theory of multidimensional channels and investigates effective coding techniques for such channels. The coding techniques are of three types: error-correction channel coding, constrained coding, and joint source-channel coding. Emphasis is placed on applications to two-dimensional magnetic and optical recording as well as three-dimensional holographic storage. These are the storage devices of the future. An important application of this research within the next few years is the storage of massive amounts of<br\/>still imagery and video on two-dimensional media. This will likely extend to three-dimensional and four-dimensional (the fourth dimension is wavelength) devices over the next 5 to 10 years. Such multidimensional devices will require a shift in paradigm, since most of the existing theory for<br\/>error-correcting codes, constrained codes, and source-channel codes was developed in the context of one-dimensional applications. There is much to be gained by coding for multidimensional channels, but the problems associated with such channels are considerably more challenging than their one-dimensional<br\/>counterparts.<br\/><br\/>Interesting technical problems arise due to the spatially dependent nature of errors in multidimensional storage media. New error-correcting codes and interleaving techniques are needed to effectively protect data stored on such media. The physical properties of optical and holographic recording channels call for a new theory of constrained coding in multiple dimensions. New joint source-channel coding techniques and theory are needed to maximize the recovered source fidelity for images and video stored on multidimensional<br\/>devices while keeping the storage density as high as possible. Inparticular, the storage capacity of multidimensional devices can be greatly increased at the expense of a less reliable recovery of the stored imagery\/video than is current practice for the storage of data. This project studies the tradeoff<br\/>between increased storage capacity and quantitative loss in fidelity of the reproduced source signal. The main topics being investigated for multidimensional channels are: (1) Error-correcting codes, (2)<br\/>Interleaving techniques, (3) Soft-decision decoding, (4) Capacity computation for constrained channels, (5)~Encoders and decoders for specific constraints, (6) Joint source-channel coder design.","title":"Source and Channel Coding for Multidimensional Channels","awardID":"0073489","effectiveDate":"2001-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["517054","485936"],"PO":["348215"]},"54553":{"abstract":"The project submitted in response to NSF 96-145, will build on established activities exploring high performance mechanisms for interoperable distributed digital libraries. In particular, the project will draw on existing efforts related to the Open Archives Initiative (OAI) to demonstrate effective retrieval.across multiple repositories in the US and Mexico. The project will test new integration of diverse systems which exemplify agent, federated search, and multiple database\/gateway approaches to distributed processing. The testbed aspect of the project aims to advance and facilitate sharing of research in a proven international, <br\/>multilingual collaborative environment. This project is highly pluralistic and will engage researchers and students from universities in the US and Mexico with high potential for extension to other sites located around the globe.","title":"CONACyT: High Performance Interoperable Digital Libraries in the Open Archives Initiative","awardID":"0080748","effectiveDate":"2001-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["550462"],"PO":["433760"]},"62312":{"abstract":"This award to WTEC, Inc. is for organization of a workshop at NSF in February 2001 that will provide a preliminary assessment of U.S. and international research activities in quantum information science. Quantum information science (QIS) is an emerging field of science and technology that draws on the disciplines of physical science, mathematics, computer science, and engineering. Its aim is to understand how fundamental laws of quantum mechanics can be harnessed to dramatically improve the acquisition, transmission, and processing of information. The exciting scientific opportunities offered by QIS are attracting the interest of a growing community of scientists and engineers, both nationally and internationally. Although the U.S. maintains a leadership role in this research, major centers of excellence exist abroad, principally in Japan, Europe, and Australia. The goal of the workshop is to gather information by a panel of U.S. experts for the purposes of planning a more extensive global study of QIS. Its scope is to identify the leading individuals, institutions, and centers of excellence in international research and development in the field. A full international technology assessment study may then be organized separately to complete the major study. Several Divisions in the Directorates for Engineering, for Mathematical and Physical Sciences, and for Computer and Information Science and Engineering at NSF are supporting this award.","title":"International Quantum Information Sciences Workshop","awardID":"0110356","effectiveDate":"2001-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}}],"PIcoPI":["560018"],"PO":["564454"]},"55833":{"abstract":"We propose a collaboration between Harvard and the Cambridge Public Schools to help public school students learn science and technology. Cambridge teachers follow a curriculum which meets standards of the Massachusetts Comprehensive Assessment System (MCAS) and prepares students for state-wide examinations. Our plan is based on teams, each consisting of one faculty member, three GK-12 Fellows, and three Cambridge teachers. Each team will choose a topic from one of three areas: the environment, materials science, and information technology. During the first half year the team will meet weekly to introduce Cambridge teachers to research at Harvard and to discuss how to involve students in investigations related to the Cambridge curriculum and MCAS standards. In the second half year, GK- 12 Fellows will move to the Cambridge Public Schools to help teachers and students in discussions and student projects. A workshop will be held at the end of the year in which Cambridge students present their results to an audience of students and parents. We will start with eighth grade students and move to the ninth and tenth grades in following years. These activities will help Cambridge students learn science and technology and help GK- 12 Fellows become more involved in public education.<br\/><br\/>This award is co-supported by the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences.","title":"GK-12 Environment, Materials Science, and Information Technology Themes in Eighth, Ninth and Tenth Grades","awardID":"0086387","effectiveDate":"2001-04-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}}],"PIcoPI":["563645","523352","405032","538871","547852"],"PO":["559975"]},"69539":{"abstract":"","title":"BIOCOMPLEXITY: Collaborative Research: Factors Affecting, and Impact of, Diazotrophic Microorganisms in the Western Equatorial Atlantic Ocean","awardID":"0196427","effectiveDate":"2001-04-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5418","name":"OCE SPECIAL PROGRAMS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["531018"],"PO":["354885"]},"60498":{"abstract":"EIA 0102264 <br\/>National Academy of Sciences <br\/>T.H. Moss <br\/><br\/>Impact of Information Technology on the Future of the Research University <br\/> <br\/><br\/>This is a workshop proposal to consider research university responses to new challenges and opportunities presented by information technology with a focus on the need for future policies to ensure the evolving research enterprise will be capable of addressing national needs. The results of the workshop will be broadly disseminated. Participants include members of diverse constituencies: early faculty adopters in innovative uses of information technology, intellectual and administrative university leaders, and representatives of government and the private sector.","title":"Special Projects: Impact of Information Technology on the Future of the Research University","awardID":"0102264","effectiveDate":"2001-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[155536,155537],"PO":["329035"]},"62214":{"abstract":"This proposal requests support to develop, test, and optimize a new approach to adaptive beamfroming in coherent imaging that was recently developed by the PI [1]. The fundamental approach is based upon the physics of imaging with signals that are scattered from targets consisting of many randomly distributed scatters. The resulting alogrithmic methodology which will be refered to as the scaled Cross-Corelation Function (SCCF) algorithm provides a robust adaptive auto-focusing phase aberration correction algorithm for digitally sampled coherent imaging systems. The underlying fundamental ideas forming the basis of this discovery are far more reaching and should have broad application to inverse problems in coherent imaging such as coherent optics, Synthetic Aperture Radar (SAR), ultrasonics, somar, etc. <br\/><br\/>The initial effort will be directed towards medical ultrasound. Here extensive simulations will be performed for 1.5 and 2D dimensional transducer arrays to further develop, test and optimize the new adaptive beamforming methodolgy. These simulations require computer power beyond the capabilities of a single CPU workstation running MATLAB code. Code, either in C++ or Fortran 90, wil be developed to run these simulations on available multiprocessor super computing systems.<br\/><br\/>The full implementation of the new methodology, which has been shown in limited simulation tests to be substantially more robust than the Flax-O'Donnell [2,3] and the Rigby [4] beamsum algorithms, is computationally intensive as it requires the computation of N (N-1)=2 signal correlations for all focused cell in the ensemble of cells used to compute the covariance matrix. Here N represents the number of channels. This computation load is too extensive for today's existing ultrasound machines, although future generations systems will undoubtedly have these capabilities. The project effort will involve extensively testing of the suboptimal, less computationally intensive versions of the SCCF methodology that may be implementable with today's hardware. The project efforts will also consider conceptual extensions of the SCCF methodology to microwave, sonar, and optical imaging. Computer simulation testbeds will be developed for these different modalities for the purpose of developing and optimizing suitable adaptive algorithms for these disciplines. Adaptive beamforming in SAR is needed to equalize phase errors caused by unknown positioning errors of the transmit\/receive points (synthetic elements) in the synthetically generated array. The current techniques such as the phase gradient algorithm [23] searches for the brighest cell, and then solves for the aberrant phase using phase gradient based upon the nearest neighbor cross-correlation functions. This method is susceptible to image artifacts, persumanly caused by a combination of the instabilities inherent in a phase gradient method and the errors made using the approximation that the good phase in the brightest pixel can be neglected.","title":"SGER: Adaptive Beamforming for Spatial and Temporal Sampled Coherent Aperture Systems","awardID":"0109944","effectiveDate":"2001-04-15","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["186645"],"PO":["564898"]},"57704":{"abstract":"The goal of the proposed research is to develop a comprehensive <br\/>understanding of the spatial aspect of distributed computing in <br\/>mobile systems. Traditionally, events in a distributed computation <br\/>are ordered by time. Scalar and vector clocks are used to represent <br\/>logical time and causal dependencies. However, the mobility of nodes <br\/>injects a new spatial dimension into the problem. <br\/><br\/>The physical and network distances between nodes in a mobile<br\/>network are not correlated. Moreover, some wireless links in a mobile <br\/>network may be unidirectional. Hence, unlike physical distance, the <br\/>network distance between nodes is not a symmetric relation. Finally, <br\/>if requests of two mobile nodes are being prioritized on the basis of <br\/>their respective distances from a third (resource) node, their relative <br\/>priority can change with time. This is in contrast to the immutable <br\/>relative ordering of events based on time. Hence, if distance is one of <br\/>the criteria for ordering requests, existing solutions for problems <br\/>like mutual exclusion (using logical clocks) cannot be efficiently used <br\/>for resource allocation in mobile computing. <br\/><br\/>We will develop a new formal representation of the spatial-temporal<br\/>relationship between events in mobile computing. Space-time vectors are <br\/>a step in this direction. A theory for a possibly immutable ordering <br\/>of events based on their spatial-temporal coordinates will be developed. <br\/>Such an ordering of requests could be used for resource deadlock free, <br\/>starvation free and fair resource management. New protocols will be <br\/>developed at the MAC sub-layer enabling nodes to communicate using <br\/>unidirectional wireless links. We will develop new routing protocols that <br\/>utilize this MAC sub-layer protocol, and can correctly route packets<br\/>in a wireless mobile network with a combination of unidirectional and<br\/>bidirectional links.<br\/><br\/>Subsequently, the performance of these solutions will be evaluated<br\/>through simulation experiments and prototyping. Graduate and undergraduate <br\/>students will actively participate in every stage of the project.","title":"CAREER: Resource Management in Mobile ad hoc Networks - the Spatial Dimension","awardID":"0093411","effectiveDate":"2001-04-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["462892"],"PO":["565090"]},"57715":{"abstract":"EIA-0093486<br\/>Winfree, Erik<br\/>California Institute of Technology<br\/><br\/>PECASE: Foundations of Autonomous Biomolecular Computation<br\/><br\/>The project is developing autonomous, programmable biochemical systems that operate in a microscopic drop of liquid to achieve chemical tasks, such as nanostructure fabrication. Theoretical models of autonomous biomolecular computation to implement these models experimentally using DNA molecules, and to quantitatively characterize individual molecular logic components and the larger systems built from them are being performed. Beyond the specific context of DNA, this research is creating a prototype of autonomous biomolecular computing systems and explore fundamental robustness issues in nanoscale computing, such as cross-talk between species and stochastic events due to thermal noise and diffusion. The project is aiming to leverage their advanced control over biochemical systems to begin establishing a broader foundation for reliable molecular computing.<br\/><br\/>Two new courses are being developed introducing students to the necessary concepts and tools required to begin work in biomolecular computation. This research is establishing an experimental system for exploring computation by biological molecules, and is providing fundamental knowledge and principles for nanoscale computation, such as models of computation, molecular algorithms, physical limits, errors and error correction. Although biomolecular systems are massively parallel, asynchronous, stochastic, and hard to design, the PI is researching on new programming principles, leading to a science of molecular computation.","title":"PECASE: Foundations of Autonomous Biomolecular Computation","awardID":"0093486","effectiveDate":"2001-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["558957"],"PO":["297837"]},"57706":{"abstract":"This is the first year funding of a 5-year continuing award. Current core speech recognition technology is inadequate in several important situations, where high error rates often render the technology unusable. This project will advance the state of the art through use of graphical models, a relatively new statistical technique comprising formal methods for reasoning about random processes, and sets of algorithms for making probabilistic data-driven decisions in computationally efficient ways. All existing statistical techniques used in automatic speech recognition (and many more) appear to be representable using graphical models; no other known abstraction has such a property. The PI will design and build new freely available open-source software for speech recognition research and education. This infrastructure will provide the tools needed to successfully investigate different graphical-model based speech recognition algorithms, and will include tools for both computing with a specified model and for searching for new ones. The infrastructure will be used for curriculum development at the University of Washington (both at the graduate and undergraduate level), and will be released, along with course materials, on the Internet for free use by anyone.","title":"CAREER: A Graphical-Model Based Software Infrastructure for Speech Recognition Research and Education","awardID":"0093430","effectiveDate":"2001-04-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["508528"],"PO":["565215"]},"58938":{"abstract":"Wireless local area networks (WLANs) have the advantages of inexpensive network reconfiguration<br\/>and user mobility over wired local area networks. However, WLANs are so far limited to niche applications due to their low data rate and data rate uncertainty. There is a tremendous user demand for WLANs with higher data rates and international availability. This research addresses the challenges of meeting the user demand. This research combines theoretical algorithm development with real-time implementation in hardware. It fosters multidisciplinary research and development among researchers at the University<br\/>of Florida and the local industry as well as the technology transfer to the local industry.<br\/><br\/>The main objective of the research is the development and application of efficient and robust parameter estimation and symbol detection algorithms and their real time implementations for high data rate WLANs. The investigators devise and evaluate efficient and robust parameter estimation and symbol detection algorithms for Orthogonal Frequency Division Multiplexing (OFDM) based WLANs with one or more transmit<br\/>and receive antennas for both stationary and rapidly time-varying channels. The most effective algorithms are implemented efficiently in hardware in real time. The investigators study the tradeoffs of effectiveness, simplicity, computational complexity, and practical hardware implementation in real time.","title":"Algorithms and Implementations for OFDM Based Wireless LAN","awardID":"0097114","effectiveDate":"2001-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["554666","151889"],"PO":["348215"]},"60402":{"abstract":"The IEEE International Symposium on Information Theory (ISIT) is held yearly at sites alternating between the U.S. and abroad. The 2001 Symposium will be held at the Omni Shoreham Hotel in Washington, DC, USA on June 24-29, 2001.<br\/><br\/>This proposal requests support for the travel expenses of ISIT participants from the U.S., Russia and Eastern Europe. These participants would be individuals whose papers have been selected for presentation at the Symposium, but who lack funds and would not be able to attend without travel support. It is proposed that the co-chairs of the symposium, Thomas Fuja and Prakash Narayan make the awards. The total amount requested is $40,000, split equally between U.S. and non-U.S. Participants; this is based on 40 U.S. awards (averaging $500 apiece) and 15 foreign awards (averaging $1333 apiece).","title":"Travel Support for the 2001 IEEE International Symposium on Information Theory","awardID":"0101993","effectiveDate":"2001-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["561385","40607"],"PO":["188393"]},"61219":{"abstract":"EIA 0105186<br\/> Turner, Albert J. <br\/> Parrish, Edward A. <br\/>Association for Computing Machinery<br\/><br\/>Special Projects: Group Travel to 7th IFIP World Conference on Computers and Education (WCCE2001) <br\/><br\/>This proposal requests support to bring US participants to a major international conference on the use of information and communication technologies in education and on the teaching of computer science. The travel program will be administered jointly by the Association for Computing Machinery in association with the IEEE Computer Society.","title":"Special Projects: Group Travel to 7th IFIP World Conference on Computers and Education (WCCE'2001)","awardID":"0105186","effectiveDate":"2001-04-15","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[157442,157443],"PO":["289456"]}}