{"30838":{"abstract":"The auditory systems of humans and animals represent and process time-varying signals and make inferences on them. The acoustic energy from various sound sources impinges on our ears from different directions and the inner ears and the brain, together, seem to effortlessly separate them into independent recognizable streams. What kind of signal processing underlies this phenomenon? Is it possible to emulate this kind of processing in a computer and thereby improve machine-based speech recognition systems? This project constitutes a collaborative effort between auditory scientists and signal processing engineers to advance the state of the art in non-stationary signal analysis. Many of the existing non-stationary signal analysis methods such as time-frequency analyses are computationally complex and are not amenable to automatic feature extraction. On the other hand, various model-based signal analysis methods require detailed knowledge of the underlying signal generation mechanisms which is often not available. Taking cues from the initial stages of auditory processing, the investigators are developing an approach and associated signal processing algorithms for analyzing composite signals. Their approach to signal analysis is based on viewing signals as products of `elementary signals' rather than sums of sinusoidal signals as in traditional Fourier analysis. This view of signals is closely related to the theory of analytic functions. Thus, composite signals will be decomposed into component analytic signals which can be further decomposed into component analytic signals and so on. These signals are amenable to logarithmic processing and lead to a natural way of characterizing a time-varying signal interms of its positive instantaneous frequencies and log-envelopes. Overall the proposed approach is a non parametric way to characterize modulation properties of signals. This is to be contrasted with the traditional Fourier based methods where the emphasis is on po wer spectral analysis.","title":"Non-Stationary Signal Analysis Motivated by the Auditory System","awardID":"9804050","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["173322"],"PO":["564898"]},"28190":{"abstract":"This project investigators scheduling protocols for the transmission of multimedia traffic in a network. Specifically, the research covers the following areas: point to point transmission of general multimedia objectsthe support of multicast communications fault-tolerance. The goals of the project are the development of strong theoretical foundations for the study of such problems and subsequently finding protocols that perform well in practice.","title":"Scheduling Protocols for Networked Multi-Media Appplications","awardID":"9734927","effectiveDate":"1998-06-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["565251","534213"],"PO":["528421"]},"28094":{"abstract":"As society increasingly relies on distributed applications, it is ever more important that these applications tolerate partial failures. However, many users and developers are unwilling to sustain the costs in resources and performance that one pays today for building reliable applications. This research seeks to resolve the tension between the need for fault-tolerance and the costs traditionally associated with it. A new low-overhead approach to fault-tolerance, called lightweight fault-tolerance (LiFT), is investigated. The ideas at the core of LiFT are (1) to determine the information necessary to reproduce during recovery each non- deterministic event in a process execution, and (2) to guarantee that this information is available during recovery by efficiently replicating it in the volatile memory of a sufficient number of processes. LiFT has two main goals: (1) the development of low-overhead fault-tolerance techniques that encompass applications in which communication is through message-passing, shared memory, or any combination of the two. (2) the development of recovery protocols that guarantee at the same time good performance during failure-free executions, fast recovery, and fault- containment.","title":"Career: Lightweight Fault-Tolerance for Distributed Agents","awardID":"9734185","effectiveDate":"1998-06-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["466840"],"PO":["209879"]},"28141":{"abstract":"Existing restructuring compilers have been successful in detecting the parallelism of regular programs, i.e., codes with relatively simple access patterns that are statically (compile time) defined, by using current dependence tests and symbolic methods. Unfortunately, for more than 50% of programs the access pattern are either very complex or are completely undefined before execution. Examples of such \"cycle consuming\" applications are SPICE, DYNA-3D, GAUSSIAN, DMOL, CHARMM and FIDAP. As modeling techniques become more sophisticated, future large scale simulations will be mostly dynamic in nature, thus increasing the fraction of statically non-analyzable codes and therefore effectively decreasing the coverage of current compiler technology. Sparse, dynamic programs are fundamentally intractable through classic compile-time analysis techniques making parallelization or other optimizations impossible. This work will extend the coverage of current technology to dynamic programs by creating a framework that will complement static compilation with run--time analysis and optimization techniques. Application level programmable hardware for the acceleration of certain simple, repetitive operations will also be studied. Finally, an adaptive strategy in which static and run-time methods will be connected in an adaptive loop with hardware and software performance monitors and statistical databases will tune the application to its data during execution.","title":"Career: Adaptive Parallel Processing for Dynamic Applications","awardID":"9734471","effectiveDate":"1998-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["496841"],"PO":["551992"]},"28021":{"abstract":"This research seeks to provide a new framework to support distributed programs that access large amounts of data stored across millions of servers. The framework consists of two parts: a set of extensible modules to provide basic system services plus higher-level policies built on top of these modules to coordinate distributed data access. This research leverages this framework in the context of four key subsystems: (1) dynamic data replication to improve performance, improve reliability, and reduce the need for human management of storage, (2) extensible and scalable data consistency to coordinate data access across multiple nodes, (3) scalable location services for mobile objects to track where objects are stored in the dynamic replication framework, and (4) market-based distributed resource management to balance large numbers of applications competing for limited system resources. The impact of this research will be a better understanding of the fundamental mechanisms required by large-scale data systems and a set of techniques that will support new classes of data-intensive applications in this challenging environment. This project also places a heavy emphasis on modernizing the teaching of operating systems and distributed systems to give students the skills and experience they need to understand and build large-scale distributed systems.","title":"CAREER: Support for Data-Intensive Distributed Programs in Large Systems","awardID":"9733842","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["466839"],"PO":["209879"]},"27275":{"abstract":"An error bound for a problem is a bound on the distance from any point to the solution set by some error function evaluated at that point. There recently has been active interest in using error bounds to design and analyze solution methods for optimization and complementarity and variational inequality problems. One focus of this project is a continued study of this subject, but in new directions. In particular, the following problems are being studied: (i) error bounds for perturbations of linear\/nonlinear programs and complementarity problems, (ii) the use of error bound to implicitly identify active sets and obtain local superlinear convergence of methods under weaker assumptions than those existing, (iii) error bounds and their use in estimating the convergence ratio of Gauss- Seidel and Jacobi methods for infinite-dimensional convex minimization. A second focus of the project is the design and the analysis of solution methods for complementarity and related problems. In particular, these problems are being studied: (iv) branch-and- bound strategies for globalizing local methods for complementarity problems, (v) extension of interior path- following and non-interior methods and merit functions for complementarity problems to the semi-definite setting, i.e., in the space of symmetric real matrices. A third focus of the project is (vi) the development of epsilon- relaxation methods for multicommodity network flow problems and, more generally, linearly constrained minimization problems with separable convex costs. Computational study of the above methods is being conducted.","title":"Error Bounds and Algorithms for Complementarity and Related Problems","awardID":"9731273","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["408018"],"PO":["179846"]},"27176":{"abstract":"9730992 Key This award supports a three-year collaborative research project between Professor Jennifer Key, Department of Mathematical Sciences at Clemson University, and Professor Jamshid Moori, Department of Mathematics at the University of Natal in South Africa. The investigators will explore the possibilities for various classes of designs, especially those associated with good codes and finite geometrics with large automorphism groups. Professors Key and Moori will also study the links among the theories of designs, codes, and groups, especially the use of algebraic coding theory and group theory, in the investigation and classification of combinatorial designs, with a particular emphasis on designs and codes arising from finite geometrics. The proposed collaboration combines Professor Key's expertise in group theory and problems associated with the classification of designs and their codes with Professor Moori's expertise in the theory of finite groups and their representations. The Division of International Programs and the Division of Mathematical Sciences are jointly providing funding for this project.","title":"US-South Africa Cooperative Research: Codes, Designs, and Groups","awardID":"9730992","effectiveDate":"1998-06-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":[68510],"PO":["234240"]},"25054":{"abstract":"9724804 Wong This U.S.-Brazil award will support a research collaboration between Dr. Peter N. Wong of Bates College to work with Professor Daciberg Lima Goncalves at the Institute of Mathematics and Statistics of the University of Sao Paulo. Their research is on Nielsen coincidence theory on homogeneous spaces. This collaboration will unite five Nielsen theorists. In addition to Drs. Wong and Goncalves, the project will include Drs. Lucila Borsari, Pedro Fagundes and Fernanda Cardona of the University of Sao Paolo. The goal of this research is to explore different computable algebraic means for computing the Nielsen coincidence number. They propose to find algebraic conditions under which the Nielsen coincidence number and the Reidemeister coincidence number agree. ***","title":"U.S.-Brazil Cooperative Research: Nielsen Coincidence Theory on Homogeneous Spaces","awardID":"9724804","effectiveDate":"1998-06-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1267","name":"TOPOLOGY"}}],"PIcoPI":["457531"],"PO":["364861"]},"25221":{"abstract":"In this project, flexible and robust models for mobile radio channels will be created and used in the analysis of joint detection and decoding algorithms and for throughput optimization of multiuser wireless systems. The research has three closely related thrusts. In the first component, fundamental issues in estimation, equalization and modeling of multipath fading channels will be addressed. Accurate models will be selected for rapidly time-varying mobile radio channels, and the impact of the nature of propagation on estimating channel coefficients will be investigated. A performance comparison of robust channel estimation and adaptive equalization techniques will be carried out, taking into account issues arising due to error propagation. Robust diversity combining techniques will be developed. The other two directions will utilize channel modeling and estimation techniques developed in the first component of this project. Reliable low complexity detection methods for multiuser systems with error control coding will be the focus of the second component. Joint equalization, multiuser detection, and decoding will be addressed taking into account the effects of interleaving and error propagation. In the third component, the throughput of realistic wireless spread spectrum packet radio networks (PRNs) with multiuser detection will be evaluated. In this work, accurate channel models, reliable joint detection and decoding methods, and antenna diversity techniques will be utilized to optimize the throughput. Receiver complexity, the coding-spreading trade-off, and access schemes will be considered in this optimization. The","title":"Wireless Channel Characterization with Implications on Coding and Throughput Optimization for Multiuser Systems","awardID":"9725271","effectiveDate":"1998-06-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["451742"],"PO":["150411"]},"37387":{"abstract":"This project aims at developing a unified and integrated theory of implicit (i.e. machine independent) computational complexity, and applying it in programming languages, program design and development, and feasible mathematics. The project proposes that implicit computational complexity can be rooted in the spectrum of weak set existence (i.e. comprehension ) principles. By transfer principles, such as proof theoretic conservation, data ramification, Schoenfinkel-Curry-Howard morphisms, and boundedness, one obtains known and new characterizations of major computational complexity classes by methods of proof theory, function algebras, lambda calculi, and finite model theory. A unified implicit computational complexity theory would enable the development of software environments for program derivation and verification, which will assure that the computer programs produced are not only demonstrably correct, but can also be executed within feasible computation time and memory. Thus, the proposed work would bring abstract conceptualizations, rooted in philosophy, to bear on concrete applications of immediate technological value.","title":"Computational and Conceptual Complexities","awardID":"9870320","effectiveDate":"1998-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1268","name":"FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["157665"],"PO":["256494"]},"28136":{"abstract":"This research focuses on improving WWW proxy caching in order to sustain the continued growth of the Web on the Internet. Caching is one of the most important techniques that can be used to increase the salability of the Web. The research targets four major problems that currently plague Web caching systems: lack of strong cache consistency, no support for server control on cache accesses, inflexible caching algorithms, and poor performance. In order to solve these problems, this project will explore means to include strong cache consistency maintenance in WWW via lease-based invalidation protocols, active cache architecture that supports server-supplied processing upon cache access, Web caching strategies that adapt to network conditions and utilize the unique capabilities of large proxy caches to reduce network congestion, and high-performance scalable proxy architectures and cache sharing protocols. Combined, these efforts promise to qualitatively improve the scalability and availability of the Web, and to support the increasingly important role that the Web plays in our society. The educational activities include developing the mini-scale Internet emulator, nurturing the \"crash and burn\" lab, and other initiatives aimed at increasing the research involvement of undergraduate students.","title":"PECASE: WisWeb: Scalable, Consistent, High-Performance WWW Proxy Caching","awardID":"9734437","effectiveDate":"1998-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["94533"],"PO":["250083"]},"31590":{"abstract":"9806597<br\/>Schilling<br\/><br\/>The Gordon Conference on \"Research at High Pressure\", which will take place June 21-26, 1998, is one of the longest standing of all Gordon Conferences, having been first held in August 1955 at the site of the upcoming conference. The secret of this conference's vitality is that it has served as a forum for topics at the forefront of both static and shock-wave high-pressure research in many diverse areas, including Physics, Chemistry, Astrophysics, and the Geosciences. The topics of the upcoming conference include: Life under Extreme Conditions; Materials Synthesis at High Temperatures\/Pressures; Superconductivity under Extreme<br\/>Pressures; Properties of Hydrogen and Other Molecular Solids at Extreme Densities; Unsolved Questions in the Material Properties of Planetary Interiors; Volume Effects in Colossal Magnetoresistance Compounds; <br\/>Strongly Correlated Electron systems; Recent Developments in Geochemistry and Geophysics. The conference will include presentations from 23 distinguished invited speakers and more than 75 poster contributions.","title":"Gordon Research Conference \"Research at High Pressure\"","awardID":"9806597","effectiveDate":"1998-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1574","name":"GEOPHYSICS"}}],"PIcoPI":["244179","480021"],"PO":["563232"]},"28104":{"abstract":"This project explores the use of physically secure coprocessors and cryptographic techniques to solve the remote execution problem. This is exemplified by issues arising from mobile code, e.g., active network capsules and mobile software agents that autonomously move among servers. The primary focus of this project is on mobile agent systems. Remote execution exemplifies mutual distrust: not only must the servers be protected from potentially malicious agents, but agents must also be protected from potentially malicious servers. This latter agent security problem is much harder, since without a trusted computing base at the serve (1) the agents have no guarantee that they will actually run at all once they arrive there, and (2) agents cannot keep any secrets (e.g., cryptographic keys) from the server. The objective of this work is to resolve the agent security problem and explore the security engineering issues involved in building a mobile agent system. To achieve protection from hostile servers, this project will explore using secure coprocessors to provide a secure execution environment, a \"sanctuary\", within the server. Additionally, cryptographic techniques such as Perfect Forward Integrity and other new schemes will be developed to enhance the security of agents when no sanctuary servers are available.","title":"Career: Computer Security Engineering","awardID":"9734243","effectiveDate":"1998-06-15","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[70749],"PO":["209879"]},"27841":{"abstract":"This award supports the development of a theory of coordination by means of examining the interactions of various organizational styles with the environmental characteristics of different problem domains. Organizational styles can be operationalized as sets of coordination mechanisms that enforce certain behaviors as part of the style. However, not all coordination behavior arises from abstract organizational styles; much arises from standard responses to specific environmental (problem domain) characteristics. This research aims to extend environment and organization models, represent standard responses to common environmental problems, and develop operational specifications for organizational styles. This allows the interactions between environmental constraints and organizational styles to be reasoned about analytically. Designers are not doomed to create coordinated systems with only a few simple organizational behaviors and large numbers of brittle domain-specific coordination heuristics. Instead, given good environment models and certain other constraints (often dictated by existing human organizations), desiginers can make principled choices of computational organizations and standard environment-influenced coordination behaviors. This project will result in a much richer set of tools for building and analyzing both multi-agent computer systems and integrating such systems with existing human organizations in applications such as distributed information gathering, distributed scheduling, and concurrent engineering. http:\/\/www.cis.udel.edu\/~decker\/research\/organizations.html","title":"CAREER: Coordination: Intergrating Organizational Style with Environmental Characteristics","awardID":"9733004","effectiveDate":"1998-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["147773"],"PO":["495796"]},"34177":{"abstract":"9814104 The Federal Communications Commission recently allocated three 100 MHz bands of radio spectrum for the Unlicensed National Information Infrastructure (U-NII), with only minimal controls on radio emissions. This unprecedented release of unlicensed spectrum provides fertile ground for technical research on coexisting systems in a wireless \"ecology\" and raises interesting policy issues which must be addressed if the U-NII is to become all it's envisioned to be. The WINLAB Focus '98 on the U-NII is to provide a forum for discussion of a broad U-NII research agenda for both technologists and policy makers. It is also intended to provide an introduction to those with an interest in this new and exciting field.***","title":"A Workshop to Study Peaceful Coexistence in the Unlicensed National Information Infrastructure; June 21-23, l998; Long Branch, New Jersey","awardID":"9814104","effectiveDate":"1998-06-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["142722","466323","258464"],"PO":["223414"]},"27434":{"abstract":"9731783 Potts, Joseph Cukor, Peter GTE Laboratories Inc. REU: Computer and Telecommunications Research for Undergraduates This Research Experiences for Undergraduates (REU) Site project provides partial support for fifteen students per year in programs carried out during the summers, for three years. Students are selected from a nation-wide applicant pool and work with a member of the GTE Laboratories technical staff on a project in the area of computer, information and telecommunications networks. The student projects are aimed at solving real life industrial problems and thus provide most program participants with a new type of experience. Requirements include both oral and written reports. University faculty members play an important role in the selection of participants and in administration of the program. Strong efforts are made to recruit women and minority students.","title":"REU: Computer and Telecommunications Research for Undergraduates","awardID":"9731783","effectiveDate":"1998-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[69182,69183],"PO":["329035"]},"37488":{"abstract":"This is a two year accomplishment based renewal of award ANI-9415552 to improve TCP to operate at the much higher speeds than those for which it was originally designed. The research continues to focus on congestion behavior including TCP transient dynamics, differentiated services, autotuning, TCP clocking and Internet measurement and diagnosis.","title":"TCP Enhancements to Support High Performance Applications","awardID":"9870758","effectiveDate":"1998-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["459054",94844,"560044"],"PO":["198445"]},"27831":{"abstract":"Error control coding has become an integral part of almost every digital communication system . The objective of this proposal is to investigate several important problems in coding and to establish teaching plans to develop competent engineers and scientists for the fast changing area of digital communications. The proposed research includes three inter-related areas: (1) soft-decision decoding of linear codes; (2) turbo decoding; and (3) coded modulation for unequal error protection (UEP) applications. The first research area is composed of two parts. In the first part, a new unified analytical approach which lets us tightly bound the error performance of many reliability-based algorithms at practical SNR is to be investigated. Although numerous such algorithms have been proposed for more than 30 years, no such bound exists yet. In the second part of (1),it is proposed to devise efficient soft decision decoding schemes for long powerful block codes with reduced decoding complexity. No existing algorithm can decode such codes without a tremendous computational effort. In area (2), it is proposed to reduce the delay associated with turbo decoding. This long decoding delay prevents the use of turbo-codes in real time communication systems despite their astonishing error performance at very low SNR values. Finally, it is proposed to devise coded modulation schemes with UEP applications based on conventional signal constellations. Very few such schemes have been proposed despite the increasing demand of coding schemes able to adapt to different channel conditions, such as satellite broadcasting for HDTV. The second part of this proposal concerns the teaching plans of the PI. Based on the principle that students are the primary reason most electrical engineering programs exist in universities, the PI's teaching main goal is to develop students into engineers and scientists who will be able to make significant contributions to the development of data communicatio n systems. Also, the particular geographical and cultural situations of the University of Hawaii with respect to other US-mainland universities are considered.","title":"CAREER: Near-Optimum Low-Complexity Soft Decision Decoding of Linear Codes","awardID":"9732959","effectiveDate":"1998-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["328464"],"PO":["188393"]},"26698":{"abstract":"Columbia College requested support from NSF to connect three remote campus sites to the Internet. These campus sites are located in Lake County, IL, Kansas City, MO and Aurora, CO. The sites will be connected through the Missouri Research and Education Network (MOREnet). Combined, these campuses have an enrollment of over 1000 students. The campuses needs the Internet connection to be able to access information resources throughout the faculty, staff students of these institutions as well as the community in general. The award provides partial support of the project for two years.","title":"Columbia College Site Wide Area Networking, Phase II","awardID":"9729682","effectiveDate":"1998-06-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67221],"PO":["198445"]},"28106":{"abstract":"With the anticipated ability to build chips containing one billion transistors, a larger amount of memory and functionality may be available on a single chip. One challenge is how to manage and configure all these resources for optimal performance and power dissipation. This research explores the problem of determining optimal use of all available resources on chip on an application by application basis. Where reconfigurable logic is available for use (either on chip or off) synthesis tools can be used to determine optimal hardware\/software partitioning of the application as well as to architecturally synthesize the hardware portions onto reconfigurable logic. Tools are being developed to produce high-performance power-conscious designs. Various applications are being explored to determine the effectiveness of these tools. The applications are being run on reconfigurable computing platforms designed at Brown's computer engineering laboratory. The topics of low-power and high-performance computer design, and advanced computer architecture design are being introduced to the curriculum via new courses and the modification of existing ones. Approaches to advising and mentoring students at levels from pre-college to graduate are being developed. Emphasis is in mentoring and outreach services to young women just entering a career in science or engineering.","title":"CAREER: (Re)Configuring Architectures for High Performance and Low Power","awardID":"9734247","effectiveDate":"1998-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550256"],"PO":["562984"]},"30295":{"abstract":"9702556 Griffeath This award provides funds to partially support a workshop on cellular automata theory to be held at the Santa Fe Institute. The purpose of the workshop is to bring together researchers from different disciplines to help foster the development of rigorous results in cellular automata. The workshop will focus on three active areas of cellular automata research: shape and interface theory, constructive analysis of Conway's Life, and algorithmic complexity of elementary cellular automata.","title":"Workshop on Constructive Methods in Cellular Automata Theory","awardID":"9802556","effectiveDate":"1998-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1287","name":"MATHEMATICAL PHYSICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["183139"],"PO":["517169"]},"25588":{"abstract":"We propose a new paradigm for system design in which the algorithm and circuit implementations are jointly designed to achieve high-performance while minimizing average power consumption. We propose to drive the research using a case study of an adaptive equalizer\/decoder where both algorithm selection and asynchronous hardware design will be tackled using a Minimum Average Complexity (MAC) approach. In particular, we will develop a detailed asynchronous design of representative components of a MAC optimized mobile radio receiver, variable complexity algorithms for joint adaptive equalization and decoding, a characterization of the average computational load of these algorithms for a typical mobile user, general procedures for MAC algorithm optimization, an architecture for the new algorithms and a quantitative estimate of the power savings relative to a standard design.","title":"Challenges in CISE: Algorithm and Implementation Co-Design for Optimizing Average Complexity\/Performance: A Case-Study in High-Performance Low-Power Mobile Multimedia Comm. Design","awardID":"9726391","effectiveDate":"1998-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2882","name":"CISE CHALLENGES"}}],"PIcoPI":["451991","485748","257944"],"PO":["150411"]},"21353":{"abstract":"Douglas 9707040 The investigator begins a study of multigrid methods for computers whose performance is highly dependent on the cache utilization. The project includes both algorithm development and realizations in code. For structured problems in two dimensions, effective new algorithms can be devised. For general, unstructured problems in either two or three dimensions, this is much harder and requires a completely different approach. Two approaches are planned. One is based on localizing graph connections of a sparse matrix associated with the grid based problem. A second is based on a software tool that re-orders the computation at run time to use the cache efficiently. In addition, the investigator develops new nonlinear multigrid algorithms that can robustly solve real applications. A new methodology is developed to coarsen adaptively refined grids for problems in which current algorithms fail to converge. Real world simulations of complex science and engineering problems like climate, ocean, petroleum reservoir, and pollutant tracking modeling require enormous amounts of computer time. Computers today have separate memory modules that run at vastly different speeds. Normally, programs run at the speed of the slowest memory in a computer. The investigator examines how to use the faster memory modules instead of the slowest memory for the solvers needed to run complex problems much faster.","title":"Linear and Nonlinear Multigrid Methods on Cache Based Parallel and Serial Computers with Applications","awardID":"9707040","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["495104"],"PO":["562372"]},"27833":{"abstract":"In this project we investigate the design and performance of advanced digital receivers for use in multiple access communications networks, where a potentially large number of simultaneous users share a common transmission environment. The receivers we study apply iterative soft information processing, which has proven very effective and efficient in the decoding of so-called \"turbo\" codes. Our receivers integrate error control decoding and multiple access interference resolution to achieve maximum performance. We study the fundamental theoretical limits of various multiple access strategies, including code-division multiple access (CDMA), and design receivers aimed at approaching these limits as closely as possible under a given computational complexity constraint. The theoretical as well as the implementation complexity of these receivers is studied carefully, and hardware implementations are proposed and evaluated. The goal is to design and verify efficient joint receivers for multiple access systems. We also study the interaction of the proposed receivers with higher level communication protocol layers, particularly the operation of these receivers in packet oriented networks with their unique requirements","title":"CAREER: Iterative Decoders for Multiple Access Communication Systems","awardID":"9732962","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["118411"],"PO":["188393"]},"27965":{"abstract":"9733588 Tian This research project combines software reliability engineering and software measurement to develop an integrated approach to early measurement and improvement of software reliability. Key research activities include: 1) Integrating research findings in software reliability engineering and software measurement to assess and improve software quality over extended development phases and application domains. 2) Developing analysis techniques and tools to effectively analyze diverse measurement data. 3) Practical implementation of this integrated approach and adaptation of it to a wide variety of software development environments in collaboration with several industrial partners. (4) Developing or enhancing several graduate and undergraduate level courses in software engineering and computer science. The key benefits of this research project include: (1) a systematic technique to measure software quality early in development and to identify early problems for effective quality improvement, (2) construction of support tools that can help the implementation and deployment of these techniques in industry, and (3) educational opportunities for students to work on leading edge research projects that solve practical problems. ***","title":"CAREER: Techniques and Tools for Early Measurement and Improvement of Software Reliability","awardID":"9733588","effectiveDate":"1998-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["491097"],"PO":["564388"]},"27448":{"abstract":"The goal of this project is to study both practical and theoretical aspects surrounding the application and implementation of algorithms for computing stationary probabilities and analyzing transient behavior of discrete Markov chains. One facet of the research is dedicated to applications of discrete models for understanding and analyzing the dynamics of large systems comprised of collections of loosely coupled subsystems such as in the study of queuing models and networks, telecommunications, computer performance evaluation, stochastic automata networks, economic and biological forecasting, and flexible manufacturing systems. Special attention is devoted to making Markov chain technology widely available to researchers in diverse areas. Specific research objectives include the following aims. (1) The project seeks to relate properties of specific Markov chain models to characteristics of numerical algorithms with the goal of devising a sieve from which the most appropriate algorithm and implementation for a given application can be extracted. (2) Another objective is to develop both theoretical and numerical mechanisms to facilitate the determination or estimation of stationary probabilities of large-scale finite Markov chains by utilizing a variety of aggregation\/disaggregation methods. A specific goal is to formulate a comprehensive theory of errors which can simplify and unify the analysis of a broad range of aggregation\/disaggregation processes and algorithms. (3) The project seeks to develop practical preconditioning techniques for iterative algorithms which can be applied to Markov models which are formulated as stochastic automata networks. (4) A final objective is to develop a comprehensive software package which provides access to sophisticated computational tools for Markov modeling. The goal is to structure the package for researchers in applications areas who do not want to be diverted by or become immersed in technical numerical analysis details.","title":"Computational Methods In Markov Chains","awardID":"9731856","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["200721","221311"],"PO":["179846"]},"25039":{"abstract":"This three-year award supports US-France cooperative research aimed at the development of a suite of computing protocols that can be used to build high performance and fault-tolerant services for computer applications. The collaboration involves Mustaque Ahamad at the Georgia Institute of Technology and Michel Raynal of the University of Rennes and the French National Institute for Research in Informatics and Applied Mathematics (INRIA). They propose to explore fundamental techniques in support of highly interactive and dynamic applications, and interactions among widely distributed users. Their research will focus on the characterizations of consistency criteria useful for distributed services and scalable implementations. The US investigator brings to this collaboration expertise in distributed shared memories and management of fault-tolerant access to computers. This is complemented by French expertise in theoretical and applied distributed computing.","title":"U.S.-France (INRIA) Cooperative Research: Architectures for Scalable Distributed Services","awardID":"9724774","effectiveDate":"1998-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["549757"],"PO":["323582"]},"29649":{"abstract":"This research will develop a framework for the rapid detection, location, and identification of visual targets in unconstrained real world domains. This framework will lead to algorithms which can be implemented on portable computers with video input with the goal of being used, for example, to enable the blind\/visually impaired to navigate in real world scenes. These requirements mean that the algorithms must be extremely efficient at extracting information from the input images. The approach will use statistical analysis of the targets and background, taking into account variations due to illumination and viewpoint variations, to determine probabilistic models for the appearance of the target and background. From these models, sets of tests and groups of tests will be determined. These tests will be designed to be maximally informative, based on statistical measures of errors rates such as Chernoff Information, and to lead to fast implementations on portable PC's. The search strategy is based on the intuition of picking tests which maximize the expected gain in information about the target hypothesis. In practical problems, however, it will not always be possible to compute these expected information gains in real time. Therefore the search strategy will make use of a more general formulation in terms of A algorithms where the search is guided by a heuristics taylored to the application domain. Expected information is one possible heuristic but there are many others which are more easily computable and which can still give provable convergence to the optimal solution.","title":"Automated Detection of Informational Signs and Hazardous Objects: Visual Aids for the Blind","awardID":"9800670","effectiveDate":"1998-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["549461"],"PO":["179262"]},"26602":{"abstract":"This research is on hierarchical and symbolic test generation and design for testability techniques for core- based systems. The system can be a combination of soft, firm and hard cores. In the case of untestable soft cores, hierarchical testability techniques are being applied to make them testable. Also techniques of adding hardware so the cores are functionally transparent and can propagate test data without information loss are being developed. The approach is to integrate testable and transparent cores to ensure justification of precomputed test sequences. This test generation approach is independent of the bit-width of the cores. The case of firm and hard cores which have testability features built into them by core providers is also being explored. Approaches here include: using information supplied by the core vendor; use of in-built testability features; and providing transparency through glue logic outside the core.","title":"Hierarchical Test Generation and Design For Testability of Core-Based Systems","awardID":"9729441","effectiveDate":"1998-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550002"],"PO":["564898"]},"27604":{"abstract":"Variational problems arise as a natural consequence of modeling the physical world. Stretching an elastic membrane or bending a piece of metal can be mathematically described as a minimization problem. Perhaps the simplest example of this idea is the \"spline.\" Originally, a spline was a drafting tool consisting of a long, thin piece of wood that could be clamped to drafting table at certain fixed points. Since the deformed wood naturally assumed a minimum energy state, tracing its length produced a smooth curve. In the 1950's, mathematicians redefined a spline as the mathematical solution to the following problem: Find a smooth function F(t) such that the \"bending energy\" of F(t) is minimized subject to the constraint that F(t) interpolates user-specified values at the integers (the spline's knots). The space of functions that minimizes this problem is the natural cubic splines. In the 1970's, Lane and Riesenfeld discovered that cubic splines can also be expressed as the limit of a sequence of functions, each related by a simple averaging rule. This averaging process, known as subdivision, is an increasingly popular modeling technique in geometric design. In recent work, the PI has shown that the solution process to a wide range of variational problems can be expressed concisely as a subdivision scheme. This project investigates application of this approach to three important topics: - Subdivision rules for thin-plate splines - Fast numerical solution of variational problems - Creation of splines with local knot insertion rules","title":"Subdivision Methods for Variational Problems","awardID":"9732344","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["551026"],"PO":["179846"]},"34028":{"abstract":"The goal of this research project is to explore the applicability of advanced signal processing techniques to certain problems arising in natural language text processing. Specifically, we seek to evaluate the effectiveness of using multiple hypothesis tracking concepts, originally developed for radar target tracking applications, to the problem of correlating text-based messages over time. A key concept in this project involves treating a natural language message or statement as a sensor report. Such a text message, M, is regarded as a random variable that is related to the underlying truth of a system's state, S, through joint and conditional probabilities, p(M|S), p(S|M), and p(S, M). For example, p(S|M) is the probability that the true system state is S given that an observation, M in text form, has been reported. The tracking problem is to estimate the most likely sequence of states Stl, St2, ..., Stk given a sequence of text-based observations, Mtl, Mt2,..., Mtk, of those unknown states. Formulated as a maximum likelihood estimation problem, this can be solved using standard recursive estimation methods including Viterbi's algorithm.","title":"Text-Based Signal Processing","awardID":"9813744","effectiveDate":"1998-06-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["96339"],"PO":["564898"]},"27869":{"abstract":"Reversible Cellular Automata (RCA) are locally computed parallel one-to-one mappings of cellular space onto itself. They provide a solid theoretical model for massively parallel non-dissipative computation. This project investigates the theory of RCA and closely related Quantum Cellular Automata (QCA), and introduces new applications in image compression and cryptography. The main theoretical goal is to understand the structure of RCA and find new representations of RCA in terms of simple local operations. The representations should allow easy generation of new RCA rules that can be used in the applications. Most useful representations are ones that allow desired properties to be programmed directly into the RCA. Quantum CA are generalizations of RCA. The first goal is to find a correct definition of QCA in the sense that it is realizable in the actual physical world with quantum interactions. The definition should be also general enough to allow implementations of arbitrary quantum algorithms. Then the relation between QCA and homogeneous arrays of finite quantum gates will be determined. Image compression applications arise from analogy to subband coding. Reversible Cellular Automata are interpreted as non-linear versions of perfect reconstruction filter banks. Energy compaction by linear transforms is replaced by the idea of information compaction by RCA. The new compression techniques will be most suitable for efficient lossless compression but also lossy image compression applications are considered. In addition, analogy to RCA theory provides new insight into the theory of higher dimensional filter banks. In cryptography the project continues investigating the feasibility and security of RCA based cryptosystems. Applications to image compression and cryptography, together with related results on finite automata in fractal image generation and compression will be introduced to the computer science curriculum through standard computation theory cou rses. They provide practical examples of how automata theory can be useful in seemingly unrelated fields, and increase student motivation to study challenging theoretical concepts. A new graduate course and seminar on image compression will be developed with emphasis on algorithmic aspects of compression in addition to the traditional signal processing approach.","title":"Career: Theory and Applications of Reversible Cellular Automata","awardID":"9733101","effectiveDate":"1998-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[70278],"PO":["543507"]},"30784":{"abstract":"9803876 Change propagation is a key part of software maintenance and evolution. The change starts with the programmer changing a component of software. After the change, the component may no longer fit with the rest of the software, because it may no longer provide what the other components require, or it may now require different services from the other components. In order to reintroduce the consistency into software, the programmer must keep track of inconsistencies and the locations where the secondary changes are to be made. The secondary changes, however, may introduce new inconsistencies, etc. The process continues until all inconsistencies are removed. The formal model of change propagation is based on graph rewriting. It covers specific scenarios, including strict change-and-fix, random change-and- fix, and top-down. The research includes development of a prototype tool based on the formalism, which keeps track of the remaining inconsistencies in software, and marks the components to be updated. The validation of both the formal model and the tool will be done by a case study. The results of the case study will serve as a feedback, and will be projected into both the model and the prototype tool.***","title":"A Model and a Tool for Change Propagation in Software","awardID":"9803876","effectiveDate":"1998-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["374749"],"PO":["150697"]},"31334":{"abstract":"9805693 Bhargava, Bharat Purdue University CISE PostDoc: Experiments in Adaptable Communication Services This research project will develop innovative adaptability mechanisms in communication software and conduct experiments to evaluate their impact on quality of service (QoS) available to emerging applications such as video conferencing and multimedia\/digital library. Focusing on adaptability in active networks (for flexible control of services), transmission scheme (for reliability), and anomaly management (for bandwidth constraint, etc.); the project will also provide training to a Postdoctoral Associate, while considering both wide area networks and mobile networks. Two directions constitute the main thrust. The first aims towards extending the infrastructure for experimenting with adaptable communication services. The second conducts a series of experiments that evaluate a variety of adaptability schemes. Two sample experiments explore Feasibility of Active Techniques in Adaptability and Re-transmission Scheme and its Effect on Reliability. Since Raid Laboratory has an infrastructure for experiments in adaptability, communication, and video conferencing, these experiments are conducted there. The experiments, along with necessary software tools, will be designed by the postdoc; thus significantly increasing both the quality and variety of experiments that are planned and the system support for the Ph.D theses of graduate students. This research can make emerging applications to run at top efficiency and optimize network resources.","title":"CISE PostDoc: Experiments in Adaptable Communication Services","awardID":"9805693","effectiveDate":"1998-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["540775"],"PO":["564318"]},"33865":{"abstract":"This award provides partial support for a cluster of eight workshops centered around automated learning and decision making based on data. The meeting is held at Carnegie Mellon University on June 11-13, 1998. It covers scientific research at the intersection of statistics, computer science, artificial intelligence, databases, social sciences and language technologies. The aim of this meeting is to initiate a dialogue between these disciplines. By doing do, it seeks to attain two types of impacts. First, it aims to generate synergy between previously separated fields, to lead to new, cross-disciplinary research collaborations and new, unified research approaches. Second, it attempts to provide guidance to the scientific community by characterizing the state-of-the-art, pointing out possible overlaps, making people aware of research results in other fields, and identifying some of the most promising cross-disciplinary research directions. One of the results of this meeting will be a written report, which will be made available to NSF and the scientific community at large, by posting it on the Web, and by submitting it to a widely accessible magazine or journal.","title":"Workshop on Automated Learning and Discovery","awardID":"9813354","effectiveDate":"1998-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["353783","548220","532936","533288"],"PO":["565227"]},"30048":{"abstract":"Traditional libraries have developed sophisticated tools for abstracting and cataloging their contents, allowing users to find information efficiently. The flood of digital information that is now available via the Internet and other technologies has overwhelmed these tools, and created an urgent need for new methods. Geographic location is one basis for organizing information that has been underexploited in the traditional library, but is much more practical in the digital world. A geolibrary is a library filled with georeferenced information and accessed using geographic location as the primary key. The full power of the geolibrary lies in its ability to provide access to types of information not normally found in libraries. The project entails a workshop to (1) develop a vision of geolibraries for organizing information resources using spatial reference and search mechanisms; (2) identify the research and policy issues associated with the development of distributed geolibraries; and (3) facilitate greater collaboration between various research and technology development projects related to geolibraries. Participants will be drawn from the disciplines of information and library science, computer science, geography, and related fields. They include participants who have had experience in building parts of the geolibrary, and others who can place its problems within broader scientific contexts. The project will result in an Academy report which will be widely distributed both in conventional form and on the Internet. The report will describe the vision of the geolibrary, its current practicality, and the research and development that will be needed to make it a reality. http:\/\/www2.nas.edu\/besr\/230a.html","title":"Workshop on Distributed Geolibraries: Spatial Information Resources","awardID":"9801753","effectiveDate":"1998-06-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1352","name":"GEOGRAPHY AND SPATIAL SCIENCES"}}],"PIcoPI":[75856],"PO":["563751"]},"27959":{"abstract":"9733569 More than ever, society relies on software systems that operate correctly. Modifying software systems to insure their reliability poses major technical and economic challenges. The difficulties that face software engineers include absent or incorrect documentation, poorly structured code, and the effort required to understand handed-down systems. To maintain software, one must recover, understand, correct, and maintain the design-level structure of the software. The goal of this research is to develop techniques and implement tools to simplify software maintenance. The proposed tools support three activities: first, design recovery to extract structural information from systems; second, design visualization to facilitate the viewing of recovered software structures; third, design maintenance to determine the quality of designs, identify problematic areas, measure the impact of software modifications, and so on. Central to our design maintenance approach is a formalism for specifying constraints on software structures. From these specifications, the design maintenance tools are automatically generated to detect violations of such constraints. Currently, in the absense of such tools, designers have difficulty preserving the structural integrity of systems that undergo continuous modification. The outcome of this work should benefit software practitioners and inspire educators to integrate software maintenance techniques and tools into their curricula.***","title":"CAREER: Toward a Design Environment for Recovering and Maintaining the Structure of Software Systems","awardID":"9733569","effectiveDate":"1998-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["521625"],"PO":["564388"]},"30786":{"abstract":"9803880 Productivity benefits and quality improvement have come about as a result of designing and implementing software at ever higher levels of abstraction. So called \"executable specifications\"-high level functional descriptions of software-represent the current state of language development for software design. However, software is rarely implemented by directly translating such specifications, as the performance of the resulting product is usually poor. To remedy the performance problem without requiring human effort to reprogram a specification as an implementation, the use of program transformation has often been suggested, rewriting the specification according to rules that preserve its meaning but change its form. The technology of transformational improvement has made progress over a span of twenty years. Several functional language compilers now achieve substantial performance gains through the use of source-language transformations. Many improvements remain to be made, however. This research will build on recent and promising results that improve the performance of recursively defined functions by applying transformations based upon their underlying mathematics. Prototype systems have shown the potential of some of these methods, but these systems have never been fully implemented, integrated, or tested. In particular, this research will integrate a variety of known techniques that are expected to work more powerfully in concert than individually. In this project, a prototype transformation system will be extended so that it can be applied to programs written in a core subset of the programming language Standard ML, as well as in CAML, an ML dialect widely used in Europe. The research will help to determine whether high-level transformations can be effective enough in improving the performance of high-level specifications that software designers might quit worrying about many details of programming.***","title":"Refining Program Specifications by Automatic Transformation","awardID":"9803880","effectiveDate":"1998-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["40586","551061"],"PO":["150697"]},"23802":{"abstract":"PI: John Tucker Proposal Number: DMS 9714380 Project: Statistical Methods in Computational Modeling and Virtual Experiments Abstract: The Committee on Applied and Theoretical Statistics (CATS) will convene a multidisciplinary study panel on statistical methods in computational modeling and virtual experiments. The panel will recommend sound methods for identifying and quantifying uncertainties that arise in simulation experiments. The panel will develop recommendations for improved and, where necessary, new statistical methods and data analysis techniques for use in simulation modeling and virtual experiments. It will also recommend appropriate statistical methods to assist practitioners in their use of experimental data when validating simulation models or assessing model fit and predictive performance. These recommendations will address modeling and simulation limitations associated with ever increasingly complex systems. The panel's report will provide examples to illustrate the complexity of evaluating model combinations that arise from varying assumptions, parameters, and initial conditions within the models, will point out possible approaches for addressing those complexities from existing experimental design techniques, and will highlight areas needing further research. Experts may be consulted from the communities concerned with computer simulation, discrete events systems, and dynamic systems modeling, and any other scientists, researchers, or engineers with significant technology or methodology to contribute. A National Research Council panel of experts will examine the state-of-the-art for statistical methods used in computer simulation and modeling, and computational experimentation. This is needed because of an ever-growing dependence upon these kinds of simulations and \"virtual\" experiments in designing and evaluating such complicated devices and systems as semiconductors, automobiles, aircraft, spacecraft, or in very complex application areas such as transportation networks, government intelligence, and battlefield scenarios. The study will address how modeling and simulation tools can be developed with the robustness and reliability to handle the demands of emerging intelligence, domestic, and military technology. It will also look at limitations on modeling and simulation with respect to these increasingly complex systems.","title":"Statistical Methods in Computational Modeling and Virtual Experiments","awardID":"9714380","effectiveDate":"1998-06-01","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["244065"],"PO":["331535"]},"32327":{"abstract":"9809120 Blumenthal, Marjory National Academy of Sciences Special Project: Computing and Communications Research to Enable Better Use of Information Technology in Government This two-year award totaling $550,500 will support three workshops exploring the possible application of research and development to the arena of Federal information services. Two communities who do not normally converse, academic researchers and Federal managers, will be asked to work together to identify the technical hurdles and possible research directions which might be applied in surmounting those hurdles. Focus of the first two workshops will be on the domains of crisis management and Federal statistics, with the final workshop addressing the broad area of Federal information services in general.","title":"Special Project: Computing and Communications Research to Enable Better Use of Information Technology in Government","awardID":"9809120","effectiveDate":"1998-06-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0403","name":"Division of SCIENCE RESOURCES","abbr":"NCSE"},"pgm":{"id":"8806","name":"INFO & TECHNOLOGY SVCES PRGM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"Y563","name":"NASA-DIGITAL GOVERNMENT INITAT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1333","name":"METHOD, MEASURE & STATS"}}],"PIcoPI":["234699"],"PO":["329035"]},"31018":{"abstract":"9804736 There is a serious need for effective formal methods to construct correct computer programs. This need becomes crucial for reactive systems associated with many safety critical or economically vital applications, such as computer network communication protocols or air traffic control systems. One promising approach centers around the use of Temporal Logic, a logical formalism for describing change over time. Purely manual temporal reasoning seems infeasible for large-scale reactive systems. The goal of this research is to make verification of reactive systems as automated as possible. Automated verification is more reliable than manual verification. It is also more likely to be of industrial utility, as it is possible to offer fully automated push-button verification and debugging tools. The basic idea is that certain problems associated with (propositional) Temporal Logic are decidable, in some cases efficiently. These include the model checking problem (Is a program's global state graph a model of Temporal Logic specification ?). This research investigates, the following key technical issues: (i) Amelioration of the state explosion problem in model checking; (ii) Reasoning about many homogeneous processes; (iii) Development of a modular Research Model Checker; and (vi) Efficient program synthesis.***","title":"Automated Formal Methods","awardID":"9804736","effectiveDate":"1998-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["184167"],"PO":["397849"]},"31724":{"abstract":"9807061 Grosch, Herbert Unaffiliated Individual Special Project: Chronicle of Early Datamation Magazine This project provides partial support for the PI to develop a chronicle of early issues (for up to twenty years from its inception in 1957) of the magazine DATAMATION, one of the most important sources of information about computer hardware, software, the community of users and installations, conferences, and user group meetings in those early years of computing. The PI will review every issue page by page and item by item, and construct a chronicle of the events of those decades, drawing on his personal and unique acquaintance with the publication and his involvement in the events and the people described. Cumulations of the work will be issued every six months on CD\/ROM or DVD discs and the work will be announced in the Annals of the History of Computing and other appropriate publications.","title":"Special Project: Chronicle of Early Datamation Magazine","awardID":"9807061","effectiveDate":"1998-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["175531"],"PO":["329035"]},"30767":{"abstract":"9803843 This project investigates formal methods for programming object- oriented (OO) software components. The goals are to produce: (a) theoretical foundations to support careful reasoning about such components, and (b) expressive behavioral interface specification languages (BISLs) that are able to substitute for the source code of such components. Foundational issues for goal (a) include the model theory and proof theory of abstract data types with mutable objects, subtyping, aliasing, and message passing. The model theory of our previous work is extended to account for nondeterminism and higher-order procedures. In proof theory, equational reasoning techniques for reasoning about immutable objects are sought. These results are to be connected with verification logics for OO languages with the new feature of multimethods. Goal (b) helps vendors explain OO class libraries and frameworks to customers without giving them source code, which cannot be done with existing BISLs. This project provides: guidance for the design of more expressive OO specification languages, ideas for use in documentation of OO class libraries and frameworks, and expressive notations for specification. Software engineers will also benefit from more expressive BISLs and the ideas about reasoning.***","title":"Formal Methods for Multimethod Software Components","awardID":"9803843","effectiveDate":"1998-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["152128",77635,"521544"],"PO":["150697"]},"27907":{"abstract":"Profile feedback optimizations have been shown to improve program performance for several compiler research areas. The main profiling information used to guide most of these optimizations are basic block and control flow edge frequencies. This is actually only a small fraction of the profile information that could be gathered and used for compiler optimizations. This proposal focuses on two relatively new areas of profile feedback optimizations. The first area will investigate gathering value profiles, which keep track of the top values for instructions and variables found during execution. This information is then used to guide value-based code specialization, which can significantly reduce the number of executed instructions. The second profiling area deals with memory access profiles. Memory access profiles will be used to guide a new optimization procedure called Cache-Conscious Data Placement, as well as to guide speculative instruction scheduling. Cache-conscious data placement uses a temporal relationship memory profile to determine at compile- time where to place stack, global, heap, and constant objects in the cache. This can potentially result in a significant reduction in the data cache miss rate. In addition to the performance benefits from these optimizations, this research will investigate fast and efficient approaches for gathering the profile information.","title":"CAREER: Value and Memory Access Profiling for Compiler Optimization","awardID":"9733278","effectiveDate":"1998-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["293079"],"PO":["551992"]}}