{"80768":{"abstract":"ABSTRACT: EIA 0301046, CRA, Lori Pollock, PI<br\/><br\/>This award to the Computing Research Association provides funds for travel grants for participants and speakers, and support for the workshop keynote dinner for the CRA-W 2003 Career Mentoring Workshop. The workshop has the objectives of 1) providing undergraduate women with exposure to computing research, 2) establishing and nurturing multi-institution and interdisciplinary research collaborations, 3) strengthening one's decision making power and coping ability with regard to the job and 4) providing support for teaching, advising, and service components of an academic career. The project incorporates a special keynote dinner with an inspirational woman speaker and opportunities to form and nurture relationships with potential mentors and colleagues. These workshops have been very successful in the past and this project will continue with similar results.","title":"Special Projects: Support for CRA-W FCRC Career Mentoring Workshop for Women in Research Careers in Computer Science and Engineering; June 7-8, 2003; San Diego, CA","awardID":"0301046","effectiveDate":"2003-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["527984"],"PO":["564181"]},"81847":{"abstract":"The aim of this proposed work is the development of new scalable algorithms and software to<br\/>address a number of outstanding problems arising in scientific computing applications. In particular,computationally complex simulations that demand the solution of multi-scale or multi-physics models will benefit. A significant component of this research will be the collaboration with applications scientists considering problems of this nature.<br\/><br\/>The project PIs have had significant experience and success in the development of scalable<br\/>algorithms for the fundamental problems inherent in unstructured mesh calculations.<br\/>The realization of this toolkit will be a significant resource enabling educators and scientists<br\/>to make better use of the large-scale computing infrastructure. This proposed work is driven through signi.cant collaborations by the PIs with other NSF-funded initiatives at Universities,on-going work at the National Laboratories,and with Industry. These collaborations will promote widespread use of the toolkit as well as feedback to ensure that the toolkit developed is relevant to user needs. The toolkit will be disseminated into the public domain, as well as through direct collaboration, to ensure widespread use.","title":"Algorithms: A Toolbox of Scalable Algorithms and Software for Advanced Scientific Computing Applications","awardID":"0305743","effectiveDate":"2003-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["528208","485861","347998"],"PO":["565272"]},"83926":{"abstract":"ABSTRACT<br\/>The International Conference and Research Center for Computer Science in Dagstuhl regularly organizes scientific workshops, called Dagstuhl Seminars. These are not a fixed series of workshops, rather are individually arranged. A few scientists are responsible for each seminar, and they must apply to the Scientific Directorate of the Center for a seminar to be held. Only proposals with high scientific merit are accepted. The 2003 Dagstuhl Seminar on Deduction was proposed by an international team of researchers led by Deepak Kapur, University of New Mexico, Andreas Podelski, Max-Planck-Institut fuer Informatik, and Andrei Voronkov, University of Manchester (UK), and is being held April 21-25, 2003. Fifteen researchers and students are participating in the workshop.","title":"2003 Dagstuhl Seminar on Deduction","awardID":"0314135","effectiveDate":"2003-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["531861"],"PO":["321058"]},"78485":{"abstract":"A surprisingly large number of safety tasks can be viewed as the detection of unusual events. This research will develop video analysis systems that can distinguish ``unusual'' from ``normal'' activities without specifying the unusual events ahead of time. This stands in contrast to most current systems which are designed to recognize special, pre-determined events. Three major thrusts of work will make the development of such video safety systems more realistic: (1)The PI will significantly increase the precision of parametric process models by including the event duration and the time of an event. (2)These complex models require more training data, yet only few data points will be available to estimate the time-dependent parameters. Therefore, this research will explore several different ways of estimating accurate models robustly from limited data. (3)Finally, this research will investigate how to use HMMs to detect deviations of the current time-series from the learned model. <br\/><br\/>The theoretical work will be put to practice on a task that will increase the safety of independently living senior citizens. The system will learn a model of the daily habits of the person based on video data from multiple cameras in the apartment. Emergency situations like strokes and falls can then be detected as deviations from the regular behavior, and a care taker can be notified. In the later stages of the project, the new models will also be applied to other safety and traffic tasks.<br\/><br\/>The education component of this award includes the development of extensive tutorials on stochastic modeling techniques which will be made available to the public online, as well as an interdisciplinary seminar on stochastic modeling at RPI.","title":"CAREER: Stochastic Models for Video-Equipped Intelligent Environments","awardID":"0237913","effectiveDate":"2003-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[204596],"PO":["317663"]},"86792":{"abstract":"ABSTRACT<br\/>0327252<br\/>Edmund Clarke<br\/>Carnegie-Mellon U<br\/><br\/>We believe that there is both a need and an opportunity to bring together important problems in software<br\/>development praxis with the theoretical advances that promise solutions. After consultation with the US National Science Foundation, the Chinese National Science Foundation, and the European Commission IST program, we propose to form an International Working Group in order identify such problems and related theoretical advances, and bring together the appropriate practitioners and scientists in a series of workshops. The outcome of a workshop may be the recognition of a gap in the theoretical foundations; filling that gap would then become an item in the research agenda. A different outcome may be the recognition that applicable theory is available but needs to be packaged for practical use. For example, the theory may be used as the foundation of a systematic method that can be applied in normal design; this work would become an item of an agenda for development rather than for research.","title":"The CUE Initiative on The Scientific Foundation of Software Engineering","awardID":"0327252","effectiveDate":"2003-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["553671"],"PO":["564388"]},"87012":{"abstract":"This award is for a one-and-a-half-day workshop on \"Fundamental Research in Networking.\" The workshop will bring together researchers with expertise covering a broad spectrum of areas within networking. The purpose of this workshop is to provide vision and direction for fundamental research in networking. The outcome of the workshop will be a detailed report documenting the discussions and will provide overall recommendations that will be available to the community and can help to better articulate the future research agenda in networking. The workshop will stimulate far-reaching future research, collaborations and evolvement of the networking research community.","title":"Workshop on Fundamental Research in Networking; April 2003; Warrenton, Virginia","awardID":"0328250","effectiveDate":"2003-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["263351"],"PO":["565090"]},"86286":{"abstract":"This is funding to support a research event for 10-14 promising doctoral students from the United States and abroad, along with distinguished research faculty, which will take place in conjunction with the 2003 IEEE Symposia on Human-Centric Computing Languages and Environments (HCC 2003), to be held October 28-31 in Auckland, New Zealand, and sponsored by the IEEE Computer Society. Many schools in minority and rural areas struggle to provide even the basics of education, let alone technological training, to their students, who become educationally disadvantaged adults; this problem can also exist for certain groups in schools that serve some populations better than others. With little experience or confidence in their ability to deal with technology, educationally disadvantaged people face serious obstacles when trying to cope with software designed by and for \"information haves.\" Whether and how software with the power of programmability can be viable for disadvantaged populations is the subject of this event, which will bring together and build community among young researchers working on different aspects of the research problem, whether their \"home\" research community is in Computer Science, Sociology, or Education. The workshop will emphasize to attendees (both the graduate students immediately involved and general conference participants) the crosscutting nature of research relevant to this pressing research problem, which has received almost no prior study. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Extended abstracts of the students' work will be published in the conference proceedings, which has wide print and electronic distribution. The conference steering committee will evaluate the workshop outcome, and the results will be made available to the organizers of possible similar future events.<br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other.","title":"Workshop Event: Programming Languages\/Environments for the Educationally Disadvantaged","awardID":"0324756","effectiveDate":"2003-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["548135"],"PO":["565227"]},"79895":{"abstract":"Institution: University of California - Santa Cruz<br\/>Proposal Number: EIA - 0244016<br\/>PI: Richard Hughey<br\/>Title: REU Site in Information Technology at the Baskin School of Engineering<br\/><br\/>The Summer Undergraduate Research Fellowship in Information Technology (SURF-IT) program provides an intensive and personalized summer program for 12 underrepresented (women and minority) and disadvantaged undergraduates. The students are drawn primarily from institutions that do not have strong, personalized research opportunities. SURF-IT is a 10-week summer program that includes research directly supervised by a faculty member in computer engineering, computer science, or electrical engineering. Students also have weekly meetings on graduate school preparation, research ethics, and research presentation, as well as field trips to local neighboring Silicon Valley research laboratories. The summer program concludes with<br\/>a research poster presentation by the SURF-IT students, coordinated with other undergraduate summer programs within the institution. <br\/><br\/>The goal of the program is to promote diversity in engineering by assisting motivated students in obtaining graduate degrees to then become positive role models for future generations of college students throughout the nation. Thus after the summer program, the faculty maintains continuing contact with SURF-IT alumni to assist them in applying to and succeeding in graduate school, as well as in their eventual careers.","title":"REU Site in Information Technology at the Baskin School of Engineering","awardID":"0244016","effectiveDate":"2003-04-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["505531","555419"],"PO":["564181"]},"79621":{"abstract":"Proposal : IIS-0243042<br\/>Institution: Corporation for National Research Initiatives<br\/>PI: Laurence Lannom<br\/><br\/><br\/>This proposal requests continuing support for the publication of D-Lib Magazine. D-Lib is only published on the World Wide Web, and is widely considered the most influential and respected source of information on digital libraries today. It has proven to be an especially effective forum and promoter of scientific communication and dialogue across a broad spectrum of IT, disciplinary and education issues.","title":"D-Lib Magazine: Continuing Advancement of Digital Library Research Dissemination","awardID":"0243042","effectiveDate":"2003-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["562790"],"PO":["433760"]},"85342":{"abstract":"EIA-0320595<br\/>Russell Schwartz<br\/>Carnegie Mellon University<br\/><br\/>Project Summary: Discrete Event Simulation of Self-Assembly Kinetics <br\/><br\/>The goal of this project is to develop a novel computational tool for simulating generalized self-<br\/>assembly systems. Self-assembly systems consist of many small components, or subunits, that <br\/>spontaneously arrange themselves into larger structures under appropriate conditions. Among the <br\/>many medically important self-assembly systems are viral protein shells, or capsids, which form <br\/>protective coats around the genetic material of viruses; amyloids, fibrous agglomerations of <br\/>proteins that are implicated in Alzheimer.s disease, Huntington.s disease, and the prion diseases; <br\/>and irregular protein aggregates. For all of these systems, the process of assembly is only <br\/>partially understood. In addition, self-assembly has attracted recent interest as a means of <br\/>constructing man-made devices and materials on the nanometer scale. Due to the small size, <br\/>speed, and complexity of many self-assembly processes, they have proven difficulty to analyze <br\/>experimentally. Simulation approaches have therefore emerged as a crucial avenue for gaining <br\/>insight into the self-assembly process. This project seeks to build on the prior work in the area by <br\/>creating a model of the self-assembly process sufficiently versatile to capture a wide variety of <br\/>self-assembly systems, yet fast enough to handle realistic simulation sizes in a reasonable time. <br\/><br\/>The basic methodology will involve combining techniques developed in prior modeling work on <br\/>this problem with a computational method that has not previously been used for self-assembly <br\/>simulation. The simulator will use a model of self-assembly dynamics based largely on the prior <br\/>.local rules dynamics. model, which provided a versatile representation of high-level self-<br\/>assembly behavior in terms of low-level subunit interactions. It will be efficiently implemented <br\/>using a computational data structure called a .discrete event priority queue,. which will allow the <br\/>simulator to step between changes in discrete state (such as subunits binding to one another) <br\/>without the need for explicit integration over all time steps. The result will be faster simulation of <br\/>a highly general self-assembly model than was possible with prior methods. The simulator will <br\/>be implemented in Java to facilitate ease of development, extensibility, and portability. <br\/>Implementation will be conducted through distinct phases devoted to developing an object model <br\/>(which specifies how pieces of computer code interact with one another), coding and testing a <br\/>prototype simulator, and finalizing an optimized and well documented release-quality version. <br\/>The end result will be both a stand-alone simulation tool and a set of computational classes <br\/>available for extension and use in other programs. This work will require innovation primarily in <br\/>mathematical models of self-assembly processes and in algorithms for their efficient simulation <br\/>by a discrete event queue methodology. Further innovation will be needed in the integration of <br\/>existing knowledge from such areas as biophysics, algorithms, software engineering, and user <br\/>interface design to produce a versatile, easy-to-use graphical simulation tool. <br\/><br\/>The project can be expected to yield several benefits. Its impact will be primarily on the field of <br\/>self-assembly, by providing a general tool that can be used by researchers throughout the field for <br\/>modeling known systems across size and time scales, developing computational prototypes of <br\/>novel systems, and experimenting with interventions in both. It will also provide new methods <br\/>and experience to the general field of biophysical simulation through the development of a novel <br\/>simulation methodology, its implementation in a computational simulator, and optimization of <br\/>algorithms for this problem. The cross-disciplinary nature of the project will enhance its impact <br\/>by providing for the computational community new variations on problems to be found in <br\/>biophysical systems and providing for the biophysics community new computational techniques <br\/>that can be brought to bear on other problems. The work will also have educational value by <br\/>providing interdisciplinary research experience to students, including two undergraduates, and by <br\/>providing a simulator that can be used as both a research and a teaching tool.","title":"SGER: Discrete Event Simulation of Self-Assembly Kinetics","awardID":"0320595","effectiveDate":"2003-04-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["563452"],"PO":["565223"]},"78621":{"abstract":"Software reliability is one of the most important problems in computer<br\/>science. A single operating system error can crash the machine. A single<br\/>security hole can compromise the integrity of the entire system or, as<br\/>software and its errors is replicated, the integrity of entire networks.<br\/>This research focuses on practical techniques to effectively find large<br\/>numbers of such software errors. Initial results are promising: the<br\/>approach has found hundreds of security holes and thousands of serious<br\/>errors in the Linux operating system, as well as in large commercial<br\/>systems.<br\/><br\/>The research centers on using static analysis to find errors in source<br\/>code. It uses two main techniques: (1) metacompilation (MC) to check<br\/>correctness rules (such as ``a call to the lock() function must be paired<br\/>with a call to unlock()'') and (2) belief analysis to infer such rules<br\/>automatically.<br\/><br\/>Metacompilation uses programmer-written, system-specific static checkers<br\/>to find software bugs. Because these extensions can be written by<br\/>system implementors themselves, they can take into account the ad hoc<br\/>(sometimes bizarre) semantics of a system. Because they are compiler<br\/>based, they also get the benefits of automatic static analysis.<br\/><br\/>Belief analysis: A major obstacle to finding program errors in a real<br\/>system is knowing what correctness rules the system must obey. These<br\/>rules are often undocumented or specified in an ad hoc manner.<br\/>Belief analysis automatically infers such checking information from<br\/>the source code itself, rather than the programmer, thereby avoiding<br\/>the need for a priori knowledge of system rules. It works by analyzing<br\/>source code to infer what programmers believe to be true and checking<br\/>these beliefs for contradictions. For example, if a call to ``lock()''<br\/>is paired with a call to ``unlock()'' 1000 times and not paired once,<br\/>this is a good indication that the code believes these calls must be<br\/>paired, and that the single deviation is an error.<br\/><br\/>The research will also involve an educational component. The most<br\/>significant feature will be heavily involving undergraduates in research.<br\/>Empirically, doing so helps them think creatively, independently, as<br\/>well as pushing them to go much deeper than a typical class.","title":"CAREER: Effective Methods for Finding Software Errors","awardID":"0238570","effectiveDate":"2003-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["448745"],"PO":["561889"]},"81383":{"abstract":"This award provides funds to subsidize the travel and housing expenses of students selected to participate in the eighth SIGART\/AAAI Doctoral Consortium, which will be held on August 10-11, 2003, in Acapulco, Mexico. The consortium will be collocated with the National Conference on Artificial Intelligence (NCAI), which will be held from August 10-15 in Acapulco. ACM\/SIGART and AAAI together organized the first seven Doctoral Consortia, which have also been collated with either NCAI or IJCAI (International Joint Conference on Artificial Intelligence). <br\/><br\/>At the consortium, Ph.D. students who are doing their dissertations on AI-related topics present their proposed research, and receive feedback from a panel of established researchers as well as from the other students. This provides the students with invaluable exposure to outside perspectives on their work, at a critical time in their research, and also enables them to explore their career objectives. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades.","title":"2003 American Association for Artificial Intelligence\/Special Interest Group on ArtificialIntelligence\/ IJCAI Doctoral Consortium; August 10-11, 2003; Acapulco, Mexico","awardID":"0303781","effectiveDate":"2003-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["558297"],"PO":["491702"]},"77038":{"abstract":"This project is developing and delivering a course in Computational Neuroscience originating at Carnegie Mellon University and offered for credit at remote universities. The course is based on both research performed and workshops taught at the Pittsburgh Supercomputing Center and has a strong computational aspect, with the lectures tied to computational examples. The course utilizes the Access Grid group-to-group communication technology to create a distributed classroom, and utilizes the computational resources of the Pittsburgh Supercomputing Center for computer-intensive student exercises. The problem addressed by this project is the national need to train students in computational biology in general, and computational neuroscience in particular. It is particularly difficult to meet this need for students in universities in the EPSCoR states. The project's objective is to test whether courses originating in universities affiliated with the National Supercomputing Centers can be disseminated via synchronous interaction with EPSCoR universities. In this particular project the Pittsburgh Supercomputing Center is collaborating with faculty at the University of Montana, Carnegie Mellon University, and University of Edinburgh to provide a distributed course in computational neuroscience. The course addresses geographical diversity and integrates high performance networking and communication, and high performance computing, with education in a manner that would not have been possible until very recently due to limitations in communications technology and accessible computer power. This project is jointly funded by the Division of Undergraduate Education in the Education and Human Resources Directorate and by the Division of Experimental and Integrative Activities in the Computer and Information Science and Engineering Directorate.","title":"Computational Neuroscience over the Access Grid Nodes","awardID":"0231173","effectiveDate":"2003-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7427","name":"CCLI-EDUCATIONAL MATERIALS DEV"}}],"PIcoPI":["384292","493848",200937,200938],"PO":["562454"]},"77611":{"abstract":"Abstract<br\/><br\/>Proposal : IIS-0233908<br\/>Institution: University of Illinois<br\/>PI: Leigh Estabrook<br\/><br\/><br\/>This award provides for coordination and support activities for the Interagency Digital Libraries Initiative. The current project is providing services to the sponsoring agencies and communities in the form of<br\/> improving the coordination, communication, and information collection and dissemination necessary for ongoing planning activities associated with Digital Libraries Initiative-Phase2. <br\/> collect and organize research output of the projects and compile relevant information for sponsoring programs and agencies to assist in planning future levels and directions of support and measurement of scientific impact<br\/> collect, aggregate and produce useful information for the larger constituencies of the initiative - both in the US and International arenas<br\/> provide logistical and organizational support for working groups and planning activities<br\/><br\/>These activities will continue as well as new tasks associated with developing and providing support for evaluation processes for the new NSF\/DLI2\/JISC [United Kingdom Joint Information Systems Committee] international testbeds activity and coordination of NSF\/DLI2\/EU working groups.","title":"National Coordination Project","awardID":"0233908","effectiveDate":"2003-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[202442],"PO":["433760"]},"78205":{"abstract":"With National Science Foundation support, Dr. Carol Espy-Wilson will conduct three years of interdisciplinary research. This project combines knowledge and techniques from engineering, speech science, and computational linguistics to develop a robust automatic speech recognition system that works well for a large and diverse population. This project includes the development of (a) acoustic parameters that target the linguistic information in the speech signal, and (b) a new paradigm for recognition that integrates current speech knowledge with a powerful statistical framework. <br\/><br\/>The knowledge-based speech recognition system serves as a model of the early stages of speech perception. Its development is a tool for understanding and coping with variation in speech that occurs within and across speakers due to differences in gender, age and emotional states. New insights will be gained in the areas of speech production, speech perception, and acoustic phonetics. Further, different components of the system can serve as speech analysis tools to be used in various applications including speech coding, automatic speech transcription, speech enhancement, and speech training aids for speech pathologists and their clients.","title":"Acoustic-Phonetic Knowledge and Speech Recognition","awardID":"0236707","effectiveDate":"2003-04-01","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}}],"PIcoPI":["508500"],"PO":["564500"]},"87504":{"abstract":"Mathematical methods have become important tools in analyzing the spread and control of infectious diseases and in the analysis of alternative interventions in the case of newly emerging diseases, naturally occurring epidemics of traditional diseases, and deliberate attacks using biological weapons. Much is to be gained by extending the mathematical tradition by making use of the powerful tools of modern computer science. This project is based on the belief that partnerships among computer scientists, mathematical scientists, biologists, and epidemiologists can lead to important new contributions to the usefulness of such methods, and in particular on the belief that opening lines of communication between computer scientists and mathematicians interested in problems of epidemiology but coming at them from completely different perspectives can stimulate important new developments.<br\/><br\/>The project will support the work of postdoctoral fellows at DIMACS, the Center for Discrete Mathematics and Theoretical Computer Science. The students have mathematical and computer science backgrounds, and are interested in epidemiological applications. The effort will focus on control theory models of virus dynamics, chemostat models describing the competition of several organisms for a single nutrient, and on influenza modeling. Additionally, they will work on applying powerful methods of modern data mining to the developing DIMACS efforts in data cleaning of public health data, biosurveillance, and bioterrorism sensor location. In the most exploratory part of the project, the students will participate in work related to other's special interests, with the mathematicians working on ways to use control theory in biosurveillance and the computer scientists working on ways to use methods of data mining in flu modeling.","title":"SGER: DIMACS Exploratory Postdoctoral Program in Computational Epidemiology","awardID":"0331486","effectiveDate":"2003-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}}],"PIcoPI":["264120"],"PO":["565136"]},"78517":{"abstract":"CAREER: A Composition System for Computer Graphics<br\/><br\/>Abstract<br\/><br\/>Engineers and artists approach problems in a very different manner. The terms engineer and artist are used in a very broad way; engineers are people who primarily build things and tend to approach problems by asking how something can be done. Artists, on the other hand, create content and focus on what information they are trying to convey. Both of these approaches are important, and it is often the intersection of the two that produces the most compelling results. Computer graphics has been fortunate in that a large artistic community is actively involved its development. Unfortunately, software design is still largely in the hands of the engineers.<br\/><br\/>The goal of this proposal is to bring the artistic approach into existing software and to bridge the communication gap between artists and engineers. As a maturing field, computer graphics is ready to address the problem of purposeful display - not just how to render an image from a model, but how should it be rendered so as to convey specific information about that model.","title":"CAREER: A Composition System for Computer Graphics","awardID":"0238062","effectiveDate":"2003-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["547864"],"PO":["550859"]},"77726":{"abstract":"The goal of this research is to automatically generate implementations of digital signal processing (DSP) transform algorithms that are adapted to a given off-the-shelf computing platform, i.e., the generated code takes full advantage of architectural features and available instructions sets, including the memory hierarchy, multiple processors, vector instructions, fused multiply-add instructions, and prefetching instructions. We refer to this type of code as \"advanced code'' for two reasons: (1) the code uses instructions that are<br\/>significantly beyond standard C or Fortran programming; and (2) manually writing such code requires a very high level of programming expertise including assembly level programming and a deep understanding of the platform's architecture. Our goal is ambitious: automatically generate code that competes with or outperforms expertly hand-tuned code for DSP algorithms.<br\/><br\/>Our approach is based on the following: (1) We represent each fast DSP<br\/>transform algorithm as a formula in a concise mathematical language. (2) We derive for each transform a very large number of structurally different fast algorithms or formulas. (3) These different formulas (i.e., algorithms) are efficiently enumerated and manipulated. (4) We automatically translate each formula into advanced code. (5) We optimize the implementation by searching over the space of alternative formulas and code implementations.<br\/><br\/>Step (4) is the key claim---the automation step---of our approach. In other words, the applicability of advanced instructions, including vector instructions, parallel threads, fused multiply-add instructions, and prefetching instructions, can be related to mathematical constructs in our formula notation. Step (5) provides the<br\/>tuning and adaptability of the code to the platform.<br\/><br\/>We will research the mapping from formulas to advanced code and formalize it in a way suitable for automatic code generation and optimization. We will develop a compiler that translates a formula description of a fast DSP algorithm, possibly augmented with parameters that control coding degrees of freedom, into advanced code. Finally, we will build an \"Advanced Code Generator'' that interfaces our compiler with a formula generator and a search module to<br\/>automatically explore the space of structurally distinct fast algorithms and the space of advanced coding degrees of freedom. For a given DSP transform, our Advanced Code Generator automatically finds the formula, i.e., the algorithm, whose structure allows the best implementation given the available advanced instructions and given the computing platform.<br\/><br\/>In contradistinction to other approaches to advanced code generation, including approaches using optimizing C or Fortran compilers or manual coding, our Advanced Code Generator automates and integrates the optimization at the mathematical level of algorithms and the optimization at the implementation level of machine-specific instructions. This way the Advanced Code Generator has access to all structural information necessary to produce high quality code and<br\/>mimics a highly skilled programmer who understands and exploits the structure of algorithms and the given architecture to write platform-tuned advanced code. We believe that our research makes, for the performance-critical class of DSP algorithms, a pioneering step towards a solution for one of the present fundamental problems in software development for high performance scientific computing: How to develop, with reasonable effort, optimal and portable performance on increasingly complex and diverse off-the-shelf computing platforms.","title":"SOFTWARE: ACR: Advanced Code Generation for Digital Signal Processing Algorithms","awardID":"0234293","effectiveDate":"2003-04-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["451785","332185"],"PO":["565272"]},"86108":{"abstract":"This is funding to support this year's HCI doctoral research consortium (workshop) of approximately 14 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2003 Conference on Human Factors in Computing Systems (CHI 2003), to be held April 5-10 in Fort Lauderdale, Florida, and sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI). Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on April 6-7, with follow up activities to be held during the technical program of the CHI 2003 conference. Extended abstracts of the students' work will be published in the CHI 2003 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results made available to the organizers of future consortia. The CHI doctoral consortia, which began in 1986, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today's leading HCI researchers participated as students in earlier consortia. <br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Workshop: Human-Computer Interaction Doctoral Research Consortium","awardID":"0323991","effectiveDate":"2003-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551829"],"PO":["565227"]},"85713":{"abstract":"This award supports a symposium on the role of learning and motivation in integrated cognitive architectures. The two-day meeting will be held at Stanford University during March, 2003, and will have 12 speakers and approximately 30 attendees. The participants will include top researchers in the field of cognitive architectures and planning, and a number of additional researchers will be invited based upon submitted summaries of their research. This symposium will contribute significantly to communication and cooperation between scientists with different research emphases, and it will advance our understanding of the nature of cognition, perception, and action, leading eventually to unifying theories that combine the best ideas from alternative frameworks.","title":"A Symposium on Learning and Motivation in Cognitive Architectures","awardID":"0321888","effectiveDate":"2003-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["559662","469185"],"PO":["491702"]},"82711":{"abstract":"Ramesh Rao<br\/>University of California San Diego<br\/><br\/>\"The New Role of Science and Engineering in Risk Reduction\"<br\/><br\/><br\/>In February 2002, NSF funded a successful workshop in New York City, inspired by the events of September 11, to develop a research agenda related to unexpected events. Now, one year later and with the Department of Homeland Security established, the topic of homeland security is much better defined as it relates to the Federal Government and NSF. NSF is now engaged in developing a large cross-agency initiative in Cyber-Infrastructure. The workshop being funded by this grant is intended to bring the two areas of cyber-infrastructure and homeland security into juxtaposition, with the goal of developing a computer\/information science research agenda within the context of homeland security, as related to cyber-infrastructure.","title":"DG: The New Role of Science and Engineering in Risk Reduction","awardID":"0309195","effectiveDate":"2003-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}}],"PIcoPI":["554382",215615,"328469"],"PO":["371077"]}}