{"19091":{"abstract":"","title":"NYI: Analysis and Design of Artificial Neural Networks","awardID":"9696144","effectiveDate":"1995-12-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["114531"],"PO":["564898"]},"2442":{"abstract":"This research concerns infrastructure for supporting multiuser- interfaces. Two important criteria for evaluating such an infrastructure are the flexibility of the supported paradigms for (a) application-user interaction and (b) user-user sharing. Currently, an infrastructure offers either great interaction flexibility but limited sharing flexibility, or great sharing flexibility but limited interaction flexibility. The maximum interaction flexibility is offered by shared window systems, which allow multiple users to share a single logical window. However, these systems offer no sharing flexibility. The hypothesis of this research is that it is possible to significantly increase the sharing flexibility of these systems without reducing their interaction flexibility. This research identifies new software abstractions and architectures for establishing this hypothesis and uses an experimental method wherein the new concepts are implemented and used in validation experiments. If successful, it will lead to a new kind of infrastructure that automatically meets the sharing needs of a large class of multiuser user-interfaces that must today be implemented manually at great programming costs.","title":"Flexible Shared Windows","awardID":"9508514","effectiveDate":"1995-12-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["533215","554765"],"PO":["565227"]},"1287":{"abstract":"IRI-9504316 Freuder, Eugene University of New Hampshire $78, 415-12 mos Higher Level Reasoning for Constraint Satisfaction Constraint satisfaction is an important reasoning paradigm in artificial intelligence, with many applications, extending to more general computing domains outside of AI. As constraint satisfaction addresses larger and more practical problems, it will become increasingly necessary to bring to bear advanced artificial intelligence techniques for higher level reasoning. Higher level reasoning steps back from the immediate need to find a solution to a problem and reasons about such interests as: Interactive constraint satisfaction (How to acquire, update, and explain constraint knowledge), Abstraction and reformulation (How to simplify problems by removing constraints without trivializing them), Metaknowledge (How to use knowledge about constraint management, substitutability of constraints, and relation of constraints to problem structure effectively), Knowledge compilation (Achieving efficiency by preprocessing bodies of constraints), and Subproblem decomposition (Extraction of useful subproblems and their constraint representations).","title":"Higher level Reasoning for Constraint Satisfaction","awardID":"9504316","effectiveDate":"1995-12-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["105002"],"PO":["565227"]},"6556":{"abstract":"The project's objectives are: 1) development of \"SignStream,\" a database tool for analysis of linguistic data captured on video; 2) use of SignStream for creation of a large database of utterances from American Sign Language, consisting of raw video and fine-grained linguistic transcription; 3) development of an interactive format for linking electronic documents to SignStream databases (allowing direct access from texts to video, encoded data, and SignStream tools). SignStream provides a single computing environment for manipulating video and transcribing utterances by entering linguistic information in multiple fields and linking this to specific video frame sequences, resulting in a fine-grained, multi-level, temporally calibrated transcription. Information from the various fields is aligned visually on screen to reflect temporal relations. The goal is to make SignStream and the databases and interactive document tools developed accessible to the general research community. There is a pressing need for such tools, for linguistic research on signed languages (which has to date been hampered by the inaccessibility of data for inspection, and the lack of tools for scientific analysis thereof) as well as for related disciplines relying on analysis of video data.","title":"SignStream: A Multimedia Tool for Language Research","awardID":"9528985","effectiveDate":"1995-12-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["475203"],"PO":["565227"]},"4753":{"abstract":"This project investigates the use of non-volatile semiconductor memory (such as flash memory) as a storage system to replace some of the functions currently assigned to disks. A board (eNVy) incorporating a large (128MB) flash memory is being designed at Rice University; concurrently, a log-structured file system (Rio) that can use the flash memory board as a cache between main memory and disk is being developed at the University of Michigan. In later stages of the project these research prototypes will be integrated. Research issues in hardware development include space reclamation (garbage collection), and tradeoffs between memory size, performance, and memory lifetimes. Research issues in file system development include optimization of the sizes of cache and main memory, algorithms for compression of data in the cache, protection of memory from software faults, and exploration of file system index structures. Integration of the prototypes will provide insight into the protability of these techniques to new systems.","title":"Reliable Main-Memory Storage Systems","awardID":"9521386","effectiveDate":"1995-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["191820"],"PO":["241298"]},"4787":{"abstract":"IRI-9521487 Iwanska, Lucja Wayne State University $18,000-12 mos RPG: The Semantics and Pragmatics of Natural Language in A Computational Model for Representation and Inference This research planning grant is to develop a knowledge representation system closely resembling computational, algorithmic, representational and inferential characteristics of natural language, starting with a Boolean algebra approach. It is planned to demonstrate that only combining semantic and pragmatic processing, logical, context-independent, and nonlogical, context-dependent reasoning in natural language allows one to fully simulate human understanding of natural language and write programs that correctly derive, represent, and reason with the information from natural language texts. Further, it is planned to demonstrate the attractiveness of the proposed framework by applying it to computing some pragmatic aspects of natural language, all extremely common and all having to do with the way knowledge is communicated and acquired by natural language. The objective of the project is to produce a research proposal for continued research in this area.","title":"A Boolean Algebra Approach to The Sematics and Pragmatics ofNatural Language: Computational Model for Representation and Inference","awardID":"9521487","effectiveDate":"1995-12-01","expirationDate":"1996-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[11682],"PO":["54008"]},"1114":{"abstract":"9503757 Hu This project will investigate efficient parallel algorithms to find all numerical solutions for large-scale nonlinear systems of equations in a given domain with mathematical certainty, even in the presence of uncertainty in the data, roundoff error, and nonlinearities by finite digit computations. The basic algorithm to be used is based on the interval Newton\/Generalized bisection method. Parallel algorithms will be implemented on vector processors, shared-memory multiprocessors, and distributed-memory multicomputers. On a vector processor, new data structures will be designed to take full advantage of completely pipelined functional units of vector processors. To speed memory accessing, techniques will be developed to increase cache hit ratio on machines with cache such as the IBM 3090, and to reduce bank conflict on interleaved memory systems such as the CRAY C90. On a shared memory multiprocessor, optimal partitioning schemes will be studied for given nonlinear systems based on two protocols. By overlapping communication and computation, in addition to reducing communication and contention, large speedup is expected. On distributed-memory multicomputers, algorithms on coarse grained SPMP schemes and fine-grained MPMP schemes will be implemented on realistic machines. General sparsity and scalability will be considered in all implementations. ***","title":"RUI: Finding All Numerical Solutions for Large-Scale Nonlinear Systems of Equations Parallelly and Reliably in a Given Domain","awardID":"9503757","effectiveDate":"1995-12-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["347186"],"PO":["187585"]},"6713":{"abstract":"; R o o t E n t r y F \/ C o m p O b j b W o r d D o c u m e n t I O b j e c t P o o l \/ \/ $ ! \" # % & ' ( ) * + , - . \/ 0 1 2 3 4 5 6 7 8 9 : ; < = > ? @ A B C D E F G H I J K F Microsoft Word 6.0 Document MSWordDoc Word.Document.6 ; e = e d I d j j j j j j j { C T 7 { j { j j j j ~ j j j j 4 9529482 Blumenthal The Computer Science and Telecommunications Board is undertaking study to address the history of key innovations in information technology and their economic impacts. The committee will collect and document more fully than has been done to date the histories of key information technologies and see what can and cannot be reliably quantified (including confidence assessments on what can be quantified); derive inference for public policy from the historical and analytical material; and produce a report summarizing the findings of the committee and articulating their recommendations. *** ; S u m m a r y I n f o r m a t i o n ( Oh +' 0 $ H l D h R:\\WWUSER\\TEMPLATE\\NORMAL.DOT 9529482 Tracey Zeigler Tracey Zeigler @ :& @ @ :& @ F # Microsoft Word 6.0 1 ; c d c _ d ! ! ! ! K @ Normal a \" A@ \" D efault Paragraph Font d d d d 4 Tracey Zeigler\"\\\\CLM18\\TZEIGLE$\\WWUSER\\BLOOMY.DOC @HP LaserJet 4\/4M LPT1: HPPCL5E HP LaserJet 4\/4M D k @ X HP LaserJet 4\/4M D k @ X C Times New Roman Symbol & Arial 5 Courier New \" h k e k e $ 7 9529482 Tracey Zeigler Tracey Zeigler ; ;","title":"Special Project: Innovations in Computing and Communications: Lessons from History","awardID":"9529482","effectiveDate":"1995-12-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["234699"],"PO":["297837"]},"1511":{"abstract":"9505053 Casson Casson will study the Geometrization Conjecture for 3- dimensional manifolds, proposed by Thurston in 1982. A proof of this conjecture would complete the topological classification of closed 3-manifolds, provide insight into topological properties of 3-manifolds, and lead to efficient methods to determine whether two given 3-manifolds are topologically equivalent. Casson will explore a very direct approach to Thurston's conjecture; given a topological description of a 3-manifold M, he will attempt to find triangulations of M that are closely related to a geometric structure on M. Kirby will continue his work (often with Paul Melvin) in Topological Quantum Field Theory. He will try to explain the Kontsevich and Vassiliev invariants, using intersections of certain codimension-two manifolds in a compactification of products of the given 3-manifold with diagonals deleted. He will also continue to study the formulae for the Witten-Reshetikhin-Turaev invariants, looking for topological interpretations and applications. Since the space that we live in is three-dimensional, and all our lives we perfect our three-dimensional geometric intuition simply by going about our everyday business, it is always surprising to the layman to learn that mathematicians' are frequently more capable of answering questions about higher dimensional geometric objects than about the analogous objects in dimension three. This is, however, very much the case. The most famous outstanding conjecture in topology is the three-dimensional Poincare conjecture, made at the turn of the century. On the other hand, its higher dimensional analogues have all been settled. The research of this project is directly addressed to these notoriously recalcitrant problems. ***","title":"Mathematical Sciences: Representations of Three-Manifold Groups","awardID":"9505053","effectiveDate":"1995-12-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1267","name":"TOPOLOGY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["463328","289362"],"PO":["116040"]},"1744":{"abstract":"IRI-9505790 Rao, H. Raghav SUNY-Buffalo $44, 498 - 12 mos This research is in discrete resource allocation among multiple agents in an environment of incomplete information. The problem is considered from the viewpoint of a coordinator. The existence of incomplete information makes the issues involved particularly complex. A decision and information theoretic perspective is being used to study multiple information structures, the nature of information flows, computational costs, and team problem solving. A comparative analysis of various information and communication structures for multi-agent decision-making will be undertaken, based on the concepts of spatial and logical entropy, with all of the likely significant costs included in the analysis. The results are expected to be significant both for the practical use of decision and information theoretic models and for providing insights into harder problems in discrete resource allocation under incomplete information.","title":"Discrete Resource Allocation Among Multiple Agents: A Decision and Information Theoretic Investigation","awardID":"9505790","effectiveDate":"1995-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["563364"],"PO":["565227"]},"19011":{"abstract":"","title":"An Investigaton of the Interaction Between Codes and Decoding Machines","awardID":"9696064","effectiveDate":"1995-12-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["466234"],"PO":["150411"]},"15335":{"abstract":"This is a one-year standard award. This interdisciplinary workshop on human\/computer interaction and persons with disabilities will provide a national forum for the exploration of the research issues and the development of a national plan for the inclusion of the needs of persons with disabilities within the more general human\/computer interaction research framework. There has been increased awareness of the need for including persons with disabilities in the benefits to society of computing and communications technology. This has been supported by the development of new technologies that provide increased accessibility for persons with physical, sensory and learning disabilities. The workshop will convene within the first three months of 1996 and will involve forty university and industry researchers in human\/computer interaction and assistive technology, along with representatives of Federal agencies in a three-day program. The outcome will be a report to the National Science Foundation. An edited, draft report will also be presented at the ACM ASSETS Conference held in conjunction with the ACM SIGCHI Conference in April 1996.","title":"Workshop on Human\/Computer Interaction and Persons with Disabilities","awardID":"9625707","effectiveDate":"1995-12-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["202606"],"PO":["183208"]},"15549":{"abstract":"IRI-9626345 Buchanan, Bruce University of Pittsburgh $24,995 - 12 mos WORKHOP ON EVALUATION OF KNOWLEDGE-BASED SYSTEMS This grant is to provide partial funding for a Workshop on Evaluation of Knowledge-Based Systems, to be held December 7-8, 1995 at the National Library of Medicine, Bethesda, Maryland. The purpose of this meeting is to clarify the questions and tradeoffs involved in evaluating knowledge-based software designed to assist decision-makers in contexts involving human health and welfare. These principles will have applications to all knowledge-based systems, but the acuteness of the need is most apparent in deployments that directly involve human life. Knowledge-based systems are complex pieces of software, so empirical studies are necessary to predict their performance. The workshop will bring together many persons who have undertaken systematic evaluations of such systems to share their knowledge and develop principled approaches to such evaluation.","title":"Workshop on Evaluation of Knowledge-Based Systems","awardID":"9626345","effectiveDate":"1995-12-15","expirationDate":"1996-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["550649"],"PO":["54008"]},"8550":{"abstract":"The goal of the project is twofold: research in the area of signal reconstruction, and teaching in signal processing, both components emphasizing on the interdisciplinary aspect of signal processing. The main thrust of the research is the reconstruction of a signal with unknown statistical description that propagates through a system with unknown characteristics, solely from the system's output (blind deconvolution). Higher Order Statistics are powerful mathematical tools to be employed in this problem, capable of revealing a wealth of information about the signal\/process (e.g., phase, presence of nonlinearities), and at the same time suppressing noise. The theoretical developments of this work will be applied in the areas of digital communications, medical diagnostics and earthquake engineering, and are expected to bring new knowledge to these fields. In the area of teaching the goal is to develop and maintain a new systems curriculum, highlighting principles that unite different engineering disciplines. Towards this goal, a state-of-the-art multimedia signal processing laboratory will be developed, and new courses will be designed.","title":"PFF: Signal Reconstruction and Applications to Communications, Ultrasound Image Processing, and Earthquake Engineering","awardID":"9553227","effectiveDate":"1995-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["526916"],"PO":["564898"]},"5087":{"abstract":"Morgan 9522612 In this project, improvements of the restarted GMRES method for solving large nonsymmetric systems of linear equations will be investigated. The goal is to develop a method that is competitive with short recurrence Lanczos methods such as QMR, but maintains the desirable properties of GMRES. These properties include extraction of the minimum residual solution from the subspace, generally steady convergence, and numerical stability. It is also desired to not significantly raise cost per iteration and storage requirements. The convergence of GMRES can be improved by including approximate eigenvectors in the subspace. Once these eigenvalues are essentially deflated from the spectrum of the matrix, removing even just a few small eigenvalues from the spectrum can significantly improve the convergence. In this project a new and efficient way of including eigenvectors is proposed. Sorensen's implicit-QR Arnoldi method for eigenvalues is combined with an interior eigenvalue version of Arnoldi. The surprising result is that the approximate eigenvectors become part of a new Krylov subspace. This Krylov subspace can be used with GMRES. The expense per iteration is even less than that of regular GMRES for the case where matrix-vector products are expensive, and the number of iterations needed is sometimes greatly reduced. The resulting implicitly restarted GMRES method will be studied and compared with other methods. ***","title":"Implicity Restarted GMRES and Arnoldi Methods for Nonsymmetric Systems of Equations","awardID":"9522612","effectiveDate":"1995-12-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["216657"],"PO":["187585"]},"7542":{"abstract":"Development of the national information infrastructure is a top priority direction by which this country has chosen to drive its technology to the future, innovate its social and economical interests, and maintain its international competitiveness and technological lead. At the backbone of this information superhighway lies the breakthrough technology of optical networks. This research outlines the relevance of the mathematical techniques of algorithmic graph theory and combinatorial optimization in the design and operations of backbone all-optical networks. Three prototype classes of problems will be investigated. The first class is new and it exemplifies minimization of investment cost. The second class is also new and it exemplifies optimization of service. The third class exemplifies maximization of technological benefits, and has been previously examined under different model assumptions. The significance of automation in high speed network studies and relevance of algorithms and optimization in the manufacturing of all-optical devices for all-optical networks will be outlined. Interactive activites include: teaching a graduate course on Approximation Algorithms and Applications, teaching an undergraduate course on Introduction to Algorithms, organizing a workshop on Computational Support for Very High Speed Networking, and organizing student field trips to visit laboratories at Bellcore.","title":"VPW: Combinatorial Optimization, Automation, and Very High Speed Optical Networking","awardID":"9550136","effectiveDate":"1995-12-01","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"9225","name":"VISITNG PROFESS FOR WOMEN"}}],"PIcoPI":["381502"],"PO":["180153"]},"1230":{"abstract":"IRI-9504138 Kuipers, Benjamin University of Texas-Austin $93,501-12 mos An Ontological Hierarchy for Spatial Knowledge Spatial knowledge is an important and ubiquitous kind of commonsense knowledge. it also raises a critical issue facing computational models of mind: the relationship between behavior in the continuous world and inference with discrete symbolic representations. in this project, a hierarchy of representations for spatial knowledge called the Spatial Semantic Hierarchy (SSH) developed in a previous NSF grant is being formalized so that it can be more widely useful. The formalization will clarify precisely when and how different descriptive ontologies and inference methods can interact effectively. It will also identify the minimal preconditions on sensors, effectors, and environment required for the spatial model to apply and identify the minimal set of targets for machine learning and discovery required to learn an instance of the hierarchical spatial model from experience. It will be evaluated both mathematically and experimentally on simulated and physical robots. The results should be theoretically important to the foundations of artificial intelligence and practically important to intelligent robotics applications.","title":"An Ontological Hierarchy for Spatial Knowledge","awardID":"9504138","effectiveDate":"1995-12-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["534124"],"PO":["565227"]},"6554":{"abstract":"This is the first year funding of a two-year continuing award. The objective is to provide textual corpora to use in developing and evaluating automatic methods to identify intended senses of polysemous English words, and to make these resources generally available. 1000 English words (nouns, verbs, adjectives, adverbs) that have multiple meanings and occur frequently in printed materials have been selected. Corpora of written English will be searched for occurrences of these words, which will then be classified by hand according to the word's meaning in each context. The result will be a set of files for each word, one file for each attested meaning; the sizes of these files will indicate the relative frequency of occurrence of different senses of these words. Such files can be used to develop automatic methods of word-sense identification, and will make it possible to standardize the evaluation of automatic word-sense identification systems and to evaluate progress in this branch of natural language processing. Better methods of automatic word-sense identification will facilitate language processing in various applications: information retrieval, machine translation, computer-assisted instruction, and elsewhere.","title":"Resources for Word-Sense Identification","awardID":"9528983","effectiveDate":"1995-12-01","expirationDate":"1998-03-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["468530"],"PO":["183208"]}}