{"210497":{"abstract":"Transformative research activities in the last decade focused on sustainable, robust, and reliable power systems have presented several paradigms such as smart grids, self-healing grids, and distributed generation. This workshop seeks to address the Control, Computing, and Signal Processing Challenges in Future Power Systems within the context of developing the tools for a system-level understanding of the impact of these emerging paradigms. It will promote cross fertilization of ideas with the aim of developing the underlying foundational science to realize next-generation electric generation, transmission, and distribution systems.<br\/><br\/>Intellectual Merit:<br\/><br\/>The workshop will bring together prominent researchers in relevant disciplines to address key questions relevant to future power systems, including: 1) What emerging control paradigms will improve management of renewables and charging of electric vehicles, with build-in resilience against failures and malicious attacks on critical infrastructure? 2) What is the role of optimization, big data analytics, and grid informatics in revitalizing power delivery subsystems and improving consumer satisfaction? 3) How can advances in statistical signal processing and machine learning be leveraged to improve situational awareness and system reliability? 4) How can we educate next-generation engineers about system-level challenges in future power systems?<br\/><br\/>Broader Impacts:<br\/><br\/>This workshop will engage several engineering disciplines to map out the foundational science for research in future power systems. The workshop will also emphasize the related educational aspects, primarily by leveraging the long tradition of excellence in power and energy systems education that the University of Minnesota has established through the NSF-supported Consortium of Universities for Sustainable Power.","title":"Workshop on Control, Computing, and Signal Processing Challenges in Future Power Systems. To be Held in Arlington,VA in November, 2013","awardID":"1358182","effectiveDate":"2013-11-15","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":[564049,564050,564051],"PO":["565205"]},"211047":{"abstract":"A major advantage of virtual organizations (VOs) is flexible membership and participation. In many VOs, members are able to join and leave at will, and can change whom they collaborate with at any point in time. This flexibility can be a source of increased effectiveness as VO structures are more readily able to adapt to contingencies and VO leadership can evolve over the course of a VO's lifecycle. <br\/>This project examines the relationship between structural fluidity, VO leadership, and VO performance. The investigators will examine the log data generated by the technical systems used for coordination and information sharing in four different types of VOs (software engineering, disaster relief, online learning, and public discourse communities), will interview VO participants, and will measure VO performance in context-specific ways. The project will: (1) develop tools to measure organizational fluidity and make that fluidity visible to VO participants; (2) examine the relationship between organizational performance, the fluidity of group membership and fluidity of leadership in virtual organizations. The techniques pioneered in this proposal will increase understanding of how to use technical system log data to more quickly identify the most effective social structures and leadership strategies in VOs. The results and tools developed in the course of the project will have practical value for those seeking to improve VO performance for science, industry and government organizations that increasingly rely on virtual organizations for their success. A number of undergraduate and graduate students will participate in the project, furthering their training and education in interdisciplinary research.","title":"VOSS: Toward a Context Adaptive Theory of the Relationship Between Structural Fluidity and Virtual Organization Performance","awardID":"1422982","effectiveDate":"2013-11-01","expirationDate":"2015-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7642","name":"VIRTUAL ORGANIZATIONS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8031","name":"Science of Organizations"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7953","name":"SOCIAL-COMPUTATIONAL SYSTEMS"}}],"PIcoPI":[565341],"PO":[565342]},"208717":{"abstract":"This award is to fund a transformational data intensive resource for the open science community called Wrangler. Big data is creating tremendous new scientific opportunities, but also many new challenges for data-driven science. The computational needs of large-scale data-driven science vary across domains and applications but there are some requirements that are widely applicable: capacious, high performance, reliable data storage; support for diverse data types and access methods; and support for embedded analytics that eliminate costly data movement. Wrangler is a high performance system with an innovative embedded data analytics capability that far exceeds the capabilities available to the open science community today. It contains massive data storage, which can be expanded if required, high performance, and support for both structured and unstructured data. The storage is configured for ultra-high reliability using replication at two locations, unprecedented analytics capabilities and innovative NAND flash storage. The resource contains 3000 next generation Intel Haswell cores, offering the most powerful embedded analytics capabilities in the world for a wide range of data intensive science. Wrangler will be connected at 100 Gbps to Internet2, the fastest available connection to the biggest research network. The project will also offer a data docking service for receiving and ingesting data shipped on physical media. Augmented by Stampede & XSEDE, Wranglers capabilities will be enhanced through tight integration to TACC?s Stampede supercomputer, and through TACC to other XSEDE resources.","title":"Wrangler: A Transformational Data Intensive Resource for the Open Science Community","awardID":"1341711","effectiveDate":"2013-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":[559502,559503,559504],"PO":["565292"]},"202779":{"abstract":"This project will create a simulation facility that will advance a capability to study the social interactions of two children, or a child and parent, as the two people walk or bicycle across a traffic-filled roadway. The project will expand existing infrastructure at the University of Iowa to build a new simulator that matches a recently installed simulator at the same institution, which will permit each of two experimental participants to inhabit their own separate simulated environment. The two simulators will be connected by a high-speed network and programmed to share a single, virtual environment that can be configured for either bicycling or walking. Experimental participants will control their motion by actually walking or cycling across these virtual intersections, surrounded by graphically rendered images that show a real-time, first-person view of their motion through the environment. A full-body motion tracking system will be used to create high-fidelity avatars that represent participant motions to provide a realistic experience of walking or riding with a friend or parent.<br\/><br\/>Intellectual Merit<br\/><br\/>On the computational side, this research will advance the technology for immersive, interactive virtual environments by developing methods to represent full-body movements in avatars moving through large-scale environments, and by studying how the fidelity of avatar movements influences rider and pedestrian interactions. On the behavioral side, this research will advance an understanding of social influences on risk taking by studying how children interact with friends or parents in the context of crossing roads, an everyday and yet risky activity. The reciprocal relations between the computational and behavioral components of this project will motivate creative solutions to the computational challenges that arise in creating realistic avatars and semi-autonomous agents and will enable new discoveries about the psychological processes underlying risky road-crossing behavior within the context of a virtual environment.<br\/><br\/>Broader Impact<br\/><br\/>This research will help to address public health problems by contributing to an understanding of the risk factors for car-bicycle and car-pedestrian collisions. The project will create a foundation for future intervention studies that will help to reduce such collisions. Advances in simulation technology, experimental methodology, and methods to create life-like avatars will contribute to the development of virtual environments for use in behavioral research and simulation-based training. The results of this work will be disseminated to the public through scientific publications and presentations, along with community-based activities such as open house events and bicycling\/pedestrian safety lectures for the public.","title":"II-EN: Shared Virtual Environments for Studying Social Influences on Risky Cycling and Pedestrian Behavior","awardID":"1305131","effectiveDate":"2013-11-01","expirationDate":"2016-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[543444,543445,543446,543447,543448],"PO":["565362"]},"210008":{"abstract":"This award supports a research development workshop for promising doctoral students to be held in conjunction with the 2014 ACM Conference on Computer Supported Cooperative Work (CSCW 2014). CSCW 2014 will take place in Baltimore, Maryland, USA on February 15-19, 2014 and will be attended by approximately 500 CSCW professionals from around the world. Research reports published in the CSCW Conference Proceedings are heavily refereed and widely cited.<br\/><br\/>The Doctoral Colloquium (DC) is a research-focused meeting of 12 selected Ph.D. candidates and a panel of 4-6 research mentors. Prior colloquia have helped launch the careers of many outstanding CSCW researchers. The colloquium seeks to (a) build a cohort group of new researchers who will then have a network of colleagues spread out across the world, (b) guide the work of the new researchers by having the experts in the research field give advice, (c) encourage and support the selection of CSCW research topics, (d) enable new entrants to the field to attend a key research conference, (e) illustrate the interrelationship and diversity of CSCW research, and (f) make the new entrants' experience at CSCW an intellectually stimulating and rewarding experience, encouraging them to return and submit papers, panels, demonstrations, and posters, to the conference. Key efforts of the organizers will encourage participation from diverse fields and underrepresented populations and universities.<br\/><br\/>The primary intellectual contributions of this project lie in close intellectual mentoring of the selected Ph.D. participants and the development of a cohort of future leaders within the CSCW community. Furthermore, bringing together these students with the faculty panel, both during the workshop and during the conference poster presentations, will support the development of interdisciplinary dialogs, creating an environment for exchange and conversation that will further enable progress on every project represented at the DC. The specific projects of students selected for the DC will generate additional intellectual contributions.<br\/><br\/>The consortium will have considerable benefits to society and the CSCW community, both short and long-term. In the short term, the panelists will provide significant feedback to the students participating in the DC. In the long-term, the expectation is that students who have participated in the DC will give back to the community by engaging as mentors to undergraduate students, and in the future to doctoral students. Furthermore, these exceptional students are anticipated to be among the future leaders of the CSCW community, and it is durable long-term benefit to that community to support them in their early research. These values of continuity and knowledge community will be explicitly expressed at the consortium.","title":"WORKSHOP: Computer Supported Cooperative Work 2014 Doctoral Research Colloquium","awardID":"1350764","effectiveDate":"2013-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562931],"PO":["565342"]},"209081":{"abstract":"The very success of the industries that produce information technology (IT) and the pervasiveness<br\/>of their products and services in our daily lives can obscure the mutually reinforcing<br\/>roles that industry, government, and academia play in conducting IT research and its translation<br\/>into new products, services, and industries. This project will capture examples of such phenomena<br\/>as how much industry builds on government-funded university research, the long incubation<br\/>periods sometimes needed for research to be translated into major industry activities, the<br\/>steady work and funding required to get from initial exploration to large-scale commercial<br\/>deployment, the interdependencies between research advances in different subfields, and the<br\/>complex nature of the IT research ecology. This project will build on earlier work by<br\/>developing additional and\/or more in-depth examples and providing updated information<br\/>on research impacts and the other phenomena listed above in the context of these examples.","title":"Continuing Innovation in Information Technology: A Workshop","awardID":"1343663","effectiveDate":"2013-11-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["560890"],"PO":["565136"]},"208350":{"abstract":"The Level Playing Field Institute will design and implement a comprehensive Advanced Placement computer science preparatory course sequence within its 3-year Summer Math and Science Honors Academy (SMASH) to prepare underrepresented high school students of color to pursue computer science degrees in higher education. The project will to provide 345 African American and Latino low-income, first-generation high school students from schools in the San Francisco Bay Area and Los Angeles Area the opportunity to engage early (9th grade) and consistently (three 5-week courses over 3 summers) with computer science curriculum. This course sequence will adopt the Exploring Computer Science curriculum and introduce students to the field of computer science, while making computer science relevant to the cultural background and lived experiences of students of color. This project aims to: (1) integrate computer science into the core program components of the SMASH Academy, providing a 3-year AP CS Principles preparatory sequence for all students; (2) examine the impact of a 3-year computer science sequence on the learning outcomes, aspirations, beliefs, attitudes, and longitudinal outcomes of underrepresented high school students; and (3) examine the impact of online AP CS Principles courses on student outcomes and examine implications for online computer science courses to address disparities facing underrepresented students and broaden participation in computer science.","title":"BP: The Development, Implementation, and Evaluation of an AP Computer Science Preparatory Sequence for Underrepresented High School Students","awardID":"1339424","effectiveDate":"2013-11-01","expirationDate":"2016-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558345,558346,558347],"PO":["560704"]},"209134":{"abstract":"To prescribe safe medications, physicians use computerized physician order entry (CPOE) that routinely relies on drug-drug interaction (DDI) alerts. Despite the current attempts to reduce frequency and complexity of alerts, the effectiveness of such alerts remains extremely low, with up to 96% of warnings being ignored by physicians on a daily basis. The primary cause for this is alert fatigue, a state in which physicians, bombarded by numerous warnings, become desensitized. The goal of this project is to transform drug safety alerts from oft-ignored warnings to trusted tools that advise physicians in daily decision making. To accomplish this, the investigators are aiming beyond incremental improvement establishing novel principles for alert design that are based on what physicians consider important when taking advice from peers in their daily clinical work. The project is addressing this problem with a three prong approach: (1) determining principles that accompany trusted physician-to-physician advice regarding appropriate medication prescribing; formative studies will be conducted in a variety of clinical settings to identify key factors in sharing trusted advice among doctors and residents; (2) generating novel designs for drug safety guidance that elicit physician trust and maximize compliance and (3) evaluating the impact of novel designs on physician compliance to DDI warnings.<br\/><br\/>Intellectual Merit:<br\/>By investigating the question of why physicians trust each other, the project is leveraging a fundamental behavioral dynamics reconsidering the role of clinical alerts, and thus generating new principles to design effective computerized guidance that elicits similar notions of trust. A very important contribution of this research is a more complete understanding of what makes physician-to-physician advice trustworthy in the ecosystem of daily clinical activities provides a solid, long-term intellectual basis for the creation of substantially better alerts for a broad variety of CPOE systems. Key innovative aspect of this work is the departure from the mere optimization of alerts to focus rather on complex yet crucial dynamics by which trusted advice is shared among physicians. There are potentially transformative aspects of the proposed work, which if successful, could unleash a new generation of drug-drug interaction warnings that will substantially advance the level of adherence in daily medication prescribing.<br\/><br\/>Broader Impacts:<br\/>The outcomes from this project will potentially affect the over 600,000 physicians in the United States who spend the majority of their time in direct patient care, and who are exposed to dozens of DDI alerts on a daily basis. By reframing current alerting strategies, the project results are expected to substantially increase safe drug prescription in day-to-day clinical setting. The investigators are disseminating the project results through large-scale real-world CPOE deployments and live experimental evaluations available to hundreds of physicians. The team is also reaching out to CPOE vendors, to promote the incorporation of the ideas generated in the project in the current and next generation of products. Ultimately, this basic research in physician communication and human-computer interaction is providing the research basis to catalyze a change in industry practice, also facilitated by the PI's leadership of the EMR Innovations Summit, an annual meeting of national EMR vendors hosted by the Regenstrief Institute.","title":"SCH: EXP: From Critique to Collaboration: A Fundamental Rethinking of Computerized Clinical Alerts","awardID":"1343973","effectiveDate":"2013-11-01","expirationDate":"2016-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560582,560583],"PO":["564768"]},"208635":{"abstract":"This project utilizes NSF support to enhance the networking capabilities at Kansas State University to support high-end applications in science and engineering, particularly bioinformatics, with applications in OpenFlow research and privacy\/security.<br\/><br\/>The project adds a pair of high-performance, low-latency OpenFlow-compatible enterprise routers to provide a foundation for upgrading KSU's campus core network to 40GbE, and 10GbE to most major research buildings on campus. KSU is adding another router to set up a science DMZ for research in OpenFlow and Smart Grid research. This impacts over 24 departments in 16 locations, 8,000 undergrad majors, 2,000 grad students, 700 faculty, and $88M in funded research. This system, along with the expertise provided by related personnel, serves as a common hybrid network technology platform for a number of research groups in genomics, smart grids, GIS\/environmental modeling and computer security at K-State and off-campus partners.<br\/><br\/>The project increases KSU's ability to look deeper in modeling genomes, Smart Grids, GIS economies and computer security through bringing much greater bandwidth and flexibility to bear, attacking grand challenges like forecasting responses of ecological systems to genetic changes. KSU expects to help protect the nation through developing better understanding of threats to key agricultural products, like the Hessian fly, which attacks wheat. KSU also plans to gain insight into advanced networking and its interaction with controlling the effects of brownouts or sabotage on the electrical grid; and significantly enhance and integrate educational efforts at all levels for data-driven computing, particularly in bioinformatics.","title":"CC-NIE Network Infrastructure: KGAP: Bridging th Gap in Network Flexibility and Performance for Genomics and Data-Intensive Research at Kansas State University","awardID":"1341026","effectiveDate":"2013-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8080","name":"Campus Cyberinfrastrc (CC-NIE)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["110718",559268,559269,559270,559271],"PO":["564246"]},"210396":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 10 promising graduate students from the United States and abroad (no more than 2 expected to be from outside the country), along with 5 distinguished research faculty. The event will take place on Sunday, October 20, immediately preceding and in conjunction with the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS 2013), to be held Monday-Wednesday, October 21-23, in Bellevue, WA. The ASSETS conferences are the premier forum for presenting innovative research on the design and use of both mainstream and specialized assistive technologies. This includes the use of technology by and in support of: individuals with hearing, sight and other sensory impairments; individuals with motor impairments; individuals with memory, learning and cognitive impairments; individuals with multiple impairments; older adults; and professionals who work with these populations. Researchers and developers from around the world in both academia and industry will meet to exchange ideas and present their latest work. More information about the conference may be found at http:\/\/www.sigaccess.org\/assets13. <br\/><br\/>A key component of building this community is through its youth. The ASSETS 2013 doctoral consortium will provide an opportunity for graduate students from diverse backgrounds (computing, engineering, psychology, architecture, etc.) to come together and explore their research interests in an interdisciplinary workshop, under the guidance of the PI and a panel of other distinguished experts in the field, so that they can appreciate the broader spectrum of research and development approaches to assistive technologies and universal usability, and also experience the community in which they can pursue their endeavors. Student participants will make formal presentations of their work during the consortium, and will receive constructive feedback from the faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the consortium will help shape ongoing and future research projects aimed at assistive technologies and universal access, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will also expose these promising young researchers to a larger community. In an effort to further integrate doctoral consortium participants into the conference itself, a (poster) session has been set aside in the technical program to allow all doctoral consortium participants to present their research to the full conference. In addition, one student from the doctoral consortium will be selected to deliver the closing plenary presentation. An evaluation of the consortium will be conducted and the results made available to the organizers of future such events. <br\/><br\/>Broader Impacts: The doctoral consortium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field. The organizers will take special steps to promote participation from institutions with relatively large numbers of students from under-represented groups; to further increase diversity, participation will be limited to at most one male and one female student from the same institution.","title":"WORKSHOP: Doctoral Consortium for ASSETS 2013","awardID":"1355986","effectiveDate":"2013-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[563803],"PO":["565227"]}}