{"2599":{"abstract":"IRI-9509067 William C. Rounds University of Michigan $84,231 - 12 mos. Imperfect Information Flow: Modeling Channels and Defaults in Domain Theory This work is an attempt to use techniques used in the semantics of programming languages to unify some concepts in intelligent systems modeling. More specifically, it studies the flow of information which admits errors but still allows useful information to be transmitted. In previous work, a theory of such information flow, called default model theory , grounded in domain theory, has been developed. Default model theory allows information used at one point in a computation to be overwritten when new \"strict\" information becomes available, providing a means of understanding default and nonmonotonic reasoning from the perspective of information channels. This work will also investigate applications to natural language processing, logic programming, and database handling.","title":"Imperfect Information Flow: Modelling Channels and Defaultsin Domain Theory","awardID":"9509067","effectiveDate":"1996-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["202485"],"PO":["54008"]},"8979":{"abstract":"Maly 95-54261 Building on its expertise in networking, computer supported collaborative work, and remote learning, Old Dominion University will prepare to build a statewide highly Interactive Remote Instruction (IRI) pilot system based on networked workstations. Technology and pedagogical methods developed in the system will be integrated into TELETECHNET, a state funded program in which Old Dominion University and community colleges provides four-year degree programs. The first two years are being taught at the community colleges with the last two being provided by Old Dominion University to remote community college campuses via networked and televised course instructions. The project will consist of a three-year phase of research, development, implementation and evaluation. Significant contributions include: 1) refining an existing IRI system to provide an open-ended teaching\/learning environment with a set of basic features easy to use by students and faculty of all disciplines; 2) developing the basic concepts of new instructional methods to exploit the interactivity of the system in support of higher domains of learning; and 3) bringing together a consortium of government, industry and academic individuals who are dedicated to innovative approaches to education for the 21st century, and 4) providing Virginia with a cost-effective method of delivering high quality education remotely; and 5) serve as a model for other states faced with similar problems. The proposed open hardware\/software architecture uses existing technologies but anticipates the wider availability of a high-speed Information Superhighway and multimedia workstations in the near future. The system provides two-way video to remote sites; shared operation of X-window tools and applications; interactive note-taking; a VCR-like replay of past classes and ancillary material and a full motion video window which can display the instructor, a classroom demonstration, or any PC, Macintosh or X-window application. These in structional capabilities enables instructors and students to access multimedia generated from a variety of sources and to use group collaboration tools for interaction between two participants, among small groups, or entire classes. The system will provide audio-visual interaction and allow faculty and remote-site students to share the manipulation of software tools, such as spreadsheets or chemistry models. While the elements of IRI are currently technically feasible, a major portion of the project's efforts are directed to the developing of new student-centered teaching methods and paradigms which take advantage of the environment and to refining the hardware and software through experience of actual instructional needs. This system will provide easier access to higher education for both traditional and non-traditional students, who for personal or financial reasons choose not to reside at a four-year institution. IRI will promote effective use of network and computer technology for all participating students and faculty.","title":"Collaborative Interactive Remote Instruction","awardID":"9554261","effectiveDate":"1996-01-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7263","name":"NETWORKING INFRASTRUCT-EDUCAT"}}],"PIcoPI":["338005",22530,"254934"],"PO":["564412"]},"6559":{"abstract":"The proposed work creates human language resources to stimulate research in three important areas: (a) automatic language identification-- the problem of identifying the language being spoken; (b) robust speech recognition-- the problem of recognizing speech from different microphones, communication channels, and environmental conditions; and (c) speaker recognition-- the problem of identifying a speaker based on his or her voice characteristics. To support research in automatic language identification, over two minutes of speech from 300 speakers in each of twenty two language is being collected. To support research in robust recognition, about two minutes of cellular speech from several thousand speakers is being collected. To support research in speaker recognition, twelve hundred speakers are providing speech samples during ten telephone calls over a two year period. For each corpus, the speech is annotated orthographically, and a portion of each corpus is transcribed phonetically. A critical need for annotated speech corpora is met by this work: to stimulate research in three important areas of human language technology, leading to secure access to the information highway by any person who speaks a language.","title":"Human Language Resources for Research in Multilanguage Systems, Robust Recognition, and Speaker Identification","awardID":"9529006","effectiveDate":"1996-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[16090,"34230","551122"],"PO":["565227"]},"2896":{"abstract":"9510244 Bach The goal of this project is to study the computational complexity of number-theoretic problems. Algorithms for solving these problems are useful in the design of systems for random number generation, cryptography, and computer algebra. In addition, many of the classic questions in complexity theory (such as whether randomization helps in efficient computation) are motivated by computational number theory. Our proposed investigations fall into three categories: a) Computations and explicit bounds in analytic number theory. b) The design and analysis of number-theoretic algorithms. c) Constructive techniques in algebraic geometry and commutative algebra.","title":"Algorithmic Number Theory","awardID":"9510244","effectiveDate":"1996-01-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["321051"],"PO":["187585"]},"1987":{"abstract":"IRI-9506670 Prietula, Robert University of Florida $6,000 - 12 months NSF-CONACYT Workshop on Computational Organization Theory This project is concerned with a focused, one-day NSF Workshop on Computational Organization Theory to be held in conjunction with 1996 International Symposium on Artificial Intelligence, hosted by the Instituto Tecnologico y De Estudios Superiorcs de Monterrey (ITESM) in Monterrey Mexico.","title":"NSF-CONACyT Workshop on Computational Organization Theory; Monterrey, Mexico","awardID":"9506670","effectiveDate":"1996-01-01","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["397037"],"PO":["54008"]},"19076":{"abstract":"","title":"RIA: Unified Data and Code Based Program Partitioning on Distributed Memory Systems","awardID":"9696129","effectiveDate":"1996-01-01","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550988"],"PO":[48424]},"15282":{"abstract":"9625544 Loveland This workshop will assess the achievements, opportunities and goals of the field of automated deduction. Some key researchers of the field and a sample of users of the technology will be assembled to address in particular the impact of automated deduction on other fields, present and future. This workshop will produce reports to NSF and the larger scientific community, identifying the major accomplishments, and discussing future directions, for the automated deduction field. ***","title":"Workshop on Future Directions of Automated Deduction, March 2-3, l996, Chicago, IL","awardID":"9625544","effectiveDate":"1996-01-01","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[38604],"PO":["187585"]},"19022":{"abstract":"","title":"Engineering Databases Supporting Dynamic Extensibility and Partial Integrity","awardID":"9696075","effectiveDate":"1996-01-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["85115","140393"],"PO":["563751"]},"19069":{"abstract":"","title":"CAREER: Computer - Aided Verification","awardID":"9696122","effectiveDate":"1996-01-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["226709"],"PO":["150697"]},"19038":{"abstract":"","title":"Algorithms and Tools for the Automatic Analysis of Embedded Systems","awardID":"9696091","effectiveDate":"1996-01-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["226709"],"PO":["150697"]},"19208":{"abstract":"","title":"NorthWestNet--A Proposal for Continued Support (renewal)","awardID":"9696261","effectiveDate":"1996-01-01","expirationDate":"1997-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[48722],"PO":["57343"]},"5075":{"abstract":"; R o o t E n t r y F % \\ C o m p O b j b W o r d D o c u m e n t O b j e c t P o o l % \\ % \\ 4 @ ( ) * + , - . \/ 0 1 F Microsoft Word 6.0 Document MSWordDoc Word.Document.6 ; 9522573 Pardalos This grant provides funding for a conference on network optimization, Hosted by the Center for Applied Optimization at the University of Florida, this conference will bring together leading researchers working on many different aspects of network optimization and on diverse applications in fields such as engineering, computer science, operations research, transportation, telecommunications, and manufacturing. It will also provide a unique opportunity for cross-disciplinary exchange of research. The conference has received endorsements from the Mathematical Programming Society and the Institute for Operations Research and Management Science, and is being held in cooperation with the Society for Industrial and Applied Mathematics. Networks are pervasive in modern life, whether real, as in the case of highways, pipelines, electrical systems, etc., or more abstract network models which represent interconnections among components of a complex system. Advances in data structures and computer technology and the development of new algorithms have made it possible to solve classes of netwo rk optimization problems that were formerly intractable. Among these are problems in airline scheduling, transportation planning, satellite communications, water resource allocation, environmental modeling and VLSI chip design. Papers presented at this conference will represent the state-of-the-art in network modeling and solution techniques. A selection of these papers will be placed in the public domain by the publication of special issues of refereed scholarly journals. *** Oh +' 0 S u m m a r y I n f o r m a t i o n ( ' $ H l D h R:\\WWUSER\\TEMPLATE\\NORMAL.DOT lagnese lagnese @ Wzp @ J# @ G @ ^ Microsoft Word 6.0 2 e = e ? ? j j j j j j ? D D F F F c % T y \" j j j j j D j r j j j j D 9522573 Pardalos This grant provides funding for a conference on network optimization, Hosted by the Center for Applied Optimization at the University of Florida, this conference will bring together leading researchers working on many different aspects of network optimization and on diverse applications in fields such as engineering, computer science, operations research, transportation, telecommunications, and manufacturing. It will also provide a unique opportunity for cross-disciplinary exchange of research. The conference has received endorsements from the Mathematical Programming Society and the Institute for Operations Research and Management Science, and is being held in cooperation with the Society for Industrial and Applied Mathematics. Networks are pervasive in modern life, whether real, as in the case of highways, pipelines, electrical systems, etc., or more abstract network models which represent interconnections among components of a complex system. Advances in data structures and computer technology and the development of new algorithms have made it pos","title":"Mathematical Sciences: Conference on Network Optimization: State of the Art","awardID":"9522573","effectiveDate":"1996-01-01","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["210085","485318","438489"],"PO":["209579"]},"5560":{"abstract":"The project studies techniques for performing efficient communication in parallel computers that have faulty components. Parallel computers with a large number of identical processors have a great potential for fault-tolerance. The main challenge that must be overcome in order to exploit this potential for fault- tolerance is the fact that faults also affect communications between processors. Hardware faults in processors, routers, and communication links force messages to take new paths that avoid the faulty components. In addition, the mapping of computations from faulty processors to nonfaulty ones changes the pattern of communication. As a result, faults can have a major impact on the performance, and even correctness, of the communication subsystem in a parallel computer. Specifically, the project focuses on the following two key issues; creating efficient, deadlock-free routing algorithms for parallel computers with faulty components, and developing efficient mappings of communication-intensive real-time applications to parallel computers that contain faults. This research will result in more efficient use of parallel computers and a better understanding of how their inherent potential for fault-tolerance can be utilized.","title":"Techniques for Fault-Tolerant Communication in Parallel Computers","awardID":"9525887","effectiveDate":"1996-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[13627],"PO":[13628]},"6344":{"abstract":"9528296 Jordan This project connects the Institute for Manufacturing and Automation Research to the Internet over a 128Kbps line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"Next Generation Manufacturing Network-International (NGMNET-I)","awardID":"9528296","effectiveDate":"1996-01-01","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["275915","59958"],"PO":["43608"]}}