{"105359":{"abstract":"This award will: (1) conduct a detailed case study of one integrated criminal justice system (the San Diego, CA area's Automated Regional Justice Information System (ARJIS) for the purposes of (2) comparing this case study to case studies which have been started on similar systems in the United States (in DC and PA) and United Kingdom (The Police Information Technology Organization, a national level effort in the UK).<br\/><br\/>The technical merit of this work will be realized through three contributions:<br\/>1. Findings and generalizable principles regarding appropriate governance structures, operational plans and work arrangements to better support integrated criminal justice activities.<br\/>2. Design criteria to support development of future (and evolution of current) information systems to better support integrated criminal justice.<br\/>3. Findings and guidance regarding policy issues relative to information sharing; building and using integrated criminal justice systems and their governance. <br\/><br\/>The broader social impacts of this work will be reflected in two contributions:<br\/>1. The design and operational guidance will lead to improved systems and increased usage, leading to safer communities, greater homeland security, more pro-active policing and improved e-government.<br\/>2. The design and operational guidance will also provide insights into improving inter-agency and cross-level work and governance, an important aspect of improved government.","title":"SGER: Integrated Criminal Justice","awardID":"0512458","effectiveDate":"2005-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["561666"],"PO":["371077"]},"101003":{"abstract":"This CAREER proposal will investigate three key areas of online information exchange: the exchange of information about competing products, the exchange of information goods in peer-to-peer networks, and the exchange of ideas and opinions within online communities. Each area has a particular design characteristic that is underutilized in current information exchanges, but which can be used to improve the efficiency of online information provision and consumption. In the case of product information exchange, the PI will analyze the malleability of information display -- the ability to passively learn customer preferences and dynamically alter the assortment of information shown to customers based on their individual tastes and needs. In the case of peer-to-peer networks, the PI will analyze the malleability of incentive design -- the ability to easily change the incentives provided within information exchanges to achieve socially desirable outcomes. In the case of communities, the PI will analyze the malleabilty of social interactions -- how rich media interactions can change the organization of communities of discourse and the dissemination and persuasiveness of messages exchanged in these communities. This project will have a direct impact on the education of social science, economics and engineering students through course development at CMU. The PI has developed course modules and data exercises related to market efficiency, consumer surplus gains in Internet markets, and customer online behavior. A new course is proposed entitled, \"Designing Efficient Electronic Markets.\" This course will include new modules on improving efficiency in Internet markets, designing online reputation systems, designing online collaborative filtering systems, designing a better shopbot, incentives to peer-to-peer networks, and efficient regulation of Internet markets. Each module will include a lecture on the relevant market and design issues and an exercise designed to statistically analyze available data and based on this analysis to propose technical solutions to improve market design.","title":"CAREER: Designing Efficient Information Exchanges: A Program for Research and Teaching","awardID":"0448516","effectiveDate":"2005-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["255915"],"PO":["564456"]},"104699":{"abstract":"Over the last three years the Claremont Graduate University, in collaboration with the University of<br\/>Minnesota, has investigated the time-critical nature of emergency medical services (EMS) and the<br\/>implications for information systems that support these services. This proposal aims to extend this work<br\/>by exploring conceptual model development for time-critical information services generally and EMS<br\/>specifically and convening a workshop of interested researchers. The motivation for this study and workshop is to improve the public welfare through a better understanding of how IT and organizations interact to deliver time-critical services such as emergency medical services.<br\/><br\/>Intellectual Merit<br\/><br\/>While there is a burgeoning literature on digital government processes, to date, there has been minimal attention to the time-criticality dimension of information services. This research and workshop will develop a foundation for conceptual and empirically-based tools that can improve scientific understanding about how information and organizational systems interact to facilitate and\/or thwart the delivery of time-critical information services. From a methodological perspective, the project will explore how both qualitative (e.g.,<br\/>ethnographies) and quantitative (e.g., simulation) methods can aid in understanding end-to-end<br\/>performance of e-government services.<br\/><br\/>Broader Impacts<br\/><br\/>The project findings are aimed to improve the performance of time-critical egovernment<br\/>services. This information can serve a broad range of policy makers (including transportation, health care, public safety, and emergency management) and increase general understanding of information technology and organizational dynamics associated with time-critical information services. By increasing the time-responsiveness of services such as EMS, the aim is to benefit a broad range of citizens from diverse racial, income, and ethnic backgrounds.","title":"SGER: Time-Critical Information Services: Exploratory Analysis of Information and Organizational Dimensions in Emergency Medical Services","awardID":"0508938","effectiveDate":"2005-03-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["290087"],"PO":["371077"]},"103435":{"abstract":"The National Energy Technology Laboratory (NETL) has a need for supercomputing time, technical and software support, and training to carry out its on-going Computational, Energy Science and Virtual Demonstration Program. These requirements include an archiving system that must be available to store the data that will be generated and three-dimensional visualization capability to aid in analyzing simulation results. NETL supports the advancement of energy and environmental technologies through the application of high performance computing and communications (HPCC) among its other regional partners. The Pittsburgh Supercomputing Center (PSC) a Research Center of Carnegie Mellon University (CMU), operates one of the leading supercomputing centers in the nation as well as nationally recognized Internet and Internet2 point of presence and regional network aggregation capability than can satisfy NETL's requirements for supercomputing time, technical and software support, training and outreach and coordination support. PSC will provide supercomputing time, technical and software support, training and outreach and coordination support to NETL as a result of this inter-agency transfer of funds to support this activity.","title":"SCI: Terascale Computing System (NETL Support)","awardID":"0502665","effectiveDate":"2005-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"H138","name":"DEPARTMENT OF ENERGY"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"H281","name":"DEPT OF ENERGY"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"H369","name":"NATL ARCHIEVES AND RECORDS"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"S016","name":"US DEPT OF ENERGY"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T328","name":"ENERGY-SUPERCOMPUTING SERVICES"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T393","name":"ENERGY-SUPERCOMPUTING SERVICE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T482","name":"ARCHIVES-NARA'S ELEC RECORDS"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T513","name":"ENERGY-SUPERCOMPTING SERVICE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T625","name":"ENERGY-SUPERCOMPUTING SERV &"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T733","name":"ENERGY -SUPERCOMPUTING SERVICE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T734","name":"ENERGY -SUPERCOMPUTING SERVICE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T829","name":"ENEGRGY-SUPER COMPUTING SERVIC"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T927","name":"ENERGY-SUPERCOMPUTTING SERVICS"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"T929","name":"NARA-ERA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"T011","name":"ENERGY-SUPERCOMPUTING SERV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"T253","name":"ENERGY-SUPERCOMPUTING SERV &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V829","name":"ENERGY-SUPERCOMPUTING SER & SU"}}],"PIcoPI":["538216"],"PO":["525727"]},"105306":{"abstract":"This is an integrated research program on a new area with a rich array of applications: the problem of recovering a signal from its noise-corrupted version. The recovery can assume two major modes depending on the application: noncausal, i.e. it starts once the entire signal is available; and causal, i.e. decisions must be made immediately after each symbol is received. Our focus is on the theory and practice of denoising for the case where the alphabet of the noiseless, as well as that of the noise-corrupted signal, are finite. The problem arises in a variety of situations ranging from typing and\/or spelling correction to hidden Markov process state estimation; from DNA sequence analysis and processing to enhancement of facsimile and other binary images; from blind equalization problems to joint source-channel decoding when a discrete source is sent unencoded through a discrete noisy channel. Certain instances of the discrete denoising problem have been studied, particularly in the context of state estimation for hidden Markov processes, assuming that the signal statistics are known. However, the literature on the universal setting, where there is uncertainty regarding the distribution of the underlying noiseless signal and\/or regarding the noise-corrupting mechanism, has been sparse until this research. The compression-based approach to universal discrete denoising that preceded our research gave rise to schemes that were not implementable with reasonable complexity, and were considerably suboptimal relative to the case where the statistics are known.<br\/>This research develops universal algorithms for discrete denoising without the need to know the statistical characterization of the noiseless signal. Promising results are obtained for the case of an unknown discrete source corrupted by various types of discrete channels. We show that it is possible to achieve universally the same asymptotic performance under any given distortion criterion as an algorithm that knows, and is specifically tailored for, the input statistics. Furthermore, we accomplish this with computational complexity that grows linearly with the size of the data.","title":"Universal Discrete Denoising","awardID":"0512140","effectiveDate":"2005-03-01","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["551175"],"PO":["564898"]},"100984":{"abstract":"One of the greatest challenges in modern data analysis is to find significant and non-obvious patterns within immense and complex data sets. The detection of such salient patterns is an indispensable tool for comprehending the trends and meaning of data. Such tools are required by scientists, economists, marketing analysts, and all other data analysts. This project is developing new methods and tools for identifying the salient patterns within complex data sets and has the following objectives: design robust and scalable algorithms for mining the most salient patterns; evaluate the significance of mined patterns in the context of complex and noisy data; and integrate and correlate heterogeneous data sets based on corresponding patterns. The project is focussed on problems related to bioinformatics with four driving applications: Integrative Genetics of Cancer Susceptibility, HIV Salivary Gland Disease (SGD) Pathogenesis, Discovering Family Specific Residue Packing Patterns of Proteins, and Integrative Functional Annotation of Proteins. All of these applications produce massive quantities of data thereby providing an excellent testbed for the salient pattern mining algorithms being developed in this project.<br\/><br\/>The intellectual merits include a new class of data analysis tools for analyzing the huge data sets generated by modern quantitative genetics technologies. These tools will assist biologists in their study of functional proteomics, aid in their understanding of disease progression, and assist in the search for effective treatments. In order to be useful, the data mining techniques must also be accurate, computationally efficient, and operate autonomously. If successful, this project will make significant contributions to bioinformatics and computational biology. Results from this research will be disseminated through publications and the software will be made publicly available through a web portal. <br\/><br\/>The broader impacts of this research include interdisciplinary collaboration and training, immediate applications to fields other than life sciences, a multitude of educational impacts, and outreach to underrepresented groups in the sciences. The pattern mining methods will be applied to analyze the administrative paperwork of child welfare cases from the North Carolina Department of Health and Human Services (NC-DHHS) in an effort to improve services and achieve better outcomes for children in the welfare system. Long-term interdisciplinary collaborations with scientists have been established and will be strengthened during the course of this project. Educational impacts include new curriculum developments for computer science and bioinformatics, support of multidisciplinary educational experiences, and services to the research community.","title":"CAREER: Mining Salient Localized Patterns in Complex Data","awardID":"0448392","effectiveDate":"2005-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7373","name":"ITR-INFORMATION INTEGRATION"}}],"PIcoPI":["234536"],"PO":["565136"]},"100896":{"abstract":"0447900<br\/>Janet Wang<br\/>University of Arizona<br\/><br\/>CAREER: Variational Methods for Design Complexity in Nanometer VLSI Circuit<br\/><br\/>The growing design complexity of nanometer scale (component length ~ 10-9 m) VLSI\/ULSI (Very- and Ultra-Large-System-Integration) circuits cause escalating research\/design costs that are likely to hinder the creation of cheaper and faster computer processors. To illustrate, the current Complementary-Metal-Oxide-Semiconductors (CMOS) processes requires complicated physical modeling in order to accurately predict the performance of the fabricated product. Process variation, coupling<br\/>capacitance, mutual inductance, and MOSFET leakage currents are jargon-specific concepts for such intricate physical details peculiar to components (e.g. gates) of very small (~ 10-9 m) physical dimensions.<br\/>These time-variant, unsteady effects induce severe uncertainties < \/B>in the operating speed of the cicuit, in the integrity of the pre- and post-circuit signal, in the power consumption, and in the distribution<br\/>of undesirable hot-spots within the circuit architecture. <br\/><br\/>The PI strives to alleviate design cost through the creation of Electronics Design Automation (EDA) tools that benefit from specialized variational analysis techniques. As the acronym implies, EDA tools<br\/>automate many steps of the circuit design and reduce the complexity workload for the design engineer. Thi s CAREER proposal outlines a hybrid research\/education program for The University of Arizona at<br\/>Tucson. The research program is expected to generate indispensable and applicable knowledge in modeling , design, and verification of increasingly complex ULSI circuits whereas the educational component<br\/>endeavors to train students in the creation, upgrade, and maintenancy of future EDA tools. The following technological broader impacts are likely to manifest themselves through the proposed research. An<br\/>improved ratio of functional to defective units in a microprocessor batch (yield production) would translate into immense revenue savings for high volume manufactures. Chip circuit designers may have the<br\/>option to adjust important design parameters (e.g. chip clock frequency) to maximize the performance of the processor. The ability to predict full chip\/package temperature profile would allow the elim ination of<br\/>hot-spots that negatively affect the performance of the circuit. Advanced EDA tools would automate complex design rules and streamline the design decision process for upcoming new bio- and nano- materials.<br\/>The increased availability of under- and post-graduate cutting-edge electronics eduction for women and minority constitutes an important social broader impact that provides these sectors with skills to compete<br\/>in the high-end Integrated Circuit (IC) design industry within the next 20 years.","title":"CAREER: Variational Methods for Design Complexity in Nanometer VLSI Circuit","awardID":"0447900","effectiveDate":"2005-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[266172],"PO":["562984"]},"101006":{"abstract":"User interfaces for pen-stylus systems have not managed to deliver the fluid, seamless, natural interaction afforded by pen and paper interfaces, as evidenced by a resurgence of thumb keyboards, soft keyboards, and innovative mappings of numeric keypads to alphanumeric characters. In this project the PI will study the effectiveness of, and explore potential enhancements to, traditional pen\/stylus interfaces. The goal is to identify techniques for managing, displaying, and supporting user interaction with ambiguous results while maintaining the fluidity of the pen-based interface. To these ends, the PI will develop advanced AI\/pattern recognition models of the information contained by applications, advanced and novel algorithms that use these models to reason intelligently about user intention in interfaces, and prototype applications centered on these algorithms. The PI will test his models in both traditional laboratory and real world settings, including in novel applications to enhance students' learning experiences through incorporation of this research into a deployed smart classroom environment. Major outcomes of the project will be a characterization of when, where, and how intelligence can be incorporated into pen-based interfaces, and a series of specific principles for intelligent interface design in pen systems to guide research in other areas of HCI.<br\/><br\/>Broader Impacts: The PI's institution is RUI-eligible, and approximately 40% of the students are of Hispanic, African American, Pacific Islander, Filipino, and other non-Asian\/Caucasian backgrounds. Furthermore, the PI's department currently enjoys almost no external research funding. Thus, this project, coupled with the planned integration of the work into an educational environment, will expose a large number of students to research experiences and educational opportunities they otherwise would not have.","title":"CAREER: Inferring User Intention in Pen Systems","awardID":"0448540","effectiveDate":"2005-03-01","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[266399],"PO":["565227"]},"100886":{"abstract":"CCF-0447864<br\/>Atif M Memon<br\/>University of Maryland - College Park<br\/><br\/>Enhancing Testing Techniques for Event-driven Software Applications<br\/><br\/>A particular class of software that is fast becoming ubiquitous is event-driven software (EDS); examples include web applications, graphical user interfaces (GUIs), network protocols, device drivers, and embedded software. All EDS take sequences of events (messages, mouse-clicks, etc.) as input, change their state, and sometimes output an event sequence. Existing testing techniques are not directly applicable to EDS because they pose unique challenges for test-case generation, event interaction modeling, test adequacy evaluation, verification, and execution. The primary contribution of this research will be an EDS testing framework based on a new event-flow model that the PI has developed and successfully employed to automate certain aspects of GUI testing. Much like how existing control-flow and data-flow models capture the control<br\/>and data interactions in a program, the event-flow model captures event interactions in a GUI. The framework will combine the event-flow model with new techniques for automated test case generation, execution, coverage evaluation, and verification. To provide focus, the research will create an event-flow model that is applicable to web applications, network protocols, and GUIs. The commonalities of these EDS will be used to create a base event-flow model and differences between them will be used to develop domain-specific extensions.","title":"CAREER: Enhancing Testing Techniques for Event-driven Software Applications","awardID":"0447864","effectiveDate":"2005-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550281"],"PO":["564388"]},"100897":{"abstract":"Modern society increasingly relies on processing, storing and communicating large amounts of information. The exponential growth of databases necessitates the development of algorithms that structure, compress and query them efficiently. The goal of this research is to develop new tools based on probabilistic models to achieve these objectives.<br\/><br\/>A new class of \"undirected bipartite graphical models\" is studied that embeds documents into a low dimensional \"topic-space\". These representations are efficient and capture semantic relationships. Training of the underlying probabilistic model is achieved through a technique called \"contrastive divergence learning\" which is particularly well adapted to the UBG model. The main contributions of this research are the development of a new class of probabilistic graphical model, the development of improved learning algorithms that scale up to large data-sets and the application of these novel techniques to two real world applications: image restoration and information retrieval.<br\/><br\/>Research is integrated with teaching through the development of new classes in machine learning both at the undergraduate and the graduate level, where students will be engaged in research in the above application areas.<br\/><br\/>The proposed research makes important contributions that can have a broad impact on security, web-technologies, commerce, multi-media, medical expert systems etc. In particular, the proposed projects in image restoration and information retrieval have the potential to make an impact on tomorrow's technologies. An open-source, web-based repository with freely available software will be developed to help achieve that goal.<br\/><br\/>http:\/\/www.ics.uci.edu\/~welling\/NSFcareer\/NSFcareer.html","title":"CAREER: Undirected Bipartite Graphical Models","awardID":"0447903","effectiveDate":"2005-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["516952"],"PO":["563751"]},"103999":{"abstract":"The Computer Science (CS) community has witnessed decades of research into security techniques for commonplace transactions such as banking or voting. Yet, powerful cryptographic techniques - such as<br\/>encrypted ballots for voting - have not made their way into the public domain. A large part of the reason is that the current standard for electronic voting is pass\/fail in nature, and provides no incentive for the use of novel techniques. Further, while desired properties of voting systems (such as count integrity and ballot secrecy) are mentioned in the standard, they are not well-defined, nor is the standard centered on the properties. Instead, the standard is centered on specific designs of voting systems from over fifteen years ago. As a result, innovative systems, in addition to having their advantages obscured by a pass\/fail standard, also face hurdles for not being based on the old designs.<br\/><br\/>This project is aimed at pursuing an important near-term (Spring 2005) opportunity to change the basis on which electronic voting systems are evaluated. Technical recommendations are to be made to the U.S. House of Representatives in Spring 2005 by the Senate-appointed Election Assistance Commission (EAC), under the Help America Vote Act (HAVA). This group of researchers hope to contribute the recommendations. In particular, the group is working together to rate and compare voting systems on performance with respect to well-defined properties such as: ballot secrecy, count integrity, voter and public verifiability, system transparency, reliability, usability and accessibility for the handicapped. The requirement for such a framework is urgent, as the HAVA deadline is firm and another opportunity to contribute to the conduct of mass elections in the U.S. may not appear again soon. <br\/><br\/>This project will contribute to the technical core of the recommendations to the Senate by working closely with the Technical Guidelines Development Committee (TGDC) of the EAC and the Voting Systems Standards Project of NIST. The project will develop a rating mechanism that captures the properties of the flow of information among voters, voting machines, aggregation processes, counting and auditing. The investigators hope to test a prototype against some of the key dimensions of the performance rating system developed.<br\/>The project will also develop a test suite to enable testing with respect to some of the properties for large<br\/>numbers of votes.<br\/><br\/>Intellectual merit: The project will help refine the debate on voting systems by defining a technical core<br\/>for ratings of performance with respect to specific properties. It will also develop a test suite and study<br\/>the scalability of a leading cryptographic technique. Outcomes of this project will include (a) the<br\/>security and privacy aspects of the technical core used to evaluate voting systems and (b) an open-source<br\/>prototype voting system.<br\/><br\/>Broader impact: The project will contribute to the process of determining a new voting standard through input to the technical recommendations of the EAC and will make available to public interest groups for analysis and education the first open-source prototype of a voting system with voter verifiability. The project will also help train graduate students in the area of security, and will help develop ties between the computer science community and public interest groups engaged in democratic processes.","title":"SGER: A Performance Ratings Framework for the Evaluation of Electronic Voting Systems","awardID":"0505510","effectiveDate":"2005-03-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["562052",274442,"496577"],"PO":["371077"]},"100910":{"abstract":"The large number of documents in biomedical literature databases and the lack of formal structure in the natural-language narrative in those documents make the search and processing very difficult to many scientists involved in bioinformatics research. This CAREER project is investigating the efficiency and effectiveness of information retrieval procedures, the effectiveness and robustness of pattern learning methods for information extraction, and information overload in text mining simultaneously in a coherent and unified framework for biomedical literature data mining. The deliverables of this project are: (1) to develop a semantic-based query expansion method for large biomedical literature databases; (2) to design an automatic pattern generation and evaluation method from unlabeled text files based on mutual bootstrapping and dynamic programming; (3) to develop a set of novel text mining algorithms such as ontology-enhanced textual clustering and text summarization. This project is testing its application in real-world bioinformatics domains such as chromatin interaction networks and microarray data analysis. <br\/><br\/>The broad impact on society made by this project is the generation of a novel unified architecture for biomedical literature data mining. This integrated and complementary approach in a unified architecture has the potential to create a very powerful novel tool for bioinformatics and for most text processing tasks. This project has the potential to attract diverse collaborators who have an interest in accessing complex biomedical or general scientific data and information. Students are involved in this research through hands-on projects, a Co-Op program and courses at both the graduate and undergraduate level.","title":"CAREER:A Unified Architecture for Data Mining Large Biomedical Literature Databases","awardID":"0448023","effectiveDate":"2005-03-15","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}}],"PIcoPI":["554592"],"PO":["560586"]},"100921":{"abstract":"Today's enterprise computing environments resemble the mythological chimaera: they are comprised of heterogeneous devices, ranging from PDAs to servers, which individually presents distinct, fragmented views of available data and services. To exacerbate the problem, devices are often managed by individuals with different interests and expertise. Thus, the parts are not even coordinated by a single brain! Unsurprisingly, these monsters are hard to use and maintain.<br\/><br\/>This project is exploring two ingredients for the taming of these monsters: a peer-to-peer (P2P) file system and a decentralized coordination mechanism. The file system serves to unify the fragmented data views of devices into a global namespace, providing device-independent name and content addressing. Underneath the global view, the file system continually monitors device characteristics and user behaviors, and automatically adapts the replication and placement of data to achieve specified availability and durability targets.<br\/><br\/>The coordination mechanism serves to govern the interactions between components within a decentralized system according to explicitly specified policies. Critically, this mechanism is based on an intrinsically decentralized system called Law Governed Interactions (LGI). This work explores the applicability of LGI to the above P2P file system and the experimental use of the resulting integrated system in the computing infrastructure of the Rutgers Computer Science Department.<br\/><br\/>The expected outcome of the project is a demonstration of how P2P technologies can be used to build powerful and flexible, yet low-futz enterprise computing systems. The project will also produce two prototype building blocks that can be used for future investigations of decentralized systems.","title":"CAREER: Recipe for the Taming of a Chimaera: Toward No-Futz Computing","awardID":"0448070","effectiveDate":"2005-03-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["486839"],"PO":["557315"]},"100877":{"abstract":"End-user programming seeks to help people with no formal training in programming take advantage of the power of their computer systems. By one estimate, the number of end-user programmers in the United States is expected to reach 55 million by 2005, compared to only 2.75 million professional programmers. Unfortunately, closed, uncustomizable applications have long been a serious obstacle for end-user programming on the desktop. The recent migration of applications to the Web opens up a new vista of opportunity, in that applications that would have been closed and uncustomizable on the desktop sprout numerous hooks for customization when implemented for the Web. In this project, the PI will seek to advance end-user automation and customization of the Web, by developing new interface designs, representations, algorithms, and tools. The research will include fundamental advances in learning wrappers (patterns that identify components of web pages) from very few examples, so that users can demonstrate web automation by pointing and clicking. Languages and techniques will be developed that allow users to customize web sites without examining their source code. A safe environment for offline testing and debugging of web automation will be implemented, and techniques for integrating multiple web sites together seamlessly, so that pages displayed by one site automatically include context-sensitive information provided by another site, will be devised. These fundamental contributions will form the basis for end-user customizations of web sites to make them more readable, easier to use for frequent tasks, and amenable to operations like sorting and filtering done in the web browser. The capstone application of the proposed research will be a set of tools that support gathering web information to drive personal decisions, such as buying a car, finding a house, or choosing a job. To achieve these goals, the PI will develop new algorithms for inferring patterns and scripts that interact with and extract information from the Web, design and evaluate new ways to customize users' web experiences, and seek to gain a deeper understanding of how people acquire web information to make personal decisions.<br\/><br\/>Broader Impacts: The outcomes of this project will equip end-users with more control over the accessibility and performance of their browsing experience, giving them more tools for making information-driven decisions about important issues, both personal and public, such as education, health care, public policy, safety, and the environment. The software to be developed by the PI will be released free of charge as open-source tools for public use, and as infrastructure for other researchers in end-user programming. The project will also expose a generation of MIT computer science graduates to HCI principles and techniques, so that as they move on to careers in software industry and academia, they produce more usable software; related course materials will be released for free, open, public use, as part of the MIT OpenCourseWare Initiative.","title":"CAREER: End-user Programming for Web Automation and Visualization","awardID":"0447800","effectiveDate":"2005-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["549925"],"PO":["565227"]},"100647":{"abstract":"Preconditioners comprise a range of techniques for transforming a system of<br\/>linear equations Ax=b into a related system that is somehow ``better''. For<br\/>example, a solver may take less time to compute the solution to the new system,<br\/>it may compute a more accurate solution, or it may do both. Although a good<br\/>preconditioner can be critical to computing an accurate solution efficiently,<br\/>choosing a good preconditioner from the many that are available can be<br\/>difficult.<br\/><br\/>The goal of this project is the development of tools to help users choose from<br\/>large families of preconditioners one that is likely to be well-suited to their<br\/>particular application; the initial focus will be on preconditioners that are<br\/>based on reordering the rows and\/or columns of a matrix, and those that compute<br\/>an incomplete factorization of the matrix. In the process of developing these<br\/>tools, the PI, undergraduate researchers, and other collaborators will work on<br\/>developing better heuristics, improving theoretical knowledge about specific<br\/>preconditioners, creating an extensible framework for evaluating different<br\/>preconditioners, and making the results of extensive experimentation available<br\/>in a user-friendly form. All work will help lead to a better understanding of<br\/>the performance of specific preconditioners on sparse systems from specific<br\/>applications.<br\/><br\/>As a professor at a liberal arts college, the PI's primary plans for broader<br\/>impact include: supervising undergraduate and postbaccalaureate research,<br\/>seeking opportunities for students to present their work outside of the local<br\/>community and more generally preparing them for graduate work; outreach to<br\/>groups traditionally underrepresented in computer science through mentoring and<br\/>the formation of support networks; and the development, refinement, and<br\/>dissemination of courses that emphasize the role of mathematics in computer<br\/>science, as well as of courses that give a basic understanding of computing to<br\/>students who are not computer science majors but whose education will<br\/>nevertheless be enhanced by such knowledge.","title":"CAREER: Preconditioning Large, Sparse Linear Systems: Theory and Practice","awardID":"0446604","effectiveDate":"2005-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["352027"],"PO":["565157"]},"100945":{"abstract":"The focus of this project is on the problems associated with reconstruction and visualization of three-dimensional objects from images or video streams. The PI's ultimate goal is to first develop the fundamental algorithms underlying, and then to implement, an end-to-end light portal that can capture and \"re-enact\" real-world objects or events in a different time or space. A light portal captures a scene using a number of cameras with different viewpoints. From these input images, intelligent software to be developed by the PI will either reconstruct a coherent parametric scene model that includes not only geometry but also lighting and surface reflectance properties (suitable for storage, editing, and playback over time), or directly interpolate the complete bundle of color rays to be displayed (suitable for live transmission over space). These results will then be visualized on a unique light-field display that utilizes an array of projectors and micro-lens screens to emit a large collection of controllable light rays, so that any number of viewers can simultaneously perceive view-dependent stereoscopic effects as if they were in the real scene.<br\/><br\/>Realization of the light portal poses many scientific and engineering challenges in vision, graphics, image processing, networking, human-computer interaction, optics, etc., which the PI expects to be able to successfully tackle by building on his prior work and focusing on the core scientific problems in 3D reconstruction and visualization. On the reconstruction front, two paths will be explored. One is aimed at allowing robust 3D reconstruction for a much broader class of scene types by finding invariants from the complex interactions among geometry, lighting and surface reflectance properties. Alternatively, an inverse formulation to estimate directly the final image will be developed; by incorporating new constraints that are difficult to adopt in a geometric setting, such as nature image statistics, this inverse formulation should allow more realistic image synthesis even when explicitly reconstructing the 3D model is ill-conditioned. These two approaches are complimentary to each other, with one optimized for storage and editing, and the other for direct transmission and visualization. On the visualization front, the proposed light-field display will have a unique design that de-couples regular 2D displays and 3D screens, made possible by novel calibration and rendering algorithms. Therefore, in addition to its auto-stereoscopic capability, this display will offer an unprecedented level of flexibility and scalability in terms of resolution, size, field of view, etc.<br\/><br\/>Broader Impacts: In a manner analogous to the ubiquitous digital cameras and video displays in use today, the PI expects the light portal to provide the ultimate three-dimensional recording and viewing experience that may lead to profound changes in the way people communicate, educate, and entertain. In particular, the 3D capability may enable new paradigms for surgical training and tele-collaboration. This project also has an integral educational component; in addition to the usual course development, student participation, and broad dissemination through various venues (publications, demonstrations, a project web site, etc.), the PI will make efforts to attract minority students by taking an active part in the exchange program between the University of Kentucky and the University of Puerto Rico.","title":"CAREER: The Light Portal: 3D Reconstruction and Visualization Over Space and Time","awardID":"0448185","effectiveDate":"2005-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["523441"],"PO":["565227"]},"100968":{"abstract":"This project develops protocols that allow a network to use multiple paths to deliver traffic demands between any two points, adaptively balancing the load across these paths. The project studies load balancing in both wired and wireless networks taking into account the characteristics of each environment. The work combines theory with practice providing easy-to-implement solutions that are provably stable. The contributions of this work are multifold. First, the developed protocols allow the ISPs to cope with unanticipated changes in traffic demands. Current traffic engineering mechanisms react only to a subset of anticipated events such as single-link or two-links failures, for which they have pre-computed alternate routes. In contrast, the new protocols rebalance the load in realtime to cope with unanticipated changes in traffic demands caused by outages involving multiple links and routers, major BGP reroutes, or network attacks. Second, this work provides the first implementation of multipath routing in an operational wireless access networks. It improves the network throughput and increases the community understanding of how to build better 802.11 access networks. Finally, the work compares end-system multipath routing using overlays and multi-homed domains, and in-network multipath traffic engineering, and provides valuable insights into the interaction between TCP congestion control and the control loop of adaptive multipath load balancers.","title":"CAREER: Adaptive Reliable and Self-Managed Networks","awardID":"0448287","effectiveDate":"2005-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["560189"],"PO":["565090"]},"100925":{"abstract":"This Career Development Plan is focused on Metric Embeddings, a powerful area of algorithms research. Interest in embeddings stems from their broad algorithmic applicability; they are being used extensively to<br\/>obtain solutions and design algorithms that are simple, elegant and versatile. The use of metric embeddings has often allowed ad-hoc methods to be replaced by powerful general principles, and has suggested new<br\/>approaches to tackle long-standing open problems. The impact of these techniques can be seen on problems in finding graph separators, data clustering, network design, streaming computation, and geometric and<br\/>on-line algorithms, to name but a few. <br\/><br\/>This research intends to focus on the algorithmic theory of embeddings in the context of these applications. Informally, an embedding is a map of an arbitrary metric space into a ``simpler'' one which does not alter <br\/>distances by much, and the focus of this research is on two natural and fundamental themes: (a) to investigate the complexity of metric spaces from an algorithmic perspective, and to use this to develop efficient <br\/>algorithms, and (b) to develop embeddings that simplify metrics; i.e. embed general metric spaces to well-understood simpler ones.<br\/><br\/>This proposal offers a broad spectrum of research opportunities at both graduate and undergraduate levels: these include the investigation of theoretical principles, the development of algorithms and embeddings, <br\/>and the implementation and experimental evaluation of these results. Progress in this research will influence the curriculum via special courses presenting theoretical advances along with their applications. <br\/>Workshops and seminars will be used to promote interdisciplinary research.","title":"CAREER: Algorithmic Theory and Applications of Metric Emeddings","awardID":"0448095","effectiveDate":"2005-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550590"],"PO":["562944"]},"100958":{"abstract":"PROPOSAL NUMBER: CNS-0448246<br\/>PRINCIPAL INVESTIGATOR: Gupta, Indranil<br\/>INSTITUTION: University of Illinois at Urbana-Champaign<br\/>PROPOSAL TITLE: CAREER: Systematic Design of Distributed Protocols<br\/>- from Methodologies and Toolkits to Systems<br\/><br\/>Distributed protocols such as resource discovery, cooperative caching, replication, etc., are crucial to the scalability and reliability of large-scale distributed systems such as the Web and the Grid. Today, however, the critical activity of designing a distributed protocol relies on an ad-hoc approach - literature, experience, and basic Computer Science knowledge provide the only assistance. This often leads to complex protocols, increased design times and costs, and eventually to inefficient use of research potential.<br\/><br\/>This project is exploring systematic techniques for designing distributed protocols, assisted by the use of Design Methodologies for distributed protocols. Design methodologies augment the creative process of protocol innovation, without stifling it. The project is creating new methodologies that systematically convert naturally observed phenomena into protocols with predictable properties. One innovative methodology translates differential equation systems into equivalent distributed protocols. Composable methodologies are also being developed, allowing protocol designers flexibility to enrich protocols with desired properties. <br\/><br\/>The methodologies invented and discovered in this project will be used to design new system designs for cooperative web caching, adaptive Grid computing, persistent distributed file systems, and disaster response and recovery. The methodologies will be made available to the community as Integrated design Toolkits (IdTs) that automate methodologies and enable a designer to automatically generate compilable code for a protocol. While methodologies have been used with varying degrees of success in other fields of science, this project is the one of the first to study its benefits and drawbacks in certain focus areas of distributed systems.","title":"CAREER: Systematic Design of Distributed Protocols - from Methodologies and Toolkits to Systems","awardID":"0448246","effectiveDate":"2005-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550441"],"PO":["402055"]},"100728":{"abstract":"The volume of educational resources available to students is rapidly increasing. In a<br\/>wide variety of subject domains, educational resources are now available on the Web<br\/>and in educational Digital Libraries. The abundance of resources has created the need<br\/>to provide personalized access to educational resources, i.e., to help students find,<br\/>organize, and use resources that match their individual goals, interests, and current<br\/>knowledge. This project answers that need by developing and exploring a broad range<br\/>of innovative techniques for personalized access to open corpus educational resources.<br\/>Among these techniques are adaptive navigation support and adaptive visualization<br\/>techniques, which offer a higher level of interactivity and expressive power and take into<br\/>account not only the users' interests, but also their current knowledge and goals. To<br\/>integrate the results of this research into education, we are developing a system that<br\/>uses the most promising techniques to provide students in undergraduate programming<br\/>courses at the University of Pittsburgh with personalized access to a large volume of<br\/>diverse open corpus resources. This system serves as a major evaluation platform for<br\/>the techniques being developed.<br\/><br\/>By focusing on personalized access to educational resources, the project provides<br\/>short-term and long-term broader impacts. The system developed in the course of this<br\/>project maximizes educational opportunities for every student in several large,<br\/>programming-related undergraduate courses at the University of Pittsburgh. Widely<br\/>disseminated through publications and the project's web site, our personalized<br\/>information access techniques help thousands of students to harness the educational<br\/>power of the Web and Digital Libraries.<br\/><br\/>http:\/\/www.sis.pitt.edu\/~taler\/pacer.html","title":"CAREER: Personalized Access to Open Corpus Educational Resources through Adaptive Navigation Support and Adaptive Visualization","awardID":"0447083","effectiveDate":"2005-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7180","name":"EDUCATIONAL RESEARCH INITIATIV"}}],"PIcoPI":["496622"],"PO":["563751"]},"93361":{"abstract":"ABSTRACT - 0405619<br\/><br\/><br\/>Granular materials are large aggregates of macroscopic, individually solid particles, or \"grains\". Understanding and controlling their properties is of tremendous importance for industrial processes across a wide range of fields from agriculture to civil and chemical engineering to materials science. One of the most remarkable behaviors of granular matter is the transition from a jammed to an unjammed state under an applied shear stress. At this transition granular materials change character from solid- to fluid-like and exhibit characteristic properties such as the formation of shear bands. This also is an experimentally and theoretically challenging regime for which the current level of understanding is far less developed than for other phase transitions such as those occurring in ordinary fluids or solids. <br\/><br\/>Intellectual Merit. In addition to the industrial, economic value associated with proper control of particulate matter, the study of granular materials provides insights into fundamental scientific issues. A series of experiments in granular media has been designed to investigate the nature of the transition from static packing to a flowing regime. Emphasis is placed on studying the formation of shear bands and techniques that make it possible to measure some of the most important physical quantities that were previously inaccessible to experiment. In particular, direct measurements of the time-evolving forces and stresses within shear bands will be made using a newly developed optical force-visualization apparatus. <br\/>A new type of linear, parallel plate shear cell is introduced that can measure the onset and evolution of structure and viscosity within a shear band from its initial transient behavior to it final steady-state character. Finally, a modified split-bottom Couette-type shear cell with wide and tunable shear band will be used to test some of the most important current theories concerning the applicability of effective temperatures and determine the importance of fluctuations generic to these systems. These studies will help provide an experimental underpinning for some of the key ideas that have so far only been tested in theory or simulation. <br\/><br\/>Broader Impact: The experimental research on sheared granular materials will be closely integrated with a multi-faceted set of education and outreach activities. It includes the active participation of a diverse group of high-school interns and undergraduates in the research, a close collaboration with two science museums to develop hands-on activities, and the development of a new course on granular materials. In addition, we plan an interdisciplinary workshop on granular matter and the jamming transition.","title":"Experimental Investigations of Sheared Granular Materials","awardID":"0405619","effectiveDate":"2005-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}}],"PIcoPI":["505862","555612"],"PO":["426130"]},"96496":{"abstract":"This project, empowering research projects in computational science, aims at acquiring a 2048-node BlueGene\/L supercomputer from IBM. BlueGene\/L is a highly integrated supercomputer based on system-on-a-chip technology focusing on numerically based scientific problems. The new supercomputer will enable a wide range of novel, computationally intensive research in areas ranging from subnuclear physics to bioengineering, space weather and ocean modeling. These areas will provide a test-bed for BlueGene\/L applications in a concrete and diverse environment. The investigations will be carried out by researchers from Boston University, Massachusetts Institute of Technology, and Tufts University. An IBM scientist (Gyan Bhanot) will collaborate with these scientists in the study of optical techniques to use the machine. The following sixteen projects will make use of the facility:<br\/> Computational Investigations of Subnuclear Particle Phenomena,<br\/> Computational Investigations of Condensed Quantum Matter,<br\/> Photonic Crystals,<br\/> Quantum Dynamics of Chemical Systems,<br\/> Accelerated Algorithms for Multiple Time Scale Simulations of Supercooled Liquids and Biomolecules,<br\/> Molecular Modeling of Liquid and Glassy Water,<br\/> Multiscale Modeling of Materials Strength,<br\/> Computational Determination of Regulatory Networks,<br\/> Dynamics of Spin Systems and Opinion Evolution, <br\/> Managing Complex Systems in Manufacturing Enterprise, <br\/> Computational Investigations of Topological Issues in Hydrodynamics,<br\/> Large Eddy Simulation Models for Three-Dimensional Turbulence,<br\/> Space Weather,<br\/> Electrodynamics of Plasma Processes in the Ionosphere,<br\/> Non-Hydrostatic Direct Numerical Simulation of Oceans, and<br\/> Algorithms for Optimized Computation and Communication of Blue\/Gene\/L<br\/><br\/>Broader Impact: New programs in interdisciplinary training in computational science (ACES) will take advantage of the facility. The resource will be shared in a broad basis and open to the national research community.","title":"MRI: Acquisition of a Blue Gene\/L Supercomputer for Computational Science Research","awardID":"0421009","effectiveDate":"2005-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7368","name":"SCI TESTBEDS"}}],"PIcoPI":["292526","525906","425870","521813"],"PO":["557609"]},"106162":{"abstract":"ABSTRACT<br\/>IIS-0515873<br\/>Abshire, Pamela<br\/><br\/>The goal is to develop and demonstrate enabling technology for cell-based<br\/>sensing. Cell clinics are microenvironments that enable the capture and characterization of cells. Each \"clinic\" is a micro-electro-mechanical system fabricated on a CMOS chip. Biological systems have high specificity, sensitivity, and adaptability that can be part of a highly integrated sensor. The first goals are sample preparation, cell loading, and system miniaturization using the tools of feedback control, integrated circuits, and microfluidics. Results will leveraged into two ongoing efforts in olfactory sensing and low-false-positive pathogen detection. Three aspects of the system will be demonstrated. (1) Electroosmotic flow control will remove all optically visible (>5 micron) particles from the sample. This will remove dirt, dust, and bacteria and leave behind odorants for presentation to the olfactory cell sensors. This system shall be capable of sufficiently high throughput to be used in real time. (2) Dielectrophoretic actuation for steering cells in three-dimensions will be used to position cells in the plane and to direct them into the cell clinic vials. (3)In order to develop field utility cell-based sensors, a vision system with the same dimensions as cell clinics for cell steering will be developed. The proposed technological advances will allow cell-based sensing to move toward actual implementation and use with real samples. <br\/><br\/>Cell-based sensing has the potential for selectivity, sensitivity, and speed that far exceed<br\/>today's chemical and biological sensors. Problems of olfactory sensing and pathogen detection are of immediate relevance to national security. This technology has clear applications in other diverse fields such as health care, pharmaceutical development, and environmental monitoring. The integrated transduction-actuation-control approach is expected to have an impact outside of cell-based sensing to labs-on-a-chip, microfluidics, and nanotechnology by developing basic technology and techniques for sophisticated manipulation of particles at the micro-scale. The PIs are engineers in several disciplines (fluids and controls, micro-fabrication and conjugated polymers, integrated circuits and biosensors) working closely with cell biologists, molecular pathologists, and experts in bio-functionalized surfaces and quantum dots. The PIs are pioneering the development of MEMS education kits that can be used outside of a clean room.","title":"Integrated Transduction, Actuation, and Control for Cell-Based Sensing [UOM_FY05_059]","awardID":"0515873","effectiveDate":"2005-03-15","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I153","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I331","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I435","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T489","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T885","name":"DIA-MASINT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J265","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V918","name":"DIA-SOW"}}],"PIcoPI":["549647","538314","474354"],"PO":["565136"]},"106173":{"abstract":"ABSTRACT<br\/>NSF-0515929<br\/>Pappas, Thrasyvoulos<br\/><br\/>Embedded systems technology has reached the level at which it is practical to deploy numerous low-power wireless sensing devices with the capacity to execute sophisticated algorithms and to selectively allocate resources to the most critical situations. The plan is to develop a robust platform for distributed, pervasive, small sensing and computing devices to implement a cognitive information processing system that understands its surroundings and responds to changes in its environment by constantly evaluating and adapting its behavior. The novelty of the approach lies in the use of (1) multiple sensor fusion based on a dynamic Bayesian network (DBN) which provides a powerful, intelligent, and cognitive learning framework, and (2) collaborative and distributed Monte Carlo (CDMC) tracking methods for establishing the collaboration among multiple computational units. Once the DBN model is learned, solutions to<br\/>the problems under consideration are provided by the probabilistic inference of the model, which provides a self-evaluation of the tracker. The scientific objective will be to develop a framework and algorithms for multi-perspective, multi-modal fusion of sensor information subject to bandwidth, energy, reliability,and location-uncertainty constraints associated with low-cost distributed sensors. The proposed research covers topics from sensor calibration and feature extraction, to data fusion and collaborative processing, to resource\/performance optimizations at the local and system level. While many of the individual problems have been studied on their own, the challenge is to bring them all together in a new context under tight constraints on power consumption for computing and sensor communication, as well as latency constraints and sensor failure considerations.<br\/><br\/>Distributed, collaborative sensing will play an increasingly critical role ina variety of applications involving security and surveillance, environmental monitoring, industrial<br\/>automation, and remote exploration. The techniques can also be usedin a number of other applications, such as human tracking and behavior analysis for medical<br\/>applications such as telemonitoring of elderly people. The broader impacts of the proposed activity also include improvements and integration of the signal processing and computer vision curricula at Northwestern and the opportunity for undergraduates to perform research on related topics.","title":"A Distributed Cognitive Information Processing System [NWU-FY05-067]","awardID":"0515929","effectiveDate":"2005-03-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T768","name":"DIA -MASINT RESEARCH PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V918","name":"DIA-SOW"}}],"PIcoPI":[280083,"182691","290859","467427"],"PO":["565136"]},"108263":{"abstract":"The purpose of this workshop on Peer-to-Peer Mobile Ad Hoc Networks - New Research Issues is to explore architectural issues in mobile ad hoc networks and how the peer-to-peer overlay paradigm can be used in this environment. Multiple peer-to-peer networks, corresponding to different applications, may coexist on a large ad hoc network structure (eg, emergency response, urban vehicular grid, etc.). This workshop will focus on the applicability of wired peer-to-peer models to the wireless scenarios and more generally to the research problems emerging in the ad hoc peer-to-peer area.","title":"Peer to Peer MANET Workshop - Dagstuhl, Germany (10-12 April 2005)","awardID":"0526997","effectiveDate":"2005-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["558959"],"PO":["7594"]},"99435":{"abstract":"This is a collaborative research project including Dewayne Perry, James Brown and Sarfraz Khurshid at the University of Texas at Austin (award # 0438967), and Daniel Jackson at the Massachusetts Institute of Technology (award # 0438897). The aim of this project is to develop new languages, methods, analyses and tools for 'prescriptive' software architecture descriptions, to help the designers of complex software systems express and explore their architectural commitments prior to implementation, and to support families of systems that share architectural features. <br\/><br\/>Two underpinning technologies are used: Jackson's Alloy constraint language and analyzer, and Browne's compositional compiler. Alloy's underlying logic is expanded, new analysis capabilities are added, and the Alloy system is packaged as a software component. The compositional compiler is extended to utilize constraints and property specifications in order to support both constraint and performance analyses. On the basis of these technologies, an abstract model of software architecture is created, an architecture constraint specification language is defined, the rules of composition and evaluation are defined, and an integrated tool suite for constraint-based architectural evaluation is constructed. The research is evaluated first by simple specific examples and then with realistic case studies, revising and extending the research as needed to satisfy the overall evaluation goals.<br\/><br\/>The results of this project will have a significant and broad impact in terms architectural research, architecture education and architecture support technology. Further, it is expected that the technology will enable deeper understandings of design trade-offs, will improve design quality, and will significantly improve the component composition process. The project Web site (http:\/\/www.ece.utexas.edu\/~perry\/work\/projects\/nsf-cbae\/) will provide access to the resulting techniques and tools.","title":"SoD Collaborative Research: Constraint-based Architecture Evaluation","awardID":"0438967","effectiveDate":"2005-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["510448","486519","550525"],"PO":["565227"]},"106163":{"abstract":"Autonomous mobile manipulation is a challenging technology milestone underlying several important emerging markets, including health care, service and repair of orbiting spacecraft and satellites, planetary exploration, military applications, logistics, and supply chain support. Little progress has been made toward practical manipulation systems capable of functioning independently without fine-grained intervention from human users. However, exciting new dexterous machines and actuator designs are available and key technologies for creating manual skills using haptic feedback and machine learning now exist.<br\/><br\/>The proposed workshop is to identify the key scientific challenges on the path towards achieving autonomous mobile manipulation. Autonomy refers to the capability of a robotic system to work towards the accomplishment of an objective for extended periods of time without human intervention. Mobility enables a robotic system to operate in large and unstructured environments and can be achieved in a number of ways, depending on the area of application (land, air, underwater, space). Finally, manipulation describes the property of performing physical work in the environment, other than self-motion. Manipulation tasks can range from excavation to dexterous assembly.<br\/><br\/>This workshop will bring researchers together to discuss the prospects and challenges for creating integrated autonomous mobile manipulation systems with which to address commercial applications. The goal is to devise a general technology roadmap towards this objective. The results and findings will be disseminated in a report to researchers and funding agencies.","title":"Workshop on Autonomous Mobile Manipulation; March 10-11, 2005; Houston, TX","awardID":"0515874","effectiveDate":"2005-03-01","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["376899","391847"],"PO":["335186"]},"106174":{"abstract":"ABSTRACT<br\/>NSF-0515930<br\/>Liang, Hong<br\/><br\/>A broad range of inter-disciplinary techniques will be developed to enable the use of cockroaches as a sensory platform, increase our understanding of cockroach behavior,<br\/>growth of nanocrystalline piezoelectric sensors, and extreme low power electronics to condition and communicate the sensed data to a base station. Nanocrystalline piezoelectric structures are grown in a novel manner and will be used to create strain sensors which can be applied in a wide range of applications. In this project the focus is using these sensors to detect and study the locomotion of an American cockroach and develop the cockroach as a sensory platform. The diminutive size of the insects demands an ability to design circuits which operate at extreme low power levels (and thereby require extremely small and light power sources). The broader application of these techniques will be in the area of hand-held, portable and wearable computers. A prototype sensor system will be developed that will be mounted on a cockroach, sensing and communicating information such as cockroach locomotion as well as environmental lighting and electro-magnetic noise conditions.<br\/><br\/>An interdisciplinary team of researchers from the areas of entomology, materials science<br\/>and low-power electronic circuit design and design automation are participating. The proposed research project is expected to have an impact on the field of sensing, signal transfer, nanofabrication, entomology and low-power electronics. Attaching small piezoelectric strain sensors at strategic locations on a cockroach to produce a small amount of energy as the insect moves is a unique combination. Power consumption has been identified as one of the important hurdles for future VLSI designs, and hence this proposal addresses a pertinent design problem. The approach in this proposal, with its 100- 500X power reduction, may prove invaluable to the continued success of low power sensor networks and portable \/ wearable communication and computation devices.","title":"Piezoelectric Sensors on American Cockroaches","awardID":"0515930","effectiveDate":"2005-03-15","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H187","name":"DEFENSE INTELLIGENCE AGENCY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I331","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T885","name":"DIA-MASINT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V918","name":"DIA-SOW"}}],"PIcoPI":[280088,"507297",280090],"PO":["565136"]},"106560":{"abstract":"This proposal will support two annual workshops for Digital Government program grantees and government partners and students. An attendance of 200 is expected. This year tutorials will be added. The grant will also support the continued administration, management, and content development of the web site www.digitalgovernment.org. The final product of the event will be a multimedia diskette with interviews and copies of all workshop-related materials. This is the fifth annual workshop. Among other values, the workshop presents a successful forum for local, state, national and international government staffers to interact with academic computer and information scientists for the purpose of identifying common interests and possible collaborative research proposals. Additionally, a welcome forum is created for dialog between technical digital government researchers and those from the social sciences with an interest in digital governance, e-voting, impact of IT on government organizations and the citizenry's interaction with various levels of governance.","title":"Securing the Future of the Digital Government Research Community","awardID":"0518024","effectiveDate":"2005-03-01","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["446979"],"PO":["427499"]},"106120":{"abstract":"ABSTRACT<br\/>NSF-0515684<br\/>Brueck, Steven<br\/><br\/>Detection of chemical and biological warfare (CBW) agents is a con-tinuing challenge. The amounts of CBW agent sufficient to cause harm to humans are very small, requiring exceptional sensitivity; often, rapid identification and remediation is necessary; widely dispersed, inexpensive sensors are required to monitor large areas for agents; and, perhaps the most worrisome, the variety of possible agents is virtually unbounded. With advances in biological synthesis capabilities, creation of new CBW agents is no longer exclusively a nation-state enterprise.<br\/>This development demands a new approach to monitoring. In order to meet the sensitivity and areal distribution requirements, a chip-scale technology, sensitive to a variety of agent classes, requiring only very small (picoliter) volumes and with integral preconcentration processes is required. The broad goal of this work is to establish the basic understanding and<br\/>the technological methodologies necessary to implement high-density arrays of nanoscale channels as versatile, sensitive and selective components for chip-scale biodetection systems that will allow response to a wide variety of CBW agents. Nanofluidic separation and detection (providing the picoliter sensitivity) and smart, functionalized receptor bead microcolumns (providing the preconcentration and selectivity). Technologies are brought together. A fundamental understanding of the physical phenomena involved in nanoscale transport of complex fluids is a prerequisite for the development of the new generation of bio-separationtechnologies. A key enabling technology that will emerge from this effort is the development of inexpensive, facile and manufacturable means for creating integrated fluidic circuits that allow the transition from macroscopic fluid handling (e.g., pipettes) to nanoscale dimensions.<br\/><br\/>This program will support two students and one postdoctoral re-searcher. UNM is a Hispanic Serving Institution with large populations of Hispanic and Native American students;<br\/>very active recruitment and retention efforts are already underway in the labs of the investigators.","title":"Chip-Scale Integrated Nanofluidics\/Affinity Microcolumn Biosensors","awardID":"0515684","effectiveDate":"2005-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T768","name":"DIA -MASINT RESEARCH PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V918","name":"DIA-SOW"}}],"PIcoPI":["427971","511708"],"PO":["565136"]},"106153":{"abstract":"This is funding to support travel of six students currently enrolled in PhD programs in the United States to present their accepted papers and posters, and to take part in the Doctoral Consortium, at this year's International User Modeling Conference, to be held July 23-29, 2005, in Edinburgh. User modeling has been found to significantly enhance the effectiveness and usability of software systems in a variety of areas, including educational applications and applications oriented to users with various disabilities. The International Conferences on User Modeling is the premier biennial event in the field of user modeling and user-adaptive software systems; UM'05 will be the 10th event in the series. Active participation of young researchers in this conference is very important, both for the health of the field and for the researchers themselves. The UM'05 Doctoral Consortium provides a unique opportunity for PhD students partway through their dissertation research to receive valuable feedback from top researchers in the field. Experience has shown that most Doctoral Consortium participants at past User Modeling conferences were later able to expand and publish their work originally presented at the Consortium. The PI is the President of User Modeling Inc., a not-for-profit professional society of researchers working on user modeling and personalization, which is the organizer of the User Modeling conference series.<br\/><br\/>Broader Impacts: Bringing young and creative researchers to UM'05 will help advance an important and socially valuable research field. For many graduate students, the cost of attending the User Modeling conference exceeds their travel budget. Thus, NSF funding will significantly impact the careers of the next generation of User Modeling researchers, by enabling a number of them to take part in an important event they would otherwise have to miss. The students will have an opportunity to gain wider exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. Participation will also help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. The PI has indicated that he will act to assure participation by members of traditionally under-represented institutions, and will pay close attention to inclusion of minorities and women.","title":"Supporting Students Attending User Modeling 2005 Conference; July 23-29, 2005; Edinburgh, KY","awardID":"0515840","effectiveDate":"2005-03-01","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["496622"],"PO":["565227"]},"99426":{"abstract":"This is a collaborative research project including Dewayne Perry, James Brown and Sarfraz Khurshid at the University of Texas at Austin (award # 0438967), and Daniel Jackson at the Massachusetts Institute of Technology (award # 0438897). The aim of this project is to develop new languages, methods, analyses and tools for 'prescriptive' software architecture descriptions, to help the designers of complex software systems express and explore their architectural commitments prior to implementation, and to support families of systems that share architectural features. <br\/><br\/>Two underpinning technologies are used: Jackson's Alloy constraint language and analyzer, and Browne's compositional compiler. Alloy's underlying logic is expanded, new analysis capabilities are added, and the Alloy system is packaged as a software component. The compositional compiler is extended to utilize constraints and property specifications in order to support both constraint and performance analyses. On the basis of these technologies, an abstract model of software architecture is created, an architecture constraint specification language is defined, the rules of composition and evaluation are defined, and an integrated tool suite for constraint-based architectural evaluation is constructed. The research is evaluated first by simple specific examples and then with realistic case studies, revising and extending the research as needed to satisfy the overall evaluation goals.<br\/><br\/>The results of this project will have a significant and broad impact in terms architectural research, architecture education and architecture support technology. Further, it is expected that the technology will enable deeper understandings of design trade-offs, will improve design quality, and will significantly improve the component composition process. The project Web site (http:\/\/www.ece.utexas.edu\/~perry\/work\/projects\/nsf-cbae\/) will provide access to the resulting techniques and tools.","title":"SoD Collaborative Research: Constraint-based Architecture Evaluation","awardID":"0438897","effectiveDate":"2005-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["335202"],"PO":["565227"]},"95357":{"abstract":"Many digitally-mediated activities present participants with complex strategic decisions. Strategic interaction in electronic commerce arises, for instance, in negotiation, trading, resource finding, matchmaking, advertising, recommendation, contracting, and executing. Scenarios in these applications are properly modeled as games, however, direct application of game theory quickly becomes infeasible as problem complexity grows. Despite enormous advances in game theory and mechanism design, an ever-growing number of applications are intractable using standard methods. Thus, designers must resort to highly stylized models, or non-strategic analysis using simulation or experimentation methods.<br\/><br\/>This project bridges the gap between simulation and game-theoretic analysis by developing computational tools for empirical game-theoretic analysis. The new techniques combine gaming, high-fidelity simulation, <br\/>experimental manipulation, statistical analysis, search, and game-theoretic reasoning in a principled way, to reveal the shape of complex strategic environments. The results of the project will have immediate practical application to strategic reasoning in many domains, including government auctions for spectrum, oil and gas, etc.; complex matching programs (e.g., medical residency); deregulated energy market operation; and business-to-business electronic commerce. By extending the scope of problems amenable to strategic analysis, this research will inform the design of more efficient resource allocation mechanisms for public as <br\/>well as private-sector applications.","title":"Practical Strategic Reasoning for Intractable Games","awardID":"0414710","effectiveDate":"2005-03-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1320","name":"ECONOMICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["361939","563733"],"PO":["564456"]},"106187":{"abstract":"ABSTRACT<br\/>NSF 0515977<br\/><br\/>This proposal will develop a mobile, scanning, eye-safe lidar (light detection and ranging) to fully apply the laser backscatter depolarization technique to the remote characterization of aerosols suspended in the atmosphere. Although even simple lidars can be effective at detecting atmospheric aerosols and mapping their vertical and spatial distributions, eye-safety concerns severely limit their application in the field. It is well established that linear depolarization measurements offer unique capabilities to detect and classify the nature of clouds and aerosols, and a variety of such data will be obtained using an improved two-channel mobile lidar system. Such lidars unambiguously separate spherical from nonspherical particles, and further are sensitive to the exact shape of irregular particles. The lidar system will be evaluated in the field by sampling known aerosol types in Alaska such as transported Asian desert dust, Arctic haze, ice fog, tree pollens, forest fire smoke,internal combustion engine by-products, and sea spray. In addition, the system design will accommodate circular and complete Stokes parameterization of the backscattering for future applications to fully evaluate the eye-safe polarization diversity lidar research field. <br\/><br\/>This project will create a mobile lidar research facility that will grow into an advanced test-bed for studying the application of lidar polarization techniques to aerosol and cloud research. The project will help train a graduate student in the lidar field and contribute to the training of meteorological experimentalists. Important future scanning research applications are possible in the observation of forest fires, urban pollution sources, and the spatial variability of clouds and precipitation. Polarization lidar techniques have unique potential for identifying the nature of particles suspended in the atmosphere. Many of the aerosol targets have analogs in the detection of hazardous materials.","title":"Eye-Safe Polarization Diversity Lidar for Aerosol Assessment","awardID":"0515977","effectiveDate":"2005-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V918","name":"DIA-SOW"}}],"PIcoPI":["548603","529483","387219"],"PO":["565136"]},"102491":{"abstract":"The purpose of this proposal is to seek support for the Sixth IEEE Signal Processing Workshop on Signal Processing Advances in Wireless Communications (SPAWC-05). This workshop is the sixth in a series of annual meetings sponsored by the IEEE Signal Processing Society. The successful SPA\\VC workshop series started with the intent of providing a forum for scientist coming from academia and industry and for students for presenting and discussing leading edge signal processing methods for communications systems. SPAWC has had a good history of sponsorship and was funded in the past from both NSF and ARG.<br\/><br\/>The fertile terrain for starting the SPAWC series was provided at the time by the rising importance of the digital front-end design in cellular systems and stimulated by the fervid discussion about cellular transmission standards and mobile communications in general. <br\/><br\/>Since then, the community of signal processing researchers devoting their attention to communications problems has steadily grown and the wireless technology has fast forwarded towards broadband wireless local area network applications and, more recently, towards ultra-wide band radios. New technologies are attracting the interest of this growing pool of researchers. In fact, wireless communications are also the natural choice in ad-hoc networks and sensor networks, whose importance has been brought to greater attention by the need of better addressing National Security threats and guarding critical infrastructures.<br\/><br\/>Networking efficiently embedded systems, unmanned vehicles, robots and sensors can have enormous societal impact, especially in surveillance applications. This technology is still immature and it is posing very challenging engineering issues that are attracting the interest of an increasing number of researchers. Advanced distributed signal processing techniques may help overcome the limitations posed by standard networking approaches.<br\/><br\/>The SPAWC 2005 topics (see the call for paper included) reflect these emerging new areas of interest. From this premise we can conclude that, while the content of the workshop is evolving, the necessity of providing an arena to present and discuss the most recent\" Signal Processing Advances in Wireless Communications\" has not diminished.","title":"6th IEEE Workshop on Signal Processing Workshop on Signal Processing Advances in Wireless Communications -SPAWC 2005","awardID":"0455897","effectiveDate":"2005-03-01","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["475040","550699",270253],"PO":["564898"]},"104494":{"abstract":"ABSTRACT<br\/>0508019<br\/>Lori Clarke<br\/>U of Mass<br\/><br\/>This proposal is a request for $10,000 to support travel and accommodation costs for U.S. students selected to attend the 2005 International Conference on Software Engineering (ICSE 2005) Doctoral Symposium to be held in May 2005 in St. Louis, MO. We propose to provide up to $1000 of funding each for approximately 10 eligible students who are selected for support based on their needs.<br\/><br\/>The Doctoral Symposium at ICSE provides a venue for young researchers to access world-wide expertise in software engineering. The Symposium is a one-day closed event held as part of ICSE that provides a forum for Ph.D. students to publicly discuss their research goals, methods, and results at an early stage in their research.","title":"Special Projects: Student Travel Support for the International Conference on Software Engineering 2005 Doctoral Symposium","awardID":"0508019","effectiveDate":"2005-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["536735"],"PO":["564388"]},"106870":{"abstract":"Workshop Proposal:<br\/>Crossings: Applying Research Findings to<br\/>Cross-Border Security Cooperation<br\/>Abstract<br\/>A team of academic researchers, public officials, and industry leaders in southeastern Michigan<br\/>and southwestern Ontario propose to conduct a workshop on the cultural and institutional<br\/>challenges of cross-border security cooperation, and the application of research findings in<br\/>disaster management and organization research to issues of cooperation. We observe that a<br\/>growing class of disasters are those that observe no political boundaries, including international<br\/>frontiers: certain of these, particularly those involving biohazardous events, can be compounded<br\/>by the differences in cultural values and institutional assumptions (for example: accessibility of<br\/>health care) on different sides of a border.<br\/>To create a research agenda for understanding these issues, and for applying the findings of basic<br\/>research, we propose to bring together researchers and disaster management practitioners from<br\/>both Canada and the United States for an intensive, one-day discussion of the challenges posed by<br\/>these new problems in crisis management and the new opportunities for solving them afforded by<br\/>current academic research. In the scope of an intensive, well-staffed discussion between<br\/>academics and practitioners, we will be able to identify specific opportunities for applying the<br\/>research results of multiple projects, and to identify critical areas for future research collaboration<br\/>between Canada and the United States.<br\/>The workshop will be jointly sponsored by institutions in Canada and the United States.<br\/>Contributions to Theory and Method<br\/>This workshop will be an agenda-setting workshop, building a consensus among leading<br\/>academics in the United States and Canada, and practitioners at the state, provincial, and<br\/>municipal levels, for applied research in crisis management. It will give particular focus to the<br\/>application of simulations and modeling, particularly agent-based models of cooperation, to<br\/>issues of improving organizations' response to disasters.<br\/>Broad Social Impact<br\/>This workshop will bring together the users of crisis management research findings with the<br\/>producers of that research. Numerous areas that we have already identified where research could<br\/>improve practice in the design of drills and scenarios for improved learning, in the<br\/>implementation of communication technologies for improved coordination, and in the<br\/>improvement of organizational learning from crises can be quickly implemented following this<br\/>important meeting of researchers and practitioners.","title":"Crossings: Applying Research Findings to Cross-Border Security Cooperation","awardID":"0519440","effectiveDate":"2005-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1638","name":"INFRAST MGMT & EXTREME EVENTS"}}],"PIcoPI":["354231"],"PO":[281812]},"94985":{"abstract":"The recovery of the shape of reflective surfaces from images is investigated. Both the computational foundations as well as human visual perception are explored. <br\/><br\/>Key issues on the computational front are : (i) the geometrical relationship between surface shape and observations of a reflected scene on the surface; (ii) the nature and role of constraints that help in reconstructing shape from visual measurements. This second issue is investigated first under stringent assumptions (calibrated known scene) which are then lightened progressively (un-calibrated known scene, un-calibrated unknown scene). The relevance of additional visual measurements (multiple images from stereoscopic rigs, occluding boundaries, internal boundaries) as well as the relevance and use of statistical constraints (generic viewpoint assumption, isotropy, homogeneity) is also explored. <br\/><br\/>Human perception of mirror surfaces is little explored and very poorly understood. The first area of investigation is qualitative shape perception in the presence of an increasing number of cues (image patch, surface boundaries, reflected scene, internal boundaries) and with different scene statistics both natural and synthetic (regular periodic patterns, isotropic textures, indoor scenes, outdoor scenes). The cues that lead the human visual system to classify surfaces as specular vs. textured\/matte are explored next. A third issue is the relationship between the mechanisms underlying shape-from-texture and shape-from-specularities. The proposed research provides: i) methods to measure the shape of specular surfaces, a notoriously hard problem in computer vision; ii) fundamental understanding of the geometry and statistics underlying vision of reflective surfaces; iii) exploration of the value of prior knowledge in a Bayesian framework; iv) insight into an underexplored ability of the human visual system. <br\/><br\/>The broader impacts of this proposal include extending the applicability of 3D scanning system to specular surfaces, which are common in engineering, medicine and art conservation. For this reason methods that are general, practical and low-cost are of particular interest in this study.","title":"3d Perception of Specular Surfaces","awardID":"0413312","effectiveDate":"2005-03-01","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["517415"],"PO":["564316"]},"105211":{"abstract":"This award supports the participation of doctoral students from U.S. universities in the Doctoral Consortium of the 15th International Conference on Automated Planning and Scheduling (ICAPS) to be held June 5-10, 2004 in Monterey, California. ICAPS is the premier conference for research in artificial intelligence planning and scheduling. This Doctoral Consortium will provide participants with the opportunity to interact with established researchers as well as fellow doctoral students. The overall goals of the ICAPS Doctoral Consortium include providing participants with valuable feedback and exposure to additional perspectives on their work at a critical time in their doctoral research projects as well as providing helpful career advice at a critical time in their professional development. Participants will receive feedback and advice through activities and discussions at the Consortium as well as through the poster session of the main ICAPS conference.","title":"ICAPS 2005 Doctoral Consortium Student Travel Support","awardID":"0511705","effectiveDate":"2005-03-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["424402"],"PO":["491702"]},"101053":{"abstract":"The Pierce Lab at Caltech proposes a research program that combines theoretical, computational<br\/>and experimental components to advance the field of structural nucleic acid nanotechnology in developing rigorous and robust methods for encoding arbitrary mechanical function in nucleic acid sequences. Modeling and algorithm development projects will address key analysis and design challenges. The investigation of pseudoknot biophysics will help to create a physically based potential for partition function algorithms and illuminate the role of topology in the behavior of the \"kissing hairpin\" mechanism under experimental study for catalytic fuel delivery to autonomous devices as well as:<br\/>-on implementing an efficient hierarchical mutation algorithm for optimizing affinity and specificity for target secondary structures using partition function information<br\/>-on methods for identifying and designing multiple features of an energy landscape including networks of metastable states relevant to autonomous device design<br\/>-and on formulating and optimizing the multi-objective design problem that characterizes device engineering, in which multiple strands must conditionally adopt different structures depending on the subsets of strand species that are present.<br\/><br\/>Intellectual Merit<br\/>The proposed research program seeks to develop analysis and design tools that will dramatically increase the level of rigor, accuracy, and automation with which nucleic acid devices are engineered. The work encompasses physical modeling, algorithm development, mechanism design, and experimental validation, with the unifying goal of enabling the manipulation of subtle features in the multiple energy landscapes that underlie the design of devices with many conditionally stable states. The development of a practical catalytic fuel delivery method and subsequent construction of a robust autonomous walker that can take hundreds of unassisted steps would represent a breakthrough in the field. Likewise, HCR provides a new functional paradigm for nucleic acid nanotechnology, creating many attractive avenues for investigation.<br\/><br\/>Broader Impact<br\/>The ability to engineer autonomous devices at the nanometer length scale may someday have importantmedical applications including the targeted delivery of toxic drugs. In the nearer term, HCR has the potential to facilitate the construction of versatile and inexpensive biosensors. Undergraduates have the opportunity to participate fully in this interdisciplinary research through the Caltech Summer Undergraduate Research Fellowship program. Researchers at other universities can freely download source code for the analysis and design software developed in the Pierce Lab. At Pasadena public schools, 62% of students participate in free or reduced-price meal programs and more than 80% of students are underrepresented minorities. For many students, the Jr. Teacher program will provide a rare opportunity to consider the attractions of pursuing a career in science or engineering.","title":"CAREER: Engineering Nucleic Acid Devices","awardID":"0448835","effectiveDate":"2005-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["549585"],"PO":["565223"]},"105212":{"abstract":"This award supports participation of doctoral students from U.S. universities in the tenth SIGART\/AAAI Doctoral Consortium to be held July 9-10, 2005 in Pittsburgh, PA, in conjunction with the 20th National Conference on Artificial Intelligence (AAAI-05), July, 9-13, 2005. The Doctoral Consortium aims to: (1) provide a setting for feedback on participants' current research and guidance on future research directions; (2) develop a supportive community of scholars and a spirit of collaborative research; (3) support a new generation of researchers; and (4) contribute to the conference through interaction with other researchers at the conference. The Doctoral Consortium will strive to recruit and include students from underrepresented groups (e.g., women and underrepresented minorities) and smaller schools or schools with less established programs in artificial intelligence. Each student will give a 25-minute presentation to be followed by 20 minutes of discussion lead by a faculty participant. In addition, each student will have a one-on-one meeting with the faculty participant. There will also be opportunities to discuss career issues in both academic and other career pathways. It is expected that thesis summaries of the participants will be published in the AI Magazine","title":"2005 SIGART\/AAAI Doctoral Consortium","awardID":"0511718","effectiveDate":"2005-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["491701"],"PO":["491702"]},"101131":{"abstract":"This CAREER award deals with research that aims to explore time-dependent carrier dynamics and nonlinear optical effects in semiconductor quantum wells (QWs) in the THz frequency range with novel techniques for generating and shaping intense multi-cycle THz pulses. Exploiting syntheses of arbitrary THz pulses, the proposed experimental schemes focus on precise and coherent control of quantum wavepacket dynamics representing internal transitions of confined excitons and intersubband transitions in semiconductor QWs. Quantum coherences and nonlinear responses of the fundamental excitations will be investigated by manipulating and monitoring temporal evolution of the wavepackets via THz time-domain spectroscopy (THz-TDS) with intense multi-cycle THz pulses. THz-TDS permits precise measurements of phase as well as amplitude of the wavepackets, thus complete quantum information of the system can be obtained. The educational program will use interactive Java programs to demonstrate the basic concepts and results of the research program based on time-domain analysis of light-matter interaction, wave propagation, and quantum wavepacket dynamics. This will be used to contribute to course revision and development of upper-division physics courses including courses in the Paradigms in Physics Project which will be disseminated nationally. Funding for this award is provided by the AMOP Program in the Physics Division in conjunction with the Condensed Matter Physics Program in the Division of Materials Research.","title":"CAREER: Coherent Manipulation of Carriers and Nonlinear Optical Processes in Semiconductor Quantum Wells Via Intense Multi-Cycle Terahertz Pulses","awardID":"0449426","effectiveDate":"2005-03-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1290","name":"OPTICAL PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["474619"],"PO":["461829"]},"106862":{"abstract":"There exist many examples of Human-Robotic Interaction (HRI) for a single robot or a small number of robots (2-4). But HRI development for large robot teams requires novel techniques for presenting large amounts of data so as to support a human's ability to maintain situation awareness while not overloading his\/her cognitive capabilities. In this project the PI will assess needs and requirements, and develop preliminary interface designs, for tools that will permit a small number of humans to supervise large robotic teams, a capability not available with current HRI methodologies. To this end, the PI will build on prior work in HCI, CSCW, and complex human-machine systems. She will interact continuously with and solicit feedback from the Metro Nashville Police Chemical, Biological, Radiological, Nuclear, and Explosive (CBRNE) search and rescue team, because a basic premise of the work is that in order to develop useful interfaces one must first understand how organizations will actually use large teams of robots, which in turn requires an understanding of how the human team currently completes their tasks (without robots), their expectations of a robotic team, and requirements for robotic team capabilities.<br\/><br\/>Broader Impacts: This work will advance the fields of robotics, artificial intelligence, and human factors. Specifically, it will advance the community's understanding of how large numbers of robots can be effectively supervised, managed, and guided by a small number of human operators, thus affording more usable systems while reducing the associated manpower and exposure to potentially dangerous contaminants. Due to the project's focus on deploying robots for CBRNE attacks, the results will have broad affects on developing deployable robotic systems based upon user feedback to meet ever-increasing Homeland Security needs.","title":"SGER: Requirements Assessment for a Multiple Robot-Multiple Human Interface","awardID":"0519421","effectiveDate":"2005-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["379282"],"PO":["565227"]},"107446":{"abstract":"This is funding to support a one-day workshop on September 3, 2005 in Sesimbra, Portugal, immediately preceding the INTERSPEECH 2005 conference, which will be held in Lisbon on September 4-8, 2005. The PI posits that in an effort to promote more efficient and safer vehicle operation, next-generation driver-vehicle interfaces will incorporate biometric recognition using speech, video\/image and analog behavior signals. But achieving affordable and reliable biometric capabilities in vehicles is likely to be challenging. Building upon the success of a prior workshop in 2003 supported by Nagoya University's Center for Acoustic Information Research (CIAIR) under the technical sponsorship of the IEEE Signal Processing Society, participants in this year's workshop will assess the current state-of-the-art in DSP technologies and discuss ways to move the field forward. Workshop topics will include (but not be limited to) DSP technologies for vehicle personalization, DSP technologies for vehicle and traffic control, DSP technologies for detection of driver fatigue and driving under the influence, audio and video processing for mobile e-commerce applications, multi-sensor applications and data fusion, deployment of multimedia devices in vehicles, and HCI in mobile environments. The organizing committee will work to bring together key researchers from Europe and Pacific Rim countries working on the latest techniques, standards, and emerging deployment, to present their work to one another through a mixture of invited lectures and poster papers accepted through a peer-review submission process. Both a hardcopy workshop guide and a CD of the proceedings will be distributed to attendees, and additional copies will be made available for dissemination to the research community and other stakeholders.<br\/><br\/>Broader Impacts: The workshop will focus particularly on facilitating collaborative research relating to vehicle safety, vehicle personalization, safety of passengers and goods (especially in commercial vehicles), and secure e-commerce from moving vehicles. The PI expects the workshop will produce recommendations to the scientific community for new research directions and infrastructure, so as to provide a bridge linking the various disciplines related to DSP, human cognition and driving. Although certain pre-eminent scholars in the field will be invited, the organizing committee will aggressively distribute a general call for participation both via e-mail and on the Web. The PI is especially keen to assure participation by members of traditionally under-represented institutions, and will pay close attention to inclusion of minorities and women in the workshop.","title":"Biennial on DSP in Vehicular and Mobile Systems; Sesimbra, Portugal; September 3, 2005","awardID":"0521861","effectiveDate":"2005-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[283804],"PO":["565227"]},"101022":{"abstract":"CAREER: Architectural Support for Online Security Analysis<br\/>Abstract<br\/><br\/>A pressing problem facing modern computer system design is how to ensure that computers connected to the network are safe from attack. The research will investigate computer architectures that enable a new generation of network security devices capable of detecting suspicious network behavior and known attacks. Several different security applications are characterized by requiring the frequent access and maintenance of large amounts of state, such as large lookup tables, on every byte or packet, with worst-case bounds on throughput. Our architecture will take advantage of many small, wide word, on-chip memories to rapidly traverse large graph structures that are not well supported on current existing or proposed machines. This approach results in significant reduction in memory usage and increase in throughput. Such architecture could result in a new generation of devices capable of significantly reducing the damages caused by viruses, worms, and malicious attacks. The development of a functional prototype will enable both researchers and students to study the internal dynamics a network under attack, and the architectural challenges it presents.","title":"CAREER: Architectural Support for Online Security Analysis","awardID":"0448654","effectiveDate":"2005-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["527086"],"PO":["550859"]},"106116":{"abstract":"Abstract<br\/>NSF-0515674<br\/>Chandra, Surendar<br\/><br\/>The effort focuses on developing recognition algorithms that use a large number of multimedia sensors that are deployed as needed in an ad hoc fashion. The goal is to design algorithms that connect the various uncoordinated views and deduce the global state. Rather than requiring real time scene analysis, the proposed system stores the scenes in high fidelity for specific durations in in-situ storage bricks. Retrospective algorithms search and leverage the various views in order to detect complex states that are missed by analyzing a single stream. Storing the stream also allows the system to analyze complex behaviors that require behavior analysis over extended periods of time. A self managing infrastructure for profuse media capture and storage will be developed including efficient mechanisms for the sensor components to search and locate other components using an unstructured peer-to-peer overlay. Operating systems mechanisms that allow these sensor components to balance their local resource consumption with global end-to-end requirements will be designed. Pattern recognition tasks such as semantic tagging of actor trajectories, multi-camera moving object tracking as well as mechanisms for integrate multimedia data sets to extract patterns of interest are also planned. <br\/><br\/>The proposed research will enable recognition tasks that are not possible in traditional<br\/>system that require real time processing. The focus on sensors built with commodity components offer the potential for immediate impact to the user community. These systems promise to have significant economic, environmental, and societal impacts. The research prototypes developed will be disseminated freely. The educational aspect of this proposal will focus on integration of the research results into an experimental systems curriculum with graduate training and undergraduate summer research mentorships, especially for women and underrepresented students.","title":"Hydra: A Robust and Self Managing Video Sensing System for Retrospective Surveillance (UND_FY05_055)","awardID":"0515674","effectiveDate":"2005-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V918","name":"DIA-SOW"}}],"PIcoPI":["313372",279941],"PO":["565136"]},"105269":{"abstract":"The characteristics of participants (subjects) in research studies are critical for academic peers to determine the validity of a study, and the applicability of results to new populations. But while a participant's medical condition can be referred to using consistent medical terminology, for HCI the name of a given condition provides only a vague estimate of the functional capabilities of the individual. Numerous articles have been published where participants were described as having multiple sclerosis, muscular dystrophy, cerebral palsy, or cervical spinal cord injuries, but such clinical diagnoses provides insufficient insights into the capabilities of the study participants. In this research, the PI will take the first steps towards the development of consistent assessment tools for measurement of the functional capabilities of research participants, which address the needs of the HCI research community with respect to describing a subject cohort with functional impairments for a given study. The PI envisions such assessment tools being used to measure both applicable human functions (seeing, hearing, physical movement and manipulation, and cognition) and standard HCI functions (inputs such as pointing, text entry and speech input, and outputs such as visual display, text-to-speech output amd audio display). The tools would be designed for use in any study which involved HCI and people with disabilities, and could also be used to assess people who experience situational limitations which occur not because of medical causes but due to the environment (cold, heat, wind, brightness, darkness, etc) or the task (carrying things, eyes-busy, audio occluded or precluded, etc). In this exploratory study, the PI will focus on one set function, namely physical interactions with computers, for which he will develop two proof-of-concept solutions. First, a questionnaire-based functional assessment will be developed, by bringing together existing knowledge on the assessment of physical functions and IT interactions. This tool will be evaluated by accessibility researchers, followed by a controlled experiment that will allow for formal validation as well as a demonstration of the tool's practicality. Second, to demonstrate the potential of computer-based functional assessments, the PI will develop a hardware and software tool that provides detailed quantitative functional assessments for selected movement and dexterity impairments, including those which are voluntary (e.g., reduced fine motor control) and involuntary (e.g., tremors, dystonia, myoclonus). This tool, to comprise standard and customized computer hardware as well as custom software, will allow for more detailed assessments than the paper-based tool. Again, tool efficacy will be demonstrated through a controlled experiment.<br\/><br\/>Broader Impacts: This research focuses on the challenges experienced by individuals with various disabilities as they interact with information technologies. The outcomes of the project will allow the capabilities of study participants to be described independent of any underlying clinical diagnosis, while providing greater detail regarding their IT-related capabilities. As a result, the resulting techniques will enhance our ability to interpret results reported in the literature, and will also allow results to be compared among studies more effectively. Future extensions of this research may facilitate the matching of IT users to specific technologies, and also assist hardware and software developers to develop products that either adapt to the needs of individual users or are usable by people with a wide variety of functional limitations.","title":"SGER: IT-Oriented Functional Assessments","awardID":"0511954","effectiveDate":"2005-03-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["466602","559955"],"PO":["565227"]},"100990":{"abstract":"Despite the tremendous improvement in technology of networked storage, and the vast improvement in cryptographic techniques, the directly-applicable state-of-the-art cryptographic techniques are rarely used in today's real-life storage systems and research. There exists a wide gap between the recent cryptographic advances and the existing cryptographic techniques used to secure storage systems. This project narrows the gap between the state-of-art cryptographic solutions and the existing storage security solutions as well as continuing to identify and resolve new security problems. In particular, this research provides the following solutions: 1) Security for Minimally Trusted Storage Systems: Securing data on minimally trusted storage is particularly important, because of frequent insider misuse as well as the current trend of outsourced storage services. In this project, new cryptographic mechanisms are provided for temporal access control and secure file sharing. 2) A Secure and Practical Data Sharing System: Relying either on system administrator or on the data users to add a new user in global file system may cause possible misuse of privilege. This project resolves this \"dilemma\" by splitting the trust between system administrators and data owners and making them co-operatively work together to add users to the system. 3) Symmetric-key role-based access control: This project provides efficient decentralized access control mechanism. For all these project, complete cryptographic analysis as well as implementation on diverse storage platforms are considered. The output of this research will be disseminated to diverse audiences ranging from cryptographers to storage industries.","title":"CAREER: Reconsidering Security for Storage and Distributed File Systems","awardID":"0448423","effectiveDate":"2005-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["422435"],"PO":["561889"]}}