{"135410":{"abstract":"Algorithm researchers require realistic test problems to validate their work. However, these researchers may not have access to the applications that would produce such test problems. Consequently, they have to rely on test problems stored on web sites, which may be too limited in variety and unrealistically small, or on hand-coded test problems, which will not be realistic. This research concerns the construction of a test problem server, that is, a server that has a number of realistic research and production codes installed, with the facility to deliver to the algorithm researcher the test problems these codes produce. With such a server, the researcher can specify in advance the desired size and properties of the test problems, benefitting the quality of the algorithm research.<br\/><br\/>Algorithms such as for linear systems, graph theory, or eigenvalue computations, are often developed in mathematics and computer science departments, without the researcher having access to the sort of applications that these algorithms will benefit from. Consequently, algorithm researchers have to rely on the limited inventory of test problems on popular archive sites such as Matrix Market, or they have to code their own test problems, which are unlikely to be realistic. <br\/>This project constructs a server that will have a number of research and production codes installed, with the facility to serve up generated problems to the user. These codes can be run on demand, with specified problem inputs controlling the problem size and numerical properties. Thus, researchers have access to test problems that are both wide ranging in variety and finely graded in numerical properties. This is of benefit to the quality and robustness of the algorithms developed.","title":"CRI: CRD-- An On-Demand Test Problem Server","awardID":"0751144","effectiveDate":"2008-03-15","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["501527"],"PO":["565272"]},"135399":{"abstract":"This is a planning grant that focuses on an embedded middleware development tool for sensor networks that is based on a research prototype recently developed by this team at Purdue University.<br\/><br\/>For this planning grant the project team proposes to expand their existing sensor capability by purchasing a larger sensor network test-bed to validate software development tools for run-time error monitoring and diagnosis. In addition, the project will enable an application case study for carbon dioxide monitoring for indoor circulation systems.<br\/><br\/>Sensor nodes typically are highly vulnerable to hardware breakdowns when deployed in harsh conditions. Because of their ad hoc and dynamic nature, the communication protocols of networked embedded systems tend to be complex and frequently error-prone. In addition, these networks experience: components and communication links that are exposed to potential adversaries and hence are under security threats such as node capture, denial of service, and malicious code injection; constrained resources such as storage, bandwidth, computing power and energy; and, even though they may be correctly designed, network protocols may be implemented incorrectly due to programming errors.<br\/><br\/>The goal of this project is to permit the broad research community of Networked Embedded Systems (NES) to use the robust programming tool proposed with this project for run-time error monitoring and diagnosis. The tool will target the problem that errors can occur in any of the many components of a sensor network and those errors need to be detected quickly and effectively.","title":"CRI: Planning - A Testbed for Compiler-supported Scalable Error Monitoring and Diagnosis for Reliable and Secure Sensor Networks","awardID":"0751101","effectiveDate":"2008-03-15","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["408878","556632","540778",359685],"PO":["564778"]},"134322":{"abstract":"New general high-performance computing platforms simultaneously run multiple programs and a large number of threads. This presents unprecedented challenges for code optimization. First, the ubiquitous existence of multi-program and multi-thread makes a program run in an environment that has extensive resource competition. Second, the execution environment, which is the target of code optimization, is always changing during the life of a program.<br\/> <br\/>This project employs a systematic approach of optimization and runtime adaptation for multiple runtime contexts - Context-aware and Context-adaptive Optimization (CACAO). CACAO exploits both computer architectural features and runtime contexts in program optimizations and integrates four synergistic approaches: (1) Runtime environment characterization, which characterizes contexts in which a program will execute and augments compiler models with context; (2) New profiling techniques, which report both program performance and context information; (3) Context aware code optimization, which uses profiling information to identify and predict contexts, optimizes programs for different contexts, and integrates contextualized versions of a program; and (4) Dynamic code adaptation, which adapts programs at runtime by selecting the most suitable version of a program for the current context.<br\/> <br\/>The project directly leads to more effective compilation and code generation in all domains, thus bringing broad benefits to society, in particular for people who require the computation power from the new general high-performance computers.<br\/> <br\/>The project is expected to provide new code optimization techniques that accelerate programs in the new high-performance computers. The optimization techniques and resources will be disseminated as open-source software tools and packages.","title":"CAREER: Context-Aware and Context- Adaptive Code Optimization for New General High-Performance Computers","awardID":"0746034","effectiveDate":"2008-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["525208"],"PO":["565303"]},"142198":{"abstract":"so This award provides NSF support for a multidisciplinary planning workshop, held April 25, 2008, in St. Louis, Missouri, in conjunction with CPSWEEK 2008. The purpose of the workshop is to examine research needs and advance a multidisciplinary research agenda in Cyber-Physical Systems. Contributing subfields include distributed, real-time and embedded systems, dynamics and control theory and engineering, networking and communication, formal methods, learning and state estimation, robotics, human-in-the loop design, sensor and actuator nets, hardware and system software platforms for embedded systems, and physical device and system engineering. Cyber-physical systems are seen as the next generation of engineered systems, in which cyber capability (computation, networked control, and communication) is pervasive and deeply integrated into the design and interactions of physical and engineered systems.","title":"Workshop Proposal: Cyber-Physical Systems Summit","awardID":"0825209","effectiveDate":"2008-03-15","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["431683"],"PO":["561889"]},"140032":{"abstract":"This is funding to support a workshop of approximately 30 graduate students and recent graduates from master's and doctoral programs in diverse communities (including computer science, engineering, psychology, cognitive science, and communications), along with distinguished research faculty. The event will take place on Wednesday, March 12, 2008, in Amsterdam, The Netherlands, immediately preceding the Third Annual Human Robot Interaction Conference (HRI 2008) to be held March 13-15, which is sponsored by ACM and cosponsored by IEEE. This workshop is designed to complement the conference by providing a forum for students and recent graduates in the field of human-robot interaction to present their current research before peers and a panel of senior researchers in a setting that is less formal and more interactive than the main conference. Student and faculty participants will talk about the important upcoming issues in the field, encouraging the formation of collaborative relationships across disciplines and geographic boundaries. The workshop will include three types of sessions: student presentations, breakout sessions, and group presentations. Participants will hear short presentations on current research from 12 selected participants, with time allotted for questions and discussion after each of these talks. Breakout sessions will divide the participants into 2-4 groups to discuss a focused question on common research themes posed by the organizers. The theme of HRI 2008 is \"Living with Robots,\" which highlights the recent trend toward developing a new generation of robots capable of operating in human-centered environments, interacting with people, and participating in\/assisting with their daily lives. The morning session of the workshop will pose questions related to conference-oriented themes (e.g., assistive robotics, awareness and monitoring of humans, long term interaction). The afternoon breakout session will involve a small group project in which participants must work together to address some facet of HRI in a given domain\/application (e.g., design parameters, methods and techniques, relevant technologies). Following a keynote address from a distinguished researcher in the field, the group presentation session will provide each breakout group with the opportunity to present a summary to the entire workshop. <br\/><br\/>Broader Impacts: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (e.g., computer science and engineering, psychology, robotics, human factors and ergonomics, and human-computer interaction). This is important for the field, because it has been recognized that advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming year. Workshop organizers will act aggressively to recruit young researchers from minority and underrepresented groups in order to assure that the participants constitute a diverse group across a variety of dimensions, so that the students' horizons are broadened to the future benefit of the field.","title":"HRI Pioneers Workshop 2008","awardID":"0813909","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[372103],"PO":["565227"]},"135973":{"abstract":"The WGBH Educational Foundation together with the Association of Computing Machinery (ACM) and dozens of partners, proposes a major new initiative to reshape <br\/>the image of computing among college-bound high school students, with a special focus on Latina girls and African-American boys. Image is seen as an important factor in the lack of interest in computing majors among high school and college students, who often see computer scientists as geeks and nerds with boring jobs and equally boring lives. Latina girls and African-American boys ? among the most underrepresented groups in computing ? represent particularly important and challenging audiences. The New Image for Computing project will research and design a ?communications make-over?? a new set of messages that will accurately and positively portray the field and will be widely tested for their emotional appeal to and intellectual connection with the targeted audiences. Experienced marketing professionals will help create the messaging campaign using proven marketing and communications strategies. WGBH, a leading producer of programming for public television and non-broadcast educational media, is uniquely positioned to lead this initiative, as they have a current, similar project called Engineer Your Life that aims to encourage academically prepared high school girls to consider engineering as an attractive option for both post-secondary education and as a career choice.","title":"New Image For Computing","awardID":"0753686","effectiveDate":"2008-03-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["497533",361237],"PO":["561855"]},"144135":{"abstract":"The PIs will develop and pilot test educational materials for teaching ethical and social issues to graduate students in information assurance and security, computer science, and information technology, the main deliverable of the project being a book having four main sections: ownership; privacy; access; and safety, reliability, and liability. The book will present case studies to help students develop their ethical reasoning skills, and to engage students in an enthusiastic understanding of how information assurance and security professionals contribute to the construction of the future. The PIs envision that the final edited book could be used as the text in a stand-alone graduate course in a computing curriculum or an information assurance and security curriculum, or alternatively a chapter at a time as supplementary material throughout a graduate computing curriculum. The PIs' approach differs from existing efforts, in that the structure and theoretical basis of the book will stem from research on moral development in early adulthood as well as constructivist learning theory. That is to say, the PIs' book will address ethical and social issues in a manner that attends to the cognitive, social, and affective aspects of ethical development of human beings during early adulthood, which is the age of most graduate students. The PIs' approach is also unique in that it is specifically targeted at ethical and social issues for the information assurance and security graduate curriculum, which is a growing field. <br\/><br\/>Broader Impacts: The availability of a well designed, evaluated and tested educational resource as described above will help computing programs establish courses and curricula that emphasize ethical development of students. The project is built on the partnership of faculty from nine universities who will serve as developers and\/or testers of the book. The home institutions of these faculty include an HSI and an HBCU, and the developer group has ethnic, gender and geographic diversity.","title":"Collaborative Research: Ethics Education in Computing - A Moral Development\/Constructivist Approach","awardID":"0835594","effectiveDate":"2008-03-01","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}}],"PIcoPI":[384220],"PO":["565227"]},"139944":{"abstract":"This is funding to support a pair of events in conjunction with the 2008 Interaction Design for Children conference (IDC08), which will take place June 11-13 in Evanston, Illinois: a Doctoral Consortium which will bring together approximately 9 promising doctoral students from the United States and abroad along with 3 distinguished research faculty; and a pre-conference Workshop on Designing Technologies for Children with Special Needs that will culminate in a keynote lecture that will explore the challenges, opportunities and complexities behind producing international versions of a children's television program. The annual IDC conference is the leading international forum for the presentation and discussion of interaction design for children, from the perspective of research as well as practice. IDC08 will strive to expand the reach of previous conferences, both in terms of the number and kind of attendees, and in terms of the number and kind of children that we target with our technologies. The goals of the Doctoral Consortium are to increase the exposure and visibility of the participants' work within the community, to help establish a sense of community among this next generation of researchers, and to help foster their research efforts by providing substantive feedback and guidance from a group of senior researchers in the area in a supportive and interactive environment. Student participants in the Doctoral Consortium will make formal presentations of their work and will receive feedback from a faculty panel; the feedback is geared to helping students understand and articulate how their work is positioned relative to other research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The Workshop on Designing Technologies for Children with Special Needs will allow intellectual exchange among top researchers and designers in this field. Discussions about challenges for working with special populations, new methods for approaching these challenges, and new directions for research and design will contribute to and expand the research perspective of all participants. During the main conference attendees of both events will present their work in poster sessions, and abstracts will be included in the IDC Conference Proceedings as well in the ACM Digital Library.<br\/><br\/>Broader Impacts: The pre-conference workshops at IDC08 will bring together some of the best students, researchers and practitioners in the field of interaction design for children, and will thereby afford the younger participants a unique opportunity to gain wider exposure in the community for their innovative ideas while also allowing them to create a social network both among themselves and with senior colleagues in the field. Since the IDC conferences host a diverse group along several dimensions (such as nationality, scientific discipline, and research specialization), participants' horizons will be broadened and new collaborations will emerge, to the future benefit of the field.","title":"IDC Conference 08 Workshops","awardID":"0813604","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["496760"],"PO":["565227"]},"135402":{"abstract":"Intellectual Merit: <br\/><br\/>The goal of this project, a collaboration between the University of Michigan and Georgia Tech, is stand up a deployed system and associated distributed monitoring and diagnosis algorithms to improve performance, availability, and security of production communication networks. The infrastructure will enable research in two primary settings: network security and network management.<br\/><br\/>The project provides a unique platform for evaluating systems and algorithms for network management and security that rely on cross-domain visibility. The infrastructure and associated research will enable multidisciplinary research between experts in networking, databases, security, and machine learning. It will provide researchers from these domains both (1) access to real-world network management and security problems from operational networks, thus providing a sound basis for new research problems; and (2) a realistic setting under which they can evaluate their results.<br\/><br\/>Broader Impact: <br\/><br\/>The first area of broader impact is in network operations. The infrastructure will be deployed on production networks and will serve as a platform for distributed network monitoring research in both network security and network management. There will be close collaboration with campus network operators at Georgia Tech, the University of Michigan, Southern Crossroads (SOX), and Merit Network. The second area is in education. Students in undergraduate and graduate networking courses at the two universities will be given the ability to run their own monitoring experiments on the infrastructure through a controlled interface. The third area is with regard to NSF goals such as those expressed in Future Internet Design (FIND) and Global Environment for Network Innovations (GENI). The networking community to-date has no infrastructure that facilitates deployment studies of systems and algorithms and the operation of real, production networks. This infrastructure offers a way to bring together different networking and computing communities and explore the hardest management and security problems confronting large-scale networking.","title":"CRI-IAD: Collaborative Research: Enabling Security and Network Management Research for Future Networks","awardID":"0751116","effectiveDate":"2008-03-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["464147","533271","549845",359698,"553725"],"PO":["565327"]},"140012":{"abstract":"ABSTRACT<br\/><br\/>Title: Symposium on Journalism and Computation<br\/><br\/>PI: Irfan Essa<br\/><br\/>Institution: Georgia Institute of Technology<br\/><br\/>Symposium on Computation + Journalism<br\/><br\/>Fundamentally, journalism is aimed at collecting news information and disseminating that information with a layer of contextualization and understanding provided by journalists. Recent advances in computational technology are rapidly affecting how news information is gathered, reported and distributed. Furthermore, new avenues for aggregating, visualizing, summarizing, consuming, and collaborating on news are increasingly becoming popular and challenging traditional practices of Journalism. Following the success of text search, image and video search questions are now poised to make a bigger impact to journalism and other related fields. Computation and Journalism individually share a deep routed interest in Information, and the value it provides to society. The concept of Information Quality, the measure of the value that the information provides to the user of that information, brings these two disciplines together. In computing and information sciences, information quality is used to describe the degree of excellence in communicating knowledge or intelligence and is composed of different facets such as accuracy, reliability, comprehensiveness, currency, and validity. In journalism, where the conveyance of quality information is paramount, principles such as accuracy, fairness, thoroughness, and transparency guide journalists in communicating quality information.<br\/><br\/>Traditionally, journalism has also entailed an ethos of working on the side of the citizenry to provide them with quality information they need to make informed decisions in the process of their daily lives. <br\/>However, the plethora of un-vetted blogs, podcasts, videos and other online media, generated by users or by corporations with subjective biases have led to significant compromise in information quality. <br\/>Collaborative knowledge generation (wikipedia), and citizen journalism, are showing new ways of how information and (global) news can be shared. However, as the Web and the Internet continue to grow and as computing technologies pervade through the planet, a thorough study of the process of journalism and the deep computational aspects of such processes need to be undertaken.<br\/><br\/>To this end, the PI's research group at Georgia Institute of Technology is interested in understanding how computational advances impact the field of journalism. The long term aim is to make novel contributions by developing computational technologies to better support the goals of journalism. To launch this effort, they are organizing a Symposium on Computation + Journalism at GA Tech, in Atlanta, GA, February 22-23, 2008. The goal of this symposium is to bring together stakeholder from the all aspects of Journalism, Media, and Computation. Participants in panels, presentations and breakout groups will discuss these issues and create a roadmap towards answering these questions that bring together computation and journalism.","title":"Symposium on Computation and Journalism","awardID":"0813831","effectiveDate":"2008-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["508256"],"PO":["564316"]},"135414":{"abstract":"This project supports the acquisition of a high performance cluster and storage system for data-intensive applications in materials science, electrical power systems and systems biology. In materials science, the investigators will develop methods to analyze data from the LEAP atom probe tomography, and find ways to understand material properties from the arrangement of its constitute atoms. This new instrumentation is increasingly being adopted by materials scientists, and the project will provide an archive for such data and develop analysis tools. In power systems, the researchers will investigate improving the security, reliability and efficiency of national energy infrastructure by utilizing high-performance computing for complex system analysis in energy control centers. In systems biology, the investigators will collectively analyze large-scale gene expression data from experiments conducted worldwide to build robust gene networks. These research efforts will lead to significant advances in the penetration of high performance computing technology in materials science, power systems research, and molecular biology. The project will bring together multiple departments and research centers at Iowa State University and further enrich interdisciplinary culture and training opportunities.<br\/>A number of students will be trained in computation-centric interdisciplinary research.","title":"CRI: IAD Acquisition of a Cluster and High Performance Storage for data-intensive applications in Materials Science, Power Systems and Systems Biology","awardID":"0751157","effectiveDate":"2008-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["561185","521840","511484","565135","536194"],"PO":["565272"]},"141685":{"abstract":"The International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS) is the premier forum for interdisciplinary research in computer architecture, programming languages and compilers, and operating systems. The goal of the conference is to bring together researchers in these fields for technical exchange on topics at the intersection of these discipline, as well as emerging research areas that transcend these traditional disciplinary boundaries. This proposal aims to increase the impact of this conference on women by encouraging and enabling their participation, especially in cases where travel support would otherwise preclude attendance. Priority for these funds will be given to defray the travel expenses of female students (graduate and undergraduate) and female junior faculty.","title":"Travel Support for the Thirteenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2008)","awardID":"0822905","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["450774"],"PO":["565272"]},"140497":{"abstract":"The 6th USENIX Symposium on File and Storage Technology (FAST) is scheduled<br\/>for February 2008. FAST is a leading forum for innovative research in storage<br\/>systems, bringing in researchers and practitioners from both industry and<br\/>academia. Topics include reliability, performance, mobility, power management,<br\/>measurement, and other topics germane to file and storage systems. This NSF<br\/>proposal requested funding to support the attendance of US-based graduate<br\/>students. Participation in leading conferences is an extremely important part<br\/>of the graduate school experience, providing the opportunity to interact with<br\/>more senior researchers and to be exposed to leading edge work. The support<br\/>requested in this proposal makes possible the participation of students who<br\/>would otherwise be unable to attend. Particular attention will be paid to<br\/>directing support towards underrepresented minorities including women,<br\/>African-Americans, and Native Americans.","title":"NSF: Request for Funding for Student Participation in FAST 2007","awardID":"0817478","effectiveDate":"2008-03-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["550389"],"PO":["565272"]},"134502":{"abstract":"The advance in the neuroimaging technology has brought with itself many challenges. One key challenge is the identification of dynamic functional networks underlying the observed neural activity. The current imaging modalities reflect solely the local neural activity, and do not provide a measure of the interaction between electrical or magnetic activity recorded at different sites. In order to gain a better understanding of how the brain processes information, it is crucial to quantify these interactions across the brain. This research addresses this problem by developing a comprehensive signal processing framework to study the functionality of the brain as a complex system based on electroencephalogram (EEG) data for a better understanding of psychopathologies.<br\/><br\/>This research develops three major signal processing methods to improve the current understanding of the brain as an integrated information processing system. First, data reduction and source separation methods that use the sparsity of the EEG signals in the time-frequency plane are developed to reduce large amounts of data into a few neuronal sources.<br\/><br\/>Second, synchrony and information based functional connectivity measures are developed to quantify the time-varying dependence between different neuronal sources. Third, methods from graph theory are adopted to build network models based on the functional connectivity measures and to identify the neuronal pathways and modules. Finally, this framework is applied to the study of the brain related to different psychopathologies including schizophrenia and impulse control problems. Several educational programs are tightly integrated with these research activities to emphasize the societal benefits of engineering. In particular, the investigator is designing outreach activities for K-12 women students and developing an undergraduate signal processing course with a focus on neuroscience applications.","title":"CAREER: Integrated Research and Education in Functional Brain Networks","awardID":"0746971","effectiveDate":"2008-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["518268"],"PO":["564898"]},"137945":{"abstract":"This workshop is intended to be a workshop to disseminate the goals of Cyber-enabled Discovery and Innovation (CDI) to the Operations Research community at the INFORMS Annual Meeting which will be held in Seattle, November 3-7, 2007. The PI will invite key speakers who will provide insights into the types of research projects which will be appropriate for the CDI solicitation. NSF program officers will also be present to provide guidance to this research community. The venue of the workshop was chosen to make the workshop easily accessible to the roughly 4000 participants at the INFORMS meeting.<br\/><br\/>This workshop is a timely undertaking, and will greatly enhance the quality of proposals received by NSF. The presentations and the frequently asked questions will be posted on the web (www.datadrivendecision.osu.edu), thus allowing others to also benefit from the workshop.","title":"Workshop for Cyber-enabled Discovery and Innovation in Operations Research; Seattle, Washington; November 3-7, 2007","awardID":"0804945","effectiveDate":"2008-03-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["529360"],"PO":["423737"]},"135404":{"abstract":"The PI and his graduate students are active OSS researchers, and experienced in e-Science portal and collaboratory design, database technology, search, retrieval and data mining.<br\/><br\/>Intellectual Merit: A self-sustaining community resource a data repository and infrastructure supporting researchers studying the important OSS phenomenon will be developed, deployed, and maintained. The proposed project will preserve, extend and share a unique one-of-a-kind data repository supporting scholarly research on the OSS phenomenon; additional users of the data include researchers in the fields of data mining, software engineering, management, information systems and social science.<br\/><br\/>Broader impact: Under represented groups will be recruited for participation on the project. The community resource will enable increased quantity and quality of research on OSS that could promote better decisions affecting US economic competitiveness, cyber-security, government policy, and the design of scientific cyberinfrastructure and critical industrial infrastructure. The community resource may support research beyond OSS, into areas such as organizational theory, social sciences, and commercial software engineering, and may provide a model for community resources in other research domains.<br\/><br\/>Summary: A large one-of-a-kind research data repository serving a large and growing research community, needs reliable equipment and graduate student support to preserve, organize, and expand its data and services. The research area is an open Source Software development that studies an important but not well-understood phenomenon will be well served by this unique Community Resource.","title":"CRI: CRD Data Archive & Collaboratory for Research on Open Source Software Development","awardID":"0751120","effectiveDate":"2008-03-15","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["426517"],"PO":["564388"]},"135426":{"abstract":"Architecturally diverse computers are those in which a variety of distinct computing engines are mutually present in a system. Examples include chip multiprocessors, reconfigurable logic, and graphics engines. While constructing systems of this type is straightforward, actually using the capabilities of the diverse architectural components to effectively deploy an interesting application is quite difficult.<br\/><br\/>Each of the different computing engines has its own architecture, memory subsystem, language for authoring applications, performance capabilities and limitations, algorithmic strengths and weaknesses, and communities of proponents and detractors. Coordinating a single application across all of this diversity is a daunting task.<br\/><br\/>Auto-Pipe is an application development environment that is designed to support the exploitation of a wide variety of computing engines in the execution of real-world applications. Auto-Pipe includes a coordination language, compiler, simulator, deployment tool, and performance monitor. <br\/> Application authors compose algorithm kernels into streaming applications and the development environment eases the tasks of specifying the required data communications, debugging the composed application, mapping the kernels to computational resources, understanding the performance implications of the mapping decisions, and deploying the resulting application on the architecturally diverse computer system. Auto-Pipe is being developed as a community resource to enable the middleware and computational science communities to effectively use architecturally diverse computers.","title":"CRI: CRD - Enabling Research on Architecturally Diverse Computers","awardID":"0751212","effectiveDate":"2008-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["511555","511556","525751"],"PO":["565272"]},"145514":{"abstract":"PROPOSAL NO: 0429924<br\/>INSTITUTION: Georgia Tech Research Corporation - GA Institute of<br\/>Technology<br\/>PRINCIPAL INVESTIGATOR: Manolios, Panagiotis<br\/>TITLE: System-Level Processor Verification Using Refinement<br\/><br\/>Abstract:<br\/>The objective of this proposal is to develop a formal refinement-based methodology for term-level microprocessor verification and to apply it to complex designs. State-of-the-art microprocessors are extremely complex and industry estimates of validation costs, as a percentage of the engineering effort required to develop a new product, range from 30% to as high as 70%. Even with such resources allocated to validation, bugs are common and the trend toward more complex designs will exacerbate the problem. Current validation efforts focus on checking low-level properties of small components. However, it is difficult to imagine a set of properties that captures system-level correctness, which is why the project advocates a refinement-based approach, where the instruction set architecture is the specification. This means that to an external observer, the processor behaves in a fashion that is consistent with the instruction set architecture, with respect to both safety and liveness properties. The project proposes to develop a theory of refinement for system-level verification and to apply it to complex term-level designs. The refinement-based approach will be part of a design-for-verification methodology that complements the design cycle, that can be automated in a compositional, scalable way, and that is generally applicable across a wide spectrum of designs.","title":"System-Level Processor Verification Using Refinement","awardID":"0841100","effectiveDate":"2008-03-13","expirationDate":"2009-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550467"],"PO":["562984"]},"132358":{"abstract":"This research project will investigate the effects social organization, learning technologies, and their interrelationships, have on the geometric reasoning of PreK-3 students. Social organization is operationalized here as the strategic grouping of students into triads to engage in collaborative problem solving. Learning technologies are operationalized here as physical and virtual manipulative types (tangrams, pentominoes, geoboards) together with supporting software designed to facilitate students in accessing their mathematical knowledge. Based on findings from preliminary work in this area, it is proposed that learning technologies allow for fluid exchanges between peers, and transitions between physical and virtual manipulatives, significantly enhancing geometric reasoning. The current project presents a robust research and design framework that combines iterative cycles of field studies in the classroom with development and experimentation in the lab. The goal is to design, develop and prototype a tabletop computer interface that allows for unprecedented exchanges among student peers and transitions between manipulative types. The tabletop interface will serve first as the apparatus that facilitates experimental manipulations, later being used, through iterative refinement, as the learning technology platform by which students gain access to mathematical knowledge. The advancement proposed by the current work is that it places all interaction on the horizontal tabletop. This is critical in that it removes confounding effects of different seating and screen orientations from pilot study findings. Manipulations of geometric artifacts reside along two dimensions of research questions: the effects of social interaction and of learning technology on geometric reasoning. Hence, the proposed studies will allow investigation of different transitions between fully functional and fully operational thinking, functional and qualitative operational thinking, and qualitative and quantitative parametric thinking with the same interaction morphologies.<br\/><br\/>The proposed research has the potential to make significant contributions to the following intellectual domains: 1) child development -understanding children's development of mathematical reasoning in terms of learning trajectories 2) mathematics education - understanding teachers' use of advanced learning technologies and role in classroom instruction, and children's learning of mathematics using advanced learning technologies; 3) learning sciences - refining techniques for the analysis, design, and development of advanced learning technologies in use; 4) human-computer interaction -design of interfaces that aid learning to include gestural interaction, tangible manipulation, and horizontal displays; and 5) psycholinguistics - grounding of concepts developed in other domains in the classroom environment. Results from the research will also have much to say about the participation of girls in the mathematics classroom, a goal being to encourage rich discourse of all students. In addition, developed technologies may have implications for the education of special needs children as instructional interfaces can be modified and reconfigured to meet the diverse needs of this underrepresented group. A significant outcome of collaboration among these disciplines will be cutting-edge research opportunities for doctoral students and groundwork for the establishment of new curricula and, possibly, degree programs.","title":"Social Organization, Learning Technologies & Discourse: System Features for Facilitating Mathematical Reasoning in PreK-3 Students","awardID":"0736151","effectiveDate":"2008-03-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1707","name":"ADVANCED LEARNING TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["486496",351771,"558650","486881"],"PO":["565227"]},"143117":{"abstract":"Abstract<br\/>Proposal: CNS 0454416<br\/>PI: Sirisha Medidi<br\/>Institution: Washington State University <br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: Secure Wireless Ad-hoc Networking and Sensor Networking Systems <br\/><br\/>Investigators at Washington State University will acquire laboratory equipment for sensor networking research. They will establish a laboratory with an-hoc network capabilities consisting of several wireless enabled computers and personal digital assistants (PDAs), and a sensor network of 50 motes. The PI's will conduct experimental research on topics such as: (i) detecting misbehavior in ad-hoc networks, (ii) identifying and isolating malicious nodes in ad-hoc networks, (iii) distinguishing congestion from misbehavior in ad-hoc networks, (iv) quality of service routing in ad-hoc networks, (v) secure routing in ad-hoc networks, (vi) energy-efficient information dissemination in sensor networks, and (vii) receiver initiated MAC for sensor networks. The infrastructure will allow them to do performance testing and validation of their research in a realistic testbed. Broader impacts of the research include addressing the growing applications of sensor networks in research and societal applications. The facilities will be available for education and course work, including courses that Washington State University offers jointly with the nearby University of Idaho in Moscow, ID.","title":"CRI: Secure Wireless Ad-hoc Networking and Sensor Networking","awardID":"0830127","effectiveDate":"2008-03-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[381076],"PO":["434241"]},"140884":{"abstract":"This symposium explores the role of creativity in scientific discovery and how computational tools help us understand and increase scientific creativity. The symposium brings together researchers from a number of disciplines, who study science and creativity from different perspectives but who share a commitment to the computational metaphor. In addition to fostering interdisciplinary discussions, the participants in the symposium address the following questions at the intersection of creativity and scientific reasoning. <br\/>- What role does creativity play in different facets of the scientific enterprise, and how can computational tools help in each context? <br\/>- When does scientific creativity manifest as a systematic search through a problem space and when does it involve altering the problem representation? <br\/>- When does background knowledge aid creativity in science and when does it interfere with the discovery of creative solutions? <br\/>- How should we structure computational discovery aids to encourage scientific creativity? <br\/>- What is the appropriate tradeoff between constraints and flexibility in creativity-support tools? <br\/>- When do interactions among scientists increase creativity and how can computational aids for interaction support this process?","title":"Symposium on Computational Approaches to Creativity in Science","awardID":"0819656","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["559662",374426],"PO":["424970"]},"136903":{"abstract":"Proposal Summary: The Association for Computing Machinery proposes to bring a number of students with disabilities ? specifically hearing impairment ? to the 2007 Richard Tapia Celebration of Diversity in Computing, there by increasing awareness of and participation by people with disabilities in the computing sciences. The Tapia Celebration is the perfect venue to broaden computing representation to include students with disabilities. The Tapia Conference, with its small size (relative to other professional computing conferences) and its focus on STEM students, would provide a welcoming and nurturing environment. Moreover, students with disabilities may well find similar or overlapping experiences with the under-represented ethnic students at Tapia. For instance, both groups have experiences being overlooked by traditional educational and professional pipelines. These conveyed similar experiences can become the basis of friendships and collaborations. These close student interactions would also seed or broaden student perspectives on future computing environments, needs, and innovation. Faculty from Gallaudet and from RIT has identified specific support needs for each student and those needs will be accommodated with the requested support","title":"Broadening Participation from Hearing Impaired Community at Tapia Computing Conference 2007","awardID":"0800014","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[363758],"PO":["561855"]},"134549":{"abstract":"The PI proposes to study constraint satisfaction problems like<br\/>Max-Cut, Max-2-Sat, Vertex-Cover, and Chromatic-Number. For many of<br\/>these problems, the boundary between efficiently-achievable<br\/>approximation ratios and NP-hard approximation ratios is unknown. The<br\/>PI has a 3-point plan to determine these boundaries:<br\/><br\/>1. Use recent connections between semidefinite programming algorithms,<br\/>integrality gaps, and property testing to determine precise<br\/>boundaries, assuming the \"Unique Games Conjecture.\"<br\/><br\/>2. Define and explore new, more efficient property-testing--based<br\/>hardness reductions.<br\/><br\/>3. Prove the Unique Games Conjecture, using the new<br\/>property-testing--based reductions along with ideas from the theory of<br\/>Parallel Repetition.<br\/><br\/>The broader goal of this line of research is to give more efficient<br\/>and more effective algorithms for the fundamental algorithmic tasks<br\/>like network partitioning, constraint satisfaction, and optimization.<br\/>The PI will explore the limits of how well efficient algorithms can<br\/>solve these problems. Proving \"hardness results\" or limitations on<br\/>the capabilities of efficient computation has positive practical<br\/>consequences. For one, it prevents wasted effort in trying to improve<br\/>unimprovable algorithms. More importantly, by carefully isolating the<br\/>aspects of algorithmic tasks which make them difficult, we are often<br\/>led to new, effective algorithms for solving the tasks when these<br\/>aspects are not present.","title":"CAREER: Optimal Approximability","awardID":"0747250","effectiveDate":"2008-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["550547"],"PO":["565157"]},"143811":{"abstract":"The central question studied in theoretical computer science is: how efficiently (fast) can computational problems be solved?While many problems do have efficient algorithms, there is a wide class of important problems (called NP-complete problems) which are very unlikely to have efficient algorithms. In practice however, it may suffice to solve these problems approximately. This research investigates whether approximate solutions to NP-complete problems can be found efficiently, and how good is the quality of approximation.<br\/> The main contribution of this research is negative results, i.e. proving that for certain NP-complete problems, efficiently finding even approximate solutions is very unlikely. To illustrate the significance of proving such negative results, the investigator proves that it is unlikely to break into a certain cryptosystem, giving a guarantee of its security against malicious attacks. Another related aspect of this research is Proababilistically Checkable Proofs, a method to specify proof formats for mathematical statements, such that the validity of the proof can be checked very efficiently, by looking at only a few places in the proof instead of reading the entire proof. The research has a potential for broader impact in terms of scientific workshops, collaboration between several international researchers, developement of graduate courses, promoting undergraduate research, and advising Ph.D. students.<br\/><br\/> Many computational problems arising in theory and practice are NP-complete. An extensively studied approach to cope with NP-completeness is designing polynomial time algorithms that compute approximately optimal solutions. However, it turns out that for many problems, computing approximate solutions itself is an NP-complete problem, a famous result known as the PCP Theorem, discovered in 1992. In spite of the tremendous body of research that followed this discovery, for many NP-complete problems, there is a gap between the best known approximation result, and the best known inapproximability result. This research focusses on filling this gap by proving tight inapproximability results.<br\/> The PCP Theorem can also be viewed as a result about proof checking (and that is how it was discovered). It gives a way of specifying proofs for NP-statements such that the validity of the proof can be checked very efficiently. The research investigates constructions of more efficient PCPs, with further applications to inapproximability results. The techniques developed are likely to have new applications to areas like metric embeddings and learning theory. The research has a potential for broader impact in terms of scientific workshops, collaboration between international researchers, developement of graduate courses, promoting undergraduate research and advising Ph.D.<br\/> students.","title":"CAREER: New Directions in Inapproximability and Probabilistically Checkable Proofs","awardID":"0833228","effectiveDate":"2008-03-31","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["473603"],"PO":["565157"]},"141898":{"abstract":"This award supports the organization of CPSWEEK-Cyber Physical Systems Week, the first instantiation of a conference cluster that brings together three previously separate conferences under the banner of Cyber-Physical Systems. The constituent conferences are: Hybrid Systems - Computation and Control (HSCC), the Real-Time and Embedded Technology and Applications Symposium (RTAS), and Information Processing in Sensor Networks (IPSN). CPSWEEK is held in St Louis from April 21 to April 24, 2008. NSF funding supports student participation in the conferences and the associated workshops and poster sessions.","title":"CPSWEEK: A Conference Cluster on Cyber-Physical Systems","awardID":"0823915","effectiveDate":"2008-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553540"],"PO":["561889"]},"141546":{"abstract":"Increasing use of computers and networks in business, government,<br\/>recreation, and almost all aspects of daily life has led to a<br\/>proliferation of sensitive data (i.e., data that, if used improperly,<br\/>can harm data subjects or other relevant parties), and concern about<br\/>the ownership, control, privacy, and accuracy of these data has become<br\/>a top priority. Despite significant technical accomplishments <br\/>in relevant research fields (e.g., cryptology and security, database<br\/>systems, and data mining), there is no comprehensive, end-to-end<br\/>technological infrastructure for handling sensitive data over <br\/>the entire course of their lifetime, nor is there even widespread social<br\/>agreement about the rights and responsibilities of major stakeholders<br\/>in our data-intensive, networked world.<br\/><br\/>This project is a multi-institutional, multi-disciplinary, multi-modal<br\/>project that looks comprehensively at sensitive data in a networked<br\/>world. There are two main academic centers of activity (Yale and<br\/>Stanford), three smaller-scale academic participants (Stevens<br\/>Institute of Technology, NYU, and the University of New Mexico), and<br\/>substantial participation by non-academic partners, including<br\/>technology companies, (IBM, HP, and Microsoft), representatives of<br\/>user communities (Citigroup, NIH, Yale Center for Medical Informatics,<br\/>the Census Bureau, and the Secret Service), and DC-based policy<br\/>organizations (The Center for Democracy and Technology and The<br\/>Electronic Privacy Information Center).<br\/><br\/>A major technical theme of the project is privacy-preserving data<br\/>mining, and, more generally, techniques for meeting the potentially<br\/>conflicting goals of respecting individual rights and allowing law<br\/>enforcement and other legitimate organizations to collect and mine<br\/>massive data sets. Other technical agenda items include (1)<br\/>accessibility and reliability of distributed data (2) operating on<br\/>encrypted databases, (3) remote control of data, (4) repelling hostile<br\/>data, and (5) auditability of data-management systems. Because these<br\/>technical goals are affected by lack of agreement about the meanings<br\/>of basic terms, most notably \"privacy,\" a major goal of the project is<br\/>the development of a conceptual framework for the study of rights,<br\/>responsibilities, and public policies focused on sensitive-data<br\/>handling. This part of the project incorporates the notion of<br\/>\"contextual integrity,\" which considers both the context and the<br\/>content of data sets in assessing sensitivity.<br\/><br\/>Projected outcomes of the project include a next generation of<br\/>technology for handling sensitive information that is qualitatively<br\/>better than the current generation's and an effective conceptual<br\/>framework for policy making and philosophical inquiry into the rights<br\/>and responsibilities of data subjects, data owners, and data users.","title":"Information Technology Research (ITR): Sensitive Information in a Wired World","awardID":"0822269","effectiveDate":"2008-03-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1688","name":"ITR LARGE GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["540234"],"PO":["497499"]},"140017":{"abstract":"This year, the IEEE Communications Theory Workshop will take place on May 11-14 in St. Croix, US Virgin Islands. The continued success of this workshop lies in its informal and highly interactive atmosphere, in contrast to more formal conferences. As before, the workshop will be single track, with five technical sessions, three plenary speakers, two panel discussions, and a hot-topics submitted poster session. The technical sessions consist of invited lectures given by leaders in academia and industry. In addition, there will be hot-topics poster session with an open call for participation. This workshop uniquely combines communications, information theory, and networking. The NSF support for travel to the workshop will be carefully disseminated to women, minorities, or young researchers by the young, successful, up-and-coming organizing committee.","title":"A Proposal to Support Young Scientists and Graduate Students for CTW 2008","awardID":"0813845","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["522873"],"PO":["432103"]},"135408":{"abstract":"Intellectual Merit: <br\/><br\/>The goal of this project, a collaboration between the University of Michigan and Georgia Tech, is stand up a deployed system and associated distributed monitoring and diagnosis algorithms to improve performance, availability, and security of production communication networks. The infrastructure will enable research in two primary settings: network security and network management.<br\/><br\/>The project provides a unique platform for evaluating systems and algorithms for network management and security that rely on cross-domain visibility. The infrastructure and associated research will enable multidisciplinary research between experts in networking, databases, security, and machine learning. It will provide researchers from these domains both (1) access to real-world network management and security problems from operational networks, thus providing a sound basis for new research problems; and (2) a realistic setting under which they can evaluate their results.<br\/><br\/>Broader Impact: <br\/><br\/>The first area of broader impact is in network operations. The infrastructure will be deployed on production networks and will serve as a platform for distributed network monitoring research in both network security and network management. There will be close collaboration with campus network operators at Georgia Tech, the University of Michigan, Southern Crossroads (SOX), and Merit Network. The second area is in education. Students in undergraduate and graduate networking courses at the two universities will be given the ability to run their own monitoring experiments on the infrastructure through a controlled interface. The third area is with regard to NSF goals such as those expressed in Future Internet Design (FIND) and Global Environment for Network Innovations (GENI). The networking community to-date has no infrastructure that facilitates deployment studies of systems and algorithms and the operation of real, production networks. This infrastructure offers a way to bring together different networking and computing communities and explore the hardest management and security problems confronting large-scale networking.","title":"CRI-IAD: Collaborative Research: Enabling Security and Network Management Research for Future Networks","awardID":"0751134","effectiveDate":"2008-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["543138","561756","518447"],"PO":["565327"]},"141733":{"abstract":"We now rely on computer software for everything from pacemakers and telephones to automobiles, airplanes, and spacecraft. Software is often the most expensive and least reliable component in the systems in which it is embedded. The construction and verification of software requires a range of expertise that is typically available only from a team of individuals and shared semantic models. Current technology for software development does not support such collaborative development.<br\/><br\/>This project is performing an exploratory study to design and prototype an open verification platform based on an evidential tool bus (ETB) for the integration of multiple logic-based tools. The Open Verification Platform (OVP) builds on the ETB to support the social construction of verified code for embedded software in cyber-physical systems. Such a platform would be used to synthesize the contributions of multiple sources of expertise in the verification of software, including domain experts, requirements analysts, developers, testers, and verification experts. The OVP design initiates a much-needed dialogue between researchers in cyber-physical systems (CPS) and verification tools to explore the architectural and semantic challenges in building collaborative tools. The project is using the OVP to bootstrap such a dialogue. The vision of the OVP effort is formal software development as a collaborative endeavor between diverse viewpoints and sources of expertise. It integrates formal verification tools within a social networking model so that problems can be solved quickly with the help of the appropriate experts. The broader impact of this proposal is in the design of a continuous social process for developing trustworthy cyber-physical systems, and for the rigorous training of software development teams.<br\/><br\/>As part of this effort, the project is organizing a workshop on Event-based Semantics to be held at CPSWEEK 2008, in St. Louis, Missouri. The shift towards openness, distribution of real time, embedded and critical systems, and the deep integration of software into physical systems, combined with the need for certification, results in a major verification challenge. The proposed workshop sets the stage for a new research area developing event-based models, logics, specification languages, and verification tools to support the design, development, maintenance, monitoring and evolution of cyber-physical systems and other distributed, real-time, embedded systems. The workshop seeks to develop broad agreement on the critical issues facing the modeling and design of distributed real-time systems in order to bridge the gap between the formal models and the urgent CPS engineering challenges.","title":"SGER: Open Verification Platform and Event-based Semantics","awardID":"0823086","effectiveDate":"2008-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T748","name":"NSA - SOFTWARE ROADMAP RSRCH"}}],"PIcoPI":["555363","550115"],"PO":["561889"]},"141602":{"abstract":"IEEE PerCom is a high quality conference and the premier technical forum dedicated to addressing the key challenges in Pervasive computing and aware networking including wireless, mobile, mesh and sensor networks, middleware, pervasive services and applications. This year the number of submissions in response to the CFP has been over 200; only 18 regular papers and 12 short papers have been accepted by the Technical Program Committee for presentation at the conference. The proceedings will be published by IEEE Computer Press. As in the past, selected (extended) papers will be invited for publication in a special issue of the Elsevier's Pervasive and Mobile Computing (PMC) journal.<br\/><br\/>Participation in conferences such as IEEE PerCom is an extremely important part of the graduate school experience, providing the opportunity to interact with peers and more senior researchers, thus having the opportunity to be exposed to leading edge work in the field of pervasive computing and aware networking, systems integration, aware services and applications. The travel support will enable US-based graduate students to attend and present their research results in this important IEEE conference. Since the travel support in most of the NSF awards is quite limited to students (who are authors), this fund will enable the awardees not to divert research funding for travel.","title":"NeTS: IEEE PerCom 2008 Student Travel Support","awardID":"0822548","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["564777"],"PO":["434241"]},"135390":{"abstract":"The video analysis community has long attempted to bridge the gap from low-level feature extraction to semantic understanding and retrieval. One important barrier impeding progress is the lack of infrastructure needed to construct useful semantic concept ontologies, building modules to extract features from the video, interpreting the semantics of what the video contains, and evaluating the tasks against benchmark truth data. To solve this fundamental problem, this project will create a shared community resource around large video collections, extracted features, video segmentation tools, scalable semantic concept lexicons with annotations, ontologies relating the concepts to each other, tools for annotation, learned models and complete software modules for automatically describing the video through concepts, and finally a benchmark set of user queries for video retrieval evaluation.<br\/><br\/>The resource will allow researchers to build their own image\/video classifiers, test new low-level features, expand the concept ontology, and explore higher level search services, etc., without having to redevelop several person year?s worth of infrastructure.<br\/><br\/>Using this tool suite and reference implementation, researchers can quickly customize concept ontologies and classifiers for diverse subdomains.<br\/><br\/>The contribution of the proposed work lies in the development of a large number of critical research resources for digital video analysis and searching. The modular architecture of the proposed resources provides great flexibility in adding new ontologies and testing new analytics components developed by other researchers in different domains. The use of large diverse standardized video datasets and well-defined benchmark procedures ensures a rigorous process to assess scientific progress.<br\/><br\/>The results will facilitate rapid exploration of new ideas and solutions, contributing to advancements of major societal interest, such as next-generation media search and security.<br\/><br\/>URL: http:\/\/www.informedia.cs.cmu.edu\/analyticsLibrary","title":"CRI: CRD: Collaborative Research: Large Analytics Library and Scalable Concept Ontology for Multimedia Research","awardID":"0751078","effectiveDate":"2008-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["563299"],"PO":["565215"]},"143094":{"abstract":"This SGER award supports a study for the investigation and development of theoretic foundations and advanced analysis of real-time, hybrid, and embedded systems. The study is expected to contribute towards the deeper integration of theoretical foundations and advanced analysis at the nexus of these research disciplines. It has four focus areas: fundamental methodology, theoretical verification, schedulability analysis, and stochastic analysis.<br\/><br\/>This study is also expected to contribute to a new Cyber-Physical Systems (CPS) vision being developed in NSF's Computer and Network Systems division. The goal of CPS research is new science and engineering methodologies that integrate the interacting cyber and physical elements of future engineered systems. CPS seeks new design principles and systems technology that can routinely yield high-confidence physical and engineered systems. This study will contribute theoretical foundations for the deep integration of physical and cyber dynamics","title":"SGER: Theoretical Foundations and Advanced Analysis in Real-Time, Hybrid, and Embedded Systems","awardID":"0830011","effectiveDate":"2008-03-29","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["280792"],"PO":["561889"]},"132094":{"abstract":"While the purpose of medical devices is to help save lives, the software that controls them has the potential to cause death or injury to patients and care givers. For this reason, medical device software must be extensively tested to ensure that there are no defects that may cause unexpected behavior. However, typical code-testing techniques can only be applied after a significant portion of the system has already been built. In addition, these methods are very time consuming and require a significant amount of manual effort to infer, based on the test data, whether the system has met its requirements. Early detection of defects can be achieved through the construction of pre-implementation system models; however, this still does not address the problem of manual interpretation of test results. Instrumentation-Based Verification (IBV) is a specification-based testing strategy that is expected to solve the manual interpretation problem by creating an explicit connection between requirements and test results. Whether an implementation model satisfies its requirements can then be automatically deduced since the formal encodings of requirements drove the test generation.<br\/><br\/>This NSF project enables a pilot empirical study to assess the practical utility of IBV in the context of medical-device software, in which researchers work with Food and Drug Administration staff at their software laboratory in OSEL (Office of Science and Engineering Laboratories), to assess the practical utility of IBV for medical-devices. This study will involve the development of a controller model in an industry-standard design tool, for a medical application such as an infusion pump. IBV is implemented for this model in the team?s model-based verification tool, Reactis. The research objective is development of a model-based medical software and system design flow to detect defects early in the design cycle. An empirical aspect of the project focuses on quantifying the overhead of using IBV, in order to understand whether the extra burden IBV imposes compensates for its benefits.","title":"Formal Approaches to Verifying Medical Device Software","awardID":"0734020","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["417615","463480"],"PO":["561889"]},"146097":{"abstract":"0417413<br\/>GA Tech Research Corp - GA Institute of Technology<br\/>Manolios<br\/><br\/>\"CRCD\/EI: Integrating Functional Computer-Aided Reasoning into the Computer Science Curriculum\"<br\/><br\/>This project involves the development of tools, courses, modules, and self-paced online materials that integrate computer-aided reasoning into the Computer Science (CS) curriculum. This project is novel in undergraduate CS education. The use of a state-of-the-art theorem proving technology (ACL2) permits students to get instant, reliable feedback, thereby enabling effective learning and self-paced study. ACL2 is a tool consisting of a functional programming language, a logic, and a theorem-prover, that has been used to prove some of the largest and most complicated theorems ever proved about commercially designed systems. The project involves at least two research challenges: taking a necessarily complex, state-of-the-art, theorem proving system and teaching undergraduates how to be effective users in a portion of a semester, and developing effective courses in other areas, such as hardware design and object oriented programming, that are based on the use of computer-aided reasoning. A sequence of mathematical concepts and mechanical tools, with well-designed graphical user-interfaces, allow students to gradually and seamlessly master ACL2. Integration of computer-aided reasoning into current curricula is accomplished through two courses that make essential use of these tools, thereby giving students a deeper and more complete understanding of the material. The courses cover the following topics: computer organization and design, object-oriented programming using the JVM, theorem proving, and formal methods. One of the undergraduate courses focuses on computer organization and design and the other on the Java Virtual Machine (JVM). In these two courses, computer-aided reasoning is used to give students a deeper understanding of the material. They are required to think about the properties systems and components under consideration should enjoy and how to prove that these properties do in fact hold.","title":"CRCD\/EI: Integrating Functional Computer-Aided Reasoning into the ComputerScience Curriculum","awardID":"0844078","effectiveDate":"2008-03-13","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}}],"PIcoPI":["550467"],"PO":["565227"]},"135384":{"abstract":"This project supports research in Embedded and Reconfigurable Computing Research (E&RC) by providing the research community with a suite of benchmarks that are specific to E&RC. The community resource funded by this award, ERCbench, will permit researchers to estimate and compare performance, power, and resource usage of their work to other existing and proposed solutions. It will permit them to test new architectures, CAD algorithms, and systems software techniques on a variety of real-world applications for intelligent, embedded devices in areas such as bio-medicine, transportation, environmental monitoring, and communications. These applications tend to focus on low-power and high performance such as in emerging technologies in: multimedia cell phones and personal digital assistants, wireless medical devices, wearable computers, intelligent security devices, 3D gaming systems, automotive computers, and education devices. These systems typically require programmability, complex computing capabilities, and very low power operation. They also use hybrid applications, where part of the application is implemented in one or more types of hardware structures (either fixed custom or reprogrammable logic), and part in software.<br\/><br\/>Although there are benchmarks in various embedded systems arenas, this project entails development of much needed benchmarks in Embedded and Reconfigurable Computing that include hardware\/software co-design and reconfigurable computing systems along with associated wrappers, tests, data and other components. The project team will make the benchmark suites available for general use via the project website.","title":"CRI: CRD Benchmark Suite for Embedded and Reconfigurable Computing Research","awardID":"0751049","effectiveDate":"2008-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["377734","377736"],"PO":["564778"]},"137353":{"abstract":"Student Panel at IEEE Virtual Reality 2008 Conference<br\/><br\/>This conference brings together researchers academia and industry focused on research topics related to the Graphics and Visualization subarea of the CPA cluster. A five-member student panel will be supported that allows students to take a more active and integral role in voicing new research directions of interest to the research community. Among the topics to be discussed on the student panel are defining the future of virtual reality research, identifying killer virtual reality applications, and building careers in this research area. This outreach activity helps to broaden the participation of students in this research field.","title":"Student Panel at IEEE Virtual Reality 2008 Conference","awardID":"0802263","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["416130"],"PO":["550859"]},"136275":{"abstract":"This project establishes an REU Site offering undergraduate students to participate <br\/>in research activities associated with the Bio-Grid initiatives conducted at the <br\/>University of Connecticut. The initiatives aim at advancing the application of modern <br\/>computing infrastructure and information technology to research and practice in various <br\/>life-science disciplines. Specific research activities include several inter-disciplinary <br\/>projects led by researchers at the University of Connecticut. This REU Site supports ten <br\/>undergraduate students for an eight-week summer research program in each project year.<br\/><br\/>Student participants have a sufficient background in computing or biological science and <br\/>are interested in both. A series of training seminars by the project staff is designed to <br\/>equip students with preliminary background knowledge. The seminars introduce to students <br\/>concepts about modern grid computing infrastructure and related information technology, <br\/>as well as some ongoing life-science research projects that rely on or benefit from such <br\/>infrastructures. A major component of the program is for students to work with the project <br\/>staff on one research project. Students have the opportunity to participate in the Annual <br\/>International Bio-Grid Workshop. This further broadens their vision by allowing them to <br\/>witness similar research projects conducted worldwide. Intellectual merits of the proposed <br\/>activity are associated with the Bio-Grid initiatives in the investigation of computing <br\/>infrastructure, algorithmic techniques, middleware support and resource management strategies, <br\/>that are generally applicable to research and practice in life sciences. Broader impacts <br\/>resulting from the proposed activity therefore lie in the preparation of software engineers <br\/>to formalize and solve problems emerging from life sciences, as well as life-science <br\/>researchers and professionals to gain a strong background in information processing techniques.","title":"REU Site: BioGrid Initiatives for Interdisciplinary Research and Education","awardID":"0755373","effectiveDate":"2008-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["505745"],"PO":["523800"]},"140060":{"abstract":"This workshop is concerned with planning new research agendas for developing digital tools for the humanities and arts as well as creating sustainable repository infrastructures and organizational mechanisms to curate and grow tool resources as they are created. Both of the organizing institutions are part of an international network of digital humanities centers Called centerNet, with representatives from over 100 centers world wide. The need to develop computational resources for cyberscholarship in the humanities and arts for scholarship in these areas has been widely recognized and their effectiveness proven. Because of the complex data involved and interpretive methods used in humanities research applications are complex and advance computation and digital technologies.","title":"Tools for Data-Driven Scholarship Workshop","awardID":"0814033","effectiveDate":"2008-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["480369"],"PO":["433760"]},"136111":{"abstract":"IIS - 0754537<br\/>Title: REU Site: An REU Site in Computer Science and Engineering<br\/><br\/>PIs: Miguel A Labrador and Rafael Perez<br\/>Institution: University of South Florida<br\/><br\/>The primary goal of this REU site is the systematic increase of the graduation rate of undergraduate students as well as the enrollment numbers in graduate school in Computer Science and Engineering. To accomplish this goal, during a 10-week summer session, this REU site offers participating students with state-of-the-art research projects from a wide variety of disciplines in CS&E, including Computer Networks, Data Bases, Data Mining, AI, Digital Image Processing, Pattern Recognition, Location-based Services, Robotics, Software Verification, Security, Distributed Systems, and VLSI design. The program also includes other academic and social activities that provide students with a well-rounded experience and education. <br\/>Additional and unique components of this REU site are the financial support to bring at least one student from a Latin American country every year, the involvement of graduate students in the organization and mentorship processes of the site, and the financial support to extend the REU experience to a limited number of students through the academic year after their summer REU experience. The program emphasizes the enrollment of minority students belonging to groups with significant national population growth rates coming from 4-year universities as well as community colleges. More information about the site as well as past schedules, activities, publications and projects can be found at http:\/\/www.csee.usf.edu\/REU.","title":"REU Site: An REU Site in Computer Science and Engineering","awardID":"0754537","effectiveDate":"2008-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["473743","473744"],"PO":["562760"]},"138642":{"abstract":"Computer Science (31) This project, jointly funded by the Directorate for Education and Human Resources and by the Directorate for Computer and Information Science and Engineering, supports ten faculty members to attend the International Computing Education Research (ICER) conference in Sydney, Australia, in 2008. This is critical as it is allowing people to attend ICER who are doing computing education research but do not have funding for that research or for travel. In addition to the conference's role in helping to support the growth of the computer science education research community, the conference is providing a dissemination medium for recent awardees from the new NSF CISE Pathways to Revitalized Undergraduate Education (CPATH) program to present the results of their projects.","title":"Providing Access to the Fourth ACM International Computing Education Research Workshop, 2008","awardID":"0808078","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7494","name":"CCLI-Type 1 (Exploratory)"}}],"PIcoPI":["521278"],"PO":["564264"]},"132351":{"abstract":"This research project will investigate the effects social organization, learning technologies, and their interrelationships, have on the geometric reasoning of PreK-3 students. Social organization is operationalized here as the strategic grouping of students into triads to engage in collaborative problem solving. Learning technologies are operationalized here as physical and virtual manipulative types (tangrams, pentominoes, geoboards) together with supporting software designed to facilitate students in accessing their mathematical knowledge. Based on findings from preliminary work in this area, it is proposed that learning technologies allow for fluid exchanges between peers, and transitions between physical and virtual manipulatives, significantly enhancing geometric reasoning. The current project presents a robust research and design framework that combines iterative cycles of field studies in the classroom with development and experimentation in the lab. The goal is to design, develop and prototype a tabletop computer interface that allows for unprecedented exchanges among student peers and transitions between manipulative types. The tabletop interface will serve first as the apparatus that facilitates experimental manipulations, later being used, through iterative refinement, as the learning technology platform by which students gain access to mathematical knowledge. The advancement proposed by the current work is that it places all interaction on the horizontal tabletop. This is critical in that it removes confounding effects of different seating and screen orientations from pilot study findings. Manipulations of geometric artifacts reside along two dimensions of research questions: the effects of social interaction and of learning technology on geometric reasoning. Hence, the proposed studies will allow investigation of different transitions between fully functional and fully operational thinking, functional and qualitative operational thinking, and qualitative and quantitative parametric thinking with the same interaction morphologies.<br\/><br\/>The proposed research has the potential to make significant contributions to the following intellectual domains: 1) child development -understanding children's development of mathematical reasoning in terms of learning trajectories 2) mathematics education - understanding teachers' use of advanced learning technologies and role in classroom instruction, and children's learning of mathematics using advanced learning technologies; 3) learning sciences - refining techniques for the analysis, design, and development of advanced learning technologies in use; 4) human-computer interaction -design of interfaces that aid learning to include gestural interaction, tangible manipulation, and horizontal displays; and 5) psycholinguistics - grounding of concepts developed in other domains in the classroom environment. Results from the research will also have much to say about the participation of girls in the mathematics classroom, a goal being to encourage rich discourse of all students. In addition, developed technologies may have implications for the education of special needs children as instructional interfaces can be modified and reconfigured to meet the diverse needs of this underrepresented group. A significant outcome of collaboration among these disciplines will be cutting-edge research opportunities for doctoral students and groundwork for the establishment of new curricula and, possibly, degree programs.","title":"Collaborative Research: Social Organization, Learning Technologies & Discourse: System Features for Facilitating Mathematical Reasoning in PreK-3 Students","awardID":"0736117","effectiveDate":"2008-03-15","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1707","name":"ADVANCED LEARNING TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[351751],"PO":["565227"]},"143021":{"abstract":"In this proposal, the PI will develop novel efficient and effective network adaptive and dynamic bandwidth allocation strategies, named as triggered strategies, for the advanced wireless networks with multiple-class calls, multiple-channel services and multiple-level quality of service (QoS) degradations. Different calls may have the different priorities for the upgrade and\/or the degradation. The key idea of the proposed strategies is to give some reasonable more chances for the blocked calls in the common sense in order to get at least the minimal bandwidth requirement from one of the neighbor cells. The core theoretic concept here is developing the quasi-reversibility concept of stochastic processes with especially consideration of the wireless and mobility features of the networks. The significant result of the triggered strategies is that the equilibrium distribution of a wireless multimedia network in general can be verified to be a product form of individual cell's equilibrium distribution. The PI also plans to provide a complete theoretical analysis of the complexity for the proposed strategies and to test the actual performance of practical interest for general wireless multimedia networks with and without using of triggered strategies. The PI will compare the results under the triggered adaptive schemes with those possible results without using of the triggered strategies and will make a software package for the triggered strategies. Another idea of this proposal is to find the optimal triggered strategy in terms of the Markov Decision Process.<br\/><br\/>Intellectual merit: The proposed triggered strategies significantly improve almost all current existing bandwidth allocation strategies and importantly produce ways of finding extremely important network's performance measures, which could not be obtained in terms of the current methods in the literature. These measures, for example, may include the proportion of a class u call at cell j can only receive a level v QoS when it comes, the probability that a class u call will gain higher QoS than class v calls, degradation period ratio, degradation ratio, upgrade\/degrade frequency, system degradation probability, call degradation probability and other network important measures. The proposed theoretic results will provide rigorously novel approaches for the analysis of adaptive resource allocation strategies for wireless multimedia networks which are in great demand.<br\/><br\/>Broader impacts: Our research results will be disseminated in leading journals and conferences, and will be incorporated into courses and seminars. Via the training of students, and via collaborations and technical interactions with colleagues, both in the US and abroad, the work will lead to yet further technical progress. There are ongoing collaborations with colleagues in Canada, Japan, and China. This project will lead to the incorporation of various novel technical tools into independent studies, courses, and research seminars, which will be part of the training of many students in the department of electrical engineering and computer science. For example, this project will directly impact the capabilities, interests, and careers of the graduate students who participate in the project. At the University of Toledo, a new Ph.D. program in Computer Science and Engineering is in the final stages of approval and implementation. The success of this project would give the program a very strong boost.","title":"Triggered Strategies in Wireless Networks with Multiple Calls, Multiple Channel Services and Multiple-Level QoS Degradations","awardID":"0829769","effectiveDate":"2008-03-29","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["280792"],"PO":["499399"]},"135420":{"abstract":"The video analysis community has long attempted to bridge the gap from low-level feature extraction to semantic understanding and retrieval. One important barrier impeding progress is the lack of infrastructure needed to construct useful semantic concept ontologies, building modules to extract features from the video, interpreting the semantics of what the video contains, and evaluating the tasks against benchmark truth data. To solve this fundamental problem, this project will create a shared community resource around large video collections, extracted features, video segmentation tools, scalable semantic concept lexicons with annotations, ontologies relating the concepts to each other, tools for annotation, learned models and complete software modules for automatically describing the video through concepts, and finally a benchmark set of user queries for video retrieval evaluation.<br\/><br\/>The resource will allow researchers to build their own image\/video classifiers, test new low-level features, expand the concept ontology, and explore higher level search services, etc., without having to redevelop several person year?s worth of infrastructure.<br\/>Using this tool suite and reference implementation, researchers can quickly customize concept ontologies and classifiers for diverse subdomains.<br\/><br\/>The contribution of the proposed work lies in the development of a large number of critical research resources for digital video analysis and searching. The modular architecture of the proposed resources provides great flexibility in adding new ontologies and testing new analytics components developed by other researchers in different domains. The use of large diverse standardized video datasets and well-defined benchmark procedures ensures a rigorous process to assess scientific progress.<br\/><br\/>The results will facilitate rapid exploration of new ideas and solutions, contributing to advancements of major societal interest, such as next-generation media search and security.<br\/><br\/>URL: http:\/\/www.informedia.cs.cmu.edu\/analyticsLibrary","title":"CRI: CRD: Collaborative Research: Large Analytics Library and Scalable Concept Ontology for Multimedia Research","awardID":"0751185","effectiveDate":"2008-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["533348"],"PO":["565215"]},"138896":{"abstract":"The Association for Computational Linguistics (ACL) is the primary international organization<br\/>in the field of natural language processing. The ACL's annual conference is the major international<br\/>conference in this field. This project is to subsidize travel, conference, and housing expenses of<br\/>students selected to participate in the Association for Computational Linguistics (ACL) Student<br\/>Research Workshop, which is part of the ACL conference on June 15-20, 2008 in Columbus, Ohio.<br\/>The workshop consists of two tracks: full paper presentations and poster presentations. All selected<br\/>work has only student authors. The full paper sessions are composed of paper presentations followed<br\/>by a discussion panel led by respected researchers in the field. The workshop is organized and run by<br\/>students. The workshop provides a valuable opportunity for the next generation of natural language<br\/>processing researchers to enter the computational linguistics community. It allows the best students<br\/>in the field to take their first important step toward becoming professional computational linguists<br\/>by receiving critical feedback on their work from external experts, and by making contacts with<br\/>other students and senior researchers in their field. The students who are involved in running and<br\/>selecting papers for the workshop also gain valuable opportunities for professional growth and interaction<br\/>with the researchers on the organizing committee of the main conference. The workshop contributes<br\/>to the maintenance and development of a skilled and diverse computational linguistics and natural<br\/>language processing workforce, helping to produce a pool of researchers with the scientific and<br\/>engineering knowledge for natural language processing.","title":"Student Research Workshop in Computational Linguistics at the ACL 2008 Conference","awardID":"0809034","effectiveDate":"2008-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["409250"],"PO":["565215"]},"126488":{"abstract":"This project will create a new community information infrastructure resource that consists of datasets of dense, multi-modal sensor records of activity of volunteers who live in an instrumented home environment. Researchers in computer science, engineering, user-interface design, and telemedicine fields are currently developing technologies for the home that exploit new sensing capabilities to create context-aware environments that can proactively deliver information to occupants wherever and whenever it is appropriate, based on the occupants' activities. Context is detected using inference algorithms that process data from sensors distributed throughout the environment, worn on the body, or both. This community resource will include high-quality, synchronized data streams from most of the sensor types currently being used in activity research (object usage, RFID, wearable accelerometers, video, audio, etc.). It will allow researchers to focus on developing and testing in-home techniques for context-detection, without being stalled by the steep requirements of data collection.<br\/><br\/>With the resource to be created in this project, researchers will be able to quickly assess the viability of inference algorithms they propose on datasets that capture realistic home behavior, and compare algorithms across different behaviors of interest and sensor modalities. The datasets created through this work will allow researchers to determine the minimal set of sensors required to reliably detect specific activities, thereby making larger scale testing of prototypes in other homes more practical. Rather than requiring months of work to collect data and run a test of an algorithm on data from a home, researchers will be able to quickly try different approaches using the community resource.<br\/><br\/>This infrastructure will accelerate research on use of information technology to create novel applications in the home, especially those designed to help people stay healthy as they age through medical support and monitoring in the home. The datasets will assist researchers creating context-sensitive user interfaces that are customized to particular individuals and automatically present information at times when it is needed. This work will have application in the fields of user interface design, preventive healthcare, and ubiquitous computing. Researchers studying communication, education, health, work practices, entertainment systems, and energy conservation may all be able to learn how to create easy-to-use and meaningful home technologies from analysis of the datasets this information infrastructure will offer. The freely-available multi-modal datasets of home activity can be used by graduate and undergraduate students interested in developing advanced ubiquitous computing technology for the home.","title":"CRI: CRD Development of Longitudinal Home Activity Datasets as a Shared Resource","awardID":"0708375","effectiveDate":"2008-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[335579],"PO":["550147"]}}