{"52838":{"abstract":"Network protocols lookup state using a number of data structures for functions such as IP lookups (e.g., tries), bridge lookups (e.g., hash tables), and packet filtering (e.g., Pathfinder). Network lookups are a key bottleneck for Internet routers today. As Internet link speeds move to 10 Gbps (OC-192) and 40 Gbps (OC-768), state lookups must complete in tens of nanoseconds. The researcher argues in this proposal that solutions to such next generation lookup problems must span a number of areas from algorithms to computer architecture. The proposal is devoted to investigating such crosscutting issues that arise in the context of next generation network lookups.<br\/> Current lookup technology that uses external DRAM (Dynamic RAM) cannot scale to this speeds; thus<br\/>Terabit lookups will require the use of on-chip or off-chip SRAM (Static RAM). Such memory is limited by either expense or manufacturing process | e.g., on-chip SRAM of 16 Mbits is considered optimistic. In this proposal, the researcher considers the issues involved in dealing with such state lookups at Terabit speeds using limited fast memory while providing provable guarantees.<br\/> An important issue considered in this proposal is SRAM memory utilization: if the lookup chip is to provide guarantees about the amount of state (e.g., number of IP prefixes) it can handle, the resarcher shows that the lookup chip must use a memory allocator which can guarantee a provable memory utilization ratio. However, all conventional memory allocation algorithms (e.g., First Fit, Best Fit, Buddy System) only guarantee poor worst case utilizations: for example, for requests of size 32 standard allocators can only guarantee a utilization ratio of 1\/log2 32 = 20% because of possible fragmention. The proposal introduces new problem-specific memory allocation schemes that can be tuned to provide worst-case memory utilization ratios close to 100%. For example, a chip that does IP lookups using the researcher's new allocation schemes can guarantee to handle almost 5 times the number of prefixes that can be handled by a conventional allocator, and yet can allow insert\/delete times of around 100 microseconds. The researcher's<br\/>schemes use new algorithms; optimal versions of the researcher's schemes also require new SRAM memory designs that allow shifted access in addition to normal word access.<br\/> The research also proposes to investigate other issues including the interaction of memory allocation with pipelining (i.e., dynamically allocating memory to stages), and the introduction of new lookup primitives that can support accounting and Quality of Service. For example, the researcher wishes to investigate a novel paradigm for pipelining a trie based on depth rather than height which appears to have a more bounded use of memory. As a second example,the researcher wishes to investigate the possibility of doing prefix lookups that contain a cost field; such a lookup can be used to update a accumulated cost field per input link. The proposal seeks to investigate these and other issues that arise when designing Terabit lookups, to search for new mechanisms, and implement, evaluate, and fine-tune the researcher's new ideas.","title":"Terabit Lookups","awardID":"0074004","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["438592"],"PO":["234222"]},"41519":{"abstract":"This collaborative research project is carried out by Leonard Pitt at the University of Illinois and H. V. Jagadish at the University of Michigan, drawing on Professor Pitt's experience in computational learning theory, and Professor Jagadish's expertise in databases. The goal of this research is to develop a theoretical framework for investigating data mining problems, and to adapt existing machine learning algorithms and develop new ones within the framework. Typically, the focus of Machine Learning algorithms is on learning a single classifier that works well for most of the (labeled) data, whereas data mining focuses on learning \"heuristic\" rules, typically on unlabeled data, that give insight into the nature of the data. By unifying techniques from the former area with goals of the latter, new clustering algorithms are developed that deal with massive data sets via sampling, yet provide optimality guarantees. The research also provides criteria that data mining practitioners may apply in deciding whether aggregation or sampling is a preferred data reduction technique for the task at hand. Algorithms for new and useful types of data patterns are designed, and algorithms that incorporate the user into the data-mining task are analyzed and developed within the framework.","title":"Collaborative Research: Data Mining: Theory and Algorithms","awardID":"9907483","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["343510"],"PO":["563751"]},"52509":{"abstract":"A workflow is a collection of cooperating, coordinated activities designed to carry out a well-defined complex process, such as trip planning, graduate student registration procedure, or a business process in a large enterprise. A human, a device, or a program might perform an activity in a workflow. Workflow management systems (WfMS) provide a framework for capturing the interaction among the activities in a workflow and are recognized as a new paradigm for integrating disparate systems, including legacy systems. Automated workflow management is becoming increasingly important, as it is one of the enabling technologies for business-to-business e-commerce. Ideally, a WfMS should be able to help the user in analyzing and reasoning about complex business processes. Unfortunately, present-day systems do not provide sufficient support for this activity and the virtual lack of analysis and reasoning facilities in current workflow management systems is considered a serious problem. To tackle this problem, a formal specification model with a well-defined semantics is needed. The objective of this project is to conduct research in workflow management and to develop a robust and expressive model for dynamic workflows (i.e., workflows where tasks and their interrelationships change over time) as well as a technological infrastructure (prototypes) for implementing verifiable workflow management systems. The techniques will be validated in the area of supply chain management in collaboration with industry partners. The research is expected to result in the development and distribution of an open source tool for building and managing dynamic workflows. <br\/>Relevant links:<br\/>http:\/\/xsb.sourceforge.net\/<br\/>http:\/\/www.cs.sunysb.edu\/~lmc\/<br\/>http:\/\/www.cs.sunysb.edu\/~workflow\/","title":"Logic-based Modeling Analysis, and Implementation of Workflow Management Systems","awardID":"0072927","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["560897","518366","477226"],"PO":["563751"]},"42091":{"abstract":"This project is to establish a Digital Music Library (DML) testbed. The testbed will focus on system architectures, content representation and metadata and network services. Although the <br\/>project will address a wide range of multimedia digital libraries issues, it is unique in it's comprehensive approach to musical content and the internet - pressing contemporary issues capturing <br\/>intense public and commercial interest. The project will involve a large team of interdisciplinary researchers at multiple sites. There is as of yet no comparable digital music library to that presented in <br\/>the proposal. As a digital library system, the DML will provide integrated multimedia access to a large corpus of musical material. As a research and educational resource for a large, diverse group of <br\/>communities, the project promises to draw out new uses and user needs and stimulate creative activities in many areas.","title":"DLI-2: Creating the Digital Music Library","awardID":"9909068","effectiveDate":"2000-10-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X709","name":"NATL ENDOWMENT OF HUMANITIES"}}],"PIcoPI":[106595,106596,106597,106598,"167616","314705",106601,"285595",106603,106604,106605],"PO":["433760"]},"56270":{"abstract":"087945<br\/>Kurose, Jame F.<br\/>University of Massachusetts<br\/><br\/>CRCD: Curriculum Development and Infrastructure for an Advanced Systems Laboratory<br\/><br\/>This project involves collaboration between two institutions, the University of Massachusetts and Smith College. The project integrates current research results and cutting-edge practices in systems, specifically in the fields of operating systems, distributed systems, real-time systems, multimedia systems, and networking. The project incorporates educational modules that are research-driven, laboratory-based, hands-on, experiment-oriented, for both undergraduate and graduate students, in computing curricula. The new course and curriculum project modules are part of a pool of laboratory projects that are integrated into existing courses and serve as the foundations for two new courses. In addition to funding for module development, this project supports a multi-site Advanced Systems Laboratory (including 75 networked PCs and a half dozen routers - one server and PC cluster at Smith College and the remaining servers and PCs at University of Massachusetts) to serve approximately 400 students per year. The role of the laboratory is to permit students to use hands-on modules to implement, instrument, and experiment with hardware and software that integrate recent research results in the core areas of networking, distributed systems, operating systems, multimedia and real-time systems. A standard template guides module development that includes guidelines for module format and module resource (e.g., tools) requirements. The PIs are supported in this effort by the University of Massachusetts Video Instructional Program staff who have expertise in video-based education.","title":"CRCD: Curriculum Development and Infrastructure for an Advanced Systems Laboratory","awardID":"0087945","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["499259","152242","564706","443993","553615"],"PO":["551712"]},"42092":{"abstract":"This project will research and develop innovative techniques for indexing handwritten historical manuscripts. Automatic indexing of historical archives to create indexes similar to those at the back of most printed books would potentially make available a whole new set of materials to scholars and students. Conversion of printed materials usually involves Optical Character Recognition (OCR) to convert them to machine-readable form. OCR does not work well on handwritten text. The investigators propose to use a scheme known as Word Spotting in which a document page is segmented into words and lists of words are created. By matching word images against each other multiple instances of the same word are then identified. A user then provides the ASCII equivalent to a representative word image from the lists and links to the original documents are automatically generated. For this approach to succeed, a number of problems need to be solved including new techniques for \"cleaning up\" a document by removing non-meaningful visual artifacts, extending existing algorithms for word segmentation of handwritten documents, and building new algorithms to find similarity between handwritten word images.","title":"DLI-2 Word Spotting: Indexing Handwritten Manuscripts","awardID":"9909073","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X709","name":"NATL ENDOWMENT OF HUMANITIES"}}],"PIcoPI":["406626"],"PO":["433760"]},"56282":{"abstract":"0087977<br\/>Blank, Glenn D.<br\/>Lehigh University<br\/><br\/>CRCD: Development of a Web-based Integrated Learning Environment for Manufacturing Engineering Education<br\/><br\/>This project combines research in inquiry-based learning with emerging concepts in textual content identification and classification to the development of a multimedia learning system. The project applies a multimedia framework to the teaching of introductory and upper-level computer science courses for students with diverse learning styles, gender, and cultural backgrounds. In particular, the project concentrates on one introductory computer science course and two upper-level undergraduate\/introductory graduate level courses, Object-Oriented Software Engineering and Artificial Intelligence with Applications in Textual Data Mining. Applying current research in data mining algorithms and knowledge base creation, a reference-librarian avatar guides learners through course content using a multimedia interface that seamlessly connects learners, networks, knowledge repositories and human instructors.","title":"CRCD: Constructive, Inquiry-Based, Multimedia Learning in Computer Science Education","awardID":"0087977","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}}],"PIcoPI":["322848",144524,"451739"],"PO":["551712"]},"55084":{"abstract":"This project addresses new methods to generate collision-free paths for robots that operate in environments that change over time. Typical applications of this research include robot arms mounted on mobile platforms, arms that operate in factory settings, or any other manipulation systems that operate in environments that are either unknown a priori or may change over time.<br\/>The proposed approach comprises preprocessing and on-line stages. Preprocessing produces a representation of the configuration space that can be easily modified in real-time to account for changes in the environment. A one-dimensional roadmap is constructed for an obstacle-free workspace, and the mapping from workspace cells to<br\/>nodes and arcs in the roadmap is encoded. In the on-line stage, when the environment changes, this mapping is used to make the appropriate modifications to the roadmap, and plans can be generated by searching the modified roadmap. At the heart of the method is the encoding for the mapping from workspace obstacles to configuration space obstacles. To make the proposed approach truly viable, a major component of the proposed research will focus on robustness and complexity issues. These issues will be addressed by using tools from the fields of image processing, information theory, graph theory, computational geometry, and incremental algorithms.","title":"Millirobots for High Fidelity Minimally Invasive Surgery","awardID":"0083472","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["420868"],"PO":["234178"]},"55075":{"abstract":"0083422<br\/>Brown<br\/> Underlying the diversity of life and the complexity of ecology is order that reflects the operation of fundamental physical and biological processes. Scaling relationships are emergent quantitative features of biodiversity. Some of them appear to be universal, occurring in virtually all taxa of organisms and kinds of environments. They are patterns of structure or dynamics that are self-similar or fractal-like over many orders of magnitude. They can be described mathematically by power functions. They allow extrapolation and prediction over a wide range of scales., They offer clues to underlying mechanisms that powerfully constrain biodiversity. This research will use the interplay of mathematical models and empirical measurements to elucidate the physical and biological principles that determine how the life history, abundance, distribution, and species richness of organisms scale with body size, space, and time. The program of research and education activities involves: (1) collaborations among physicists, mathematicians, geologists\/hydrologists, biologists and ecologists, (2) interactions among scientists from seven institutions, (3) cooperation between the University of New Mexico, the Santa Fe Institute, and Los Alamos National Laboratory, and (4) interdisciplinary training for graduate students and postdoctoral fellows.","title":"BIOCOMPLEXITY: Scaling of Biodiversity: Physical and Biological Foundations of Ecological Principles","awardID":"0083422","effectiveDate":"2000-10-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1524","name":"ATMOSPHERIC CHEMISTRY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1182","name":"POP & COMMUNITY ECOL PROG"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1366","name":"BIOCOMPLEXITY"}}],"PIcoPI":["267052","542353","460103"],"PO":["563582"]},"69364":{"abstract":"","title":"KDI: Molecular Information and Computer Modeling in Cardiac Electrophysiology","awardID":"0196184","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":[179576,179577,179578],"PO":["216753"]},"58001":{"abstract":"This project seeks to investigate robotic control and assembly of objects in the millimeter and nanometer range, respectively. Specific topics of research include developing motion control techniques and algorithms for atomic force positioning and force-feedback manipulation systems and for micro and nano-robotic systems that include micro and molecular scale actuators (e.g., motors, pumps, etc.). Various proposed designs for these actuators will also be investigated, and realistic <br\/>physical models will be formulated for such systems, including (i) environments on flat surfaces, and (ii) fluid environments (e.g., micro-fluid-MEMS architectures, and robotic systems that move in fluid environments). As one application, the development of a MEMS scale Babbage machine will be investigated, which is a micro-scale mechanical <br\/>computing machine, with the long term aim of building nano-scale programmable machines. The proposed research is of high risk due to the uncertainty in all the essential properties of the molecules to be manipulated and lack of a complete characterization of the physical properties of the manipulation systems at this micro and molecular scale.","title":"SGER: Micro and Nano-Robotics Motion Control and Self Assembly Algorithms","awardID":"0094604","effectiveDate":"2000-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["550822"],"PO":["179262"]},"46661":{"abstract":"The past decade has seen an increase in the deployment of wireless networks supporting mobile communication and an exponential growth rate in the number of users. The majority of wireless networks function as wireless access networks to provide a means for untethered access to resources that reside primarily in a wired network. Such wireless access networks include analog and digital cellular phone networks, Personal Communication Systems networks, many wireless local area networks, and mobile data services. In general, the novelty of mobility has satisfied users of current wireless access networks, despite the decrease in the quality and scope of service offerings as compared to wireline networks. As ongoing research extends the capabilities of wireless access networks to include multimedia services at higher data rates, an increase in the public's demand for and dependence on mobile services will result. Ultimately, users will demand the same reliable service guarantees, that is characteristic of wireline based telecommunications and data networks. <br\/> The critical importance of providing communication service in the face of failures has been recognized in the public switched telephone network and a great deal of attention has been paid to making these networks survivable and self-healing. However, little emphasis has been placed on understanding or improving the survivability of wireless access networks. The unique aspects of wireless access networks (e.g., user mobility, wireless channel environment, power conservation, etc.) implies that survivability techniques for wired networks have limited applicability. The objective of this project is to develop a comprehensive treatment of survivability for wireless<br\/>access networks.<br\/> The project will have two main thrusts. First is survivable network design and analysis. Techniques for analyzing the survivability of wireless access networks will be developed. This includes identifying metrics that are useful for quantifying mobile network performance during normal and abnormal (failure) operating modes and determining a methodology for estimating the metrics. Given appropriate metrics, wireless access network topology design and capacity allocation algorithms which incorporate survivability strategies will be developed. This includes the cell-site architecture and the topology of the network interconnecting the cells to the fixed infrastructure. Both initial topology design and the problem of modifying an existing topology to improve the survivability will be addressed. Secondly, traffic restoration algorithms will be developed which aim at making the best use of available network resources after a failure. This work will concentrate on the design and analysis of priority based traffic restoration techniques to provide users service continuity while minimizing network congestion. A multi-layer approach involving a coordinated strategy among network layers will be developed. The restoration algorithms will be suitable for automatic invocation by network components, resulting in a self-healing network. Special emphasis will be placed on the analysis of transient network congestion immediately following failures and<br\/>incorporating its effect into the network design and traffic restoration algorithms. An additional focus will be placed on minimizing the effects of wireless access network failures on the attached wired transport and signaling networks. The work will initially address current wireless access networks (i.e., PCS), but will later address evolving wireless access architectures including mobile data services (e.g., CDPD, GPRS) and next generation systems (e.g., wireless ATM).<br\/> The research will be conducted using techniques from optimization, queueing and communication theory. Additionally, due to the complexities involved, simulation combined with the use of empirical data and heuristic algorithms will be used. The significance of this research will be its contributions to the limited base of knowledge of wireless access network survivability. The results of the work should benefit the future design and deployment of survivable wireless access networks.","title":"Collaborative Research: Design and Restoration Techniques for Fault Tolerant Wireless Access Networks","awardID":"9980516","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["531589"],"PO":["565090"]},"57255":{"abstract":"This CISE Information Technology Workforce (ITW) proposal requests funds to analyze, through six unique surveys (i.e. alumni, recent graduates, enrolled, changed to a non-IT program, stopped-or dropped-out), the environmental, educational, and workforce issues faced by over 8,500 adult females and 8,900 minority students. The goal of this research is to obtain an understanding of the backgrounds, motivations, preferences and support systems that adult women and minority IT students express upon entrance and exit from a non-tradional university. This project has the potential to provide valuable insight about how to educate and provide support services to women and underrepresented groups who are interested in pursuing IT careers.","title":"ITW: Assessing an Untapped Supply of Information Technology Workers: Adult Women & Underrepresented Minorities","awardID":"0091574","effectiveDate":"2000-10-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[147305,147306,147307],"PO":["289456"]},"49654":{"abstract":"EIA-0000516<br\/>Wolfson, Ouri<br\/>University of Illinois, Chicago<br\/><br\/>CISE Postdoctoral Associates in Experimental Computer Science: Data<br\/>Replication in Peer to Peer Broadcast Networks<br\/><br\/>A mobile computing problem that has generated a significant amount of<br\/>interest recently is data broadcasting. The problem is how to organize the<br\/>pages in a broadcast from a server to a large client population in the<br\/>dissemination of information. A strongly related problem is how to<br\/>replicate (or cache) the broadcast data in the mobile units that receive<br\/>the broadcast. Our research involves the study of the problems of<br\/>broadcast and replication in a peer-to-peer rather than client-server<br\/>architectures. These architectures are motivated by new types of emerging<br\/>wireless broadcast networks where receiving nodes may be disconnected,<br\/>turned off or out of power, and messages may be corrupted. Further,<br\/>reliable broadcasting by acknowledgment and retransmission may not be<br\/>justified due to increases in communication costs. The postdoctoral<br\/>associate will explore fundamental principles of peer-to-peer broadcast<br\/>replication: when to broadcast, what to broadcast, and the cost functions<br\/>to measure the efficiency of a given replication approach. Various<br\/>broadcast replication algorithms will be compared analytically and<br\/>experimentally and the associate will 1) design and analyze various<br\/>broadcast replication algorithms, and 2) design and conduct experiments to<br\/>compare these algorithms.","title":"CISE Postdoctoral Research Associateships in Experimental Computer Science - Data Replication in Peer to Peer Broadcast Networks","awardID":"0000516","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["557651"],"PO":["564318"]},"69377":{"abstract":"","title":"Worst-Case v.s. Average-Case Complexity and Applications to Secure Cryptography","awardID":"0196197","effectiveDate":"2000-10-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["517847"],"PO":["543507"]},"58058":{"abstract":"This workshop explores opportunities and directions for increased interaction between the geospatial and mainstream information technology (IT) research and development communities. Its goal is to illuminate directions for future research that would enhance the accessibility and usability of geospatial information and explore how geospatial applications can influence IT design and research. Topics include research and development areas and associated development\/implementation issues, including trends in the enabling information technology, the nature and roles of the potential information contributors (information providers and validators), system builders, and users. The workshop report will synthesize the ideas and viewpoints expressed at the workshop, supplemented as necessary by additional material developed by the committee, including findings and recommendations on opportunities for collaboration between the geospatial and information technology disciplines as well as other research, development, and implementation issues, and may make suggestions for appropriate follow-on activities that would examine these issues in more depth. The report will be widely disseminated and available on-line.<br\/>http:\/\/www.cstb.org","title":"Workshop on Intersections Between Geospatial Information and Information Technology","awardID":"0094796","effectiveDate":"2000-10-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X779","name":"NASA-WORKSHOP"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1580","name":"INSTRUMENTATION & FACILITIES"}}],"PIcoPI":["234699"],"PO":["563751"]},"54692":{"abstract":"The PI will investigate the stucture and function of new multiview eyes, that is new imaging devices built out of several conventional cameras. The research is motivated by the variety of eye designs<br\/>in the biological world and obtains inspiration for an ensemble of computational studies that relate how a system sees to what that system does. This, coupled with the geometry and statistics of multiple views, points to new ways of constructing powerful imaging devices which suit particular tasks in robotics, visualization, video processing and augmented reality. First, the \"Argus\" eye will be designed and built, which is a system<br\/>consisting of up to 12 cameras attached to a sphere-like structure and pointing outwards. The video cameras, equipped with a synchronizer will simultaneously record data onto disk. Next new algorithms will be developed and implemented for processing video collected by the new sensor for the purpose of very accurately estimating 3D motion and subsequently shape models of the imaged scene. how to use such models in video editing and manipulation will be shown. In the second stage of the project, new algorithms for \"negative spherical eyes\", i.e. networks of video cameras attached to the walls of a room pointing inwards, will be developed. The main effort will consist of algorithms for recovering descriptions of action, in particular human movement. Specifically, software will be developed for building representations of 3D motion fields, and these structures will be analyzed using geometric and statistical techniques to develop invariant characterizations of action. It is expected that these developments<br\/>will have a strong impact to automatic animation.","title":"Alternative Camera Technology","awardID":"0081365","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["460460"],"PO":["234178"]},"55110":{"abstract":"Surfaces abound in advanced scientific analysis and computing. The basic geometry of virtual environments, the isosurfaces of volume data, and the subdivision surfaces of synthetic environments are some examples. Effective utilization and data management of surfaces requires the ability to query archives of surfaces to look for particular surface shapes and features. Central to this capability is an efficient means to measure the distance between two surfaces. The objective comparison of algorithms that produce surfaces requires a similar precise and quantitative measure of the surfaces with each other or with an ideal. This project will develop a new methodology for computing the distance between two surfaces. It will also develop efficient basic techniques and algorithms that will bring this technology into everyday use in areas of searching databases of surfaces and comparing algorithms on surfaces.","title":"Data Management Tools for Surfaces and Volume Data","awardID":"0083609","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["353596"],"PO":["551992"]},"55132":{"abstract":"Scientific visualization - that is, presenting computed or measured scientific data to human senses - is a vital area of research. Pictures are often the clearest and fastest way to give a scientist an intuitive feeling for an experiment or simulation. Unfortunately, visualization of time-dependent vector fields (such as velocity of a fluid at all points) is currently limited to a few basic techniques that originally came from experimental methods. Every technique is a variation on streaklines and timelines, both built from particle paths. Crude extensions to algorithms developed for steady flows have recently supplemented these. Most notable among these are the computation and display of streamlines, but these are only physically relevant for steady-state fluid flows.<br\/><br\/>This project will place these commonly used techniques within a general geometric and mathematical framework, and advance the notion that no single method is best suited for all flows. Therefore, it will study a more general class of algorithms, and will seek to match a vector field representation to the display of a desired time-dependent feature of the flow (e.g. vortices, eddies, or shocks). To explore this parameter space, the project will develop a suite of interactive vector field visualization tools using both software- and hardware-based techniques. The methods will be tested on prototypical unsteady vector fields, namely linear and quadratic fields in the spatial and temporal variables.","title":"Flowspace: The Space Spanned by Pathlines, Timelines, Streaklines.","awardID":"0083792","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["480998","550080"],"PO":["551992"]},"55275":{"abstract":"Abstract<br\/><br\/>This is a renewal proposal to continue development of first--order system least squares (FOSLS) for numerical solution of partial differential equations (PDEs). It combines theoretical analysis, algorithm design, and software development, driven by several real applications, including aerodynamics, meteorology, elasticity, electromagnetics, particle transport, and porous flow. The goal is to develop accurate discretizations and fast solvers for the governing PDEs. The focus will be on the continued development of the FOSLS methodology, with special attention on developing methods that allow non-smooth problem character and solutions, and on further implementation of the methodology in the software package FOSPACK. Applications will include coupled systems, especially those arising in biological simulation, and porous media flow. Successful progress of this project would enable numerical simulations beyond current capabilities in many important applications of national interest.<br\/><br\/>The central aim of this project is research in the field of computational mathematics. The purpose is to improve our understanding of the mathematics behind numerical computer simulation of complex physical phenomena. Such simulations are key to the study and control of many important processes, including groundwater flow, global change, energy production, biological modeling, and material science. One of the challenges in such simulations is the development of improved computational methods for solving the mathematical equations that arise in these models. The basic aim of this research is dramatic improvement in our ability to model increasingly more complicated and sophisticated processes with much greater accuracy and efficiency. This should pave the way for simulations that can provide scientists, engineers, and policy-makers with much more powerful tools to understand and improve our industry, science, and environment.","title":"First-Order System Least Squares (FOSLS) for Partial Differential Equations","awardID":"0084438","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["562151","562152"],"PO":["562372"]},"48753":{"abstract":"In order to make programming easier, future software development environments will have to raise the level of abstraction at which programmers work, provide them with more and better information about their systems, and handle more of the mundane and mechanical tasks involved in programming. This project is designed to lay the foundations for the next-generation programming tools that will compose such environments. In particular, the project will consider two important tools: one to support design patterns, and another to visualize software behavior. The design patterns tool will let programmers find, create, verify, and edit instances of design patterns in their source code, thus allowing higher-level programming. The software visualizations will enable programmers to quickly define and see visualizations for specific problems that arise in program execution, thus allowing better understanding of the running program.","title":"Next-Generation Programming Tools","awardID":"9988141","effectiveDate":"2000-10-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["448702"],"PO":["551992"]},"47786":{"abstract":"Database query optimizers are large, complex, and error-prone software systems. The goal of this project is to assist researchers and developers in building optimizers that are \"provably correct\". Specifically, this research group is building a framework which accepts specifications of optimizer components and their interactions, and generates optimizers that can be shown to satisfy the property that the plans they construct always return the data specified in a user queries. The group's approach separates the components of the optimizer into those that require correctness proofs (the safety critical components) from those that do not. Languages are under design for formally specifying those components, and tools are under construction that both generate these components according to the specifications, and generate proof obligations enabling their verification with an automated theorem prover. The experimental research is linked to the educational goal of training students in the application of formal methods in building large software systems. The results of this project will provide a sandbox for database researchers in both academia and industry, to introduce new optimizer techniques and products while providing tangible guarantees that they are free of errors. <br\/>{http:\/\/www.cs.brandeis.edu\/~mfc\/cokokola.html}","title":"CAREER: Generating Provably Correct Query Optimizers","awardID":"9984960","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["518052"],"PO":["469867"]},"47797":{"abstract":"Recent developments in hardware have fueled the growth of applications that store and manipulate very large volumes of data. Unfortunately, due to the limitations of physical motion, I\/O devices have not made commensurate advances, resulting in a performance bottleneck. The goal of this project is to develop a broad class of innovative techniques to alleviate the I\/O bottleneck for modern database applications. The project focuses on data-intensive applications that handle multi-dimensional and multimedia data. The research has two major directions. The first is the development of declustering schemes for the efficient execution of range and nearest-neighbor queries over large multi-dimensional datasets under realistic assumptions such as non-constant disk I\/O times, and non-uniform data and query distributions. The second addresses the storage and content-based retrieval of multimedia documents that can be viewed at various levels of quality (e.g., resolution). The goal of this research is to provide integrated techniques for placement, scheduling, migration, and reliability of continuous media data on secondary and tertiary storage. The approach is to design, develop, implement, and test the schemes on real datasets such as sanitized medical records. In this manner the effects of the simplifying assumptions typically made to make analysis tractable can be identified and addressed. The project will result in a collection of new techniques as well a prototype implementation and test results on real applications. These will be made available for public access over the world-wide-web. The expected impact is a 10-50% improvement in performance for a broad class of applications. The education component aims to integrate I\/O related issues for modern systems into the graduate curriculum. This involves the development of new web-based tools and projects that will enable students to understand and experiment with I\/O issues and solutions, and facilitate distance learning.<br\/>http:\/\/www.cs.purdue.edu\/~sunil\/","title":"CAREER: Efficient I\/O for Modern Database Applications","awardID":"9985019","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["470080"],"PO":["469867"]},"56861":{"abstract":"Institution: American Association for the Advancement of Science<br\/>Proposal Number: EIA 0090004<br\/>PI: Shirley M. Malcom<br\/>Title: Bringing Women and Minorities into the IT Workforce: The Role of Non-Traditional Educational Pathways<br\/><br\/>This CISE Information Technology Workforce (ITW) proposal requests funds to study the role that non-traditional educational pathways play in the education of IT professionals, in particular, their role in preparing underrepresented minorities and women for IT careers. The study will consist of four primary tasks. The first task will be the collection of demographic data and statistical information to characterize non-traditional students and educational pathways. The second task will be the collection of detailed information on the education and careers of non-traditional students in the Virginia-Maryland-D.C. region through surveys of former students and interviews with educators, employers, and employees. The third task will be data analysis. The final task will be a science policy conference to develop a policy agenda for federal and state governments based on the results of the first three tasks. This project has the potential to provide valuable insights into the education of underrepresentation of women and minorities for IT careers.","title":"ITW: Bringing Women and Minorities into the IT Workforce: The Role of Non-Traditional Educational Pathways","awardID":"0090004","effectiveDate":"2000-10-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["390118","467010"],"PO":["289456"]},"46950":{"abstract":"This project will attempt to organize the topical matter of an academic discipline in a comprehensive and innovative way by creating a dynamic reference work of exceptionally large scope using information technologies. The goals of the project are: - to design and implement a customized work-flow system through which academic philosophers can collaboratively write, maintain, track and summarize the new ideas being published in print and electronic media- to produce a comprehensive reference work useful not only to scholars, but to the general public as well- to develop XML standards for the materials of philosophy applicable to other topical areas research funds from the Digital Libraries Initiative would be part of a larger base of support for the project and targeted toward advances in work-flow system development and building user interface tools that can fully exploit the features of a dynamic reference work. Examples of these include evolving concept maps, dynamic cross-referencing based on user needs, etc. The methods used to achieve this can serve as an example for other disciplines in the humanities and sciences.","title":"The Stanford Encyclopedia of Philosophy","awardID":"9981549","effectiveDate":"2000-10-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X709","name":"NATL ENDOWMENT OF HUMANITIES"}}],"PIcoPI":[120188],"PO":["433760"]},"47369":{"abstract":"EIA-9983289<br\/>Nusser, Sarah M<br\/>Iowa State University<br\/><br\/>Digital Government: Collecting and Using Geospatial Data in the Field: An Extensible Framework and Testbed<br\/><br\/>This work will conceive, develop, and test an extensible framework to support the collection and use of geospatial data in the field. Partner Federal agencies include the Bureau of the Census, the US Geological Survey, and several agencies of the US Department of Agriculture.<br\/><br\/>The proposed activities are designed to meet five key objectives:<br\/>1. Develop a model documenting and formalizing the infrastructure, tools, and key capabilities required to support a flexible and extensible field data collection system.<br\/>2. Conduct research on computer science tools and associated information technologies required to fully integrate digital geospatial data into the collection process.<br\/>3. Conduct research on infrastructure components that are needed to implement the system in a manner that limits the complexity of the system from the vantagepoint of the user in the field.<br\/>4. Investigate emerging field data collection technologies to determine how the usage of geospatial data is transformed by these new interfaces.<br\/>5. Explore the framework model and research developments in an application environment by developing prototype components and testbeds that correspond to agency data collection settings.<br\/><br\/>Six developments will be needed to address the research objectives:<br\/>1. a user-driven framework model,<br\/>2. a conceptual framework for conflation of heterogeneous geospatial data for field use,<br\/>3. a multi-agent system to support tools required to use and collect geospatial data in the field,<br\/>4. interoperable searching and discovery mechanism for prepared, existing, and potentially unknown sources of data,<br\/>5. object-oriented warehouse designs for the field data collection environment, and<br\/>6. evaluations of emerging field technologies and their impact on user activities.","title":"Digital Government: Collecting and Using Geospatial Data in the Field: An Extensible Framework and Testbed","awardID":"9983289","effectiveDate":"2000-10-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W076","name":"BUR OF CENSUS-DIGITAL GOV PROJ"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W111","name":"AGRICULTURE-DIGITAL GOV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W174","name":"AGRICULTURE-DIGITAL GOV PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W443","name":"BUR OF CENSUS-DITAL GOVT PROJ"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W448","name":"AGRIC-FRAMEWORK FOR THE DISSEM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W450","name":"AGIRC-DIGITAL GOVT PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X667","name":"BUR OF CENSUS-DIGITAL GOVT PRO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X763","name":"INTERIOR-DIGITAL GOVT PROPOSAL"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1580","name":"INSTRUMENTATION & FACILITIES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["376529",121252,"376530"],"PO":["371077"]},"51571":{"abstract":"Future networked multimedia information systems will carry a wide variety of applications including digital libraries, video, audio and image services, distance learning and collaboration, networked virtual environments, and entertainment. The main characteristics of multimedia applications that lead to difficulties in end-to-end systems design are that they have very large bandwidth and storage requirements, with vastly different performance and reliability requirements, often coupled with real-time constraints. Along with these characteristics, the highly interreliability requirements, often coupled with real-time constraints. Along with these characteristics, the highly interactive nature of a variety of multimedia applications, resulting in fairly unpredictable workloads, makes the design and evaluation of networked multimedia information systems an exceptionally challenging problem. <br\/> In this proposal, we outline research on three aspects of this problem: (1) the design and evaluation of server resource allocation algorithms for CM servers in order to retrieve information efficiently and according to the QoS demanded by the application; (2) the development of performance evaluation techniques for evaluating new server designs. (3) the participants of this project bring expertise from a wide variety of areas: databases, distance learning, multi-media, networking, and performance evaluation to bear on problems in these areas. <br\/> Another important feature of this proposal is that the participants have available four prototypes of state of the art multimedia systems: the Virtual World Data Server (VWDS) developed at UCLA: the prototype of a Video-on-Demand server developed in Brazil as part cooperative research project among Brazilian institutions; and the Multimedia Asynchronous Networked Individualized Courseware (MANIC) and the Internet Multimedia Proxy (IMP) both developed at UMass. <br\/> These applications will be used to motivate the development of new algorithms for retrieving information and for maintaining the desired quality of service after sending the data over a wide area network. They will also form the basis of the many experimental and analytical studies that will be performed to evaluate these new algorithms. To aid in this evaluation, our group also developed three performance evaluation and modeling tools: a state-of-the-art tool for constructing performance and reliability models (Tangram-II) developed in Brazil jointly with UCLA; a symbolic model checking tool (VERUS): and a tool which facilitates design, development, and subsequent performance evaluation of designs of multimedia storage hierarchies (ViPEr-HiSS) under development at UMD. <br\/> Thus, the environment of our labs as well the long distance among them will provide a unique testbed for this type of an evaluation due to the drastically different connectivities available to our applications, from gigabit low utilized links to intercontinental congested links. <br\/>The proposed research represents a fundamentally important step in the design and performance evaluation of next generation information servers and the networked applications that will operate on top of them. As a result of our research we expect to have a better understanding of how storage server resource management policies, channel allocation policies, and network adaptation policies interact to satisfy the required QoS of CM applications, despite the fairly unpredictable network delays.","title":"Collaborative Research (NSF-CNPq): Application Level Adaptation and Control for Retrieval and Delivery of Continuous Media over the Internet","awardID":"0070246","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["142856"],"PO":["565090"]},"55982":{"abstract":"EIA-0086977<br\/>Jennifer Preece<br\/>University of Maryland-Baltimore County<br\/><br\/>Special Projects: Student Fellow Support for the ACM Conference on Universal Usability<br\/><br\/>On November 16 and 17, 2000 the ACM Conference on Universal Usability is being held in Washington, D.C. The conference seeks to promote research that will enable the widest possible range of users to benefit from information technologies. These user groups include ethnic minorities, women, and those who are physically, intellectually, educationally or financially challenged. The aim of this research is to enable them to participate in communication, online education, online health care, e-commerce and government services via the Internet. The goal of this project is to support and train students from these designated groups (and others who have strong skills and experience in assisting individuals from these groups) about potential research opportunities in universal usability by involving them in the conference, its planning and the dissemination of ideas and initiatives arising from the conference. The grant will provide partial support for ten graduate students and ten seniors and juniors to work with the conference committee, participate in planning, attend the conference, disseminate research ideas and develop a web site.","title":"Education Innovation: Student Fellow Support for the ACM Conference on Universal Usability,","awardID":"0086977","effectiveDate":"2000-10-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["527291"],"PO":["551712"]},"57401":{"abstract":"Title --- CAREER: A Statistical Approach to Estimating 3D Manifolds From Range <br\/>Data<br\/><br\/>PI --- Ross T. Whitaker<br\/><br\/>Institution --- University of Utah<br\/><br\/><br\/>This project addresses the question of how to automatically generate 3D <br\/>computer models of objects and scenes using data from a range finding <br\/>device, such as a laser range scanner, sonar, ultrasound, or radar. Such <br\/>3D computer models are important in a wide range of applications including <br\/>defense surveillance, forensics, teaching, and medicine. Range measuring <br\/>devices typically sweep a beam of energy to gather many millions of 3D <br\/>measurements from surfaces of objects but they have some limitations. <br\/>First, because not all object are visible from a single point of view, a <br\/>single sweep is incomplete. Second, each individual range measurement is <br\/>not necessarily accurate because the measurement process is inherently <br\/>noisy. The strategy is to systematically fuse together many measurements <br\/>from different points of view in order to create accurate, complete 3D <br\/>models. This project examines some of the fundamental mathematical <br\/>questions pertaining to this process and then studies how to implement and <br\/>demonstrate this theory on real data.<br\/><br\/>Range-finding devices measure distances to objects by reflecting energy off <br\/>of the interfaces between different types of materials, but they provide a <br\/>noisy, mathematically complex, and highly nonlinear transformation from a <br\/>collection of surfaces to a set 2D depth maps. This project will develop <br\/>statistical methods for estimating manifolds from this kind of data, <br\/>thereby generalizing the current state of the art in estimation theory, <br\/>which is primarily concerned with estimating functions or fields. Thus, <br\/>the goal is to provide a general, complete, and practical foundation for 3D <br\/>surface reconstruction. The strategy is to find the surface that maximizes <br\/>the posterior probability conditional on a collection of range measurements <br\/>taken from different points of view. The reconstruction framework is <br\/>Bayesian; it includes a sensor model as well as prior knowledge about the <br\/>characteristics of the object or scenes being modeled. This work will <br\/>address a number of important issues pertaining to this statistical <br\/>methodology for building 3D models, including better sensor models, <br\/>high-order priors, fast and robust algorithms, and broader applications. <br\/>These developments will comprise a fundamental scientific result: the <br\/>generalization of the basic principles of estimation theory to the <br\/>challenging and timely problem of 3D surface reconstruction.","title":"CAREER: A Statistical Framework For Reconstructing 3D Manifolds From Range Data","awardID":"0092065","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["515717"],"PO":["564898"]},"56323":{"abstract":"0088078<br\/>Astrachan, Owen L.<br\/>Duke University<br\/><br\/>CRCD: Modules and Courses for Ubiquitous and Mobile Computing<br\/><br\/>This project educates students in the techniques and technologies required to deploy next generation wireless information systems. Courses developed for this project focus on ubiquitous and wireless computing. And, these same technologies are used in classrooms to deliver the curriculum as a part of the project that supports \"active learning.\" The areas of research chosen for migration into the curriculum include mobile code (placement and migration of code to adapt to rapidly changing clients, networks, and service characteristics), transcoding (transforming multimedia web content to save bandwidth and thus energy consumption at the destination device), active name architectures (where resource names are decoupled from specific hosts when resolving services), and energy aware operating systems (where the goal is to make basic interactions of hardware and software as energy efficient as possible for local computation). The project migrates research topics into advanced undergraduate courses and graduate courses, developing modules, assignments, software and curricular support that engage and educate students in the technologies of mobile and wireless information systems. The materials developed are integrated into five computer science courses. The courses apply active lectures, a form of active learning, to deliver content.","title":"CRCD: Modules and Courses for Ubiquitous and Mobile Computing","awardID":"0088078","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["353750","531300","485593"],"PO":["551712"]},"57028":{"abstract":"Abstract<br\/><br\/>0090667<br\/>Donald P. Butler and Zeynep Celik-Butler<br\/>Southern Methodist University<br\/>Small Grants for Exploratory Research (SGER): <br\/> $70,000 - 12 mos.<br\/><br\/>Sensors on Flexible Substrates for Smart Skin<br\/><br\/><br\/>This is a one-year Small Grant for Exploratory Research (SGER). This project concerns the development of suspended, micromachined sensors on flexible substrates. The project's results will form a basis for the production of other micromachined sensors such as pressure\/strain sensors, \"hair-like\" touch and flow sensors, and accelerometers on flexible substrates. Flexible substrates can serve as the basis of a sensitive skin for humans and robots where sensors are distributed over the skin to provide the sense of touch or monitor the physiology of the wearer. A major obstacle in the development of vanadium oxide bolometers or lead titanate and similar oxide pyroelectric detectors on flexible substrates is the incompatibility between the thermal budget required by the detector material and the low maximum temperature of the flexible substrate. This work will solve the incompatibility between the two thermal budgets by the use of the PI's patented microbolometer material: semiconducting Yttrium Barium Copper Oxide (YBaCuO). The deposition temperature for this infrared sensitive material does not exceed 150 C. High quality nanocrystalline, semiconducting YBaCuO films can be deposited using rf sputtering at ambient temperature. Since there is no requirement for crystallization, high-temperature annealing steps are not necessary. <br\/><br\/>The funding for the project is provided by two NSF divisions, as follows:<br\/> IIS\/CISE - $50,000<br\/> ECS\/ENG - $20,000","title":"SGER-Sensors on Flexible Substrates for Smart Skin","awardID":"0090667","effectiveDate":"2000-10-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":["513341","513340"],"PO":["234178"]},"54850":{"abstract":"Today there exist three environments in which to perform network research: live networks, network<br\/>simulators, and static small-scale testbeds. Although each environment has benefits, each also has many<br\/>limitations. This project proposes to build a new type of experimental environment, an \"Internet in a room,\" which will not only complement the strengths and weaknesses of existing experimental environments, but work synergistically with some of them, such as simulation.<br\/> The proposed instrument, a large-scale network emulation facility, will be a unique resource for network<br\/>experimenters. The researchers are currently building a prototype, based on donated equipment and University of Utah funds. Under this proposalthe researchers will continue this early work, make the testbed \"real\" through developing significant software and deploying additional hardware, work closely with others to integrate it with network simulators, and provide professional staffing so that the facility is of maximum use to external researchers. A crucial goal is to make the facility universally available to any external researcher, without administrative or technical obstacles to simple and straightforward use.<br\/> Single-node systems research and development has flourished as the barriers to entry have plummeted.<br\/>Inexpensive, commodity, open, hardware (x86 PC) and software (Linux, *BSD), have made such R&D<br\/>possible for all researchers, without large budgets. We propose to develop the software for an instrument<br\/>that will bring similar benefits to network researchers, and apply it to a first instance of hardware.<br\/> A significant aspect of this proposal is joint work with other researchers domain experts, especially net-work simulation experts at Georgia Tech to exploit the facility's unique capabilities for network emulation, to learn how best to use it, and to guide its evolution.<br\/> The emulation facility's unique characteristics include:<br\/> (1) significant scale: 250 nodes, each of degree at least four.<br\/> (2) user-configurable lowest-level control over the testbed's \"physical\" characteristics, such as error models, latency, bandwidth, packet ordering, processing power, and buffer space.<br\/> (3) accurate emulation of wide-area networks via internal traffic-shaping nodes;<br\/> (4) capture of low-level device\/OS costs such as interrupt load and memory bandwidth;<br\/> (5) experimentation on the router software itself, as well as ease of maintainence and robust security, is<br\/>provided by fully user-replaceable router OS\/software;<br\/> (6) \"ns\" compatible specification language and integration with the Georgia Tech \"software backplane<br\/>for emulation,\" allowing experiments easily to move between simulation and emulation;<br\/> (7) remote configurability and availability to researchers world-wide, both time and space-shared;<br\/> (8) isolated control, monitoring, and data acquisition network; remote power control and serial line console \/debugging for all nodes;<br\/> (9) incorporation as an integral part of the national Active Network Backbone (ABONE).","title":"A Large-Scale, Highly Configurable Network Emulation Facility","awardID":"0082493","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["344532"],"PO":["564246"]},"50384":{"abstract":"The objective of this research is to investigate the use of virtual environments as a medium for the study of human behavior in dynamic environments. The project has two thrusts: a computational component directed at advancing scenario modeling techniques to meet the needs of experiments for replicable experiences that adapt to subject behavior, and an experimental component that investigates children's bicycle riding behavior in a virtual bicycling simulator. Virtual environments present an exciting new medium for the study of human behavior that combines the rigor of controlled laboratory experiments with the ecological validity of natural experiments. They immerse subjects in worlds that appear physically real, but where conditions can be controlled. In addition, they can realistically simulate dangerous circumstances without risking injury to subjects. To exploit the potential of virtual environments as laboratories for studying human behavior, significant advances must be made in techniques for controlling the dynamics of virtual environments populated with vehicles, pedestrians, bicyclists, and traffic lights. In experiments, the right things must happen at the right time and place. Furthermore, the activity should maintain an appearance of spontaneity; subjects should feel that they have freedom of action and that other objects are behaving normally. The research will investigate on-line direction as a means to adaptively coordinate the behaviors of simulated objects during experiments. Psychological studies will serve as a proving ground to test and harden scenario control methodologies. Experiments conducted in virtual environments will be compared to experiments conducted in real environments to validate the use of simulators as laboratories for the study of human behavior. This work integrates research on high-fidelity simulation, control of complex behaviors, human factors, and developmental psychology. The research will advance virtual environment technology, experimental methods, and simulator validation, and increase our understanding of a leading cause of childhood injuries.","title":"Virtual Environmentents as Laboratories for Studying Human Behavior: Modeling, Testing, and Validation","awardID":"0002535","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["543444","543446","543447"],"PO":["565227"]},"56852":{"abstract":"This CISE Information Technology Workforce (ITW) proposal requests funds to determine if an early intervention program promotes students' interest in pursuing a career in IT. More specifically, this project will focus on the factors affecting students' decisions to enter the IT workforce in Mississippi's agricultural industry. The target population will be students, especially underrepresented groups and females, enrolled in a new curriculum in Agriculture and Environmental Science and Technology (AEST). The schools using the AEST curriculum are primarily small, rural, comprehensive high schools and have an average of 45% minority student population. AEST program schools will be matched with non-AEST schools with similar demographics. This project has the potential to provide valuable insight about the impact of a culturally relevant intervention program on the interest of women and underrepresented groups in pursuing IT careers.","title":"ITW: Changing Perceptions: Agriculture, Education, and Information Technology in Mississippi","awardID":"0089970","effectiveDate":"2000-10-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[146286,146287,146288],"PO":["564181"]},"41496":{"abstract":"This interdisciplinary research is carried out in a collaboration between Professors Phokion Kolaitis at the University of California, Santa Cruz and Moshe Vardi at Rice University. Constraint satisfaction and conjunctive query evaluation are two fundamental and ubiquitous problems in artificial intelligence and database systems, respectively. Since these problems are known to be computationally intractable in the worst case, researchers in artificial intelligence and database systems have sought to discover tractable cases of constraint satisfaction and conjunctive query evaluation, as well as to design heuristic algorithms for solving these problems. Thus far, however, these studies have been largely carried out in parallel and with relatively little or no interaction between the two areas. Recent research work has established that there are strong and exact connections between constraint satisfaction and conjunctive query evaluation. The main goal of this project is to further explore the connections between constraint satisfaction and conjunctive query evaluation, and to examine the applicability of techniques developed for each of these problems to the other problem. To this effect, a novel game-theoretic framework is being developed to unify seemingly unrelated results, identify additional tractable cases of these two problems, and design heuristics for the general case. Moreover, algorithms and heuristics developed by the artificial intelligence community are being evaluated in regards to their efficacy in conjunctive query evaluation, and vice versa. Results obtained in the course of this project will enhance the interaction between artificial intelligence and database systems, and will advance knowledge transfer between these two areas.","title":"Collaborative Research: Constraint Satisfaction, Database Query Evaluation, and Information Integration","awardID":"9907419","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["518005"],"PO":["469867"]},"47821":{"abstract":"The research goal of this project is to develop more effective techniques for visualizing information that will facilitate and enhance information-processing tasks. In particular, the project develops four novel techniques, for: (1) constructing better graph visualizations, (2) detecting clusters in a database using visualization, (3) constructing visualizations faster using previsualizations, and (4) compressing 3D models. The graph visualization technique uses a novel graph-decomposition-based approach to construct more effective graph visualizations, which can help the user to more easily understand the information represented in a graph. The cluster detection technique allows the user to visually detect clusters in a database by visualizing its contents, and can be a useful aid in datamining applications. The previsualization-based technique can significantly reduce the average time needed to construct visualizations in interactive applications, where visualizations are repeatedly constructed, by storing precomputed and previously computed visualizations in a previsualization cache, and checking the cache first before constructing a new visualization from the scratch. This technique can help in developing visualizations systems with better response times. The technique for compressing 3D models uses the concept of canonical ordering to efficiently compress 3D polygonal models, and reduce their space requirements and transmission times over a network. The educational goals of this project consist of teaching a course on information visualization, developing the corresponding course-material, advising graduate students, mentoring undergraduate students and initiating them to research in information visualization. The results of this project will benefit researchers and users in the areas of datamining, computer graphics and interactive visualization, and in applications such as software engineering, where information can be represented using graphs.","title":"CAREER: Information Visualization Research and Education","awardID":"9985136","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["154576"],"PO":["563751"]},"51099":{"abstract":"This project seeks to investigate control systems for a human-machine shared locomotion platform to assist the human in pedestrian mobility. <br\/>The project is specifically motivated by the need of the elderly. The elderly are often restricted in their mobility and must rely on canes, walkers, and ultimately, wheelchairs for indoor mobility. Restrictions in mobility lead to a loss of independence for the elderly, often resulting in nursing home admission. This research will develop a control system for a semi-autonomous, wheeled \"walker\" (c.f. a lightweight frame used in the aid of walking) in which the user provides the locomotive force and the user and the walker collaborate on the steering. Specific investigation includes developing shared control techniques that assists the ambulatory elderly in guidance in known environments, providing basic safety measures in known and unknown environments (i.e. curb detection and automatic braking), implementing a hardware prototype and empirically testing the performance of the system using a variety of discrete situations developed in concert with geriatrics professionals.The essence of this research is to explore new control techniques appropriate for shared control with elderly operators.","title":"SGER: A Mobile Platform for Shared Locomotion Control for the Elderly (Exploratory Research)","awardID":"0004247","effectiveDate":"2000-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["178018","261954"],"PO":["179262"]},"43135":{"abstract":"This collaborative project combines the expertise and experience of Professors Bruce Croft and James Allan at the University of Massachusetts in the development and testing of information retrieval models and systems, with that of Professor Nicholas Belkin at Rutgers University in user modeling and user studies in interactive systems. Tools to support information retrieval and filtering have become common, but in many important respects their performance is mediocre. They make mistakes that are obvious and aggravating to users, and relevant documents are usually mixed with many others that are totally unrelated. These problems significantly lower the productivity and effectiveness of people using the tools, whether in education, science, business, or government. This project investigates a new approach to user and topic modeling that has the potential to significantly improve the effectiveness of information access and filtering. This approach is based on recent research on language models for information retrieval. Language models appear to capture the important aspects of user and domain modeling that have been observed in earlier experiments, and retrieval techniques based on document language models have been shown to be very effective. This project combines standard research methodology using TREC data, experimental and observational user studies in laboratory settings, and studies of the impact in operational environments with many users. It will significantly advance understanding of the impact of user- and topic-models on the important problems of information indexing, retrieval, and access.","title":"Collaborative Research: Supporting Effective Access Through User-and Topic-Based Language Models","awardID":"9911942","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[109205],"PO":["563751"]},"55136":{"abstract":"Many uses of computer visualization rely on displaying surfaces so that a person can easily understand the relationships between the different parts of the visualized object. This project will study new methods to identify the visible parts of an object, and will use this information to produce better images (that is, more accurate and complete images) of scientific data. Some possible applications of this work are medical visualization (e.g. showing the chambers of the heart), studying fracture mechanics (e.g. identifying interior cracks), and computational fluid dynamics (e.g. finding and studying vortices in turbulent flow).<br\/><br\/>Technically, the project has two sub-goals. First, it will automatically identify interior structures of a complex surface, that is, those regions that are not visible from locations outside the object. Currently, this is done manually or by connected component analysis, both of which have limitations. This project will explore both analytical and sampling approaches to quickly computing a visibility function for all surface points. Secondly, the project will automatically produce a group of viewpoints and associated images (an image coverage) that collectively show every visible portion of a given surface. This can be used to both save the user from the error-prone task of manually rotating the object to see all visible portions, and may aid in creating simplified models for rapid navigation and display. This project will explore several approaches, including sampling-based ones, to this previously unsolved problem.","title":"Surface Visibility for Large Model Visualization","awardID":"0083836","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["456660"],"PO":["562362"]},"49702":{"abstract":"The Cuneiform Digital Library Initiative proposes to develop tools and techniques leading to the systematic digital documentation and new electronic publication of cuneiform sources. Despite the 150 years that have passed since first decipherment of cuneiform many basic research tools remain to be developed that will allow this material to be studied in depth by specialists and generally made available to the public. This project, conducted in close collaboration with a number of organizations (including the Max Planck Institute for the History of Science and the California Digital Library) will:<br\/>Create virtual archives of widely dispersed early cuneiform tablets<br\/>Implement an integrative platform of data presentation combining raster, vector and 3D imaging with text translation and markup <br\/>Establish for collaborating museums a lasting archive procedure for fragile and often decaying collection of cuneiform records<br\/>The project's dataset will be built using platform-independent text encoding and markup conventions and linked to accurate, high-resolution images. Typologies and extensive glossaries of technical terms will be included, later supplemented by linguistic tools for accessing the primary sources by non-specialists.","title":"Cuneiform Digital Library Initiative","awardID":"0000629","effectiveDate":"2000-10-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X709","name":"NATL ENDOWMENT OF HUMANITIES"}}],"PIcoPI":[127057],"PO":["433760"]},"48987":{"abstract":"As digital repositories of information are springing up everywhere and interconnectivity between computers around the world is being established, the construction and maintenance of data warehouses (views) over such distributed data sources has been recognized to be of great importance for modern applications. However, data sources continuously evolve by modifying not only their content but also their query capabilities and schema and by joining or leaving the environment. This research addresses this critical and timely problem of how to rewrite view definitions synchronously with the schema changes of data sources, coined the \"view synchronization\" problem. The Evolvable View Environment (EVE) solution is based on a preference model for view evolution and a meta model for capturing data source interrelationships. Algorithms that exploit different types of metadata and view evolution preferences to synchronize views are designed. Measures for ranking alternative view rewritings based on their quality are established. To assure survivability in any dynamic environment, a strategy for coordinating view synchronization under schema changes and the more traditional view maintenance under data changes is incorporated. Implementation of the EVE software system serves as a proof of concept and as an experimental test bed. Experimental evaluations are conducted to assess performance, applicability, and quality of the rewritings. A case study on applying the technology to Web and E-commerce applications helps to determine the applicability as well as the limitation of the technology. In summary, this project will advance not only the state-of-the-art in data warehousing, a core area of database technology, but the benefits are potentially far-reaching by providing techniques and software tools for simplifying access to large sets of dynamic distributed data sources.<br\/>http:\/\/davis.wpi.edu\/dsrg\/EVE","title":"Data Warehouse Maintenance over Dynamic Distributed Information Sources","awardID":"9988776","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["543520"],"PO":["469867"]},"57336":{"abstract":"The goal of this research project is to investigate human motor skills and their representation in a spatio-temporal database management system. The challenges involved are multi-faceted. First, the captured data is continuous media and must be rendered in a timely manner in order to simulate a movement. If a system delivers the data at a slower rate than its pre-specified rate without special precautions (e.g., prefetching), the user might observe logical errors that result in undesirable behavior, e.g., with chop-sticks, either one or both sticks might fall out of place. Second, the movement of a limb -- say a hand -- when performing the same activity is slightly different across multiple repetitions of that activity. The approach to the first challenge is to explore design and implementation of real-time spatio-temporal database management systems that represent an activity as a multi-level presentation. The approach to the second problem is to investigate \"Envelope of Limits\" (EoL) to capture the essence of a movement. In addition, this research strives to develop a framework that detects spatio-temporal patterns that represent hypotheses about the physical constraints that govern movements. The results of this project will advance real-time spatio-temporal databases in support of haptic devices. This is a high-risk research, because it spans multiple fields, with a potential to emerge as a new discipline. If successful, a high payoff can be expected, as the results will have an impact on applications in broad areas such as health-care, education, and entertainment.","title":"SGER: Real-Time Spatio-Temporal Databases in Support of Human Motor Skills","awardID":"0091843","effectiveDate":"2000-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["214815"],"PO":["563751"]},"69239":{"abstract":"","title":"CAREER: Testing of Integrated Passive Components and Interconnects in MCM Substrates","awardID":"0196058","effectiveDate":"2000-10-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4730","name":"PROTOTYPING TOOLS & METH PROGR"}}],"PIcoPI":["335395"],"PO":["562984"]},"60142":{"abstract":"Proposal Processing and Data Entry Support for the Faculty Career Development (CAREER) Program","title":"Proposal Processing and Data Entry Support for the Faculty Early Career Development (CAREER) Program","awardID":"0101103","effectiveDate":"2000-10-13","expirationDate":"2001-02-13","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["169508"],"PO":["565227"]},"54851":{"abstract":"Multihop wireless capabilities are enabling communication and coordination among autonomous nodes in unplanned environments and configurations. At the same time wireless channels present challenges of dynamic operating conditions, power constraints for autonomously-powered nodes, and complicated interactions between high level behavior and lower level channel characteristics (e.g. increased synchronized communication significantly degrades channel characteristics).<br\/> The major goal of the research proposed here is the development, testing, and characterization of algorithms for scalable, application-driven, wireless network services using a heterogeneous collection of communicating mobile nodes. Some of these nodes will be autonomous (robots) in that their movements will not be human-controlled. The others will be portable, thus making them dependent on humans for transportation. While the focus of the work is on the mobile nodes, the project includs immobile computers on the network as well. The project emphasizes that most (though not all) of the mobile nodes will have modest sensing, computational, and communication resources.<br\/> The chief scientific motivation behind the work is the design of robust, efficient, and scalable algorithms. The project hypothesizes that distributed algorithms that rely on local interactions have many compelling characteristics, resulting in these properties. There is significant overlap between the problems of coordinating the autonomous mobile nodes that carry some of the sensors and the algorithms that direct the flow of information from sources(s)to sink(s) in the network. Both sets of algorithms need to be carefully designed to improve robustness, efficiency, and scalability.<br\/> As motivation the project proposes that the experimental part of the research be conducted on a testbed which simulates some characteristics of an urban post-earthquake scenario in a building. The sensors in the experiments will be distributed geographically (within the building) and linked by a wireless network. Many of the mobile nodes will be largely autonomous, serving as easily-accessible knowledge collectors and repositories, and exercising a wide range of independent options in the dispatch and control of information flow and resources. Other mobile nodes will be carried about the environment by people. The project will study issues of scale (how many sensor nodes does the application software accommodate), fault tolerance (how robust is the system to loss of sensors and\/or communication) and efficiency (e.g. time vs. quality of service).<br\/> As part of a one-year pilot study funded by NSF, the project has been conducting initial research in the issues underlying a system such as the one above. The project also recently received a substantial equipment grant from the Office of Naval Research to support the experimental portion of this work. The project has identified two key unsolved sub-problems that are relevant to the overall goals: localization and communication coverage. In this proposal the project discusses the broad research challenges in the area of communication and coordination of autonomous mobile nodes. The project then focuses on the two key problems as concrete questions that will be addressed in the research and describes a method involving simulation and experimentation to study them systematically.","title":"Dynamic Adaptive Wireless Networks with Autonomous Robot Nodes","awardID":"0082498","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["560926","558935","553707","560335","377594"],"PO":["292741"]},"52453":{"abstract":"EIA-0072761<br\/>Launchbury, John<br\/>Oregon Graduate Institute<br\/><br\/>CISE Postdoctoral Associates in Experimental Computer Science: Verifying<br\/>Implementations of Model Checking Algorithms<br\/><br\/>Model checkers are starting to have a profound impact on the design of<br\/>computer systems, both hardware and software. They have demonstrated an<br\/>ability not only of discovering deep bugs in systems that traditional<br\/>testing methods could not discover, but also of demonstrating the<br\/>correctness of designs and implementations. However, in order to be<br\/>increasingly effective, model checkers have been increasing in complexity,<br\/>and now are themselves becoming susceptible to buggy implementations, and<br\/>hence contain serious soundness defects. The postdoctoral associate will<br\/>develop methods for ensuring that complex implementations of model checkers<br\/>are sound, and hence able to be used with confidence. He or she will<br\/>analyze the key implementation techniques that underlie modern model<br\/>checking algorithms, such as those used to implement Binary Decision<br\/>Diagram (BDD) algorithms, and develop a formal (machine-checked) theory of<br\/>these implementation strategies. The theory will be used to verify the<br\/>correctness of the corresponding BDD algorithms.","title":"CISE Postdoctoral Research Associateships in Experimental Computer Science - Verifying Implementations of Model Checking Algorithms","awardID":"0072761","effectiveDate":"2000-10-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[133791],"PO":["564318"]},"56303":{"abstract":"0088028<br\/>Gunter, Carl<br\/>University of Pennsylvania<br\/><br\/>CRCD: Security Laboratory<br\/><br\/>This project involves the design of this university's Security Laboratory and security courses that serve as models for security education. The project integrates research in computer and network security into upper level undergraduate and introductory graduate engineering and computer and information science curricula. The project involves the creation of an instructional laboratory where students have access to and experiment with authentication methods, anti-virus software, encryption algorithms and protocols, firewalls and intrusion detection systems, and the development of network security topics in several courses including Introduction to Networks and Security and Computer Network Security. This project speaks to the widespread concern about security issues on intranets and the Internet, including: privacy policy, security design, security risk assessment, authentication techniques, encryption, incident management, and network architectures for security enforcement. In particular, this project focuses on the development of high-confidence software systems and it is also relevant to several areas of industrial and national importance including wireless information technology, IT research, and scalable information infrastructures. The transfer of this material into undergraduate and graduate courses is important for educating practitioners who develop applications and manage facilities that provide seamless availability of networks.","title":"CRCD: Security Laboratory","awardID":"0088028","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["553855",144588],"PO":["551712"]},"46667":{"abstract":"The past decade has seen an increase in the deployment of wireless networks supporting mobile communication and an exponential growth rate in the number of users. The majority of wireless networks function as wireless access networks to provide a means for untethered access to resources that reside primarily in a wired network. Such wireless access networks include analog and digital cellular phone networks, Personal Communication Systems networks, many wireless local area networks, and mobile data services. In general, the novelty of mobility has satisfied users of current wireless access networks, despite the decrease in the quality and scope of service offerings as compared to wireline networks. As ongoing research extends the capabilities of wireless access networks to include multimedia services at higher data rates, an increase in the public's demand for and dependence on mobile services will result. Ultimately, users will demand the same reliable service guarantees, that is characteristic of wireline based telecommunications and data networks. <br\/> The critical importance of providing communication service in the face of failures has been recognized in the public switched telephone network and a great deal of attention has been paid to making these networks survivable and self-healing. However, little emphasis has been placed on understanding or improving the survivability of wireless access networks. The unique aspects of wireless access networks (e.g., user mobility, wireless channel environment, power conservation, etc.) implies that survivability techniques for wired networks have limited applicability. The objective of this project is to develop a comprehensive treatment of survivability for wireless<br\/>access networks.<br\/> The project will have two main thrusts. First is survivable network design and analysis. Techniques for analyzing the survivability of wireless access networks will be developed. This includes identifying metrics that are useful for quantifying mobile network performance during normal and abnormal (failure) operating modes and determining a methodology for estimating the metrics. Given appropriate metrics, wireless access network topology design and capacity allocation algorithms which incorporate survivability strategies will be developed. This includes the cell-site architecture and the topology of the network interconnecting the cells to the fixed infrastructure. Both initial topology design and the problem of modifying an existing topology to improve the survivability will be addressed. Secondly, traffic restoration algorithms will be developed which aim at making the best use of available network resources after a failure. This work will concentrate on the design and analysis of priority based traffic restoration techniques to provide users service continuity while minimizing network congestion. A multi-layer approach involving a coordinated strategy among network layers will be developed. The restoration algorithms will be suitable for automatic invocation by network components, resulting in a self-healing network. Special emphasis will be placed on the analysis of transient network congestion immediately following failures and<br\/>incorporating its effect into the network design and traffic restoration algorithms. An additional focus will be placed on minimizing the effects of wireless access network failures on the attached wired transport and signaling networks. The work will initially address current wireless access networks (i.e., PCS), but will later address evolving wireless access architectures including mobile data services (e.g., CDPD, GPRS) and next generation systems (e.g., wireless ATM).<br\/> The research will be conducted using techniques from optimization, queueing and communication theory. Additionally, due to the complexities involved, simulation combined with the use of empirical data and heuristic algorithms will be used. The significance of this research will be its contributions to the limited base of knowledge of wireless access network survivability. The results of the work should benefit the future design and deployment of survivable wireless access networks.","title":"Collaborative Research: Design and Restoration Techniques for Fault Tolerant Wireless Access Networks","awardID":"9980528","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["464128"],"PO":["565090"]},"55379":{"abstract":"The objective of this proposal is the feasibility study of fundamental control mechanisms for<br\/>agent-based systems that facilitate network resource management and traffic control. The primary<br\/>emphasis is on orchestrating the work of multiple intelligent mobile agents such that the resulting<br\/>collaboration scales well with the size, the resource availability, and the dynamics of the<br\/>infrastructure. The proposed research investigates the feasibility of autonomously adapting the<br\/>size of the agent population as a function of parameters that describe properties of the<br\/>infrastructure directly or indirectly. The underlying idea is the separation of network centric<br\/>functions from the nodes into a mobile sub-layer. The researchers expect that this approach will yield a more<br\/>scalable architecture for solving a variety of different network centric problems. To facilitate this<br\/>approach, thet have defined fundamental mechanisms such as agent cloning, agent merging,<br\/>knowledge acquisition, and agent migration. It is through the use of these mechanisms that the researchers<br\/>attempt to show the feasibility of integrating the intelligent mobile agent paradigm into system-level<br\/>tasks. The proposed work will involve a formal analytical study of the behavior of the agent<br\/>population as a function of properties of the infrastructure and computational progress of<br\/>individual agents. The analysis will further be based on carefully constructed simulation<br\/>experiments and the emulation of a large distributed network environment.<br\/> This proposal intentionally disregards several issues of agent-based systems, such as knowledge<br\/>representation, fault tolerance, and security, and focuses on the design and analysis of the<br\/>fundamental mechanisms. We believe that the limited scope of the proposed project and its<br\/>intrinsic exploratory nature makes it an ideal candidate for the Small Grants for Exploratory<br\/>Research (SGER) program.","title":"SGER: Analysis of Fundamental Control Mechanisms for Mobile Agents in Large Network Infrastructures","awardID":"0084846","effectiveDate":"2000-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["448584"],"PO":["234222"]},"48988":{"abstract":"This CNPq research project will enable a research group at the University of Massachusetts, Amherst to cooperate with a research group at the Artificial Intelligence Group at the University of Rio Grande do Sul in Brazil. Together they will create a two-level multi-agent framework. At the higher level, a subsystem that reasons about symbolic information will be developed. Its activities pertain to domain-specific coordination tasks. At the lower level, a subsystem will be developed that reasons about quantitative information. Its activities pertain to feasibility and implementation operations. The two layers comprise interdependent activities that operate asynchronously. The lower layer provides feedback to the upper layer; the upper layer responds to the feedback by altering its tasks or performance objectives where necessary. Such an architecture will make it easier for multi-agent systems to function in open environments, such as the Internet, where the goals to be achieved, the resources available and the other interacting agents are dynamically changing.","title":"NSF-CNPq Collaborative Research: Combining Cognitive & Utilitarian Coordination in a Layered Agent Architecture","awardID":"9988784","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["485591"],"PO":["495796"]},"56029":{"abstract":"Proposal : IIS-0087158<br\/>Institution: Stanford University<br\/>PI: Marc Levoy<br\/>Title: Creating Digital Archives of 3D Artwork<br\/><br\/><br\/>Recent improvements in laser rangefinder technology, together with <br\/>algorithms for combining multiple range and color images, allows <br\/>accurate digitization of the external shape and surface <br\/>characteristics of many physical objects. This capability makes it <br\/>possible for the first time to digitize and archive substantial <br\/>bodies of three-dimensional artistic and cultural artifacts, such as <br\/>statues, buildings, and archeological remains. Although the <br\/>methodologies needed to create and manage digital archives of <br\/>two-dimensional artifacts have matured substantially in the last ten <br\/>years, the jump from two to three dimensions poses new problems. <br\/>These are problems of both scale and substance, and they touch on <br\/>every aspect of digital archiving: storage, indexing, searching, <br\/>distribution, viewing, and piracy protection. This pilot project, <br\/>will focus on the following subproblems of this new domain:<br\/><br\/>(1) cataloguing 3D artworks using techniques from image-based rendering,<br\/>(2) searching catalogues (and the Internet) for 3D models or rendered views<br\/>(3) protecting 3D archives against piracy using robust 3D digital watermarking,<br\/>(4) efficient streaming of 3D models over networks of limited bandwidth, and<br\/> (5) real-time display of large 3D models on low-cost PCs.<br\/><br\/>As test data, a 250 gigabyte archive of the sculptures of <br\/>Michelangelo and the fragments of the Forma Urbis Romae, a giant <br\/>marble map of ancient Rome will be used. The data for this archive <br\/>was generated during a year-long digitization effort called the <br\/>Digital Michelangelo Project.","title":"SGER: Creating Digital Archives of 3D Artworks","awardID":"0087158","effectiveDate":"2000-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["447448","438512"],"PO":["433760"]},"56832":{"abstract":"As scientific data becomes larger and more complex, the problem of presenting data effectively is joined by another, potentially more difficult one - how to extract presentable data from the flood of raw information. This problem is equally difficult for results from large simulations and data from high-resolution instruments. Thus, the field of scientific visualization becomes intimately tied to more traditional studies of data analysis, including image processing, pattern recognition, artificial intelligence, and computer vision. However, in contrast to those fields, visualization explicitly includes the user in the process of filtering, extracting, and rendering meaningful data. The goal of this project is to make level-set modeling - a useful but computationally expensive visualization technique - interactive for use in 3-D visualization of biological data sets.<br\/><br\/>Technically, the project has three components. The first is the design and implementation of a hardware and software system for interactive level-set surface model computation and display. This system will use off-the-shelf PC hardware and graphics boards and new algorithms and software to reach its interactivity goals. The second component will create the human-computer interface that allows users to interact with the level-set models. This will require mapping user input onto the mathematical descriptions controlling surface motion and deformation in the models. Finally, the third component will be the application of the techniques to visualize large biological data sets by researchers in this project.<br\/><br\/>This is a collaborative project between the University of Utah and the California Institute of Technology .","title":"Collaborative Research: Interactive Level-Set Modeling for Visualization of Biological Volume Datasets","awardID":"0089915","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["515717"],"PO":["551992"]},"69405":{"abstract":"","title":"Applications of Morse Theory and Catastrophe Theory to Computer Graphics","awardID":"0196226","effectiveDate":"2000-10-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["517378","467324"],"PO":["532791"]},"55127":{"abstract":"EIA-0083758<br\/>Bieber, Michael<br\/>New Jersey Institute of Technology <br\/><br\/>Title: Biocomplexity: Deeply understanding complex systems through relationship analysis<br\/><br\/>This project is an incubation activity aimed at seeding a multidisciplinary group in biocomplexity research. Through preliminary collaborative work, this group has developed an approach for analyzing complex relationships in natural (biological and others) environments, in a way similar to those for analyzing complex computing and information systems. The goals of this project are to better understanding of this new approach and to test its extensibility from a single domain to multiple domains. The project will support the interaction and collaboration among several faculty members, graduate students across several institutions. A center piece of the project is the holding of two workshops that bring together researchers from various disciplines within the biological, physical, and social sciences. The outcomes of this work will contribute significantly to the enhancement of the project team for future research and education in biocomplexity.","title":"BIOCOMPLEXITY-- INCUBATION ACTIVITY: Deeply Understanding Complex Systems through Relationship Analysis","awardID":"0083758","effectiveDate":"2000-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1366","name":"BIOCOMPLEXITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1694","name":"BE: INSTRUM DEVELOP FOR ENV AC"}}],"PIcoPI":["260669",141023,"440622",141025],"PO":[141026]},"49617":{"abstract":"EIA-0000417<br\/>Badrinath Roysam<br\/>Rensselaer Polytechnic Institute<br\/><br\/>Experimental Partnership-Real Time Computer Vision Based Spatial Mapping and Referencing for Minimally Invasive Surgery<br\/><br\/>The goal is to develop core computer vision technology for a new generation of highly capable instruments for minimally invasive surgery. The specific applications are in opthamology. Developing the technology requires facing and overcoming several fundamental barriers that have plague computer vision systems. These include poor quality image data during surgery, difficult to model biological tissues, large scale and unpredictable motions of the eye, a need for extreme accuracy over long duration, a need for predictable response in a real-time implementation, and a need for transparency of the system as a whole.<br\/><br\/>The computer vision technology will distinguish these instruments by making them \"spatially-aware\". This means they include capabilities for spatially mapping and spatial referencing. Spatial mapping is the problem of building and maintaining a seamless, wide-area map (mosaic) of the three-dimensional region of surgical interest and its surrounding. This map will be constructed from images acquired during diagnostic exploration and forms the basis for absolute and hence verifiable spatial referencing.<br\/><br\/>Novel aspects of the work in mapping include: (1) a fast, recursive technique for tracing elongated structures and then detecting their branching and cross-over points, (2) a feature-based image-to-image matching algorithm that used a high-order transformation model and a hierarchy of robust estimation techniques, (3) a joint optimization of all image-to-mosaic transformations simultaneously, and (4) a 3-D reconstruction of the retinal surface despite an inherent inability to calibrate the imaging system. These techniques are each useful in other domains besides ophthalmology.","title":"Experimental Partnership - Real-Time Computer Vision Based Spatial Mapping and Referencing for Minimally Invasive Surgery","awardID":"0000417","effectiveDate":"2000-10-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["503787","429092","541895"],"PO":["297837"]},"41840":{"abstract":"This interdisciplinary research is carried out in a collaboration between Professors Phokion Kolaitis at the University of California, Santa Cruz and Moshe Vardi at Rice University. Constraint satisfaction and conjunctive query evaluation are two fundamental and ubiquitous problems in artificial intelligence and database systems, respectively. Since these problems are known to be computationally intractable in the worst case, researchers in artificial intelligence and database systems have sought to discover tractable cases of constraint satisfaction and conjunctive query evaluation, as well as to design heuristic algorithms for solving these problems. Thus far, however, these studies have been largely carried out in parallel and with relatively little or no interaction between the two areas. Recent research work has established that there are strong and exact connections between constraint satisfaction and conjunctive query evaluation. The main goal of this project is to further explore the connections between constraint satisfaction and conjunctive query evaluation, and to examine the applicability of techniques developed for each of these problems to the other problem. To this effect, a novel game-theoretic framework is being developed to unify seemingly unrelated results, identify additional tractable cases of these two problems, and design heuristics for the general case. Moreover, algorithms and heuristics developed by the artificial intelligence community are being evaluated in regards to their efficacy in conjunctive query evaluation, and vice versa. Results obtained in the course of this project will enhance the interaction between artificial intelligence and database systems, and will advance knowledge transfer between these two areas.","title":"Collaborative Research: Constraint Satisfaction, Database Query Evaluation, and Information Integration","awardID":"9908435","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["565263"],"PO":["469867"]},"42753":{"abstract":"This project entitled \"Shuhai Wenyuan Classical Digital Database and Interactive Internet Worktable\" will create a digital corpus and internet-based resources to allow world wide use of seminal texts from China's classical period. The project will involve bringing together specialist in Classical Chinese language, thought, and culture, and information technologists to produce tools and access methods to materials that have thus far been limited to a select group of students and scholars. By doing so the project intends to open up new areas of study and research for learners of all ages.<br\/><br\/>The data content will be freely available via the web and offer Chinese texts, English examples, cultural and philosophical notes, grammar notes, and a search engine designed for a variety of tasks.","title":"DLI-2 Shuhai Wenyuan Classical Digital Database and Interactive Internet Worktable","awardID":"9910808","effectiveDate":"2000-10-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X709","name":"NATL ENDOWMENT OF HUMANITIES"}}],"PIcoPI":[108227,108228],"PO":["564456"]},"54523":{"abstract":"The primary objective of the proposed work is to investigate critical development issues to enable a two-dimensional sensor network called an artificial sensitive skin, with embedded integrated sensors and distributed signal-processing network. Specific technical objectives are summarized as follows. In the area of integrated sensors, the PI plans to develop efficient microfabrication technology to enable modular sensors with potentially high integration density. The benefit of a \"skin\" of multiple, distributed sensors can only be realized through the development and Implementation of signal processing architecture and algorithms. A scale-based distributed signal processing architecture will be developed and implemented for two sensor applications - tactile sensing and flow sensing. Integrated circuits need to be implemented under potentially limited and localized power supply in the sensor fabric. The PI proposes to develop low-power techniques for improving the energy efficiency of sensitive skin applications and demonstrate distributed error\/noise tolerance techniques.","title":"Integrated Sensitive Skin with Advanced Data Architecture","awardID":"0080639","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["470450","348133","468846"],"PO":["234178"]},"52224":{"abstract":"EIA-0072043<br\/>Jack Davidson<br\/>University of Virginia<br\/><br\/>EIA-0072043<br\/>Jack Davidson<br\/>University of Virginia<br\/><br\/>Embedded computer systems have become key building blocks of our nation's vital infrastructures. <br\/>Embedded computers are components in a large number of other automated devices and consumer appliances. Examples of automated devices include air conditioning systems, elevators, fire control systems, security systems, lighting systems, etc. Consumer appliances with embedded computers include VCRs, facsimile machines, set-top boxes, modems, cellular telephones, pagers, printers, photocopiers, etc.<br\/><br\/>This project seeks to address the embedded software development problem by developing algorithm tools, and techniques to support embedded system software development using high-level languages. Initially, our research will focus on algorithms and tools targeted at digital signal processors and the embedded applications they support. <br\/><br\/>This project will build on and extend the Zephyr compiler infrastructure being developed at the University of Virginia and Princeton University. The goal of the Zephyr project is to build compiler infrastructure that enables and supports cutting-edge computing systems research.","title":"Experimental Partnership - Comprehensive Retargetable Embedded Systems Software Development Environment","awardID":"0072043","effectiveDate":"2000-10-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["385658"],"PO":["297837"]},"41367":{"abstract":"This collaborative project combines the expertise and experience of Professors Bruce Croft and James Allan at the University of Massachusetts in the development and testing of information retrieval models and systems, with that of Professor Nicholas Belkin at Rutgers University in user modeling and user studies in interactive systems. Tools to support information retrieval and filtering have become common, but in many important respects their performance is mediocre. They make mistakes that are obvious and aggravating to users, and relevant documents are usually mixed with many others that are totally unrelated. These problems significantly lower the productivity and effectiveness of people using the tools, whether in education, science, business, or government. This project investigates a new approach to user and topic modeling that has the potential to significantly improve the effectiveness of information access and filtering. This approach is based on recent research on language models for information retrieval. Language models appear to capture the important aspects of user and domain modeling that have been observed in earlier experiments, and retrieval techniques based on document language models have been shown to be very effective. This project combines standard research methodology using TREC data, experimental and observational user studies in laboratory settings, and studies of the impact in operational environments with many users. It will significantly advance understanding of the impact of user- and topic-models on the important problems of information indexing, retrieval, and access.","title":"Collaborative Research: Supporting Effective Access Through User-and Topic-Based Language Models","awardID":"9907018","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["553228","507668"],"PO":["563751"]},"48957":{"abstract":"The objective of this project is to develop a coherent mathematical framework in which asymptotically stabilizing feedback controllers for biped systems may be rigorously analyzed and synthesized. Feedback control is an integral part of both biological and mechanical biped locomotion. For the important cases of under actuated bipeds, none of the feedback controllers or stabilization mechanisms proposed in the literature has been proven to yield asymptotically stable motions. The lack of analytical progress is normally attributed to the inherent complexity of even the simplest biped models. The proposed work will be based on a recent breakthrough by Grizzle, Abba and Plestan. For the important special case of an under actuated biped with a torso and stiff legs (i.e., no knees), these researchers provided the first mathematical proof of the asymptotic stability of a feedback-controlled walking motion. This project will systematically explore feedback stabilization and design for a sequence of more realistic biped models. The models will be selected on the basis of their applicability to robotics, biomechanics and prosthetics, and will represent a wide range in the degree of (under) actuation.","title":"Biped Locomotion Control","awardID":"9988695","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["560444"],"PO":["234178"]},"51532":{"abstract":"Future networked multimedia information systems will carry a wide variety of applications including digital libraries, video, audio and image services, distance learning and collaboration, networked virtual environments, and entertainment. The main characteristics of multimedia applications that lead to difficulties in end-to-end systems design are that they have very large bandwidth and storage requirements, with vastly different performance and reliability requirements, often coupled with real-time constraints. Along with these characteristics, the highly interreliability requirements, often coupled with real-time constraints. Along with these characteristics, the highly interactive nature of a variety of multimedia applications, resulting in fairly unpredictable workloads, makes the design and evaluation of networked multimedia information systems an exceptionally challenging problem. In this proposal, we outline research on three aspects of this problem: (1) the design and evaluation of server resource allocation algorithms for CM servers in order to retrieve information efficiently and according to the QoS demanded by the application; (2)the development of performance evaluation techniques for evaluating new server designs. (3) the participants of this project bring expertise from a wide variety of areas: databases, distance learning, multi-media, networking, and performance evaluation to bear on problems in these areas. Another important feature of this proposal is that the participants have available four prototypes of state of the art multimedia systems: the Virtual World Data Server (VWDS) developed at UCLA: the prototype of a Video-on-Demand server developed in Brazil as part cooperative research project among Brazilian institutions; and the Multimedia Asynchronous Networked Individualized Courseware (MANIC) and the Internet Multimedia Proxy (IMP) both developed at UMass. These applications will be used to motivate the development of new algorithms for retrieving information and for maintaining the desired quality of service after sending the data over a wide area network. They will also form the basis of the many experimental and analytical studies that will be performed to evaluate these new algorithms. To aid in this evaluation, our group also developed three performance evaluation and modeling tools: a state-of-the-art tool for constructing performance and reliability models (Tangram-II) developed in Brazil jointly with UCLA; a symbolic model checking tool (VERUS): and a tool which facilitates design, development, and subsequent performance evaluation of designs of multimedia storage hierarchies (ViPEr-HiSS) under development at UMD. Thus, the environment of our labs as well the long distance among them will provide a unique testbed for this type of an evaluation due to the drastically different connectivities available to our applications, from gigabit low utilized links to intercontinental congested links. <br\/>The proposed research represents a fundamentally important step in the design and performance evaluation of next generation information servers and the networked applications that will operate on top of them. As a result of our research we expect to have a better understanding of how storage server resource management policies, channel allocation policies, and network adaptation policies interact to satisfy the required QoS of CM applications, despite the fairly unpredictable network delays.","title":"Collaborative Research (NSF-CNPq): Application Level Adaptation and Control for Retrieval and Delivery of Continuous Media over the Internet","awardID":"0070067","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["499259","545655"],"PO":["565090"]},"54854":{"abstract":"The purpose of this project is to demonstrate a new paradigm for wireless network services. The<br\/>motivations for this project are the f ollowing:<br\/> (1) Today, wireless service is either local to an institution (as in wireless LANs) or is provided as part of<br\/>a regional or national service (as in cellular). But there could be other models. Individual providers of<br\/>wireless service could put up a base station and o er service locally. Users could move among these<br\/>providers and select a service based on requirements and prices. Just as we have over 5000 wireline<br\/>Internet service providers today, many only serving a small area, we could have wireless coverage<br\/>built bottom up.<br\/> (2)Today, we see a restricted range of wireless devices - a laptop PC with a wireless card, a cell phone<br\/>augmented with data capabilities, a highly integrated device such as a pager. There is not an open<br\/>market for new wide-area wireless devices, because such devices today are tightly bound, both<br\/>technically and through service contract, to a particular wireless service provider. But there could be a<br\/>wide range of new consumer devices if the proper interfaces and modules were available.<br\/> For this to work, two things are necessary. First, each of the broad mix of competing wireless services<br\/>must be accessible to a wide variety of devices. What is needed is an overall system architecture that<br\/>allows cheap, small, low-power consumer-level objects to access a wide variety of technically<br\/>incompatible wireless services with ease, using open interfaces. Second, selection of a service among<br\/>competing alternatives must be easy. For example, a manual process of selection and entry of a credit<br\/>card would be too burdensome to succeed. What is needed is a model for automated dynamic negotiation,<br\/>based on rules provided by the users and providers, together with a workable economic model and a<br\/>simple micro-payment scheme.<br\/> The goal of this research is to demonstrate two related innovations. The irst is a framework for<br\/>automated negotiation for access to wireless services. The second is a small hardware device that the user<br\/>can carry, a personal router, which contains the necessary wireless transceivers, implements the access<br\/>negotiation protocol, and provides a network connection for the other devices and appliances that a person<br\/>might choose to carry. By creation of an open interface between this personal router and other devices a<br\/>user might carry, an environment can be created for the development of new devices and applications.<br\/> The intellectual merit of this project is embodied in: a) the automated service negotiation framework, b)<br\/>experience with systems that use policy constraints to guide automatic configuration; c) the related<br\/>protocols for security and billing; d) the demonstration of the new application user interface paradigms<br\/>implied by the personal router; and e) identification and definition of the interfaces between this device<br\/>and the other consumer devices that can be connected to the Internet using it. The broader impacts are the<br\/>possibility of creating a new market model or wireless service, based on small business investment and<br\/>local competition, rather than service provision (only) by large, national-level corporations, and the<br\/>development of an increased understanding of user pricing preference for communication services.<br\/>Research that explores technology supporting alternative economic models is not likely to be done in<br\/>private industry, and is thus especially appropriate for public-sector support.","title":"Protocols for Open Access Wireless Deployment","awardID":"0082503","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["565000","458851"],"PO":["250082"]},"55646":{"abstract":"The project will create a distributed repository of significant <br\/>historical monographs in mathematics. The participation of these <br\/>three institutions is significant not only because of their <br\/>pioneering work in building digital libraries, but also because of <br\/>their extraordinary collections in this topical area. Michigan will <br\/>contribute 1,000 monographic volumes focusing on non-Euclidean <br\/>geometry from its collection; Cornell has digitized 576 volumes of <br\/>mathematical monographs, and will generate OCR to enhance access to <br\/>their materials. The State and University Library Gottingen will <br\/>contribute digitized monographs, dissertations and multivolume works <br\/>of the electronic Mathematical Archive and the database \"Jahrbuch <br\/>uber die Forschritte der Mathematik\", funded by the Deutsche <br\/>Forschungsgemeinschaft. Its collections are regarded as unparalleled <br\/>in this area. These funding requested will be used primarily to <br\/>develop an interoperability layer with the three strong digital <br\/>library systems at these institutions. In doing so, the participants <br\/>will focus on many of the issues central to the advancement of <br\/>digital libraries, including distributed repositories and integration <br\/>of digital resources, advanced access and retrieval, high levels of <br\/>interoperability, and models for dissemination and use.","title":"The Development of a Distributed Digital Library of Mathematical Monographs","awardID":"0085853","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7444","name":"NATIONAL SMETE DIGITAL LIBRARY"}}],"PIcoPI":["205770","555532"],"PO":["433760"]},"46747":{"abstract":"The objective of the proposed research is to develop efficient solutions for routing, restoration, and reconfiguration of lightpaths in a circuit-switched wavelength division multiplexed (WDM) network. Such a network is fundamentally important to the success of a next-generation Internet which will have the capacity to carry a much larger amount of traffic than today's Internet at lower delays. The network layer simply uses the lightpaths as the virtual links over which store-and-forward packet routing is performed. The design of the optical layer architecture over which electronic packet transport takes place is a grant challenge for optical network architects.<br\/> The proposed project aims to contribute to this optical layer design by improving the fault tolerance and adaptability of the optical network architecture. There are two major components to this project. The first component is to develop algorithms that efficiently restore lightpaths in the event of link failures. These algorithms will not only utilize the network resources, namely wavelengths and switches, efficiently, but also provide rapid restoration capability. This requires the design of service and restoration paths jointly at the time of resource allocation, thereby reducing the number of wavelengths required to reroute the lightpaths in the event of a link or node failure. The researchers will consider mesh-based restoration algorithms and evaluate their performance both in terms of wavelength requirement and restoration speed. In addition to determining service and restoration paths for each lightpath, the routing\/restoration algorithms will also specify efficient signalling mechanisms to coordinate the switchover to the restoration paths and the allocation of wavelengths to such paths. Restoration times and the computational complexity of the proposed signalling mechanisms will be analyzed.<br\/> A lightpath-based Internet backbone provides a unique opportunity for the reconfiguration of the logical topology by changing the set of lightpaths. Such reconfiguration must be based on real-time measurement of packet traffic on the logical links and can provide an additional degree of freedom in the capacity planning for packet networks. The researchers will design algorithms that will be used to determine the frequency and the nature of topology reconfiguration. The introduction of dynamic topological transformation at the optical layer to satisfy the dynamic traffic requirements at the network layer is a promising concept that is expected to open many interesting research directions.","title":"Routing, Restoration and Reconfiguration in Lightwave Networks","awardID":"9980783","effectiveDate":"2000-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[119553],"PO":["565090"]},"47726":{"abstract":"The goal of this research is to develop fundamental techniques to allow efficient and interactive knowledge discovery from large multidimensional datasets with spatial and temporal attributes. There are two general research goals. The first involves the investigation of effective density approximation techniques to approximate very large geospatial datasets. The proposed techniques are used both to facilitate simple exploratory data mining tasks on large geospatial datasets, and to efficiently provide accurate approximate solutions to general data mining tasks, such as clustering, classification and outlier detection. The second involves designing and implementing new algorithms and techniques for similarity queries in geospatial datasets. The educational component of the project aims to develop courses that emphasize the fundamental ideas in data mining, and introduce students to real data mining problems. The results of this project will have a significant impact on how large multidimensional datasets are analyzed, with applications in the fields of Geographic Information Systems, Epidemiology, and Environmental research.","title":"CAREER: Data Mining Techniques for Geospatial Applications","awardID":"9984729","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["430635"],"PO":["563751"]},"47627":{"abstract":"The heterogeneous, autonomous, and highly dynamic nature of databases on the Web renders most traditional data management techniques ineffective. Consequently, keeping abreast of relevant information as it evolves in this environment requires a large amount of human effort. The goal of this research is to develop, implement, and evaluate methods for data management in a heterogeneous, autonomous, and dynamic environment. The history of changes made to data is the major focus of this project. Methods for efficiently discovering, storing, browsing, and querying changes are developed. In sharp contrast to traditional database techniques, these methods try to make the best possible use of the structure in data without requiring data to conform to a fixed structure or schema. The educational component includes redesigning the current database curriculum; development of new courses on XML, related Web technologies, and semistructured data; and experimenting with pedagogical tools such as teaching by program dissection (the use of the source code of a large program as an anchor for studying related topics). In addition to graduate students, undergraduate students are involved in research by working on the system prototype, which in turn benefits from their efforts. In summary, this research will bring the benefits of database technology (e.g., faster, easier, and more precise information access) to the Web by developing methods that cope with the heterogeneous, autonomous, and dynamic nature of Web databases. <br\/>http:\/\/www.cs.umd.edu\/~chaw\/","title":"CAREER: Evolving Heterogeneous Autonomous Databases","awardID":"9984296","effectiveDate":"2000-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["456688"],"PO":["469867"]},"50323":{"abstract":"This collaborative research project is carried out by Leonard Pitt at the University of Illinois and H. V. Jagadish at the University of Michigan, drawing on Professor Pitt's experience in computational learning theory, and Professor Jagadish's expertise in databases. The goal of this research is to develop a theoretical framework for investigating data mining problems, and to adapt existing machine learning algorithms and develop new ones within the framework. Typically, the focus of Machine Learning algorithms is on learning a single classifier that works well for most of the (labeled) data, whereas data mining focuses on learning \"heuristic\" rules, typically on unlabeled data, that give insight into the nature of the data. By unifying techniques from the former area with goals of the latter, new clustering algorithms are developed that deal with massive data sets via sampling, yet provide optimality guarantees. The research also provides criteria that data mining practitioners may apply in deciding whether aggregation or sampling is a preferred data reduction technique for the task at hand. Algorithms for new and useful types of data patterns are designed, and algorithms that incorporate the user into the data-mining task are analyzed and developed within the framework.","title":"Collaborative Research: Data Mining: Theory and Algorithms","awardID":"0002356","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["533266"],"PO":["563751"]},"54822":{"abstract":"The goal of this work is to explore the fundamental properties of optimal paths <br\/>for robots subject to contact and velocity constraints, and to implement <br\/>practical path planners based on that exploration. This is a collaboration <br\/>to combine work on time-optimal paths with work on path planning <br\/>algorithms. The primary application is to plan time-optimal paths for a <br\/>differential drive mobile robot that navigates a known environment. <br\/>The planner will construct an explicit model of the configuration <br\/>space and will search for time-optimal collision-free paths. This <br\/>defines the goals for the theoretical work: to identify constraints on <br\/>the motions that reduce the complexity of the search. Optimality <br\/>and velocity constraints are both a source of such constraints. A better <br\/>understanding of time-optimal nonholonomic paths will lead to efficient <br\/>planning of efficient motions.","title":"Practical Robot Path Planning with Contact and Velocity Constraints","awardID":"0082339","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["402028","560864"],"PO":["234178"]},"51005":{"abstract":"EIA-0004056<br\/>Kriegman, David<br\/>University of Illinois at Urbana-Champaign<br\/><br\/>Postdoctoral: New Shape and Reflectance Models for Vision and Image-Based Rendering<br\/><br\/>Two areas of computer vision and image-based rendering are to be explored<br\/>by the postdoctoral associate. The first project will result in methods<br\/>for more realistically rendering scenes by constructing surface reflectance<br\/>models from image data. The result could lead to a new way to measure a<br\/>bi-directional density function under known lighting conditions and to<br\/>render images under novel lighting conditions. The second project aims to<br\/>explore the recognition of objects whose shapes are continuously changing.<br\/>The problem is phrased as an abstract contour shape recognition problem<br\/>where shape evolves dynamically. Several immediate applications in biology<br\/>and related fields are expected.","title":"Post Doc: New Shape and Reflectance Models for Vision and Image-\/Based Rendering","awardID":"0004056","effectiveDate":"2000-10-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["426630"],"PO":["564181"]},"56725":{"abstract":"EIA-0089522<br\/>Hovy, Eduard<br\/>University of Southern California<br\/><br\/>Digital Government: dg.o Workshop and Publicity<br\/><br\/>This grant will support a series of three annual workshops for the grantees of the Digital Government Program, their Federal government research partners, and other interested parties (local, tribal, state government representatives, the press, industry). The purpose of the workshops are for grantees to share their most current research findings, for agencies to contribute their problems and mission interests, and to begin to form a community for those interested in information technology research and development related to government information services.","title":"Digital Government: dg.o Workshop and Publicity","awardID":"0089522","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["543277"],"PO":["371077"]},"54789":{"abstract":"Abstract<br\/>ATM-0082131<br\/>Ghil, Michael<br\/>University of California, Los Angeles<br\/><br\/>The research bears on the problems of internal and external causes of climatic change. It emphasizes the role of the atmosphere in climate variability from months to years, of the oceans in variability from years to decades, and of the coupled ocean-atmosphere-ice-sheet system from decades to millennia. The methodology uses tools from fluid dynamics, dynamical systems theory, scientific computing and nonparametric statistics. The dynamical tools will be applied to a hierarchy of atmospheric, oceanic and coupled models. These models range from the simplest models with a small number of variables, such as box models of the ocean, to fully coupled general circulation models (GCMs).<br\/><br\/>The PIs will study coupling of climate subsystems across timescales using various mathematical and statistical techniques. On the intraseasonal time scale of 10-100 days, the PIs will consider two complementary descriptions of low-frequency atmospheric variability, episodic and periodic, i.e. multiple weather regimes and intraseasonal oscillations. On the subannual-to-interannual time scale of 100 days to 10 or more years, the research emphasizes internal variability of the mid-latitude oceans' wind-driven circulation. This circulation is studied for prescribed time-constant and seasonally varying wind stress acting on ocean-only models, as well as for fully coupled ocean-atmosphere models. On time scales of decades-to-centuries and longer, the PIs will use comprehensive coupled models such as CSM and IPSL. The simulations will be analyzed and compared with instrumental and paleo-records to determine and describe the relative importance of natural variability and anthropogenic climate change on these time scales. The work is important because it will increase understanding of climate variability across various time scales.","title":"Climate System Dynamics on Long Time Scales","awardID":"0082131","effectiveDate":"2000-10-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1610","name":"PHYSICAL OCEANOGRAPHY"}}],"PIcoPI":["529350","484094","214771"],"PO":["434790"]},"53238":{"abstract":"0075319<br\/>Sanderson and Gusfield<br\/> Supertrees are phylogenies (rooted evolutionary trees) assembled from smaller phylogenies that share some but not all taxa (twigs or end branches) in common. Thus, supertrees can make novel statements about relationships of taxa that do not co-occur on any single source tree while still retaining all the hierarchical information from all source trees. As a method of combining existing phylogenetic information, supertrees potentially solve many of the problems incurred by other methods, such as lack of homologous characters, incompatible data types, or combining trees with different taxa. However, despite the potential for constructing large trees and synthesizing phylogenetic relationships from trees based on disparate sources of evidence, supertree construction has mainly been an informal \"by hand\" operation, done without the use of specially developed software. Furthermore, there is little ground for assessing the reliability of such supertrees.<br\/> In a collaboration among biologists and computer scientists, Drs. Sanderson, Gusfield, and colleagues are examining a new class of methods that is somewhat analogous to phylogenetic distance methods but uses a novel distance measure based on \"flips\" of cells in the matrix representation of the source trees. In addition to generating supertrees, flip-supertree methods will help systematists focus on poorly known or contentious taxa, thereby directing future systematic effort where it is most needed. Accuracy and speed of supertree methods will be tested through simulation studies, and through use of the web-based database of phylogenetic trees in TreeBASE, to determine methods most useful to systematists. The graphically oriented software to be developed will implement various supertree algorithms and offer improved methods to visualize and compare trees that share some, but not all, taxa in common.","title":"Algorithms and Software for Phylogenetic Supertrees","awardID":"0075319","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1171","name":"PHYLOGENETIC SYSTEMATICS"}}],"PIcoPI":["518691","455743","451155"],"PO":["271822"]},"56858":{"abstract":"This CISE Information Technology Workforce (ITW) proposal requests funds to examine the effects of pair-programming on female students' perceived self-confidence and interest in computer science as well as their retention and achievement in these courses. Approximately, 400 students enrolled in introductory computer science courses will complete a series of programming assignments in pairs (same and mixed gender pairs) or independently. It is hypothesized that women who program in pairs will produce better programs in terms of functionality and readability, report greater confidence in their solutions, enjoy programming more, and have higher retention rates in computer science and related areas than women who program independently. This project has the potential to provide valuable insights into the retention of women in computer science.","title":"ITW: Retaining Women in Computer Science Programs: The Impact of Pair-Programming","awardID":"0089989","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7427","name":"CCLI-EDUCATIONAL MATERIALS DEV"}}],"PIcoPI":["368044","424054",146307],"PO":["289456"]},"58816":{"abstract":"The Principle Investigators of this proposal propose to organize a PI meeting for the Networking Research Programs (Networking Research Program and Special Projects in Networking) in the ANIR Division of NSF. The PI meeting will be held over a two-day period in addition to an opening night reception. The reception will be Wednesday evening, November 1, 2000 with two full days of technical sessions, Thursday, November 2, and Friday, November 3. The PI meeting will facilitate the exchange of research ideas among the PIs with active NSF awards from the Networking Research Programs and NSF program directors.","title":"NSF-PI Conference 2000","awardID":"0096740","effectiveDate":"2000-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["409909","516930","472358","515757","499298"],"PO":["194325"]},"51546":{"abstract":"An explosive growth in scale and complexity of information services is stretching data base technology beyond its limits. In particular, while the state-of-the-art data base management systems (DBMSs) provide extensibility through user-defined functions (UDFs) and data types, they are ineffective in many critical applications areas, e.g., data mining. Therefore, the project's goal is developing powerful extensibility mechanisms to enable DBMSs to support effectively new application domains and advanced information systems. To realize this goal, the new approach is based on User-Defined Aggregates (UDAs) expressed in a new SQL-based language. Since SQL is the standard language for DBMSs, this approach ensures ease of use and compatibility -- overcoming a problem besetting UDF-based approaches. The project's expected accomplishments are: (1) Design and implementation of an SQL-based language for UDAs, and of a system for supporting their efficient execution; development of compilation and optimization techniques that ensure UDAs' performance and scalability on large DBMS-resident databases, as well as on large file-resident data; (2) Development of advanced application testbeds to demonstrate the power of the UDA system, and to evaluate and tune its performance; in most applications, such as datamining functions, spatio-temporal queries, and time series data blades, the system will be used as a DBMS extender; but in applications, such as analysis of computational data or WEB data, the system will be used as a stand-alone query processor; and (3) Delivery of the software to the public, with a dedicated website providing documentation, tutorials, application testbeds, and online demos.<br\/>http:\/\/www.cs.ucla.edu\/~edu\/udahome.html","title":"User-Defined Aggregates for Advanced Database Applications","awardID":"0070135","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["542091"],"PO":["563751"]},"48906":{"abstract":"Current research to establish behavioral properties of concurrent systems uses several different paradigmatic semantics, each with its own domain of applicability. This project develops a unifying denotational semantic <br\/>framework for reasoning about safety and liveness properties of concurrent programs in a broad variety of paradigms, including shared-variable parallelism, asynchronous communicating processes, dataflow networks, and Java-style concurrent objects. A single, simple, mathematical model based on \"transition traces\" is applied to interpret these paradigms, permitting analysis and comparison of programs and specifications across paradigms. This denotational approach additionally supports syntax-directed, or compositional, reasoning. By combining concurrency with procedures and local variable declarations, the framework developed will support Java-style concurrent object-oriented programming and assist in developing a formal basis for the design of correct and secure Java programs. Principles of reasoning that apply to multiple paradigms, as well as laws of equivalence specific to a particular paradigm, are identified. To demonstrate the utility and advantages of the transition-trace approach, semantically-based techniques are applied to security protocols. The project also explores the applicability of semantically-based reasoning in improving the efficiency of automated model checking.","title":"A Semantically-Based Methodology for Proving Safety, Liveness, and Security Properties of Parallel Systems","awardID":"9988551","effectiveDate":"2000-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["451067"],"PO":["564388"]},"41845":{"abstract":"Many image databases employ image features that describe the aggregate shape and color properties of a class of objects, and hence, are only capable of \"inter-classes\" discrimination (e.g., airplanes vs. butterflies). These features are sensitive to incidental changes in camera viewpoint and scene illumination, which severely constrain the appearance of query objects. The goal of this project is to design a set of new image-derived features which utilize detailed local image analysis to enable discriminating objects of very similar appearance within the same class (e.g., \"intra-class\" discrimination of different species of butterflies in a database of butterflies). These new features capture the essential traits of imaged objects in a way that is insensitive to incidental changes in both global environmental factors, such as viewpoint and illumination, and local configuration, such as shape deformation and articulated motion. The project addresses the efficiency and utility issues in deploying these invariant features in large, real-world image databases. In particular, flexible class templates are constructed for automating image segmentation and cataloging of database objects. Invariant image features are organized in a hierarchical manner, using both image-derived and domain-specific information, for efficient pruning of unlikely matches. A representation strategy, which combines global structure models with local invariant features, is used to achieve recognition insensitive to incidental articulated motion and deformation. As a result, the new image features are highly discriminative yet insensitive to incidental changes in shape, viewpoint, and illumination. In particular, they enable invariant, intra-class image retrieval, i.e., highly precise recognition and retrieval of images in large databases of similar objects (e.g., retrieving images of Old World Swallowtails from a database of butterflies) with few constraints on the appearance of query images. The results of the project will be disseminated by scientific papers, software that can be downloaded, and prototype image databases that can be queried on the Web. <br\/>http:\/\/www.cs.ucsb.edu\/~yfwang","title":"Invariant, Intra-Class Retrieval in Digital Image Databases","awardID":"9908441","effectiveDate":"2000-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[105956],"PO":["563751"]},"46708":{"abstract":"There is an immense demand for quality of service (QoS) in the Internet. One key element of quality of service is traffic management. Since the network traffic is bursty, it is difficult to make any QoS guarantees without proper control of traffic. Currently, Internet Protocol (IP) has only minimal traffic management capabilities. The packets are dropped when the queue exceeds the buffer capacity. The transmission control protocol (TCP) uses the packet drop as a signal of congestion and reduces its load. While in the past, this strategy has worked satisfactorily, there is need for better strategies for two reasons. First, a large part of the traffic, particularly, voice and video traffic does not use TCP. Continuous media traffic uses User Datagram Protocol (UDP). The proportion of UDP traffic is increasing at a faster pace than TCP traffic. The UDP traffic is congestion insensitive in the sense that UDP sources do not reduce their load in response to congestion. Second, the bandwidth of the networks as well as the distances are increasing. For very high distance-bandwidth product networks, packet drop is not the optimal congestion indication. Several megabytes of data may be lost in the time required to detect and respond to packet losses. Therefore, a better strategy for traffic management in IP networks is required.<br\/><br\/>Recognizing the need for direct feedback of congestion information, the Internet Engineering Task Force (IETF) has come up with an Explicit Congestion Notification (ECN) method for IP routers. A bit in the IP header is set when the routers are congested. ECN is much more powerful than the simple packet drop indication used by existing routers and is suitable for high distance-bandwidth networks. Unfortunately, to realize the full potential of ECN, several questions need to be answered.<br\/><br\/>In this research proposal, the PIs propose a comprehensive program of research on traffic management in IP networks. They propose to develop a new set of traffic management algorithms for IP networks based on Explicit Congestion Notification mechanism. A total of 18 different issues will be analyzed. The PIs have identified potential solutions and approaches for each of these issues. Specifically, they propose to work on a new congestion detection and buffer management scheme for routers, a mechanism for TCP to react to ECN messages from the network. One of the important goals of this research is to make TCP traffic management algorithm free of any bias based on round trip time and number of congested gateways traveled.<br\/><br\/>The proposed research will be based on theoretical analysis and simulations. The PI's approach will be a formal analysis of simple scenarios, heuristic analysis of more complex scenarios and validation using simulations. The emphasis will be to develop simple solutions. However, the performance lost in exchange of simplicity will be theoretically analyzed.<br\/><br\/>Traffic management is the key in providing QoS. Currently, a significant amount of NSF, DARPA, and other research funding as well as energy in networking is being spent on QoS issues. When QoS based solutions (integrated services, differentiated services, or multiprotocol label switching) are deployed, the need for traffic management will become apparent and the PIs expect to see an immediate need for proper methods for traffic management. This proposal is, therefore, timely and important.","title":"Traffic Management in IP Networks","awardID":"9980637","effectiveDate":"2000-10-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["532762","532760"],"PO":["234222"]}}