{"199111":{"abstract":"Timing violations, an artifact of rapid technology scaling, embody a central reliability challenge in microprocessor design. A vast body of existing techniques in the landscape of timing violations fall under two broad categories: reactive and proactive. In both of these schemes, the lack of sufficient time in identifying an upcoming timing violation limits the scope of corrective techniques, incurring a large recovery overhead, or loss in fault coverage, respectively. Using a cross-layer analysis combining information from the application, architecture and circuit layers, this CAREER project demonstrates that timing violations can be predicted several clock cycles early. Early prediction of timing violations can offer a vast leverage in robust system design, opening up a promising direction for future systems research. In this paradigm, microprocessors can operate at a tighter frequency, where predictable errors frequently occur and are tolerated with minimal performance loss. Such a system design style can reshape physical design algorithms, boosting the energy efficient frontiers for microprocessor components. <br\/><br\/><br\/>Research in the nascent area of cross-layer design will enable circuit designers and system architects to increase collaborative design, and develop affordable, energy efficient and reliable computer systems. The rapid growth and evolution of integrated circuits creates a huge demand of Computer Engineering skill sets for addressing upcoming challenges. The CAREER project seeks to create a stream of future engineers capable of tackling growing unreliability in integrated circuits through focused knowledge dissemination. Undergraduates, women and minorities will be actively sought for participation through the existing platforms at Utah State University such as the Society of Women Engineers (SWE), Engineering State and Center for Women and Gender (CWG) programs.","title":"CAREER: Predicting Timing Violations: A New Direction for Robust System Design","awardID":"1253024","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["550106"],"PO":["562984"]},"199243":{"abstract":"Energy and resource monitoring for sustainability has garnered significant attention as an emerging global challenge. Residential energy and water consumption is one of the largest and least understood areas of consumption and is responsible for 28% of US energy consumption and 56% of US drinking water consumption. Strategies for addressing our energy and water crisis clearly require a multifaceted approach that transcends technology. However, for developing a more complete understanding of energy consumption in the home, computing technology plays a critical role in the collection, analysis, and presentation of data to answer important sustainability questions by the scientific community. Past work has demonstrated sustained energy savings of 10-15% in the home with the appropriate feedback of appliance-level usage data, but required complex sensor installations. A great challenge still remains in practically deploying sensing technologies to gather this relevant data at a large scale.<br\/>Current sensing methods remain in their infancy and are limited to small, isolated deployments, and many existing sensing approaches tend to be deemed obtrusive and difficult to install. In addition, no comprehensive public dataset on energy and water use and raw sensor data exists for researchers to build and compare new analytic tools and methods, thus limiting the ability to participate in this kind of work to a small number of groups who have access to this proprietary information through their own small deployments. The goal of this multi-year research project is to democratize sensing for sustainability by developing a complete electricity and water sensing and analytics platform for homes.<br\/>Intellectual Merit: This research will make progress on two grand challenges posed by the scientific community: 1) accelerated deployment of ubiquitous computing technology for improving quality of life and 2) the reduction of residential energy and water consumption. <br\/>This work involves novel approaches to sensing electricity and water use in the home using a small number of sensors. This includes the first full exploration of practical water sensing and analytic techniques that provide highly granular information on water use and combining electricity and water sensor streams for improved classification. This research focuses on the design, development, and evaluation (both hardware and software) of new, easy-to-install, and cost-effective sensing solutions. The insights and artifacts resulting from this research have merit in other applications beyond sustainability, such as elder care, in-home rehabilitation, and chronic disease management.<br\/>Broader Impact: The platform proposed in this research has direct implications for the growing focus on the energy and sustainability by both the federal and local governments. The potential ease of deployment for the proposed technology will make this a desirable technology for environmental researchers and ultimately homeowners who currently have little insight into their actual energy and water use. The comprehensive energy and water dataset collected with this research will serve as an enabler for others in this space to create their own analytic approaches. More generally, this data will enable scientists, engineers, and industry to answer foundational questions regarding energy and water. <br\/>The potential for the broad impact of this research coupled with the inherent interdisciplinary nature of ubiquitous computing integrates with an education plan designed to excite high school students and undergraduates to pursue careers in computing and engineering in general. They will learn about interdisciplinary research opportunities and engage in activities by participating in the primary investigator?s research lab around ?sustainable thinking.? New graduate-level courses will be designed to educate young researchers about relevant research topics in ubiquitous computing and learn new advanced prototyping techniques necessary for building real-world applications. New K-12 learning activities and projects will also be developed around sustainability.","title":"CAREER: New Systems and Tools for Residential Sustainability Sensing","awardID":"1253709","effectiveDate":"2013-03-15","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[534402],"PO":["565255"]},"199056":{"abstract":"Machine learning algorithms are now routinely used to build predictive models from data in wide range of applications. However, current approaches to machine learning have an important limitation: They assume that the set of classes observed in a training data set is exhaustive and that new data samples originate from one of the existing classes represented in the training data set. This assumption is unrealistic in many real-world applications in which previously unobserved classes of interest emerge. <br\/><br\/>This study explores a new class of machine learning algorithms that produce self-adjusting models that can accommodate new classes observed in data in offline as well as online learning scenarios. The project aims to (i) use non-parametric models to dynamically incorporate the changing number of classes; (ii) develop new online and offline inference techniques to accommodate new classes as they emerge (iii) automatically associate newly discovered classes with higher-level groups of classes in an attempt to identify potentially interesting class formations, and (iv) develop partially-observed tree models containing observed and unobserved nodes, where observed nodes represent existing classes and unobserved nodes are introduced online to fill the gaps in the existing data hierarchy that become evident only with the arrival of new data.<br\/><br\/>The broader impacts of this work could extend to several real world applications: Bio-security and bio-surveillance, information retrieval, and remote sensing among others in settings where all of the classes are not known a priori. The educational plan includes outreach to K-12 students and enhanced research opportunities for undergraduate and graduate students in computer science as well as at the intersection of computational and life sciences. All the software, publications, and data sets resulting from the project will be freely disseminated to the larger research and educational community. Additional information about the project can be accessed through the project website at http:\/\/www.cs.iupui.edu\/~dundar\/career.html","title":"CAREER: Self-adjusting Models as a New Direction in Machine Learning","awardID":"1252648","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[534010],"PO":["565136"]},"206537":{"abstract":"The objective of this proposal is to organize the first annual principal investigator meeting for the National Robotics Initiative (NRI). The NRI was launched in the summer of 2011 and there is a clear need to bring together the researchers of the projects awarded in 2012 and 2013 to provide cross-project coordination in terms of common intellectual challenges, methods for education and training, best practice in terms of transition of results and opportunities for broader dissemination of project status, activities and results.<br\/><br\/>The meeting will be organized as a two-day meeting in the vicinity of Washington DC which broadens the impact to other governmental agencies, as members will be invited due to proximity. The meeting will include all the PIs for the NRI initiative, and invitations to all the program managers for robotics related programs in DC in addition to organizers of the Robotics-VO (Virtual Organization). Finally, the meeting is organized to take place during fall of 2013 to allow the second cohort of NRI projects to participate, allowing greater cross-fertilization of topics and ideas.","title":"NRI PI Meeting 2013","awardID":"1325276","effectiveDate":"2013-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8013","name":"National Robotics Initiative"}}],"PIcoPI":["565099"],"PO":["564069"]},"199234":{"abstract":"The scientific aim of this work is to study how small electronic devices can function at a high level in the face of increasingly-severe physical complexities. The complexities can originate from the physical signals of interest in a sensing system or from non-ideal device and algorithmic behaviors within the electronics itself, which are becoming unavoidable due to technology and system scaling. As an example, this study focuses on analyzing physiological signals that are available through low-power medical sensors. Though such signals are highly indicative, extracting medical information of value requires high-order models of the underlying physiological processes when in fact no tractable analytical models generally exist. This study also focuses on errors within the hardware that occur due to unpredictable but inevitable technological defects and variations, leading to high levels of errors in the data being processed. These challenges are approached through algorithmic methods emerging from the domain of machine learning that construct models for interpreting data from the data itself. The large amount of data that is available through small-scale sensors can thus be leveraged as an extensive knowledgebase; but the problem is that these methods are not well supported by low-power electronics, in terms of their computational energy, memory requirements, network interactions, etc. This research starts with the kernel computations used in machine-learning frameworks, and it investigates kernel formulations, structured hardware architectures, and algorithms to overcome the physical complexities associated with application signals and technological non-idealities. The principles are studied through hardware and software experimental demonstrations.<br\/><br\/>The broader impact of this research is to enable greater value of electronic systems in critical applications and to establish an interdisciplinary educational program that teaches students to connect fundamentals from computer science, low-power electronics, and clinical applications. While electronics presents tremendous capabilities, its impact on real-world challenges such as in healthcare depends on high-value interactions with physical systems. This program emphasizes clinical applications and collaborations to understand the role that electronics can play in enabling preemptive medical harm detection and chronic-disease management over large patient populations: something that is infeasible with today's methods. This program also emphasizes interactions with the semiconductor industry, to transfer principles and architectures both for advanced sensing platforms and for algorithmic approaches to hardware resilience; with hardware errors having been identified by the industry as one of the critical challenges, methods that overcome the need for traditional forms of design margining are being urgently pursued. New interdisciplinary courses, student projects, and outreach activities will expose students to external collaborators and will drive an educational program that ties together engineering fundamentals from multiple domains through an application-driven pursuit of systems to overcome critical challenges in healthcare decision support.","title":"CAREER: Hardware and Algorithmic Architectures for Analyzing Physically-complex Systems: embedding inference capabilities in ultra-low-power sensors","awardID":"1253670","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":[534384],"PO":["562984"]},"199598":{"abstract":"Building a Unified Infrastructure for Data Integration on Political Violence and Conflict <br\/><br\/>This proposal s a conceptualization project whereby leaders of several major data collections, along with experts in insurgency, ethnic conflict, terrorism, computer science, and data management, will build consensus around a unified infrastructure for political violence data collection and integration. The project will create a scalable ontology focused on four domains relevant to all forms of political violence: conflicts, actors, geographies, and events. This ontological infrastructure will allow researchers and policy makers who study political violence, including its etiology and consequences, to access and integrate existing data from the major political violence data collections currently collected at academic institutions and non-governmental organizations around the world. This infrastructure will also facilitate the development of new non-linear and semantic analytical methods to decipher the complex dynamics of conflict and violence. Finally, this infrastructure will provide a platform for the next generation of data collection on violence and conflict by creating a flexible framework for new data collection projects that is both easily exchangeable and adheres to the consensus-based ontologies developed. The proposed project incorporates a two-day stakeholder workshop, a schematic design of the ontological infrastructure for political violence data collection, and a web-based community-moderated issue-tracking wiki to encourage participatory development and refinement of the ontologies. Additionally, the proposed project supports one of the core missions of NSF?s Big Data initiative, focusing on the development of a data infrastructure relevant to national security. Intellectual Merit: Although scientists have made major advances in the empirical understanding of political violence in recent years, nonetheless further advances are being hindered by the fact that leading projects from around the world are largely autonomous and uncoordinated. This project will address this weakness by creating a scalable ontology focused on domains critical to political violence. The major goal of this enterprise is to design a strategy for integrating the world?s most important data bases on political violence within an expandable platform that will allow not only updating original data but the addition of new data and variables, including rapidly evolving data sets derived from the social media. The proposal has built in sufficient resources to host a two-day stakeholder conference, to prepare read-ahead materials for stakeholders before the conference, to design and staff a wiki for reaching out to the research community and for developing a final report that will serve as a springboard for a proposal to implement the ontology designed. By integrating the major data bases, providing an infrastructure for growth, and making the end product available to the world?s research community, the proposed activity could have a transformative impact on the science of political violence. Broader Impacts: This ontological approach to political violence data collection will offer critical insights for data integration and for advancing the scientific study of violent conflict. Effective identification of ontologies across major political violence data collections will provide an essential roadmap for the integration of these data structures and the development of new applications and analysis for research on national security. Additionally, the workshop will serve to network senior and junior faculty alongside graduate students thereby developing a new generation of political violence experts. The translation of the workshop report into a community-moderated and web-based issue-tracking wiki will serve to expand participation to include other researchers who will be instrumental in defining and shaping a larger ontological structure for both existing and future data collection efforts.","title":"CIF21: DIBBs: Building a Unified Infrastructure for Data Integration on Political Violence and Conflict","awardID":"1255793","effectiveDate":"2013-03-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":["562455",535155],"PO":["565292"]},"199246":{"abstract":"Heterogeneous three-dimensional (3D) integration is an emerging paradigm for developing multifunctional systems at a lower cost. The dominant practice targets primarily high performance applications with limited heterogeneity such as logic-on-logic and memory-on-logic integration. On the contrary, this proposal embodies a significantly different vision, in which the focus is on low power highly heterogeneous 3D systems-on-chip (SoCs) with promising applications to the life sciences, energy efficient mobile computing, and environmental control. Despite the recent and growing efforts to develop hybrid 3D ICs, a systematic design and analysis framework does not yet exist. This research fills this need by addressing three interrelated issues of critical importance to this framework: system-wide power, signal, and sensing integrity. Simultaneously satisfying these three design objectives is a significant challenge in tightly coupled 3D SoCs. By considering multiple planes as a single entity, novel circuit- and physical-level design and analysis methodologies will be developed to alleviate this fundamental challenge. The traditional understanding of signal integrity will be extended to consider sensing integrity, an important issue in heterogeneous 3D SoCs, where multiple sensors and sensing electronics are coordinated. The proposed methodologies will be evaluated by developing and fabricating a heterogeneous 3D test chip with application to bio-electronics.<br\/><br\/><br\/>The synergy between 3D integration and heterogeneous SoCs provides a paradigm changing vision for integrated electronics with substantial benefits to science, industry, and society at large. At a time when the fundamental limits of traditional scaling are approaching, this synergy brings new opportunities to a variety of applications including More-than-Moore systems. The proposed research enhances the feasibility of this cooperation by targeting critical circuit- and physical-level issues. These research activities will be tightly integrated with educational initiatives at the secondary, undergraduate, and graduate levels with participation from minority and underrepresented groups. These efforts will include both traditional activities (such as introducing new courses and promoting undergraduate research) and novel methods that interact with recent pedagogical practices. The PI will also continue to participate in the departmental and local outreach activities such as an engineering summer camp and a science fair, both targeting high school students within the greater New York City area including Long Island. The intertwined objectives of this proposal will guarantee power, signal, and sensing integrity in hybrid 3D SoCs, while contributing toward the advancement of science and diversity in education.","title":"CAREER: Leveraging Three-Dimensional Integration Technology for Highly Heterogeneous Systems-on-Chip","awardID":"1253715","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":[534408],"PO":["562984"]},"201028":{"abstract":"Disasters pose a comprehensive need for critical real-time computing, where data must be collected, transmitted, transformed, and displayed to stakeholders in real-time. In this REU program, a cohort of 10 students in computing are introduced to a new style of holistic, multi-disciplinary research in which they interact with responders, industry, and agencies, and are embedded into faculty and graduate students teams to conduct individual research projects. Each summer, the program begins with the annual Center for Emergency Informatics' Summer Institute at Texas A&M's Disaster City(R) where the student cohort is introduced to applying human-centered design to problems in emergency management. The students use the feedback from responders and agencies in framing, with their faculty and graduate student mentors, creative approaches to disaster response. The individual student projects include designing new natural user interfaces for situation awareness and sensor fusion, applying cognitive neuroscience to image processing to select key snippets of video data to transmit rather than send large files over highly limited wireless networks, analyzing \"big data\" to understand trends and bottlenecks in decision making, improving security and privacy, and applying social networking to extract information about structural and social vulnerability. In addition to the purely research activities, each cohort attends seminars and brown bag lunch discussions; goes on tours of Texas A&M laboratories and NASA Johnson Space Center; and has weekly social functions with other REU students and with faculty and graduate students. <br\/><br\/>The broader outcomes of this project are both scientific and educational. The intellectual merit is the contribution of the projects to the emerging field of real-time computing for critical events such as disasters. The broader educational outcomes of integrating research and education are increases in the enrollment in graduate schools due to: exploiting the attractiveness of humanitarian applications to attract under-represented groups and encourage social networking and mutual support; using the topic of emergency response to create a common ground between students in a cohort, providing a rich set of activities that develops an understanding of research methods, new communication skills, and ethical practices; engaging students with faculty, graduate students, and industry\/agency mentors; and exposing faculty outside of Texas A&M to the emerging emergency informatics research community. Students will gain experience in presenting results from their individual projects orally, as posters, and as written reports. The written reports will be targeted for conference publications or inclusion in journals.<br\/><br\/>The website for the REU site (http:\/\/www.cse.tamu.edu\/reu\/computingfordisasters) provides additional information.","title":"REU Site: Computing for Disasters","awardID":"1263027","effectiveDate":"2013-03-15","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["565226"],"PO":["563751"]},"206738":{"abstract":"This EArly Grant for Exploratory Research aims to create neutral reference model from synthetic speech to contrast the emotional content of a speech signal. Emotional understanding is a crucial skill in human communication. For this reason, modeling and recognizing emotions is essential in the design and implementation of interfaces that are more in tune with the user's needs. Starting from the premise that paralinguistic information is non-uniformly conveyed across time, this study aims to identify emotionally prominent regions or focal points across various acoustic features. The study explores a novel approach based on synthetic speech to build reference models characterizing patterns observed in neutral speech. These reference models are used to contrast the emotional information observed in localized segments of a speech signal. The study builds a synthetic speech signal that conveys the same lexical information and is timely aligned with the target sentence in the database. Since it is expected that a single synthetic speech will not capture the full range of variability observed in neutral speech, the study explores approaches to produce different neutral synthetic realizations. After creating a parallel corpus with time-aligned synthetic speech, the study explores how well synthetic speech captures the acoustic patterns and emotional percepts of neutral, nonemotional speech. Then, a target signal from the database is compared with the properties observed across the family of synthesized signals. <br\/><br\/>The study presents a novel approach to build a robust emotion recognition system that exploits the underlying nonuniform externalization process of expressive behaviors. Algorithms that able to identify localized emotional segments have the potential to shift the current approaches used in the area of affective computing. Instead of recognizing the emotional content of pre-segmented sentences, the problem is formulated as a detection paradigm, which is appealing from an application perspective. These advances represent a transformative breakthrough in the area of behavioral analysis and affective computing. The proposed models and algorithms provide numerous insights to explore and extend theories in linguistic and paralinguistic human behavior. Having established the base infrastructure for this exploratory research, several new scientific avenues will emerge that serve as truly innovative advancements that will impact applications in security and defense, next generation of advanced user interfaces, health informatics, and education. Furthermore, the scientific methods are enriching venues for interdisciplinary training and mentoring for undergraduate and graduate students.","title":"EAGER: Exploring the Use of Synthetic Speech as Reference Model to Detect Salient Emotional Segments in Speech","awardID":"1329659","effectiveDate":"2013-03-15","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563326"],"PO":["565215"]},"199214":{"abstract":"The next generation of visual computing applications will require graphics systems to execute within a wide range of computing environments (from embedded devices to supercomputers) and be both more powerful and orders of magnitude more efficient than existing systems today. Unfortunately, creating efficient rendering solutions for any one platform or any one class of workloads is currently a laborious, expert-level task whose difficulty discourages innovation in interactive graphics techniques and graphics hardware architecture. In response, the PI is developing technologies that, given knowledge of a virtual scene, a specific rendering task, and parallel hardware platform, can automatically generate an optimized graphics system implementation specialized for this context. The core idea is to develop unifying representations for the large space of algorithmic approaches to key rendering problems such as surface visibility and shading and then to leverage these representations in new intelligent renderer compilation systems that identity efficient algorithms for a given workload and machine context. In this system, selecting appropriate algorithms is as much a part of the renderer compilation process as synthesis of high performance code. Defining new core graphics programming abstractions that embody these parameterized algorithmic spaces, exploring their application scope, and determining what graphics domain knowledge is fundamental to automating graphics system optimization are significant research components of this project. A second component of the project involves modeling and characterizing graphics system behavior in order to guide automated discovery of efficient solutions.<br\/><br\/>Graphics system performance is a fundamental enabler of new visual computing applications. In particular, project success stands to catalyze the impact of visual computing in mobile and embedded environments, where photorealistic augmented reality and high-resolution display of information will be transformative to tasks such as navigation, worker training, as well as new forms of digital entertainment and the arts. Success also stands to have cross-disciplinary benefit to the domain of scientific computing, as hardware, software, and compilation technologies developed for graphics acceleration continue to have widespread impact on the advancement of general parallel computing. High-performance visual computing topics will be used as a central component of efforts to modernize parallel computing education. The results of this effort will be available to the public as an on-line textbook and web reference for modern parallel computing. The project web site (http:\/\/graphics.cs.cmu.edu\/projects\/renderergenerator\/) provides additional information on the project.","title":"CAREER: Automatic Generation of High Efficiency Graphics Systems","awardID":"1253530","effectiveDate":"2013-03-15","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[534344],"PO":["563751"]},"199247":{"abstract":"To successfully operate in human environments, a robot needs to be able to properly interpret its surroundings and manipulate human objects. In human environments such as a household, we can bring to bear significant information about the expected spatial layout and the function of common household objects. However, for most reasoning methods for robotic perception and manipulation, humans play a secondary role. In this proposal, we propose to make humans central to our reasoning algorithms. We argue that such explicit modeling and consideration of humans, even when they are not present, will enable robots to better perceive, manipulate, and plan. Through such reasoning, we will make advances in the following areas: (a) Modeling 3D Scenes with Objects and Humans, (b) Human Activity Detection and affordances, and (c) Robot Manipulation for assistive tasks.<br\/><br\/>This research has the potential to significantly impact the quality of life of a large number of elderly people. In fact, one of the most promising applications of this research is in assistive care for the elderly and those with difficulty in performing daily tasks. Assistive care for the elderly is an increasingly important problem: a growing fraction of the US population is elderly; by 2030 about 1 in 5 Americans will be over 65. Many elderly people (including about 50% of those 85 years or older) require some personal assistance. Just to mention one basic example: a key concern in elderly care is that the subject does not drink enough water throughout the day and becomes dehydrated. Our robot (or a monitoring system) can observe the water consumption, remind the subject to drink water when needed, and even bring some if desired. Other outreach activities include incorporating young students and minorities into robotics research, curriculum development, and open-source robotics software.","title":"CAREER: Robotic Perception through Human Context","awardID":"1253719","effectiveDate":"2013-03-15","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[534410],"PO":[534411]},"199325":{"abstract":"A fundamental challenge in engineering and science today is that systems contain tremendous numbers of interconnected components with complex interactions. Examples include communication and sensor networks, high-dimensional medical images, or biological systems such as vast sets of interconnected spiking neurons responding to a large array of stimuli. Graphical models provide a probabilistic framework for modeling such systems, and contemporary message-passing algorithms lead to computationally feasible operations by decomposing problems on larger systems into smaller ones. This research develops a broader methodology and new algorithms to address larger classes of more complex nonlinear interconnected systems with potential for great technological impact. For wider dissemination, this is coupled with educational initiatives including developing courses combining perspectives in signal processing, machine learning, and statistics in the context of modern applications. An open-source code base will foster cross-disciplinary research in students, educators, and industry.<br\/><br\/>This research combines the power of high-dimensional graphical models with recent advances in random systems theory to tackle a much wider scope of problems than traditional message-passing or linear methods allow. The investigator addresses the key gaps in scalable estimation and model inference for structured nonlinear systems and develops powerful general algorithms for solving core problems. Four main objectives address aspects of this broader goal: (i) systematic general methods for representing systems characterized by arbitrary interconnections of linear and nonlinear components; (ii) computationally scalable message-passing algorithms for estimation; (iii) rigorous quantification of high-dimensional performance; and (iv) validation of the methods on real data, including neurological system identification. These research thrusts greatly expand the scope of statistical estimation techniques and provide a rigorous approach to large-scale signal processing problems underlying the big data technology of today.","title":"CAREER: Structured Nonlinear Estimation via Message Passing: Theory and Applications","awardID":"1254204","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":[534566],"PO":["564898"]},"199226":{"abstract":"Wearable technology has the ability to facilitate pervasive, continuous understanding of and interaction with the human wearer through garment-integrated wearable sensors and interface technology. However, clothing is more flexible, mobile, and intimate than most electronic technologies, and presents unique challenges for design and manufacture. Start-up costs of developing garments for each application of wearable technology are high. The primary objective of this project is the investigation of a flexible, adaptable garment-integrated architecture for sensing and actuating technologies that will facilitate the development of a wide variety of applications without the need for new hardware development. In addition to flexibility of function, the integration of hardware components into garment structures emphasizes the methods of cut-and-sewn, mass-manufactured apparel. This focus lowers the barrier-to-entry to smart clothing and wearable technology for apparel manufacturers while simultaneously preserving the human factors of apparel including aesthetics and physical comfort. <br\/><br\/>Widespread, pervasive wearable technology would allow medical conditions to be continuously and imperceptibly monitored without requiring a clinical visit or hospital stay, and would allow personal devices to become context-aware, providing information and alerts that are responsive to the activities, objectives, and social context of the user. Smart clothing can shift the frontiers of healthcare and medical monitoring, human-device interface, apparel consumption and use, and many other fields. Innovation and expertise in the production of electronic textiles and clothing offers strong competitive advantage to the US apparel industry. Further, smart clothing development effectively bridges many interdisciplinary fields, including the predominantly-female field of clothing design. Activities supported by this project expand the participation of women in STEM disciplines and encourage interdisiplinarity in education.","title":"CAREER: Toward Pervasive Wearable Technology: A Cut-and-Sewn, Textile-Integrated Smart Clothing Platform","awardID":"1253581","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[534368],"PO":["564778"]},"201811":{"abstract":"The purpose of this project is to support students to attend the ACM Sigmetrics conference to be held in Pittsburgh, PA on June 17-21, 2013.","title":"CSR: Student Travel Support for SIGMETRICS 2013","awardID":"1300202","effectiveDate":"2013-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["555524"],"PO":["565255"]},"198996":{"abstract":"This project addresses an important challenge of developing sophisticated and novel machine learning techniques for complex real-world problems. New technologies allow us to determine the genomes of organisms co-existing within various ecosystems ranging from ocean, soil and human-body. Several researchers have embarked on studying the pathogenic role played by the microbiome, defined as the collection of microbial organisms within the human body, with respect to human health and disease conditions. <br\/><br\/>The research activities in this CAREER project will develop approaches for the identification of taxonomy, function and metabolic potential from the collective genomes samples. A key contribution will be the development of multi-task learning approaches that combine information across multiple hierarchical databases associated with the annotation problems. During research, the PI will investigate the best ways to capture the underlying hierarchical structure, prevalent within different annotation databases. The rationale underlying this proposed research is that there is a wealth of complementary information that exists across several manually curated biological databases. Associating microbiome with phenotype requires integration of various high-throughput omic data sources (genomic, metabolic, proteomic) that may not be uniformly available across all samples. The PI will develop data fusion classifiers within the multi-task learning paradigm to integrate heterogeneous, incomplete data sources for predicting phenotypes. This project will lead to the following key contributions: (i) Improved metagenome annotation models by integration of multiple prediction tasks and associated databases. (ii) Incorporation of hierarchical information within regularized multi-task learning. (iii) Integration of diverse and incomplete information sources. (iv) Scalable algorithms that use hash based feature representations and improve the learning rates.<br\/><br\/>This project is interdisciplinary and spans the fields of machine learning, bioinformatics, metagenomics, microbiology and environmental ecology. This project will foster the the synergy between teaching and research by providing an environment for all students to develop intellectually and professionally. The project integrates the research with an education plan focused on mentoring of high school, undergraduate and graduate students, curriculum development and laboratory visits. Planned activities include training of inter-disciplinary researchers, integration of microbiome analysis related projects within the classes, curriculum enhancement and implementation of new learning strategies. Open source software and tools will be developed as part of this project, that will enhance scientific understanding and discovery amongst a broad and diverse group of researchers.","title":"CAREER: Annotating the Microbiome using Machine Learning Methods","awardID":"1252318","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["565089"],"PO":["565136"]},"196499":{"abstract":"The goal of this research is to develop a new framework to control teams of mobile robots, cooperating in a beamforming fashion, to transmit information between multiple source-destination pairs, while meeting quality-of-service constraints and consuming minimum power. The approach of this project ensures robust communications and longevity in challenging environments, arising during the transmission of high-rate data, such as video or images, or in environments where there is no line-of-sight. It also allows significant performance gains compared to static systems that do not consider mobility.<br\/><br\/>The intellectual merit of this research lies in the development of a cyber-physical system of mobile beamformers, where the physical space of robot trajectories and velocities constitutes an input to the cyber space of wireless communications, and vise versa. Integration of the resulting discrete and continuous dynamics and different time scales requires the synthesis of new theoretical results drawing from control theory, wireless networking, distributed optimization, and hybrid control. This cyber-physical system combines the following interrelated objectives: Distributed control of mobile beamformers; Node selection, grouping and motion scheduling; Rich models of the communication space; Platform deployment and validation.<br\/><br\/>Successful completion of this research will provide these necessary components in facilitating the design of mobile autonomous systems and fostering their adoption. Wide availability of such systems can have a significant societal impact on, e.g., search, rescue and recovery operations, environmental monitoring for homeland security, or surveillance and reconnaissance missions. The broader impact of this project lies on disseminating the research output in the industry and academia.","title":"NeTS: Small: Synergy: Collaborative Research: Controlling Teams of Autonomous Mobile Beamformers","awardID":"1239188","effectiveDate":"2013-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[526916],"PO":["565303"]},"199326":{"abstract":"There have been recent and notable advances in the field of computer-aided tools for synthetic circuit design at the system level. While most approaches focus on providing visualization and simulation capabilities for the users to explore, there is a lack of a much needed end-to-end integrated framework capable of automated optimization of synthetic circuits based on user-defined constraints. The goal of the proposed project is to develop an integrated synthetic biology framework and tools for the automated systems-level design of mixed-signal synthetic circuits. This framework will serve as a computational tool for synthetic biologists and will lay the theoretical foundations for system level synthetic circuit design. <br\/><br\/>The project will explore a global optimization platform with both approximate and exact techniques for finding the optimal set of parts for any given configuration, which will provide guarantees on the optimality, reproducibility or bounds of the solution. This work will explore matching past validated designs to the circuit at hand, by employing graph-querying and graph partitioning algorithms that will transform the original design to equivalent graphs which can be solved efficiently. This will promote modular and reusable designs, and result in an increase in the level of achievable complexity and a decrease in the cost of construction.","title":"CAREER: Integrative Synthetic Biology: A Scalable Framework for Modular Multilevel Design","awardID":"1254205","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7946","name":"BIO COMPUTING"}}],"PIcoPI":[534568],"PO":["565264"]},"202967":{"abstract":"The IEEE Symposium on Security and Privacy will be held in San Francisco, CA on May 19-22, 2013. Since 1980, the IEEE Symposium on Security and Privacy has been the premier forum for the presentation of developments in computer security and electronic privacy, and for bringing together researchers and practitioners in the field. This proposal requests funding to assist 15-20 US-based graduate students in attending this meeting. Participation in symposia like this is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work in the field. This grant enables the participation of students who would otherwise be unable to attend the IEEE Symposium on Security and Privacy.","title":"Student Travel Support for IEEE Symposium on Security and Privacy 2013","awardID":"1306061","effectiveDate":"2013-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["561510"],"PO":["565327"]},"206609":{"abstract":"This travel grant supports students and domain experts to attend the workshop on \"Multimodal and Alternative Perception for Visually Impaired People\" in July, 2013 in conjunction with the International Conference on Multimedia & Expo (ICME). The workshop brings researchers and practitioners from multiple disciplines (computer vision, neuroscience, multimedia computing, sensor technologies and assistive technology applications) to discuss fundamental issues in visual perception, computational intelligence, neuroscience and visual prosthesis for helping blind and visually impaired people and people working in visually challenged environments. The workshop papers are included along with the IEEE ICME 2013 proceedings. The workshop homepage is used to disseminate results of the panel discussions and paper presentations as well as the report.","title":"IEEE Workshop on Multimodal and Alternative Perception for Visually Impaired People (MAP4VIP)","awardID":"1327236","effectiveDate":"2013-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[553166,553167,"560237"],"PO":["564316"]},"198766":{"abstract":"This big data project develops tools and algorithms to support users in the task of choosing one (or a few) object(s) from a very large set, particularly when there is a great deal of complex data on which to base this choice.<br\/><br\/>Consider a traveler looking at hotel options on a travel site, a scientist trying to identify proteins to investigate further based upon the results of a high throughput experiment, or an intelligence analyst trying to identify suspected terrorists. In all of these cases we have a big data challenge in that there are likely to be hundreds, perhaps thousands or even millions, of options to choose from. While there are some criteria that can be expressed as simple functions of attribute values, e.g. price for a hotel room, these criteria capture only a part of the objective function. Other considerations, such as stylishness of a hotel, can be much harder to determine as a function of known attributes. The user may be compelled to examine candidate options individually. The computer's task is to help minimize the number of candidates examined, and to optimize the order of examination. This project examines how best to accomplish this task.<br\/><br\/>Techniques explored include supporting human specification of information need against a variety of big data sources and machine presentation of relevant results with the volume of big data. The broader impact of this project is in effectively harnessing the power of big data in a variety of applications, including business, science, and national defense.","title":"BIGDATA: Small: DA: Choosing a Needle in a Big Data Haystack","awardID":"1250880","effectiveDate":"2013-03-15","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":[533266],"PO":["565136"]},"199327":{"abstract":"Recent advances in sensors and high throughput data acquisition technologies have made it possible to collect massive amount of data, and especially time series data in a number of domains (e.g., climate sciences, biological sciences). While a wide range of techniques have been developed for clustering and mining such data, there has been limited progress on scalable algorithms for extracting causal relationships from time series data. This project aims to develop novel machine learning models based on Granger causality to uncover the complex dependence structures from high-dimensional time series. The resulting algorithms will be evaluated in the context of two real-world applications (climate change, computational biology).<br\/><br\/>The project aims to address three fundamental challenges of data analysis from time series data, including: (1) developing the theoretical foundations of causality analysis from time series data to quantify the gap between Granger causality and true causality, (2) developing a unified framework to incorporate different types of domain knowledge in data analysis, and (3) examining effective solutions to important but usually overlooked practical issues, including irregular nature of the time series and scalability. The resulting algorithms will be evaluated on two real applications, i.e., gene regulatory network discovery in immune systems and climate change attribution, by collaborating with researchers in biology and climate science.<br\/><br\/>The proposed research could impact multiple application domains where discovery of causal relationships from high dimensional time series data is of interest. The project is expected to advance the theoretical foundations of data analytic techniques for time-series data and provide a unified framework that can easily integrate domain knowledge. The results of this project can be expected to significantly advance the current state of the art in eliciting insights regarding causal relationships from time series data. In addition to the core research advances, this project contributes easy-to-use software based on workflows for teaching machine learning to students, researchers and practitioners with a broad range of backgrounds. Educational and outreach activities include new interdisciplinary courses, workshops, tutorials, and high-school visits. Software and data resulting from this work will be freely disseminated to the broader research and educational community. Additional information about the project can be found at: http:\/\/www-bcf.usc.edu\/~liu32\/uscTimeSeries.htm.","title":"CAREER: A Novel Framework for Knowledge Discovery from Time Series Data in Biology and Climate Science","awardID":"1254206","effectiveDate":"2013-03-15","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["563325"],"PO":["565136"]},"199019":{"abstract":"This CAREER project aims to advance the state-of-the-art in theory and methods for extracting clusters and graphs from big and dirty datasets arising in modern application domains. Clusters and graphs provide a meaningful representation of the structure of information contained in data, e.g. in neuroscience and health care domains, clustering patients with similar phenotypes and genotypes helps identify target groups for drug design, clustering fiber tracks generated by high-resolution Digital Surface Imaging (DSI) scans of brains help identify significant neural pathways, and graph structures can reflect connectivity between brain regions. The results of this work will significantly enhance the ability to exploit such modern datasets through new methods for learning clusters and graphs from data that is large-scale, high-dimensional, under-sampled, corrupted, and often only available in a compressed or streaming representation. <br\/><br\/>Specifically, this project will develop computationally efficient and principled methods for learning clusters and graphs that can (i) perform unsupervised feature selection to discard irrelevant features in high dimensions, (ii) leverage feedback based on intelligent adaptive queries that focus resources on most informative variables and features, (iii) use compressive measurement design that adapts to the information structure for measurement and computation efficiency, and (iv) be able to handle noisy streaming data. The algorithms will be accompanied with performance guarantees in the form of a precise characterization of the mis-clustering rate and graph recovery error. Additionally, the project will investigate the tradeoffs between number of measurements, computational complexity and robustness in these problems. The methods and theory developed will be evaluated through simulations as well as their applicability to real datasets in neuroscience and healthcare domain, in collaboration with practitioners from these fields. <br\/><br\/>The results of this research could potentially transform many application domains that involve grouping similar variables and learning complex interactions between them, based on big and dirty datasets. In particular, the neuroscience and healthcare applications are likely have very direct and significant implications for society. Accurately mapping neural pathways will help diagnose and treat brain pathologies at an early stage, and help understand brain functioning. Clustering patients and discovering disease spreading pathways based on few measurements of relevant genetic features or indicators could help prevent and cure diseases, and also minimize healthcare costs. The research activities will be tightly integrated with education efforts that aim to develop a diverse workforce that is better equipped with cross-disciplinary tools to address the challenges of modern datasets. The education plan includes development of two inter-disciplinary courses, and enhancement of the joint Statistics & Machine Learning PhD program at Carnegie Mellon University (CMU). Outreach activities include promoting undergraduate research, broadening participation of women and underrepresented groups in STEM fields through OurCS (Opportunities for Undergraduate Research in Computer Science), Andrew?s Leap (a summer enrichment program for area high school and middle school students) and CS4HS program aimed at High School and K-8 teachers at Carnegie Mellon University. The results of this project (including publications, data sets, and software) will be disseminated online at http:\/\/www.cs.cmu.edu\/~aarti\/research_projects\/.","title":"CAREER: Distilling information structure from big and dirty data: Efficient learning of clusters and graphs in modern datasets","awardID":"1252412","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["541682"],"PO":["565136"]},"199218":{"abstract":"Every day, millions of people across the world take photos and upload them to social media websites. Their goal is to share photos with friends and others, but collectively they are creating vast repositories of visual information about the world. Each photo is an observation of how the world looked at a particular point in time and space. Aggregated together, these photos could provide new sources of observational data for use in disciplines like biology, earth science, social science or history. This project is investigating the algorithms and technologies needed for mining these large collections of photographs and noisy metadata to draw inferences about the physical world. The project has four research thrusts: (1) investigating techniques for identifying and correcting noise in metadata like geo-tags and timestamps, (2) developing algorithms for extracting semantic information from images and metadata, (3) creating methods for robust aggregation of noisy evidence from multiple photos, (4) validating these techniques on interdisciplinary applications in biology, sociology, and earth science.<br\/><br\/>The project is laying the foundation for using visual social media as a new source of observational data for a variety of scientific disciplines. The educational component is preparing students for the next generation of \"big data\" jobs through new undergraduate and graduate courses and online instructional materials. Undergraduate students (particularly from under-represented groups) are recruited to participate in the research program and encouraged to pursue scientific careers. An annual workshop is planned to educate general audiences, particularly senior citizens, about data mining and social media. Source code, datasets, course materials, and other results of the project will be disseminated to the public via the project web site (http:\/\/vision.soic.indiana.edu\/career\/).","title":"CAREER: Observing the world through the lenses of social media","awardID":"1253549","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["535947"],"PO":["563751"]},"197975":{"abstract":"The College Board, in collaboration with Duke University and Middlebury College, proposes to extend the developmental work accomplished during the NSF-supported project \"Using Computational Thinking to Model a New Course: Advanced Placement Computer Science Principles (AP CSP I; NSF award #0938336).\" That effort led to the design of a new introductory computing course -- Computer Science Principles (CSP) -- that aims to reach a broad, diverse audience of high school students with rich computer science content and exciting pedagogy, while meeting the rigor and high standards of the AP program. AP CSP will enable students to explore the creative aspects of the field and will provide a solid academic foundation for understanding the deep intellectual and practical contributions of computing. This follow-on project -- Advanced Placement® Computer Science Principles Phase II (AP® CSP II) -- will extend that developmental work by completing all tasks required for deployment of the AP CSP exam during academic year 2016-17. To meet the goal of this project and to support the CS 10K initiative's interest in developing assessments and models of delivery, teacher professional development, and AP support materials, the AP CSP II project will (1) complete the assessment design to support the learning objectives of the AP CSP Curriculum Framework, pilot implementation, and scoring of the computer-based exam, and (2) conduct formative and summative evaluation of AP CSP II activities, with a focus on determining the extent to which the assessment tasks measure the learning objectives and whether the course and various assessments foster participation and success in computer science education, especially among students traditionally underrepresented in computer science.","title":"Collaborative Research: Broadening Participation in Computer Science: AP Computer Science Principles Phase II","awardID":"1246951","effectiveDate":"2013-03-15","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1793","name":"MSP-OTHER AWARDS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7261","name":"PROGRAM EVALUATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7625","name":"REESE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7645","name":"DISCOVERY RESEARCH K-12"}}],"PIcoPI":[531300,"531309",531302],"PO":["561855"]},"196524":{"abstract":"The goal of this research is to develop a new framework to control teams of mobile robots, cooperating in a beamforming fashion, to transmit information between multiple source-destination pairs, while meeting quality-of-service constraints and consuming minimum power. The approach of this project ensures robust communications and longevity in challenging environments, arising during the transmission of high-rate data, such as video or images, or in environments where there is no line-of-sight. It also allows significant performance gains compared to static systems that do not consider mobility.<br\/><br\/>The intellectual merit of this research lies in the development of a cyber-physical system of mobile beamformers, where the physical space of robot trajectories and velocities constitutes an input to the cyber space of wireless communications, and vise versa. Integration of the resulting discrete and continuous dynamics and different time scales requires the synthesis of new theoretical results drawing from control theory, wireless networking, distributed optimization, and hybrid control. This cyber-physical system combines the following interrelated objectives: Distributed control of mobile beamformers; Node selection, grouping and motion scheduling; Rich models of the communication space; Platform deployment and validation.<br\/><br\/>Successful completion of this research will provide these necessary components in facilitating the design of mobile autonomous systems and fostering their adoption. Wide availability of such systems can have a significant societal impact on, e.g., search, rescue and recovery operations, environmental monitoring for homeland security, or surveillance and reconnaissance missions. The broader impact of this project lies on disseminating the research output in the industry and academia.","title":"NeTS: Synergy: Collaborative Research: Controlling Teams of Autonomous Mobile Beamformers","awardID":"1239339","effectiveDate":"2013-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["564068","541930"],"PO":["565303"]},"197977":{"abstract":"The College Board, in collaboration with Duke University and Middlebury College, proposes to extend the developmental work accomplished during the NSF-supported project \"Using Computational Thinking to Model a New Course: Advanced Placement Computer Science Principles (AP CSP I; NSF award #0938336).\" That effort led to the design of a new introductory computing course -- Computer Science Principles (CSP) -- that aims to reach a broad, diverse audience of high school students with rich computer science content and exciting pedagogy, while meeting the rigor and high standards of the AP program. AP CSP will enable students to explore the creative aspects of the field and will provide a solid academic foundation for understanding the deep intellectual and practical contributions of computing. This follow-on project -- Advanced Placement® Computer Science Principles Phase II (AP® CSP II) -- will extend that developmental work by completing all tasks required for deployment of the AP CSP exam during academic year 2016-17. To meet the goal of this project and to support the CS 10K initiative's interest in developing assessments and models of delivery, teacher professional development, and AP support materials, the AP CSP II project will (1) complete the assessment design to support the learning objectives of the AP CSP Curriculum Framework, pilot implementation, and scoring of the computer-based exam, and (2) conduct formative and summative evaluation of AP CSP II activities, with a focus on determining the extent to which the assessment tasks measure the learning objectives and whether the course and various assessments foster participation and success in computer science education, especially among students traditionally underrepresented in computer science.","title":"Collaborative Research: Broadening Participation in Computer Science: AP Computer Science Principles Phase II","awardID":"1246957","effectiveDate":"2013-03-15","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[531309],"PO":["561855"]},"193623":{"abstract":"Diagnosing network and network application faults remains one of the most challenging and frustrating aspects of using the Internet, particularly for non-technical users, but also for system administrators. A single VoIP application may depend on half a dozen protocols, and basic network access requires numerous network elements, from wireless access points to authorization servers, to function. On a larger scale, researchers have only anecdotal evidence of the most common network problems and their prevalence. This makes it difficult to use actual Internet experiences to improve existing protocols and implementations.<br\/><br\/>The project proposes a new architecture and system, \"Do You See What I See\" (DYSWIS), to automate fault finding in residential, mobile, enterprise and data center networks in a systematic, extensible and scalable manner: Using protocol state analysis and packet timing analysis, DYSWIS automatically recognizes when network applications are likely malfunctioning. Leveraging social network graphs, the system finds suitable and mutually-trusting friends whose DYSWIS application can help with finding problems. As necessary, building on a programmable network platform, NetServ, in-network nodes are instantiated and discovered. DYSWIS then attempts to determine the cause of the fault, leveraging network views of other nodes to improve its diagnosis, by remotely invoking active probes at the network, transport and application layer.<br\/><br\/>DYSWIS collects and aggregates statistics about faults and their resolution, allowing researchers and operators to see trends and determine common sources of problems. DYSWIS is designed to be extensible, so that new standardized and proprietary protocols and applications can be added selectively. The project explores how to scale DYSWIS to the Internet, evaluates its effectiveness, and extends it to use a programmable network platform.<br\/><br\/>The project enhances undergraduate and graduate teaching, involves undergraduates in research projects, reaches out to industry and standardization organizations, provides tools and large data sets to researchers, and offers a data gathering platform and data for the benefit of Federal and State telecom regulators.","title":"NeTS: Small: Do You See What I See: Finding and Measuring Faults in the Internet","awardID":"1218977","effectiveDate":"2013-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[518545],"PO":["565090"]},"207181":{"abstract":"The Global Environment for Network Innovations (GENI) is a medium-scale CISE infrastructure project building a national virtual laboratory for network experimentation. However, in addition to the use of GENI as an experimental platform, NSF and the GENI community have long recognized the potential to use it as a platform for innovation in teaching undergraduate networking and distributed systems courses. A workshop on the issues of undergraduate teaching using GENI and other cloud systems was held in conjunction with the fourteenth GENI Engineering Conference (GEC) in Boston, MA on July 8, 2012. One of the findings of the workshop was that \"the first step to redefining undergraduate systems education is to inform educators at a broad cross section of colleges and universities about the resources available to them and their students.\"<br\/><br\/>Every year, ACM SIGCSE (Association for Computing Machinery, Special Interest Group on Computer Science Education) brings together educators and researchers from around the world to present papers, panels, posters, special sessions, and workshops, and to discuss computer science education in birds-of-a-feather sessions and informal settings. The SIGCSE Technical Symposium addresses problems common among educators working to develop, implement and\/or evaluate computing programs, curricula, and courses. This project funds a workshop on use of GENI in the classroom at the 2013 ACM SIGCSE meeting in Denver, Colorado. Since computer systems are the core infrastructure of modern society, the workshop supports maintaining and building a workforce that is able to address critical national needs and exploit new commercial opportunities. The tutorial will occur on Wednesday, March 6, 2013, at the conference venue.","title":"GENI Tutorial at ACM SIGCSE","awardID":"1332340","effectiveDate":"2013-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[554764,554765],"PO":["564993"]},"206181":{"abstract":"The 2013 IEEE INFOCOM Conference on Computer Communications will be held in Turin, Italy, April 14-19, 2013. This preeminent technical conference is the primary venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners in the field. Attending conferences such as INFOCOM is of paramount importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field. This proposal requests funding to support approximately 20 graduate students in the United States to attend this premiere conference. The travel award will target graduate students, in particular, women and under-represented minority students, since attending conferences is an important part of their educational experience, and they often have limited travel funds.","title":"Student Travel Support for IEEE INFOCOM 2013","awardID":"1322696","effectiveDate":"2013-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[551983],"PO":["557315"]},"206074":{"abstract":"This project is to host a workshop focused on identifying frontiers for collaborative research integrating mathematical and computational modeling of human cognition with machine learning and machine intelligence. The workshop will bring together leading researchers who are working at the intersection of the fields. The goal is to initiate dialogue between people working within different computational frameworks, to identify points of synthesis where new scientific insights or breakthroughs are most likely, and to identify gaps and obstacles to collaboration between the two communities. A summary report will be produced that details the products of the discussion, highlighting prospects identified for future collaborative research.","title":"Workshop on Integrating Approaches to Computational Cognition","awardID":"1322079","effectiveDate":"2013-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["565246"],"PO":["563458"]},"206097":{"abstract":"The big question the PIs are addressing in this project is how to unobtrusively track silent reading of novice readers so as to be able to use an intelligent tutoring system to aid reading comprehension. This EAGER project focuses on the first steps in answering that question. This pilot project builds on previous work in vision and speech technology, sensor fusion, machine learning, user modeling, intelligent tutors, and eye movements in an effort to identify the feasibility of using eye tracking techniques, along with other information collected from an intelligent reading tutor, to predict reading difficulties of novice\/young readers. In particular, the work plan includes collecting gaze data in real-world conditions in the context of using the existing Reading Tutor, designing software to display those traces so that accuracy can be guauged, testing gazepoint accuracy and detecting gaze-speech discrepancies, and using that data to develop heuristics for detecting tracking errors in real time and calibrating eye tracking data to noisy school environments, a primary environment where the augmented Reading Tutor would ultimately be used. The intellectual merit of this project is in identifying and addressing challenges in relating children's gaze data to their silent reading, in making technical contributions to calibrating eye trackers so that they can be used in normal everyday applications, and in setting the stage for intelligent tutors across diverse domains to exploit gaze more broadly.<br\/><br\/>The project's most important potential broader impacts is in establishing a foundation for exploiting gaze input to build intelligent computing systems that can be used to help children with reading difficulties learn to read and read to learn. If successful, the PIs will develop a larger project that will extent the successful Project Listen Reading Tutor so that it can track readers as they are reading silently and help them with their comprehension -- both comprehension of text itself and strategies for coming to deep understanding.","title":"EAGER: Pilot Investigation of Using Gaze in a Reading Tutor","awardID":"1322174","effectiveDate":"2013-03-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8020","name":"Cyberlearning: Transforming Ed"}}],"PIcoPI":[551746,551747],"PO":["562669"]},"201060":{"abstract":"This funding renews a highly successful CISE Research Experiences for Undergraduates (REU) site at the University of Illinois at Urbana-Champaign that is focused on parallel computing. The transition to \"parallelism as the default\" will be a change in the computing landscape of the magnitude of the introduction of the Internet. A central challenge in this transition is a shortage of people with expertise in parallelism. This site will train students in the basics of parallel programming, provide them with application-centric research experiences that demonstrate to them the qualitative impact that parallelism can have on computing applications, and help them develop the confidence that they need to be successful in graduate school. The host institution (UIUC) is well known as a center of parallel computing research and will provide an excellent environment for the REU students to learn about the application of parallelism to a range of scientific and computational problems.<br\/><br\/>This site will provide the opportunity for 30 undergraduate students (over three years) to develop essential skills in parallel programming in an application-focused research context and to develop a network of mentors, role models, and peers to inform and advise them about performing research, careers in research, and graduate school. A major motivation for the site is improving the retention of women in the sciences, and the PIs have various strategies for addressing this goal. The PIs will disseminate what they learn about engaging women in computer science research, and will also encourage and facilitate publication by the participating students and their mentors.","title":"REU Site: A Passionate on Parallel-A Summer Research Program","awardID":"1263145","effectiveDate":"2013-03-15","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[539055,"562182"],"PO":["564588"]},"206682":{"abstract":"Oregon Security Day is an annual one-day event at the University of Oregon, focusing on trends and challenges in computer security as faced by industry, academia, and government and targeted to participants throughout the Pacific Northwest and particularly within the state of Oregon. Building on the 2011 and 2012 events, the funding from this grant will support student travel from more remote areas within Oregon to be able to come to Eugene for the event.<br\/><br\/>The Security Day event is an opportunity for students and members of the community to be exposed to trends and new topics in computer security and to discuss ongoing research initiatives. It is also an opportunity to form new collaborations.<br\/><br\/>Exposure to nationally-recognized speakers in security for students and others throughout the state of Oregon, particularly from underserved areas who would not be able to receive this access otherwise, aids in the pedagogical and outreach mission of the university and can be an encouraging factor for more students to consider graduate-level study in the area of computer security.","title":"Oregon Security Day","awardID":"1329307","effectiveDate":"2013-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[553388],"PO":["565327"]},"199191":{"abstract":"In many domains, there is an increasing reliance on Recommender Systems for helping identify products, services and people that meet some user-specified criteria. Given a pool of entities (e.g., movies, books, experts) and an objective function such systems have to identify a collection (i.e., a subset) of entities from the pool that optimizes the objective function. For example, in movie-recommendation systems (e.g., Netflix) the goal is to identify subsets of movies to recommend to registered users. Analogous problems arise in social networks and social media (e.g., Twitter, Facebook), where advertisers need to identify a small set of targets for their advertisements. Finally, project management teams in large organizations often use expertise management systems to identify the subset of experts needed to complete a specific project.<br\/><br\/>Current Recommender Systems suffer from severe limitations in settings where (i) the users multiple interactions with the system over time and the recommendations provided to a specific user at any given time need to take into account the past recommendations given to the same user or (ii) The entities that make up the recommended collections are rational entities, e.g., participants in a social network, or members of a project team, that have their own goals and preferences that influence their behavior as members of the collection. This project aims to address these two shortcomings of current Recommender Systems by designing, implementing, and evaluating combinatorial algorithms for identifying (a) sequences of collections, rather than a single collection and (b) collections of rational entities with individual goals, preferences, or objectives.<br\/><br\/>In addition to developing a suite of novel combinatorial algorithms and heuristics for recommending sequences of collections and collections of rational entities, the project aims to develop and deploy two application-specific testbeds: (i) a personalized meal planner provides to its users weekly meal recommendations to guide them towards healthy eating choices; and (ii) A crowdsourcing platform with support for virtual team formation to allow students registered in some of the courses at Boston University, to form teams online to collaborate on class projects (when appropriate). <br\/><br\/>Broader impacts of this research include: new models and methods that signficantly advance the current state of the art in Recommender Systems, with broad applications in a number of domains including social networks (e.g., LinkedIn, Facebook, etc.), online recommendation systems (e.g., Amazon, Netflix, etc.), and daily-deal sites (e.g., Groupon, LivingSocial, etc.). The project contributes to the education and advanced research-based training of graduate and undergraduate students in Computer Science at Boston University. Wide dissemination of software implementations of the algorithms can be expected to benefit the larger research community.<br\/><br\/>Additional information about the project, including links to project personnel, publications, and software can be found at: http:\/\/www.cs.bu.edu\/~evimaria\/recommendations.html","title":"CAREER: On the identification of collections with complex objectives","awardID":"1253393","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["550882"],"PO":["565136"]},"207056":{"abstract":"This travel grant supports US graduate students to attend the Doctoral Consortium to be held in conjunction with the IEEE International Conference on Automatic Face and Gesture Recognition (FG 2013) to be held on April 22-26, 2013. Attendees include graduate students who are working on their dissertations and have been accepted to the consortium. Each student participant is paired with a senior researcher who serves as his\/her mentor during the conference. Each participant also presents his\/her research at a doctoral Consortium luncheon open to participants and mentors and also presents his\/her research in a poster session open to all attendees of the conference. Graduate students play critical roles in conducting innovative and groundbreaking research. The consortium provides talented young researchers the opportunity to discuss their work formally and informally with both their peers and senior researchers. These interactions with others coming from different research labs with different viewpoints typically strengthen the ability of young researchers to communicate the value of their own work and to set their work more clearly in the broader context of the research field as a whole. The successful career of graduate students would be imperative to advance the state of the art in new algorithms and applications related to face, gesture, and body motion, leading to new capabilities in areas such as biometrics, interactive systems, surveillance, and healthcare.","title":"FG 2013 Doctoral Consortium Proposal for Travel Support for Graduate Students","awardID":"1331619","effectiveDate":"2013-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[554387],"PO":["564316"]},"206035":{"abstract":"The Greater Kansas Area Security Workshop (KanSec) provides a regular forum for researchers and students across Kansas and the neighboring states to present research and educational activities in the field of cybersecurity, and to promote interactions and collaborations. With three NSA\/DHS National Centers of Academic Excellence in Information Assurance Education (CAE\/IAE) and IA Research (CAE\/R) in the State of Kansas, substantial cybersecurity research and educational activities are taking place. KanSec was formed to encourage collaboration despite the geographical remoteness of the area. The first two KanSec workshops, in Spring and Fall 2012 respectively, included over 50 participants each, with about 10 student presentations at each event. The next workshop is scheduled to be hosted at the University of Kansas in the Spring of 2013, and has received inquiries about participation from universities in neighboring states including Oklahoma, Nebraska, and Arkansas. To improve the quality of the workshop and to give students better experiences, KanSec will invite renowned researchers as keynote speakers for future KanSec workshops.<br\/><br\/>This grant supports student travel to the KanSec workshops in spring and fall 2013.","title":"KanSec: the Greater Kansas Area Security Workshop","awardID":"1321908","effectiveDate":"2013-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[551603],"PO":["565327"]},"199193":{"abstract":"While crowdsourcing and human computation methods are rapidly transforming the practice of data collection in research and industry, ensuring quality of the collected data remains difficult in practice and exposes projects relaying on quality of crowdsourced data to significant risk. This reduces the benefits of crowdsourcing for both current adopters and a wider community of potential beneficiaries. Although diverse communities have developed statistical algorithms for quality assurance, the splintered nature of these communities has led to relatively little comparative benchmarking and\/or integration of alternative techniques. Dearth of reference implementations and shared datasets has further abated progress, as have evaluations based on tightly-coupled systems, domain specific tasks, and synthetic data. This project investigates, integrates, and rigorously benchmarks diverse quality assurance algorithms across a range of tasks, data scales, and operational settings. Overall, technical findings are expected to transform current understanding of quality assurance methods for crowdsourcing, including identifying key limitations of the current state-of-the-art in order to focus ongoing research and innovation where it can have the greatest impact. Reference implementations of key algorithms are designed to support reuse, reproducible findings, continual benchmarking, and ongoing progress. Project will yield new, sanitized public datasets to support ongoing community benchmarking and shared-task evaluations.<br\/><br\/>Technical contributions from the project are expected to offset risk of growing social inequity as online, distributed work becomes increasingly prevalent. Assumptions that crowdsourcing workers are unreliable or interchangeable limit the complexity and scope of work which can be successfully accomplished with online crowdsourcing. By limiting the amount of work available online and opportunities for skilled work, this further restricts the range of upward economic mobility achievable via crowd work. By developing effective methods to measure work quality over time and identify trusted workers, it will be possible to differentiate, recognize, and reward quality work to promote merit-based economic mobility. Educational activities include a new crowdsourcing course designed for college freshman from diverse backgrounds, a graduate seminar integrating the project's research software, presentations to the student chapter of a professional society, and tutorials and short courses benefiting industry practitioners and researchers. This project will inform the principal investigator's community advisory and organizational activities, including Advisory Board service for an annual industrial conference and organizing workshops bringing the industry and research communities together. Information and results will be disseminated via the project web site (http:\/\/ir.ischool.utexas.edu\/career\/).","title":"CAREER: Achieving Quality Crowdsourcing across Tasks, Data Scales, and Operational Settings","awardID":"1253413","effectiveDate":"2013-03-15","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[534302],"PO":["563751"]},"206642":{"abstract":"RECOMB2013: 17th International Conference on Research in Computational Molecular Biology<br\/><br\/><br\/>The RECOMB Conference Series (http:\/\/www.recomb.org\/) was founded in 1997 by Sorin Istrail, Pavel Pevzner, and Michael Waterman to provide a scientific forum for theoretical advances in computational biology and their applications in molecular biology and medicine. Previous RECOMB conferences have been held annually in North America, Europe, and Asia. <br\/><br\/>RECOMB 2013 is the seventeenth in a series of well-established scientific conferences bridging the areas of computational, mathematical, statistical and biological sciences. The conference features 6 keynote talks by preeminent scientists in life sciences, including Scott Fraser (USC and Caltech, Imaging), Takashi Gojobori (Japan, comparative genomics), Deborah Nickerson (U Washington, Exon sequencing), Nadia A Rosenthal (Monash University, Australia, Stem cell), Chung-I Wu (U Chicago, evolutionary genomics), and Xiaoliang Sunny Xie (Harvard, single molecule). The conference will also feature 32 state-of-art scientific presentations selected from 167 submissions. The topics cover essentially every aspect of computational biology and bioinformatics, plus emerging areas such as molecular imaging and single molecule sequencing. There will also be 5 highlight talks selected from 47 submissions that are published in year 2012 up to 02\/10\/2013, plus about 200 poster presentations. <br\/><br\/>The conference attracts research contributions in all areas of computational molecular biology, including but not limited to: molecular sequence analysis; recognition of genes and regulatory elements; molecular evolution; protein structure; structural genomics; analysis of gene expression; biological networks; sequencing and genotyping technologies; drug design; probabilistic and combinatorial algorithms; systems biology; computational proteomics; structural and functional genomics; information systems for computational biology and imaging.<br\/><br\/>The many events at RECOMB provide an excellent way for students to be exposed to new and exciting research areas, and learn of cutting-edge advances in their own research areas and beyond. Furthermore, students will have ample opportunity to meet leading researchers in both informal and formal settings. Thus, the attendance of RECOMB2013 will benefit the students greatly for their career development.","title":"Student Support for Recomb 2013","awardID":"1328201","effectiveDate":"2013-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":[553259],"PO":["565223"]},"199173":{"abstract":"The proposed work focuses on developing resource-adaptive distributed estimation algorithms for teams of micro aerial vehicles (MAVs). Among the several challenges one faces when designing estimators for MAV teams, the most important one is the stringent resource limitations of MAVs. While in any engineered system the resources are inevitably finite, cost, power, and weight considerations make the limitations particularly strict for teams of small MAVs. In this work, we will develop a rigorous, optimization-based framework for the design of estimation and inference algorithms, as well as for the design of the MAV platforms themselves. Our approach will yield distributed estimators capable of optimally allocating the sensing, processing, communication, and energy resources of an MAV team. The methods to be developed will lead to efficient design tools, and will permit a systematic study of the tradeoff curves between MAV resource availability and estimation performance.<br\/><br\/>The algorithms and theoretical results that will result from this effort will dramatically increase the capabilities of MAV teams, in domains ranging from scientific exploration to search-and-rescue operations. In turn, these systems will yield benefits that will directly impact our lives, from advancing our state of scientific understanding to saving humans in disaster sites. Additionally, the proposed research plan will create opportunities for both graduate and undergraduate students from UC Riverside's diverse student body to conduct meaningful research. Undergraduate students will be recruited to work on new MAV designs, and it is anticipated that such an involvement will increase the likelihood of them pursuing a graduate education. Moreover, as part of an integrated outreach program, we will leverage the nature of the proposed research (flying robots capture the imagination of young minds) to inspire and recruit underrepresented minority students to science and engineering. These efforts will aid in closing the educational attainment gap for underrepresented groups.","title":"CAREER: Resource-adaptive distributed estimation for teams of micro aerial vehicles","awardID":"1253314","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["549258"],"PO":["534411"]},"203288":{"abstract":"Modern long-haul optical networks are capable of carrying a wavelength of light (a lambda or an optical circuit) and its associated bit stream thousands of kilometers without regeneration, conversion from an optical signal to an electrical one and back again (OEO). This long-haul technology has substantially reduced the cost of optical systems since OEO regeneration has traditionally been expensive. It has also offered the (as yet unrealized) promise of running multiple data formats. However, when two lambdas of the same wavelength need to be inserted onto the same optical fiber at least one of them must undergo OEO in order to change its wavelength. This is called wavelength interchange. The problem of routing and wavelength assignment (RWA) to minimize the number of wavelength interchanges has been deeply studied.<br\/><br\/>This project will study a different question: what types of topologies minimize the need for wavelength interchange? This question is expected to lead to graph properties that minimize the need for wavelength interchange in physical networks. By taking a different approach to understanding the minimization of wavelength interchange the project couples the RWA problem to issues of network design. In turn this allows questions of network resilience to be coupled to questions of optical-layer design. <br\/><br\/>Long-haul optical networks are a foundational element of the modern economy. Both network cost minimization and network flexibility and resilience are concerns affecting our national interests.","title":"Finding WDM Network Topographies that are Nonblocking without Wavelength Interchange","awardID":"1307643","effectiveDate":"2013-03-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[544700],"PO":["564993"]},"199142":{"abstract":"While existing cloud services reduce the application development time, data management applications still require significant effort by cloud tenants, for often their deployment involves a number of challenges including performance monitoring, resource provisioning and workload allocation. These tasks strongly depend on application-specific performance objectives, therefore developers often rely on ad-hoc solutions for addressing them. However, such solutions eventually hinder the application's implementation and maintainability.<br\/><br\/>This proposal is developing declarative mechanisms that allow application developers to express custom performance criteria for data processing tasks and exploits the properties of these mechanisms to design extensible resource, workload and Service-Level-Agreement (SLA) management services for cloud databases. The project also includes the design and development of an extensible cloud-based service platform, named XCloud, which unifies these services into a usable cloud utility.<br\/><br\/>The expected results include the design of declarative interfaces for the specification of performance criteria and performance models. Subsequently, by building upon properties of these interfaces, it will result in new extensible services for resource provisioning, workload allocation as well as in the support of customizable application-based SLAs for cloud databases.<br\/><br\/>The above results will have a significant impact on the quality of cloud-based data management applications. XCloud will allow developers to declaratively incorporate existing performance modeling techniques. The combination of declarative specifications and customizable modules will allow XCloud to act as a test-bed for new performance models for cloud databases, as well as QoS-driven approaches for workload, resource and SLA management, facilitating research and innovation in this emerging domain. Finally, the research of this proposal will be integrated into the development of courses and research projects for both graduate and undergraduate students providing them with background on the fundamentals and practices of building web information systems and cloud data services.","title":"CAREER: Towards Extensible Performance Management for Cloud Data Services","awardID":"1253196","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[534198],"PO":["563727"]},"199296":{"abstract":"This project seeks to unify the capability of full duplex (FD) communications and multi-input multi-output (MIMO) communications to allow a flexible way of using the available RF chains to increase the capacity and reliability of wireless networks. Recent advancements in multi-antenna wireless systems have allowed wireless nodes to use either all of their antennas for transmission (or reception), or to use half of them for transmission and the other half for reception. The first system is called a MIMO system and the latter is called a full duplex system. Traditionally, MIMO and full duplex have been seen as competing technologies. This research shows that they can be combined in innovative ways to fundamentally increase the capacity of a wireless link compared to the case when they operate separately. This combination allows a node to dynamically allocate radio resources for transmission and reception. It further shows that informing routing and scheduling protocols about this flexible radio resource feature can significantly improve network capacity. The research proposes innovations in the hardware, protocols and software needed in the current wireless network architecture to achieve significant network-wide capacity increases. Thus, this research will produce highly flexible radios that will combine full duplex and MIMO. This flexibility will allow future wireless nodes to dynamically allocate radio resources for simultaneous transmissions and receptions. Second, it will develop MAC and network layer protocols that can fully reap the benefits of this flexible system. Third, it will develop a new network simulator that incorporates the fundamentally new wireless features proposed by this research so that advanced network protocols can be effectively and more realistically studied.","title":"CAREER: Together We Rise: A Unified Multi-Input Multi-Output (MIMO) - Full Duplex Network Architecture","awardID":"1254032","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["542040"],"PO":["557315"]},"199594":{"abstract":"CIF21 DIBBs: Conceptualization of the Social and Innovation Opportunities of Data Analysis<br\/>This proposal presents an opportunity to work on the problem that scientists have access to continuously growing data repositories across economic and geographic boundaries. However, both individual innovation and the formation of rich collaborations still rely on traditional research and social mechanisms. While virtual organizations help with access to data environments among groups, members must still proactively seek to collaborate. The difficulty of sharing analysis tools, and the lack of understanding of how such tools are used, create friction that impedes extracting the greatest benefit from data and its usage. If the scientific community can formalize collection of User Data Interaction (UDI) data and develop actionable characteristic behavior patterns from it, the friction can be relieved and scientists can be connected in behaviorally meaningful ways that are not currently imagined. In this proposal is discussed the opportunity for working on the problem. Data is the lifeblood of science. Recent funding opportunities have fueled support for uploading, archiving, and managing data in more formal and standard ways. However, the actual use of data through data exploration tools is still a highly variable process. Interactive data exploration tools provide the opportunity to record researcher interactions during the exploration process. The pattern of interactions such users undertake while searching, exploring, and using data is a largely unexploited opportunity for new connections and new learning that could help researchers identify useful exploration modes or gaps, and even new collaborative partners that could increase interactions and innovation. Such data about how users explore data are here termed, ?User-Data Interaction (UDI) Data.? Creating cyberinfrastructure building blocks to support a standard for collecting UDI Data, community development of data exploration tools, and the exploration of UDI data could fundamentally change the practice of science and engineering. Having such data and analysis tools hosted within a shared cyberinfrastructure could also allow for unprecedented study of their use and effectiveness.<br\/>The goal of this conceptualization research will be to define an implementation project for the DIBBs program. To achieve this goal, the approach will be to understand the kinds of data analysis tools that various user communities currently use, those that they would like to create and share, and to explore the ensuing UDI data that could be collected and leveraged. A data source will be characterized as any service into which a user can specify a query and receive a semi-structured result. By way of example, this may include an online database with which users interact through forms, a graphical interface to a data cube, or even an online simulation tool. The proposing team has access to three such toolkits in use by thousands of users today (Rappture Toolkit, iKNEER, and DataView) to study as sources of analysis tools and UDI data. Specifically, access to the developers of these systems will provide information about how such systems could generate UDI data and what its important features may be. Having built an understanding from active communities and small group discussions, the final step of information gathering will be two larger discussions held in conjunction with two events: HUBbub 2013 and an NSF S2I2 conceptualization project meeting. The Intellectual Merit: This research will identify the social and technological roadblocks to sharing data analysis tools, and the transformational potential of UDI data. The intellectual merit of this activity will be an evidence-based blueprint for a cyberinfrastructure environment that will automatically gather UDI data, develop patterns from those data, and facilitate amplified discovery and collaboration based on those patterns in a way that acceptably balances efficacy and privacy. Collaborations will increase and will be of greater substance. Broader Impacts: This work will pave the way for new scientific connections among researchers, educators, and students that will accelerate research and innovation. The difficulties that underrepresented groups inherently face in traditional methods of establishing scientific collaborations will be bridged by an implementation of the proposed work, allowing everyone to connect to tools and other researchers?not solely by established reputation, but based on their interactions with data. Because the work is not specific to one virtual organization or data tool, it will have a broad reach across diverse scientific communities that use data and data analysis tools.","title":"CIF21 DIBBs: Conceptualization of the Social and Innovation Opportunities of Data Analysis","awardID":"1255781","effectiveDate":"2013-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":[535138,535139,535140,535141],"PO":["565292"]},"199242":{"abstract":"Over the past several decades, computer system performance has grown exponentially, enabling progress on key problems in science, engineering, health, and other areas. Owing to power, heat, and wire length limitations, however, microprocessors are now adding more, instead of faster, cores with each successive generation. As a result, general-purpose software must become more concurrent to see continued performance gains. Unfortunately, writing and debugging shared-memory concurrent software is notoriously difficult. A key problem is that most shared-memory programming languages and software systems do not provide good support for correct concurrent execution. They lack such support because all known approaches are impractical. This project aims to provide practical support for concurrency correctness in commodity systems. It develops low-overhead, software-only approaches that execute on existing commodity hardware. These approaches help programmers write and debug more reliable, scalable software, and to make software more reliable automatically by eliminating whole classes of errors. These benefits have the potential to enable society to continue to rely on software systems for increasingly complex, critical tasks. Furthermore, the project includes educational and outreach activities that help educate students in concurrent software systems, enhance dissemination of the ideas and outcomes, and broaden participation in computer science.<br\/><br\/>The project develops practical, always-on dynamic checking and enforcement of key concurrency correctness properties: atomicity, sequential consistency, and multithreaded determinism. Existing approaches are impractical because custom hardware-based approaches are unrealistic, and software-based approaches slow programs unacceptably. The project builds on preliminary work on an efficient concurrency control mechanism that elides expensive synchronization from non-conflicting accesses, which are the vast majority of accesses. Developing new analyses and systems presents significant new challenges, both to apply the novel concurrency control mechanism and to make other aspects of these analyses and systems efficient enough for production systems. For example, precise conflict detection must track prior accesses and contend with imprecision inherent to the concurrency control mechanism. The project aims to make the analyses and systems both practical and flexible, which requires systematically investigating how to reduce the costs of conflicting and non-conflicting accesses. Expected contributions are the first practical always-on atomicity checker, the first practical multithreaded record & replay system, the first practical sequential consistency checker, and the first practical system providing multithreaded system determinism. In addition to broader impacts, the contributions have the potential to enable new research on efficient software-based analyses and systems that support concurrency correctness.","title":"CAREER: Practical Language and System Support for Reliable Concurrent Software","awardID":"1253703","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[534400],"PO":["564588"]},"199275":{"abstract":"This project investigates the problem of scheduling the processing of collections of streams of medical sensor data, with a goal of providing high-confidence per-packet service guarantees that are robust to variability in the stream generation and concomitant changes in the loads at the distributed set of resources where streams are processed. Given the NP-Hard complexity of optimal stream scheduling and the need to handle streams that are stochastic in nature, the service guarantees are probabilistic. The approach makes use of statistical and machine learning techniques, harnessing a mix of application-independent and application-dependent features to adaptively orchestrate stream processing over a collection of resources with dynamic utilization profiles while retaining the ability to prioritize processing under heavy load, for multiple concurrent applications. Data from clinical and assisted living settings are used to evaluate the efficacy of solutions.<br\/><br\/>Health care and homeland security can benefit from this research, as well as experimental science. Skyrocketing healthcare costs have coincided with the proliferation of electronic monitoring devices in medical and assisted living environments, which generate data streams of patient data. Timely monitoring and analysis of these streams can detect emergencies early and improve patient outcomes, but failure can be fatal. Improvements in the efficiency and robustness of automated medical data stream processing translate to lower costs and improved outcomes. There are analogous opportunities in homeland security, where chemical and biological sensor data must be processed in real-time for threat evaluation. Open-source software produced as part of this research, which can be configured over an arbitrary number of machines to process a large number of streams in a variety of settings, lowers entry barriers for scientists who need to process observational data in their applications. The project will also provide educational opportunities for students, and middle school outreach activities targeted at improving assimilation of mathematical concepts among Native American students.","title":"CAREER: Robust Processing of Data Streams in Real Time","awardID":"1253908","effectiveDate":"2013-03-01","expirationDate":"2018-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[534466],"PO":["564778"]}}