{"1331":{"abstract":"In computational studies of intelligent behavior several phenomena have been isolated, among the most important of which are learning, reasoning, and planning. Obstacles that have been found pervasive are that the formalization of the various phenomena are often inconsistent with each other, and, even more often, that they are computationally intractable. This main thrust of this research project is to develop a computational framework and some algorithms that would comprise a unified approach to this problem area. The proposed starting point is the idea that the concept of probably approximately correct (PAC) learning provides a quantitative criterion on the behavioral performance of a system. These analytic methods used in computational learning theory, are extended to a wider class of phenomena, including various notions of reasoning and planning.","title":"Computational Rationality","awardID":"9504436","effectiveDate":"1995-09-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["438597"],"PO":["150516"]},"1232":{"abstract":"The goals of this continuing research project are to identify primitive operations in parallel and distributed computation, and to establish tight bounds on their complexity. Within this general framework, emphasis is placed on: (i) The design and analysis of algorithms for REALIZABLE models of parallel and distributed computation; (ii) the development of techniques that are applicable for a wide range of computational models and problem variations; (iii) the analysis of `simple` classes of algorithms which are easy to implement. This project concentrates on the following areas: (a) normal hypercube algorithms; (b) sorting networks; (c) list ranking; (d) algorithms for distributed networks, in particular, for the dynamic asynchronous network model; and (e) multiple-resource scheduling.","title":"Theory of Parallel and Distributed Computation","awardID":"9504145","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518067"],"PO":["150516"]},"2695":{"abstract":"Traditional databases capture only the most current data (snapshot) of the modeled reality. While snapshot information is enough for a number of applications, it is not sufficient for applications that require past and\/or future data. Instead, a bitemporal database is needed, i.e., a database that supports both valid time (the time when an event was valid in the modeled reality) and transaction time (the time when the database was updated). While much research has been performed recently on access methods that support transaction time, not much has been done for bitemporal indexes, i.e., methods that support both transaction and valid time on the same index structure. The objective of this project is to design efficient access methods for bitemporal databases. A novel approach is used that reduces bitemporal queries to problems of partial persistence for which efficient access methods are then designed. Various basic bitemporal queries are addressed, like the bitemporal pure and range timeslice queries. Concurrency and recovery issues for the new access methods are examined. In addition, the migrati on of bitemporal data to a three-level storage architecture is examined. The results of this project will enhance the efficient implementation of temporal database management .","title":"Access Methods for Bitemporal Databases","awardID":"9509527","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["543515","70486"],"PO":["563751"]},"1012":{"abstract":"This research addresses problems in in two major areas: (1) Theorem Proving: Automated deduction is being used to derive mathematical theorems whose proofs would not be feasible without computer assistance. Two facets of this research are: 1a. Search Strategies. This is part of a continuing effort to improve current theorem proving technology. Specific investigations involve: generation, model generation, and linked resolution. 1b. Specific Theorems. New areas of application are being sought out, and well- known open problems involving single axioms for groups and the Robbins algebra problem are being studied. These two facets are closely related. Improvements in theorem prover technology can be applied to proving better theorems. Conversely, proving new theorems gives a way of demonstrating the power of the technology, and failed attempts to prove a theorem can suggest ways in which the technology can be improved. (2) Verification: Here, one uses a computer program to verify existing mathematical theorems. One goal is to develop verification systems far enough so that they could be used as referees for mathematical papers. Concentration is on: (a) The Boyer-Moore prover. This works finitistic mathematics, and is probably the best known existing verification system. The current system includes the ability to do induction on the ordinal epsilon_0. Extensions of this prover are being examined, with an eye to allowing induction on larger ordinals. (b) A prover for set theory. Within axiomatic set theory (ZFC), one can develop all of mathematics. A verification system based on ZFC is being designed. This system will borrow features already used in the Boyer-Moore prover and other systems, but major new problems will be addressed. One problem is how to encode meta-rules, such as the scheme for transfinite induction. Another is how to allow the user to extend the system by adding type declarations (corresponding to informal mathematical statements such as ``from now on, x,y,z will represent real numbers'').","title":"Automated Deduction in Mathematics","awardID":"9503445","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["270742"],"PO":["187585"]},"1023":{"abstract":"IRI-9503476 Loui, Ronald Washington University $59,345 - 12 mos Presentation Tools for Argumentative Discourse Good reasoning and argument is necessary for writing, thinking, and arguments. In the hypertext and visual language domains, presentation tools are developed for arguments and design rationales. This project focuses on research on tools for the presentation of arguments and for the support of argumentative communications among humans. In the thirty years after Toulmin, there have been advances in the philosophical and logical communities on the understanding of non-demonstrative and defeasible arguments. With applications to the legal domain, the computer study of these argumentative communications becomes useful.","title":"Presentation Tools for Argumentative Discourse","awardID":"9503476","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["29335"],"PO":["495796"]},"8657":{"abstract":"","title":"Graduate Research Fellowship Program","awardID":"9553556","effectiveDate":"1995-09-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}}],"PIcoPI":["32593"],"PO":["89987"]},"2795":{"abstract":"IRI-9509914 Whinston, Andrew University of Texas-Austin $73,475 - 12 mos Economic Issues for Electronic Commerce This research is to study issues of electronic commerce, focusing on electronic data interchange, advertising, and virtual stores. The main objective is to provide a general approach to manage and analyze the potential economy consisting of users of the network services and the service providers, leading to an implementable pricing tool for communications networks. The first phase will enhance the existing simulation models by developing additional mechanisms for providing better predictions of waiting times. These additional mechanisms include: (1) approximating queuing mechanisms for computing prices, (2) developing guidelines to set parameters automatically, (3) adding functionality to simulation subroutines, (4) automating some sampling subroutines, (5) performing testing, (6) developing computing tools for the pricing scheme. The second phase will implement pricing mechanism on LANs and building a simple user interface with the ability to query, optimize costs, and present results in an appropriate format. At the server level, software agents will be developed to respond to user queries and perform estimation and pricing calculations. The third and final phase of the project intends to develop the complete final priority pricing mechanism for the Wide Area Network environments.","title":"Economic Issues for Electronic Commerce","awardID":"9509914","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["521736","281653"],"PO":["495796"]},"5732":{"abstract":"ABSTRACT: 9526358, Rochester Institute of Technology, \"GOALI: Modulation Codes for Multiamplitude Recording Channels\", PI-McLaughlin: This research is in the area of high density high data rate optical recording. The optical recording technology receiving the most attention is magneto-optics. While magnetic-optic drives are among the highest performing in both storage capacity and data transfer rate, their performance is limited. In particular no commercially available high data rate (>40 Mbits\/sec) digital recording system using a single head magneto-optic (or magnetic or optical) disk exists. An optical recording technology known as electron trapping optical memory (ETOM) developed by Optex will be capable of providing single head data transfer rates in excess of 100 Mbits\/sec. The ETOM material allows one to store multiple signal amplitudes on the media as opposed to conventional saturation magnetic or optical recording. This project is a joint Optex and RIT project in the development of modulation codes for the multiple amplitude recording channel. The codes considered include both runlength limited and partial response techniques. The principal investigator will spend time at Optex.<br\/>*****************************************************************************<br\/>Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communications Research and Infrastructure<br\/>National Science Foundation","title":"Modulation Codes for Multiamplitude Recording Channels","awardID":"9526358","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[14054,"386026"],"PO":["40607"]},"6601":{"abstract":"This workshop integrates the design disciplines into the development of easy to use electronic systems and the assessment of the critical nature of their perceptual quality, intuitive user relationships, and overall impact and value. The multidisciplinary workshop team, including researchers and practitioners from design, engineering, computer science, education, library science, the social and behavioral sciences, and fine art, consider the design and development of the interfaces, tools, services, and overall systems necessary for success. The goals are a framework for understanding the creation and cultivation of the Schools of Design for the Information Age, with Ph.D. level research agendas (such as Crticial Theory, Evaluation and Measurement Theory, Semantics, and Design Methods), and initial plans for such schools.","title":"Workshop on Integration of Design Disciplines in Information Systems","awardID":"9529141","effectiveDate":"1995-09-01","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[16191,16192],"PO":["183208"]},"4786":{"abstract":"TITLE: Parallel Processing Using Optical Interconnections (MPPOI); TITLE: San Antonio, Texas; October 23-24, 1995 Melhem This award supported travel of nine students and two minority and women faculty members to the Second Conference on Massively Parallel Processing Using Optical Interconnection in San Antonio, Texas, October 23-24, 1995.","title":"A Travel Support Grant for the Conference of Massively Parallel Processing Using Optical Interconnections (MPPOI); San Antonio, Texas; October 23-24, 1995","awardID":"9521486","effectiveDate":"1995-09-01","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["533851"],"PO":["150516"]},"1288":{"abstract":"Sequential decision tasks appear in many real-world domains, including control, resource allocation, routing, and scheduling. The objective of this project is to develop a new approach to sequential decision making based on symbiotic evolution of neural networks. In symbiotic evolution, a population of neurons are evolved with genetic algorithms to cooperate and form decision-making networks. Diversity is maintained in the population as part of the task and the system can find good solutions efficiently even in difficult tasks with sparse reinforcement. In the proposed project, symbiotic evolution will be analyzed both theoretically and experimentally, the algorithm will be further developed and applied to complex real-world domains such as local-area network management, and a practical high-level interface will be developed that will allow rapid application of the method to new domains. The main scientific contributions of the research are expected to be: (1) a novel, powerful method for extracting and encoding problem-specific knowledge automatically for sequential decision making, and (2) a thorough understanding of the role of diversity and cooperation in genetic algorithms. The development of the general application interface should also benefit many practical fields, including control engineering, military science, and operations management. The main hypotheses to be tested are: (1) Pattern recognition and generalization capabilities of neural networks can be used to implement effective and robust sequential decision making strategies;(2) Genetic algorithms can discover powepful problem-specific decision-making strategies even under sparse reinforcement; 3) By making population diversity an essential part of the task, symbiotic evolution can develop solutions to harder problems and do it more efficiently than standard genetic algorithms.","title":"Symbiotic Evolution of Neural Networks in Sequential Decision Tasks","awardID":"9504317","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["408627"],"PO":["565227"]},"5534":{"abstract":"IRI-9525790 Chen, Hsinchun University of Arizona $200,755 - 36 mos Concept-based categorization and search on Internet: a machine learning, parallel computing approach The research is grounded on automatic textual analysis of Internet documents and (homepages) attempts to address the Internet search problem by first categorizing the content of Internet documents and subsequently providing semantic search capabilities based on a concept space and a genetic algorithm spider (agent). As a first step, a multi-layered neural network clustering algorithm employing the Kohonen self- organizing feature map categorizes the Internet homepages according to their content. The category hierarchies created could serve to partition the vast Internet services into subject-specific categories and databases. After individual subject categories have been created, domain-specific concept spaces (graphs of terms and their weighted relationships) are generated for each subject category. The concept spaces can then be used to support concept-based information retrieval, a significant improvement over the existing keyword searching and hypertext browsing options for Internet resource discovery. Lastly, using homepages in each subject category, a genetic algorithm client-based \"spider\" (agent) that can perform a global, stochastic search on the Internet based on individual searchers' preferences will be developed. While focused on Internet, the concepts and results of this research are expected to be generally applicable in other networked environments.","title":"Concept-Based Categorization and Search on Internet: A Machine Learning, Parallel Computing Approach","awardID":"9525790","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["548216"],"PO":["495796"]},"6513":{"abstract":"ABSTRACT CTS-9528866 John Foss Michigan State University A Workshop: Fluid Flows\/Fundamental Automotive Issues will be held at Michigan State University on August 20-22, 1995. The topical focus areas are: 1) external aerodynamics, 2) under-hood cooling, 3) climate control flows, and 4) induction\/exhaust system flows. The specific objectives are delineating the: 1) basic research efforts which should be pursued to contribute to the pre- competitive knowledge base in each of the four topical areas, and 2) operating procedures which will permit useful interactions between academic r researchers and industrial colleagues. A general objective of the workshop: to bring together members of the industrial and the academic communities to explore common interests, will be met by its organizational structure. Specifically, the designated co-chairs for the four breakout sessions will be selected from these two communities, and the general attendees will be invited from the two communities. There are, built into the program, formal and informal opportunities to effect the contacts that can be expected to lead to appropriate cooperative efforts. Joint support has been arranged from the Chrysler Corporation, Ford Motor Company, and General Motors Corporation. In addition, The Automotive Research Initiative of Michigan State University will contribute to the support of the workshop.","title":"Conference on Fluid Flows\/Fundamental Automotive Issues","awardID":"9528866","effectiveDate":"1995-09-01","expirationDate":"1995-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["135431"],"PO":["77676"]},"6337":{"abstract":"9528276 Cogger Cornell University requests funding for research and development in the area of ATM over low-cost media. In particular, they will explore \"Cells in Frames,\" the transport of ATM over ethernet media. Initial investigations made them confident that the concept is workable and would be highly beneficial. With industry partners, Cornell will develop a prototype network, large enough for a significant demonstration, which will include low cost CIF access devices and diverse end system environments. They will test its effectiveness and develop prototype applications.","title":"Cells - In - Frames","awardID":"9528276","effectiveDate":"1995-09-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["507658","32414"],"PO":["121202"]},"1992":{"abstract":"ABSTRACT: NCR-9506681, William Marsh Rice University, Algorithms and Architectures for Channel Estimation and Multiuser Detection in CDMA Communication System, PI-Behnaam Aazhang and Joseph R. Cavallaro: There are three major problems in using multiuser detection for the next generation cellular CDMA networks: estimation of the signal and channel parameters, real-time hardware implementation of multiuser estimation and detection algorithms, and system adaption to changes in the network. This project addresses the development and concurrent implementation of algorithms for channel estimation and data detection in a multiuser environment. The objective is to find computationally efficient algorithms that are near-far resistant, are capable of tracking slowly varying channels, and can be extended to systems with antenna arrays. An integral part of the project is the implementation of these algorithms. The mapping of the algorithms onto parallel architectures, particularly using standard DSP processors in combination with custom VLSI co-processors will be studied. The project combines developments in multiuser communications with developments in DSP and VLSI to provide practical solutions for problems in CDMA communications. ***************************************************************************** Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communications Research and Infrastructure<br\/>National Science Foundation","title":"Algorithms and Architectures for Channel Estimation and Multiuser Detection in CDMA Communication Systems","awardID":"9506681","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["542042","50058"],"PO":["150411"]},"2389":{"abstract":"ABSTRACT: NCR-9508282, University of Southern California, \"Algorithmic Theory of Universal Source Coding with a Fidelity Criterion and Related Topics\", PI-Zhang: This project addresses the question \"Can one design an on-line universal sequential source coding algorithm for lossy source coding?\" What is meant by an on-line universal sequential lossy algorithm is that such an algorithm is sequential, achieves in one pass the rate-distortion limit, and has a short delay, good adaptivity, and relatively low coding complexity, so that it is suitable for on-line implementation. It will be necessary to study the basic properties of a universal lossy source coding algorithm, and this will require the development of systematic methods for algorithm analysis such as the analysis of the redundancy of an algorithm, the analysis of the robustness and coding complexity of an algorithm and other topics.<br\/>*****************************************************************************<br\/>Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communications Research and Infrastructure<br\/>National Science Foundation","title":"Algorithmic Theory of Universal Source Coding with a Fidelity Criterion and Related Topics","awardID":"9508282","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["554954"],"PO":["150411"]},"2026":{"abstract":"Given an existing software system and a task to accomplish, software engineers decide whether and how to proceed based on experience, judgment, and system-specific knowledge. For even modest-sized software systems, there is a substantial risk of making poor decisions because it is difficult (if not impossible) for software engineers to maintain adequate knowledge of the source. To manage this risk, engineers often use high-level models to focus on particular aspects of the system relevant to the task. These models help the engineer reduce risk only if they are sufficiently accurate representations of the actual system. This research investigates an approach that may help engineers determine whether their task-specific models are good enough to make informed decisions. An engineer defines a high-level structural model appropriate for the task at hand and also specifies how the model maps to the source. A tool then computes a reflexion model that shows the engineer where the high-level model is consistent with and differs from the source. Analyzing the reflexion model and applying personal experience and judgment, an engineer can then assess the risk of proceeding with the task. In some cases, especially when there are unexpected inconsistencies between the model and the source, computation of additional reflexion models may be needed before an informed decision can be made. This project concentrates on two activities intended to determine whether reflexion models genuinely help improve our ability to effectively engineer software. The first activity focuses on specific enabling technical problems related to reflexion models. The second activity consists of case studies with industrial partners. Kevin J. Sullivan, University of Virginia participates through a research subcontract.","title":"Reflexion Models: Bridging the Gap Between Source and High-Level Models","awardID":"9506779","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["450771"],"PO":["150697"]},"6514":{"abstract":"The goal of this interdisciplinary workshop is to discuss state-of-the-art and future research directions in workflow and process automation involving information systems. There is significant recent commercial activity on developing workflow tools as well as significant interest in this topic in several fields of computer science. However, the current commercial systems are not poised to exploit even much higher market potential for workflow technology that can support information processing applications within and across enterprises. Guided by an interdisciplinary program committee, the workshop provides a forum for identifying synergy among experts working on the topics of workflow and process automation in information and database systems, distributed computing, and software engineering (including computer supported cooperative work, software process modeling, component-based software development, and business process reengineering). The workshop is expected to cover state-of-the-art in current research and technology, real-world application requirements, existing and emerging standards, and ba sed on these project the future research and development directions. Workshop results will be made broadly available through an NSF report, ACM-SIG\/IEEECS-TC publications, and by electronic means. The report will identify the complementary technical issues that are being studied or should be further researched, to enhance information systems that can incorporate intra- and inter-organizational workflows to support information processes in a variety of enterprises in an effective and efficient manner.","title":"Workflow and Process Automation in Information Systems: State-of-the-Art and Future Directions","awardID":"9528870","effectiveDate":"1995-09-15","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["560054"],"PO":["563751"]},"6569":{"abstract":"This award supported travel expenses for student participants in CONCUR '95 -- the Sixth International Conference on Concurrency Theory, held August 21-24, 1995, in Philadelphia on the campus of the University of Pennsylvania. The purpose of CONCUR '95 was to bring together researchers, developers, and students from academia, industry, and government so that the science of concurrency theories and the technology of their applications can be advanced. The conference spans all areas of semantics, models, logics, and verification techniques for concurrent systems. Particular topics include, but are not limited to, process algebras, Petri nets, true concurrency, shared-memory and message-passing formalisms, operational and denotational semantics, programming language semantics, concurrent logic and constraint programming, fairness, temporal logics, compositional analysis techniques, model checking, verification tools, and applications. The primary goal of holding CONCUR '95 in the U.S. was to increase participation by American researchers in the area, and to encourage interaction among the various schools, both European and American, that have worked towards formal approaches to concurrency.","title":"CONCUR '95 - Sixth International Conference on Concurrency Theory; University of Pennsylvania; Philadelphia, PA; August 21-24, 1995","awardID":"9529068","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["451745"],"PO":["150697"]},"8516":{"abstract":"9552985 Bamberger In this project, key components of a distance learning computer laboratory will be prototyped. In particular, the following systems will be developed: an interpersonal communication tool which combines elements from email, video-conferencing, listserv\/listproc, usenet news, WAIS, gopher, and WWW; network based, interactive, media-rich, digital collections or curricular material; and authoring agents for the seamless integration of the interpersonal communication systems and interactive digital collections. The prototype sytems will be developed and field tested during the grant period. Deliverables will include the prototype systems, raw data for assessment of the impact of the tools on educational delivery, and a preliminary assessment study. In order to fully demonstrate the need for and benefits of distance learning computer laboratories, the prototype system will be developed in the context of a course on digital image processing. ***","title":"A Prototype Distance Learning Computer Laboratory for Exploratory, Asynchronous Learning","awardID":"9552985","effectiveDate":"1995-09-01","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7410","name":"DUE COURSE & CURRICULUM PROG"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7257","name":"APPLICATS OF ADVANCED TECHNOLS"}}],"PIcoPI":[21346],"PO":["527266"]},"6349":{"abstract":"9528308 Tanner The Roberts Wesleyan College requests support from NSF fro connection of two college campus networks to NYSERNet. NYSERNet a midlevel network will provide operations management and information services and it will give the campus access to the Internet connection, a collection of interoperable networks that connect most research and education organizations in the United States. The campus needs the Internet connection to be able to access information resources throughtout the state, the nation and the world. The connection will benefit the faculty, staff students of Roberts Wesleyan College campus as well as the community in general.","title":"Roberts Wesleyan College - Internet Direct Connection","awardID":"9528308","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[15589,15590],"PO":["43608"]},"2642":{"abstract":"The transition from sequential object-oriented programming to parallelism has been the focus of research over the past decade. Experimental languages that try to integrate objects and parallelism often compromise the inheritance capability for parallel objects. Even the languages that permit some parallelism and inheritance support only single-class inheritance. In this project support for multiple-class inheritance for parallel objects will be investigated. The technique employed is based on `separate` methods which generate processes and provide rendezvous type coordination. The project will apply this technique to Oberon language. The research will be performed under the Research for Undergraduate Institutions (RUI) program.","title":"RUI: Parallel Object-Oriented Programming with Multiple Inheritance","awardID":"9509223","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["207416"],"PO":["150697"]},"1322":{"abstract":"Advanced real-time systems, such as the Next Generation Workstation\/Machine Controller (NGC) for automated factories, require built-in database support for concurrent data access. However, conventional database systems do not provide the performance levels or response time guarantees needed by these real-time applications. To address these needs, an object-oriented software system called Multiprocessor Database Architecture for Real-Time Systems (MDARTS) is being designed, implemented, and evaluated. MDARTS supports explicit specification of real-time requirements and semantic constraints at an object-granularity level. Unlike other approaches, MDARTS has built-in strategies to examine these specifications at runtime during application initialization and to dynamically adjust its data management configuration on a per-object basis to provide real-time guarantees. For maximum performance on shared-memory multiprocessors, MDARTS supports concurrent, direct shared-memory data access. This unique design achieves transaction execution times two to three orders of magnitude faster than current real-time d atabase systems. In summary, the contributions of this project are two-fold. One, novel database technologies will be introduced, including methodologies for providing probabilistic and hard real-time guarantees and the implementation of an open multiprocessor database architecture providing extremely high levels of performance. Two, MDARTS technology will be applied to develop distributed, open architecture controllers for actual manufacturing machine tools, evaluating its effectiveness for addressing the high-performance real-time data management needs of manufacturing applications.","title":"MDARTS: A Multiprocessor Database Architecture for Real- Time Systems","awardID":"9504412","effectiveDate":"1995-09-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1468","name":"Manufacturing Machines & Equip"}}],"PIcoPI":["553551","543520"],"PO":["563751"]},"1685":{"abstract":"ABSTRACT: NCR-9505619, University of Southwestern Louisiana, Generalized Hamming Weights of Algebraic-Geometric Codes and Asymptotically Good Algebraic-Geometric Codes, PI-Gui-Liang Feng, and T.R.N. Rao: This research will explore the following problems: (1) to develop a simple and efficient method to determine a lower bound of the generalized Hamming weights of algebraic-geometric (AG) codes, such that the method can also be used to determine the weight hierarchy of a special class of AG codes, for example, Hermitian codes and generalized Hermitian codes, and (2) to investigate the construction of asymptotically good improved AG codes, and improved AG codes that exceed the Gilbert-Varshamov bound for some special finite fields. A more general approach will be developed to determine the minimum distance bound, which is as good or better than the bound given by the Reiman-Roch theorem (referred to here as the Goppa Bound) or by counting the number of well behaving terms (known as the Feng-Rao bound). The Feng-Rao bound was shown to be superior to the Goppa bound. Based on this approach the principal investigators will develop a lower bound of the generalized Hamming weights. For special classes of AG codes, this method can be used to determine the weight hierarchy. Classes of AG codes with true minimum distance greater than the Goppa and the Feng-Rao bounds will be constructed which provide good code properties for length and minimum distance. An attempt will be made to prove that these codes are asymptotica lly good codes. The problem of finding a sequence of AG codes exceeding the Gilbert-Varshamov bound will be the main feature of the research.<br\/>***************************************************************************** Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communications Research and Infrastructure<br\/>National Science Foundation","title":"Generalized Hamming Weights of Algebraic-Geometric Codes and Asmptotically Good Algebraic-Geometric Codes","awardID":"9505619","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["78436","78437"],"PO":["150411"]},"3314":{"abstract":"This project will investigate a new approach to learning models of dynamical systems for use in advanced reinforcement learning architectures. It will develop a method by which a reinforcement learning system can learn multiple time scale models and use them as the basis for hierarchical learning and planning. the project(s objectives are to develop the mathematical theory of this approach, to examine its relationship to control theory and to behavioral and neural models of learning, and to demonstrate its effectiveness in a number of simulated learning tasks. The significance of the project for engineeirng is that the use of TD models will be major generalization of RL architectures, making them much more widely applicable. It also has the possibility of establshing the utility of TD modesl for system identification in more conventional adaptive control. The project also has implication for our understanding of animal learning able to model indirect and direct associations and their interactions in a mathematically principled way. An Additinoal impact of this research will be t o strengthen links between engineering, artifical intellegence, and biological studies of learning, thereby contributng to all three areas by facilitating a transfer of concepts and methods.","title":"Multiple Time Scale Reinforcement Learning","awardID":"9511805","effectiveDate":"1995-09-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["513288"],"PO":["563109"]},"5998":{"abstract":"ABSTRACT NCR-9527163 Hajnal, Andras Rutgers University MDC: Simulations of Integrated Communications Systems The rapidly developing synthesis of communications and computing technologies, the ongoing construction of immense digital data networks, and the global deregulation of telecommunications industries will have a tremendous impact on the national economy and infrastructure. This proposal brings together leading experts in network modeling, network design and analysis, and high performance discrete-event simulation to focus on the development and validation of high-performance modeling and simulation tools for broadband networks and wireless communication services. The project will apply these tools to cutting edge problems in network design and operations that cannot be answered otherwise. The goals of this project are to: (1) develop network description methodology, similar in spirit to VHDL (very high speed integrated circuit hardware design language), suitable for the description of current and future telecommulication networks (2) provide validated high-performance simulation software prototypes based on this methodology, and (3) demonstrate the use of the tools for network construction and operation problems that cannot be answered otherwise. An important aspect of this project involves education and training of graduate students and post-doctoral fellows by involvement in pressing industrial problems, and via sharing the high-performance modeling and simulation tools within the public domain. The multidisciplinary project team attacks the problem by covering all of its critical elements. The team includes applications scientists who will help shape the network description and simulation tools by their experience and knowledge of current research directions in networking, and who will use the tools to explore those directions: it includes network modeling experts who contribute mathematically valid network behavioral models that help to accelerate the simulations ; it includes experienced developers of high performance simulation tools. Most critically, all members will participate vigorously in the design of the network specification methodology, for that methodology must address the needs and concerns of each. We envision a role analogous to the academic and industrial research partnership which successfully fostered the rapid expansion of the computer-aided-design industry in microelectronics. Indeed, we employ some of the proven strategies critical to that expansion - standardized description methodologies and highly efficient simulation tools.","title":"MDC: Simulations of Integrated Communications Systems","awardID":"9527163","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["297837","133639","264120"],"PO":["150490"]},"5569":{"abstract":"As computer Systems become ubiquitous and more information becomes available electronically, it is increasingly important for computer systems to be able to collaborate with each other and their users. The develop ment of the underlying theories and formalization needed to build collaborative systems will have far- reaching practical import as well as addressing challenging computer science problems. The Shared Plan formalization of collaboration (Grosz and Kraus, 1995; Grosz and Kraus, 1993) provides a specification of the capabilities to act and mental attitudes that agents must have to participate in collaborative activities with one another. This formalization will be extended developing strategies for elabmrating partial plans by specifying axioms that treat more completely the attitude of intending that a proposition hold. In addition a collaborative communication system based on Shared Plans will be designed: this system will both demonstrate the value of a model of collaboration to the design of human-computer interface systems and test the formalization. The proposed research will contribute to the development of computer agents that are fully collaborative, with each other and their users; it will also enable the construction of more flexible and user-friendly interfaces.","title":"Collaborative Plans & Collaborative Communication Systems","awardID":"9525915","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["333902"],"PO":["495796"]},"2621":{"abstract":"Abstract FARNET, Inc. NCR-9509138 PI: Jim Williams FARNET proposes a three-year project to design, develop and deploy an on-line guide to telecommunications infrastructure, Internet penetration and strategic directions for each of the United States. No comprehensive resource exists which describes state networking infrastructure, current capabilities and strategic intentions. FARNET will proposes to collect information from each of the states, organize the information and provide gopher and world-wide web servers to the Internet community. FARNET will be responsible for the collection and organization of the data, they propose that the InterNIC Database and Directory Services (AT&T) be the repository of the collected information. The document will have value when initially produced, the nature of networking in the United States is one of change. The document will have to be maintained and updated as State infrastructure or intentions change, it will be of even greater value. The 3 year project will terminate with an information resource that will be self sustaining with information maintained by each of the states.","title":"An Inventory of State Network Infrastructure and Strategic Planning for the National Information Infrastructure","awardID":"9509138","effectiveDate":"1995-09-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["57093","547713",6113,"437217","106147"],"PO":["121202"]},"4942":{"abstract":"9521955 Palmer The Manatee Community College requests support from NSF for connection to the Internet through the SURAnet regional network. SURAnet is the midlevel network located in the state of Florida that will provide operations and information services. It will provide the Manatee Community College with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The College needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff, and students of Manatee Community College.","title":"Manatee Community College Connection to the Internet","awardID":"9521955","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[12071,12072,12073],"PO":["57343"]},"2775":{"abstract":"The objective of this `applied algorithm` project is to continue the establishment and study of the interrelationships between formal language theory and the structure and behavior of the informational macromolecules. The formal representation of recombinant behaviors exhibited by double stranded DNA in the presence of specified sets of enzymatic activities is of crucial interest. This project includes the continued investigation of splicing systems and the languages they define. The fact that DNA occurs naturally in both linear and circular forms, which interact through recombination, has motivated the initiation of a unified theory of interacting linear and circular words. This project includes further development of this theory with emphasis on splicing. A treatment of languages of bi-infinite words and semi-infinite words is made, which will initiate the integration of these theories with the theories of languages of circular and finite words. This project directs special attention to the sofic shifts, which are a class of languages of bi-infinite words that play a major role in dynamical systems. This project is significant in that it establishes and clarifies relations between formal language theory and molecular biology. It develops an additional source of suggestive problems and imagery for formal language theory. Also, over a time scale of decades, it is expected to suggest questions and contribute precision to biochemical thought about informational macromolecules and their behavior. Additionally, the project provides new problems and approaches to the study of symbolic dynamics. This project combines theoretical computer science, biology and dynamical systems in a mutually stimulating and reinforcing way.","title":"Computational Systems with Biological Roots II","awardID":"9509831","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Z701","name":"ARPA-COMP SYS WITH BIOLOG ROOT"}}],"PIcoPI":[6494,6495],"PO":["150516"]},"2798":{"abstract":"This project explores the development and use of constraint programming languages in database applications. Constraint Query Languages (or CQLs) are applicable to many domain-specific areas, such as spatial databases, because their basic data type generalizes the relational tuple data type and is closer to the application semantics, e.g., for spatial databases these generalized tuples are convex spatial point sets . Most importantly, CQLs are designed so that I\/O-efficient access to large sets of generalized tuples can be supported through existing multi-dimensional searching data structures. This project is an investigation of both the principles and the practice of CQLs. The principles include: the expressive power of various classesof constraints both linear and nonlinear; the design of calculus\/algebra languages combining constraints and objects; the optimization of constraint programs; and the data structures for indexing very large sets of constraints. The practice involves developing prototypes of persistent constraint languages and evaluating them in three concrete application areas: solid modeling in design databases; map overlays in spatial databases; and subsequence matching in scientific databases. Constraint Query Languages will be key components of the next generation of declarative database interfaces, because they capture domain-specific semantics in an efficient fashion, and their successful implementation will be a significant extension of the current relational and object- oriented database technologies","title":"Constraint Query Languages","awardID":"9509933","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["483625",6551],"PO":["563751"]},"2325":{"abstract":"9508014 Sohraby Effective teletraffic analysis of communication networks is essential for their successful design and engineering. This project will introduce and examine a new paradigm for the teletraffic analysis of communication networks which is based on a system theoretic approach that is well rooted in the field of control theory. This approach has the following features: 1) it is based on a dynamical system viewpoint for the workload distribution in the system; 2) it provides both exact solution and approximate solution (with less computational effort); 3) it is unifying in the sense that the method is capable of solving most of the proposed teletraffic models in a unique and simple framework, including fluid flow approximations, queues fed with different correlated and bursty arrivals, general Markov chains of M\/G\/1 or G\/M\/1 type, etc.; 4) the method can be viewed as a \"bridge\" between the matrix analytic methods and spectral decomposition techniques where it avoids the need for a large number of iterations (especially in heavy traffic) encountered in the methods of the former type and the ill-conditioned root finding problem (especially when individual source characterization is complex) of the problems of the latter type; 5) the method can be easily implemented using traditional analog filtering theory; and 6) the method can also be implemented using known and effective algorithms extensively used in the field of control theory for the solution of Riccati equations. ***","title":"Single Node and Multiple Node (End-to-End) Teletraffic Analysis of Connection-Oriented Packet-Switched Networks","awardID":"9508014","effectiveDate":"1995-09-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["285452"],"PO":["150490"]},"4657":{"abstract":"ABSTRACT: NCR-9520981, Cornell University, \"Information Coding Technology for Multimedia and the Information Superhighwa\", PI-Chris Heegard: This research deals with three topic areas: trellis coding and symbolic systems, algebraic and algebraic geometry coding and Gr=F6bner bases, and data compression theory and applications. In the first area the research will treat the symmetries of trellis codes, rotationally invariant trellis codes, punctured trellis codes, and broadcast trellis coding. In the second, the work explores the algebraic structure of codes, decoding via the key equation, and systematic encoding of algebraic geometry codes. The last area focuses on audio data compression, fractional octave filters, and variable length\/rate compression; the overall goal of the third area is high fidelity perceptual (transform or sub-band) coding at lower bit rates.<br\/>**************************************************************************<br\/>Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communications Research and Infrastructure<br\/>National Science Foundation","title":"Information Coding Technology for Multimedia and the Information Superhighway","awardID":"9520981","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["131015"],"PO":["150411"]},"5526":{"abstract":"9525767 McKinley In this Research Planning Grant (RPG) the PI will develop new approaches for combining compile time analysis, program transformation, and data transformation to generate programs that achieve good cache memory performance. During the planning period, the PI will explore and compare benefits of techniques that improve locality within loop nests and techniques that improve locality between loop nests in spite of large data sizes. A successful completion will lead to a more ambitious research plan to investigate compile time techniques to improve memory performance of scientific applications on uniprocessors and shared memory multiprocessors. ***","title":"Improving Cache Performance for Uniprocessors","awardID":"9525767","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["519591"],"PO":[13545]},"4679":{"abstract":"A problem for an object database management system (ODBMS) is the reclamation of storage for persistent, secondary-memory objects that are no longer accessible. Although excellent reclamation algorithms have been developed for transient, primary-memory objects, these algorithms have been shown to be inappropriate for use on secondary-memory objects in object databases. This project investigates new algorithms for ODBMS storage reclamation. The critical aspects of secondary-memory reclamation are teased apart into a set of distinct policy areas. Rigorous trace-driven simulations of the algorithms are performed to gain an understanding of the relative performance of alternative policies within each area as well as an understanding of the interplay of policies across areas. Prototype implementations of the most promising algorithms are integrated into an existing ODBMS. This project makes three primary contributions to the ODBMS research, development, and user communities. First, a set of new reclamation algorithms appropriate for object databases is defined. Second, performance evaluations of the algorithms are used to reveal the circumstances under which the algorithms should be considered for adoption within a particular ODBMS or application. Third, a catalog of benchmark and live-application traces is created to establish an empirically founded characterization of application behavior that can be used far beyond evaluation of reclamation algorithms.","title":"Design and Evaluation of Algorithms for Storage Reclamation in Object Databases","awardID":"9521046","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["290193","57552"],"PO":["563751"]},"6307":{"abstract":"Charles Kalina NCR-9528211 NSF is a major participant in the Federal High Performance and Computing Program (HPCC), along with several other Agencies. HPCC's goal is to accelerate the rapid development of future generations of high performance computers and networks and to bring the results of the program into widespread research, educational, commercial and general public use. The National Coordinating Office (hosted by the National Library of Medicine) coordinates the programs of the participating agencies, and serves as a liaison to a variety of parties ranging from the Congress, through academia and industry, to the general public and the Executive Branch. This award provides the National Library of Medicine with support for the Foundation's share of National Coordinating Office responsibilities connected with the HPCC program.","title":"High Performance Computing and Communications","awardID":"9528211","effectiveDate":"1995-09-15","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":[15486],"PO":["121202"]},"1764":{"abstract":"9505845 Magliveras This research explores a new lossless image compression technique. The method is based on optimal non-linear codes of spanning trees. Maximum compression rates occur for codes of a certain critical covering radius, whose value depends on the statistical characteristics of the image. The method utilizes variable image-scanning using codes of spanning trees to maximize compression ratios. Compression rates are expected to be significantly better than those achieved by previous methods. ***","title":"A Coding Theoretic Approach to Lossless Image Compression","awardID":"9505845","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["283387"],"PO":["150411"]},"1665":{"abstract":"9505551 Hakimi Effective communication in networks is emerging as a critical factor in improving the performance of distributed systems including multiprocessor computers and computer networks. Research in this project will focus on three classes of problems: 1) the design of effective sequential and parallel algorithms for certain common communication functions in networks, such as all-to-all broadcast or \"gossiping\"; 2) the study of gossiping in a faulty environment and its application to the problem of automatic identification of the faulty units; and 3) the investigation of gossiping in wireless (radio) networks and the channel assignment problem in cellular telephone systems. Work will also include extending the PI's previous work on effective information dissemination in networks with emphasis on devising efficient approximation algorithms for known difficult problems and extending work on distributed gossiping algorithms in a faulty environment to make it applicable to automatic identification of intermittently faulty units in a network. The principal investigator will also study problems in wireless networks and cellular systems using generalizations of graph coloring problems. ***","title":"Fault Diagnosis and Information Dissemination in Networks","awardID":"9505551","effectiveDate":"1995-09-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["60054"],"PO":["125800"]},"1313":{"abstract":"This proposal addresses a variety of statistical and computational problems that arise in genetics and molecular biology. An important aim of the research project is the training and development of post-doctoral research fellows in this interdisciplinary area. The problems described here are part of our ongoing collaborations with geneticists and molecular biologists from USC and elsewhere. All of them have significant computational and statistical components. We are studying statistical and algorithmic aspects of physical mapping. Among these are optical mapping, by which ordered restriction maps are produced using fluorescence microscopy. The long term aim is the development of an online program that produces such an ordered map. We are analyzing the efficiency of various physical mapping strategies based on variants of sequence-tagged-sites schemes. In particular, we are studying inhomogeneous clone and anchor distributions, the effects of false, ambiguous or missing anchors, and strategies that allow for mixtures of clone walking and random steps. We are developing statistical models for the evolution of genome rearrangements and methods for reconstructing phylogenetic trees from such data. This is motivated in part by data on rearrangements occurring in the promoter of GFAP in the brain. A related project addresses other aspects of phylogenetic tree reconstruction, in particular the effects of dependence among sites when DNA sequence data is used to build the tree. Motivated by data on rRNA promoters, we are also developing algorithms for fitting more detailed evolutionary models when the underlying tree is known. We are investigating the statistics of pattern counts in molecular sequences. These a re frequently used to characterize biological features such as coding regions, regulatory sequences, splice sites and so on. Our focus is on the development of useful computational algorithms for pattern counts when the underlying sequence structure must be estimated from the data. A further project addresses the estimation of deletion rates in mitochondrial genomes in humans. A PCR assay is used to detect whether or not a cell line contains any mitochondria with the deletion. The data comprise the results of the assay on several cell lines. We are developing analogs of the Luria-Delbruck method of fluctuation analysis for estimating the rate of deletions. The results are used to study the role of the deletion in Kearns-Sayre Syndrome patients. We are developing Monte Carlo likelihood methods for inference in genetics, aimed primarily at the study of mitochondrial and nuclear gene variation in humans, and its use in the study of human evolution. One focus is on the estimation of recombination rates, in particular between human disease loci and a variety of marker loci.","title":"Statistical and Computational Problems in Genetics and Molecular Biology","awardID":"9504393","effectiveDate":"1995-09-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["154218","477718"],"PO":["565136"]},"5801":{"abstract":"9526593 Hoffman The Institute for Computer and Telecommunications System Policy (ICTSP), a research center at the George Washington University serves as a unique, interdisciplinary policy institute for both the University and the Washington region. The ICTSP wants to focus on new telecommunications issues that make their way onto the public agenda. A number of public policy issues have been identified which ICTSP will be researching and facilitating discussions for. This proposal requests stable funding to provide a base from which to build ongoing work and so that technological building of the network infrastructure can have a solid underpinning of well- reasoned policy decisions and can support any reasonable set of policy assumptions. Funding provided by this grant will help put in place mechanisms for supporting reports, videotapes and other works produced by affiliated scholars.","title":"Seed Funding for Institute for Computer and Telecommunications Systems Policy","awardID":"9526593","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["529428"],"PO":["121202"]},"2447":{"abstract":"ABSTRACT: NCR-9508528, University of Wisconsin-Milwaukee, Multi-Sender and Multi-Receiver Network Security, PI-Yvo Desmedt: State of the art network security is based on end-to-end encryption and link encryption. In many security operations there are multiple senders and\/or receivers. The straightforward application of link or end-to-end oriented techniques to network security implies either that the required bandwidth increases dramatically or that a terrible key management problem is created. Several multi-sender-multi-receiver cryptosystems have been presented previously. One of these schemes guarantees unconditionally the authenticity of broadcast. Several schemes have been developed in which the power to use a cryptosystem is shared non-interactively without the need for having a trusted party. The schemes protect against insiders conspiring with outsiders. Some of the schemes allow a majority of co-senders to co-sign a document non-interactively without enabling a minority to use the occasion to substitute a fraudulent message. Others allow a majority of co-receivers to co-decrypt a ciphertext. A minority cannot use such a decryption process to decrypt another ciphertext. Different schemes allow for different security requirements (e.g. heuristic and proven secure). Having demonstrated previously the feasibility to achieve several of the original objectives refinements are studied here including (1) how one can detect and correct internal disrupters who jam the co-production of a signature by sending erroneous data (and simi lar problems will be addressed for the joint description of ciphertext), (2) how to trace those who co-signed, in general those who used their share of cryptographic power, and (3) how to improve previously developed schemes and study bounds on performance.<br\/>***************************************************************************** Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communications Research and Infrastructure<br\/>National Science Foundation","title":"Multi-Sender and Multi-Receiver Network Security","awardID":"9508528","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["218583"],"PO":["150411"]},"5307":{"abstract":"This research involves the development of a domain independent approach to real-time, distributed coordination of multiple agents. It is based on the GeneralizedPartial Global Planning (GPGP) approach which views coordination as modulating local control, not replacing it. This process occurs via a set of domain-independent coordination mechanisms associated with each agent that posts constraints to the local real-time scheduler about the importance of certain tasks and appropriate times for their initiation and completion. Each coordination mechanism is defined as a response to certain features in the current task environment. In order to construct a generic approach to coordination, it is necessary to have an underlying framework that can represent the wide diversity of tasks, task properties, and task relationships in order to arrive at effective coordination among the activities of different agents in a wide variety of domains. The framework is called TAEMS (Task Analysis, Environment Modeling, and Simulation). It is a framework with which to represent the important aspects of complex computational task environments that is compatible with both formal agent-centered approaches and experimental approaches. The result of this research will lead to the development of a generic coordination module which can help desiginers of multiagent systems to build coordination strategies.","title":"Towards an Architecture and Theory for Agent Coordination","awardID":"9523419","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["485591"],"PO":["495796"]},"29194":{"abstract":"","title":"CISE Research Instrumentation: Research Instrumentation in Support of VLSI Design and Testing","awardID":"9796057","effectiveDate":"1995-09-01","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[73856],"PO":["173164"]},"1204":{"abstract":"9504064 Leveson Two aspects of the integration of HCI and safety research will be investigated in this work. The first area of research is the application of HCI techniques and knowledge to the design of formal specification languages---both their printed and automated representations. The concept of semantic distance for formal specification languages will be made operational and its implications in the design of such languages will be explored. The approach will involve working with application experts in building real specifications and using this experience to determine what features of specifications they find most natural, and exploring cognitive psychology models of human error and how they can be applied to specification languages to minimize the errors that are made. The second research topic involves modeling the HCI and performing a hazard analysis on the model. This work will involve modeling human behavior, developing analysis techniques to identify potential hazardous behavior of both the human operators and the computer, integrating these models into the general model for specification and analysis of critical system properties, and determining how the resulting information can be used in the design of the software and the design of user procedures. The subject of how current knowledge about the safe design of traditional controls can be applied to the design of computer-based models will be examined and experimental testbeds will be developed to test the hypotheses. ***","title":"CISE Postdoctoral Program: ES Postdoctoral Associate: Safety and the Human-Computer Interface","awardID":"9504064","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["296879"],"PO":["564412"]},"1325":{"abstract":"The objective of this RUI project is to design ``smarter` algorithms that avoid memory access conflicts without significant slowdown of an algorithm's performance. In particular, this research focuses on designing such algorithms (especially for graph problems), studying their characteristics, developing methodologies, and evaluating the gains from removal of concurrent memory access. The methods studied which, when carefully employed by a parallel algorithm, avoid concurrent memory access. Methods, which have been shown to be effective on parallel graph algorithms and which are also being investigated, include: (1) pseudotree contraction, a set of rules that allows a pseudotree to be contracted to a rooted star in logarithmic time without concurrent-writing access; (2) edge-list augmentation, a procedure that runs in constant time without any concurrent memory access; (3) growth-control scheduling, a method of balancing the work performed by clusters of processors so that the total amount of time needed to finish a job is minimized.","title":"RUI: Evaluating the Significance of Removing Concurrent Memory Access from Parallel Algorithms","awardID":"9504421","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["486402"],"PO":["150516"]},"1249":{"abstract":"Two software systems, RRL (the Rewrite Rule Laboratory) SATO (SAtisfiability Test Optimized), developed under the past grant, have been successfully used for solving many problems often considered a challenge for automated theorem provers, including several dozens of open problems in quasigroups. The current research will further increase the reasoning power of RRL and SATO. The objectives of this research are to develop new high performance reasoning algorithms, and to apply these algorithms in specification and verification of hardware and software, and in solving open problems in algebra, logic and combinatorics. The research focuses on constraint satisfaction and automated mathematical induction. The topics include efficient constraint propagation, parallel and distributed reasoning, intelligent induction schemata formulation, management of large proofs, and implementation and experimentation of all the involved algorithms. Practical problems will be chosen from software and hardware design verification and combinatorics as test problems for both RRL and SATO. Both systems will be enhanced to meet the need of large-scale applications by user-friendly interfaces. Special effort will be made to distribute RRL and SATO to the automated reasoning community worldwide.","title":"High Performance Automated Reasoning","awardID":"9504205","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["292881"],"PO":["187585"]},"1139":{"abstract":"This research project will develop a quasistatic motion planning paradigm that is a significant extension of classical robotic motion planning paradigms. The quasistatic problem arises when significant reaction forces between the robot mechanism and its environment are required to generate and\/or stabilize the robot's motion. The planning paradigm is based on the PI's recently developed configuration space mobility theory. To demonstrate the practical utility of this work, algorithms will be developed and implemented for two important quasi-static application examples: a novel workpiece fixturing algorithms that incorporates the curvature of the fixtures into the planning phase; and a proof-of-concept 2-dimensional quasistatic planning system for a highly articulated robot. This planner will be tested on an actual robot prototype in the laboratory.","title":"Robotic Motion Planning with Quasistatic Force Constraints","awardID":"9503835","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["301111"],"PO":["475621"]},"6628":{"abstract":"IRI-9529227 Kasif, Simon Johns Hopkins University $30,620 - 12 mos. SGER: Fast Queries and Updates in Probabilistic Networks Knowledge representation using networks is one of the most promising approaches to Artificial Intelligence. The main goal of another current grant to the same investigator is to develop very efficient algorithms for network-based AI tools such as constraint networks and probabilistic networks, focusing on utilizing parallel processing to achieve execution time that is sub-linear in the size of the network. A by-product of this existing project recently was several new compilation strategies for probabilistic networks that allow, after fast preprocessing, the processing of both queries and updates in time that is logarithmic in the size of the database. This represents an exponential improvement in current algorithms. At present, the techniques are known to be applicable to certain special cases, but it appears possible to extend them to more general networks. If they can be extended adequately, it will have a strong impact on technology, given the wide applicability of the ability to define, manipulate, and update probabilistic information. This small grant for exploratory research is to explore the applicability of these techniques, which were not a part of the existing grant's research plan.","title":"SGER: Fast Queries and Updates in Probabilistic Networks","awardID":"9529227","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["335993"],"PO":["54008"]},"1810":{"abstract":"ABSTRACT: NCR-9505975, California Institute of Technology, \"Coding Theory and Applications\", PI-McEliece: Three topics in modern coding theory are studied: Trellis complexity of convolutional codes, subgroup subcodes of Reed Solomon codes, and turbo-codes. The first involves a novel way of reducing the Viterbi decoding complexity of a large class of convolutional codes, including many codes currently used in practice (e.g. punctured convolutional codes and the unit memory convolutional codes). This is a surprising spinoff of the large body of recent work on the trellis complexity of block codes. The second considers a new class of algebraic block codes, the class of \"SSRS\" codes, which promises to break the \"bottleneck\" of Reed-Solomon codes, i.e. the restriction that the code length be no more that the size of the code alphabet. Finally the new class of \"turbo-codes\", recently introduced in France, will be studied. Turbo codes represent the biggest single step forward in many years in high gain low complexity coding. It is hoped to develop a credible theory to explain the remarkable experimental results and enable the work to be pressed forward systematically.<br\/>*****************************************************************************<br\/>Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communications Research and Infrastructure<br\/>National Science Foundation","title":"Coding Theory and Applications","awardID":"9505975","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["279563"],"PO":["150411"]},"1623":{"abstract":"ABSTRACT: NCR-9505443, University of Wisconsin-Madison, Blind Simulation and Regenerative Processes, PI-James A. Bucklew and Peter E. Ney: Importance sampling is used to speed up Monte Carlo simulation of rare events. The methods used to date have required exact knowledge of the underlying probability structure of the system being simulated. Direct Monte Carlo simulation requires only an assumption of ergodicity to guarantee that relative frequency estimates of system parameters will converge to true values. The direct Monte Carlo technique is an example of a blind simulation technique: a generic class of methodologies which bootstrap their way without exact knowledge of the underlying probability law. Some partial results achieved to date indicate that in many interesting situations, blind techniques can perform just about as well as those utilizing much more prior information. Applied to systems with memory (Markovian for example) these techniques lead naturally to the study of regenerative processes. These are processes that at random times stop and essentially start themselves over again. Aspects of the theory of these processes are yet to be developed and are needed for the analysis of blind simulation methods. This study of blind simulation and regenerative processes promises to very important in the bag of tricks available to system simulators.<br\/>***************************************************************************** Aubrey M. Bush<br\/>Program Director, Acting Deputy Divison Director<br\/>Division of Networking and Communica tions Research and Infrastructure<br\/>National Science Foundation","title":"Blind Simulation and Regenerative Processes","awardID":"9505443","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["38611",3768],"PO":["150411"]},"19075":{"abstract":"","title":"NSF Young Investigator: Computational Molecular Biology","awardID":"9696128","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["275326"],"PO":["150516"]},"4847":{"abstract":"IRI-9521672 Whinston, Andrew University of Texas-Austin $14,850 - 12 mos Conference: Frontiers of Electronic Commerce The conference is aimed at pushing and provoking Electronic Commerce research and practice to \"go where no firm has ever ventured before. \" Electronic commerce will render obsolete much of the accumulated research in business. Instead of merely transforming the way commerce is done today from a non-electronic world to an electronic platform, the new way of commerce will create and demand radical changes in the process, product and promotion to better exploit the digital platform. However, this emerging electronic market place is an unknown and needs to be understood. The goal is to use emerging technology to create a business environment or infrastructure that will ensure efficient electronic markets. What does it take in terms of new organization structures like the network structures facilitated by smart and wireless messaging; new electronic institutions such as brokerages staffed by electronic brokers or agent; new business processes better suited for mass customization, global sourcing and logistic; new financial payment mechanisms and mercantile protocols? To achieve exploration and exploitation of new frontiers, we need to integrate business concerns with the changing technology. The conference aims to provide this integration by bringing together leading business researchers who specialize in the various facets of electronic markets, namely economics, finance, marketing production and operations management, and technology experts in the industry who are creating the Electronic Commerce infrastructure. In addition, experts who specialize in the World Wide Web browsers, electronic cash, encryption, software agents, MIME-based messaging and EDI and Structured documents will be invited. The outcome of conference will be a better understanding of the shape, structure, and operation of business in the coming millennium.","title":"Conference: Frontiers of Electronic Commerce","awardID":"9521672","effectiveDate":"1995-09-15","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["521736"],"PO":["503214"]},"1503":{"abstract":"Recent research has demonstrated that the well-founded semantics and its equivalent, the alternating fixpoint semantics, can be implemented efficiently on deductive databases (relational databases with additional function free logical rules, which may introduce intertwined negation and recursion). Logic programming is a natural candidate for a database programming language because it shares the relational paradigm. This project is studying extensions to traditional logical languages that are likely to be useful for database programming, including nested relations and aggregation. Deductive rules involving aggregation as a primitive operation permit a natural and concise expression of several well-known optimization problems, such as shortest paths in a graph. However, implementation of such primitive operations is complicated by the fact they they occur inside recursion; that is, the relation being aggregated within a deductive rule is also being defined in part by that same rule. Greater complications are added if the rules may contain negation. This project is developing algorithms to implement aggregation efficiently within recursion and negation. Collection types are a valuable adjunct to deductive database languages, and are closely related to aggregation, nested relations, and complex objects. A collection type is any data type suitable for representing a finite set. With collection types, a language can manipulate relations (and nested relations) directly. This research is designing a language to integrate collection types with deductive database rules, with sufficient restrictions on the collection-typed objects to make efficient implementation possible. For example, the language excludes unification among partially instantiated sets. Integration of the functional programming paradigm and the relational paradigm of logic programming is also being studied. Data typing plays a central role. In logic programming functional terms are normally uninterpreted, and specific data types are not declared. The main idea is to establish contexts in which functional terms are interpreted as user-defined functions. The objective is to provide a high level language that can manipulate sets and relations in a convenient and understandable way, with sufficient power to solve practical applications.","title":"Efficient Extensions of Well-Founded Semantics for Functions, Aggregation and Collection Types","awardID":"9505036","effectiveDate":"1995-09-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["62499"],"PO":["561889"]},"2867":{"abstract":"9510146 Roughgarden Early competition theory is based on the Lotka-Volterra competition equations, which are widely viewed as inadequate. A problem today is to develop new models of competition specific to systems where competition is known to occur. This research will develop and begin to test a new model of competition, tailored for terrestrial foragers, such as Anolis lizards that are known to compete. The new model involves processes at four scales, a capture event scale measured in seconds, an optimal foraging scale in hours, a social spacing scale in days, and a population-dynamic scale in weeks. The model at the capture event scale is a behavioral rule that shows how optimal foraging may be learned in a matter of hours. The model at the optimal foraging scale shows how the asymptotic outcome of the behavioral rule can be predicted by maximizing net rate of energy intake. The model for the social spacing scale shows how the spacing of animal territories is ideally adjusted according to the spatial distribution of resources. Combining these relatively small-scale models culminates in a model for population dynamics and interspecific competition. The counterparts of classic population-dynamic parameters, such as r, and K of the logistic equation, are derived in terms of measurements defined on individuals, leading to a so-called individual-based model of population dynamics. It is proposed to extend this theory beyond the preliminary stage outlined in the proposal, to make it more realistic in many respects, and to revise it depending on results of future field studies.","title":"Individual-Based Competition Theory for Territorial Foragers","awardID":"9510146","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1182","name":"POP & COMMUNITY ECOL PROG"}}],"PIcoPI":[6727],"PO":["499029"]},"2757":{"abstract":"Integrity is a guarantee offered by Database Management Systems, both centralized and distributed, against nonmalicious errors in its data, i.e., the data is faithful to the relevant external world objects and their constraints. Heterogeneous distributed databases (HDDBs), by allowing shared access to pre-existing databases, are growing in importance. They exhibit site autonomy, the right of each local database to reject arbitrary global demands. Unfortunately, site autonomy seriously exacerbates global integrity maintenance. The aim of this research is to develop methods for maintaining integrity in distributed databases while accommodating site autonomy. The research plan is to explore three related techniques: generation of local sufficient constraints from global constraints, automated theorem proving, and relaxation of constraints. Some global constraints can be transformed into relatively simple, adjustable local ones needing little coordination, thus satisfying autonomy. This project investigates both the theoretical questions regarding what class of constraints is so transformable, and the p ractical question of how to produce a tool for generating such transformations. The proposed tool extends theorem proving techniques previously applied to centralized databases and allows special predicates that capture the notion of relaxation of constraint checking. This work will result in better integrity assurance in distributed databases in spite of site autonomy, with applications in decision support systems, optimization of material flow, and integration of scientific data from several sources, and other the areas where these requirements are important.","title":"Accommodation Site Autonomy in Distributed Constraint Maintenance","awardID":"9509789","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["336176"],"PO":["563751"]},"4935":{"abstract":"9521940 McFarling The Kentucky Wesleyan College requests support from NSF for a connection to the Internet through the SURAnet regional network. SURAnet is the regional network located in the state of Kentucky that will provide operations and network information services. It will provide the Southern College of Optometry with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The college needs the Internet connection to be able to access information resources throughout the state, the nation nd the world. The connection will benefit the students, faculty and staff of Kentucky Wesleyan College and Brescia College.","title":"Joint Proposal for Equipment to Connect to SURAnet","awardID":"9521940","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[12053],"PO":["57343"]},"2768":{"abstract":"Wireless technology is gaining popularity very rapidly. Many predict a new emerging market where millions of mobile users will carry small, hand-heldterminals, capable of communicating over a wireless connection. Mobile users will mostly need location dependent information such as local yellow pages, traffic reports, shopping information, local directions, etc. Mobility, bandwidth and energy limitations are the main new factors which have to be taken under consideration in the design of wireless information services. Three basic modes of wireless information dissemination are defined: (1) publishing, (2) delta publishing, and (3) on demand. The publishing mode is the most energy efficient scheme as it does not require the clients to submit uplink requests to the Mobile Support Station (MSS) but just listen to the downlink stream of data periodically broadcast by the MSS on its downlink channel. However, data which is published has to be very carefully organized and multiplexed with the directory information. Tradeoffs between different dissemination modes are investigated, with the goal of developi ng energy efficient access methods from battery powered clients. Different caching strategies in the context of frequent client disconnections are also investigated. Finally, the implementation of the above methods in the form of prototypical wireless information server (kiosk) is provided.","title":"Designing Wireless Information Services","awardID":"9509816","effectiveDate":"1995-09-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["483835","6481"],"PO":["563751"]},"1339":{"abstract":"9504460 Singh The Culinary Institute of America requests support from NSF for connection of the campus networks for the Culinary Institute of America to NYSERNet and the Internet. NYSERNet is the midlevel network located in the state of New York that will provide operations and network information services. It will provide the Culinary Institute of America a 56KB connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The Institute needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the The Culinary Institute of America.","title":"The Culinary Institute of America's Proposal to Connect to NSFNET","awardID":"9504460","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[3089,3090],"PO":["57343"]},"19055":{"abstract":"","title":"PYI: CAD Tools for New Circuit Technologies","awardID":"9696108","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["549747"],"PO":["321058"]},"2769":{"abstract":"Many government and commercial organizations possess extremely large databases, with sizes often measured in terabytes, containing such information as consumer data, astronomical observations, biological sequences, etc. The extraction of information from such large databases has become known as database mining and is an area where machine learning techniques must meet performance requirements of very large database systems. This research focuses on one particular database-mining task, the problem of rule discovery. Rule discovery is viewed as an interactive process with a human in the loop , an iterative process where the user is not only trying to discover interesting results, but also interesting questions to ask. The approach is based on the key idea that rules can themselves be viewed as objects. Under this view the space of possible rules supported by a database can itself be treated as a database, and the rule-discovery process can be approached as a process of querying the rule base implicitly defined by each database. The human in the loop user of the discovery system would interact with the system via ad hoc rulebase queries, designing the desired query interactively as various results are returned during a rule discovery session. The proposed implementation of the data mining system is tested on the data from the health-care field, obtained through an ongoing collaboration with a major provider of managed health care.","title":"A Query-Based Approach to Database Mining: Database Tools for Rule Discovery","awardID":"9509819","effectiveDate":"1995-09-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["523297",6481],"PO":["563751"]},"1109":{"abstract":"Object-oriented languages offer one promising approach to making programs easier to write and easier to modify and extend. Unfortunately, object-oriented language constructs often incur a substantial run-time cost. To improve the run-time performance of object-oriented languages, previous research applied intraprocedural class analysis and compile-time class prediction to determine the actual classes of arguments to a dynamically bound call at compile-time, thereby statically binding the call to the target procedure and enabling inline expansion to eliminate the overhead of the call. This work was performed primarily in the context of purely object-oriented languages. The goal of this project is to extend previous work in three directions. First, the scope of analysis will be expanded to the whole application program. This necessitates developing and evaluating techniques for constructing call graphs for object-oriented languages and performing interprocedural class analysis. Second, profile information will be incorporated into the analysis and optimization process. In particular, profile information can provide much more accurate class prediction information than can static estimation techniques. Third, procedure specialization will be selectively applied to the optimization of object-oriented languages. The goal will be to investigate the relative trade-offs in cost and benefit among inline expansion, procedure specialization, and interprocedural analysis for object-oriented languages. The suitability of these techniques across a range of object-oriented programming languages, both pure and hybrid, will be evaluated in this effort.","title":"Analysis and Optimization of Object-Oriented Languages","awardID":"9503741","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["332082"],"PO":["150697"]},"18990":{"abstract":"","title":"Mathematical Sciences: Toward a Theory of Well-Founded Orderings for Use in Automated Deduction","awardID":"9696043","effectiveDate":"1995-09-15","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["331030"],"PO":["187585"]},"2803":{"abstract":"A much-touted advantage of the relational data model is the existence of a formal calculus and algebra to model database queries. In practice, these formalisms fail to model many of the features present in commercial query languages (e.g., SQL): grouping, aggregation, duplicate values, and sort orders. The gap only widens as one moves to object- oriented query languages, such as OQL of ODMG-93, which must deal with multiple bulk (collection) types, arbitrary nesting of type constructors, methods and embedded query expressions. Such features also appear in relational query language standards proposals, such as SQL3. This work addresses efficient query processing for modern database languages. It seeks to demonstrate through prototype implementation that new language features can be handled more effectively if these features have direct support in a query calculus. The research framework is based on such a calculus, called the monoid comprehension calculus. Instead of starting from relational algebra and making extensions, our formal model represents naturally the new emerging features of database lang uages. A successful outcome for the research will lead to a better basis for implementing the query processors of commercial database systems, both of pure object-oriented models and relational-object","title":"An Effective Framework for Processing OODB Languages","awardID":"9509955","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["483300","553595"],"PO":["563751"]},"2957":{"abstract":"Learning theory is concerned with the rigorous study of concept classes under well- established criteria for learnability. Most of the current research focuses on expanding the frontiers of the concept classes known to be learnable. Two different but related models for learning are the probably approximately correct (PAC) model and the exact learning model with equivalence and membership queries. This project derives its motivation from recent results in exact learning with queries and from practical considerations of limited data available for inference. Many concept classes which are not efficiently learnable with queries if cryptographic assumptions hold are possibly exactly learnable in a model where considerations of time-efficiency are relaxed, but considerations of limited data are made paramount. Such a model is formalized along with a discussion of partial results. This project concentrates on the reinvestigation of the learnability of natural concept classes which have been neglected in view of known negative results. Where possible, efficient learning algorithms are developed according to both exact and PAC criteria.","title":"Exact Learning with Queries","awardID":"9510392","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["554655"],"PO":["150516"]},"2759":{"abstract":"IRI-9509792 Cooper, Gregory University of Pittsburgh $69,951 - 13 mos. Learning Bayesian Networks that Contain both Discrete and Continuous Variables Probabilistic belief networks are increasingly being used to model belief in a great variety of domains in knowledge-based systems. Some of the most extensive work has been done in the area of medical knowledge and beliefs, and this project continues previous work in that domain. One of the problems that has continued to bedevil probabilistic network knowledge bases, as well as other knowledge bases, is knowledge acquisition. The goal in this work is to enable the use of medical and other types of databases and Bayesian learning methods to develop probabilistic networks. The particular type of probabilistic network structure being used here is called a Bayesian belief network. The method being investigated uses two stages. The first stage is a relatively generic technique for learning the qualitative, structural relationships among the model variables; and the second stage uses distribution- specific techniques for quantifying the relationships among the model variables. The hypothesis, to be tested on a variety of simulated and real-world databases, is that this method will produce more predictively accurate Bayesian belief network models.","title":"Learning Bayesian Networks that Contain Both Discrete and Continuous Variables","awardID":"9509792","effectiveDate":"1995-09-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["406755"],"PO":["565227"]},"19056":{"abstract":"","title":"Database for Image Processing Research","awardID":"9696109","effectiveDate":"1995-09-15","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["142498","290859"],"PO":["564898"]},"19002":{"abstract":"","title":"RIA: Selecting Information to Include in Cooperative Task- Oriented Dialogues","awardID":"9696055","effectiveDate":"1995-09-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["117482"],"PO":["495796"]},"19123":{"abstract":"","title":"Multidimensional Nonseparable Subband Coding","awardID":"9696176","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["562984"],"PO":["564898"]},"2848":{"abstract":"Transaction Processing (TP) systems form a core software component in database management systems, making sharing of information and concurrent processing in multi-user, distributed environments possible. However, the currently used Atomicity, Consistency, Isolation, and Durability (ACID) properties of transactions have limited the use of TP systems in new applications such as engineering design and long activities, due to their inflexibility. This project strengthens the ACID properties to support a spectrum of choices. For example, Epsilon Serializability gives application designers fine-grained choices in the specification of bounded inconsistency tolerance. This work complements theoretical results such as the ACTA framework. This project maps strengthened atomicity, isolation, and durability properties onto existing proven software systems, in particular, TP monitors such as Transarc Encina. Combining theory with practice, the results from this research will make strengthened production TP systems available to the designers and implementors of advanced applications such as cooperative long tra nsactions and autonomous TP on the Internet","title":"Strengthening the ACID Properties: Modular Transaction Models and TP Systems","awardID":"9510112","effectiveDate":"1995-09-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["532971"],"PO":["563751"]},"4905":{"abstract":"9521804 Green Bryan College requests support from NSF for connection of two college campus networks to (Tennessee Education Cooperative Network (TECnet). TECnet a midlevel network will provide operations management and information services and it will give the campus access to the Internet connection, a collection of interoperable networks that connect most research and education organizations in the United States. The campus needs the Internet connection to be able to access information resources throughtout the state, the nation and the world. The connection will benefit the faculty, staff students of Bryan College campus as well as the community in general.","title":"Connection to Internet (NSFNET)","awardID":"9521804","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11977,11978],"PO":["43608"]},"18970":{"abstract":"","title":"Performance Measurement and Modeling of Parallel Computer Systems","awardID":"9696023","effectiveDate":"1995-09-01","expirationDate":"1997-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["540643"],"PO":["150516"]},"171":{"abstract":"Representing curved shape is a fundamental problem in geometric modeling and design. A variety of approaches currently exist for modeling curved shape, by far the most popular of which is a boundary representation (B-rep) whose surfaces are trimmed NURBS (non-uniform rational B-splines). Unfortunately, building a modeler based on trimmed NURBS is exceedingly difficult for at least two reasons. First, trimming two NURBS patches to agree along a common edge usually involves complex surface\/surface intersection algorithms and substantial approximation. Second, even in the absence of sharp edges, patching is often required since a single NURBS patch is capable of modeling only surfaces topologically equivalent to planes, cylinders, and tori. Modeling surfaces of other topological types (even those as simple as a sphere) require the surface be decomposed into a quiltwork of individual NURBS patches. Complicated continually conditions must then be imposed to guarantee that adjacent patches join smoothly. Subdivision provides a promising alternative to NURBS. Using subdivision, a polyhedron is mapped to a sequence of denser polyhedra whose limit is a curved object. Each new polyhedron is derived from the previous polyhedron by splitting each of its faces into four new faces and positioning its new vertices using a fixed averaging mask. Different masks yield surface features such as corners, curved edges, or smooth faces in the limit object. The method is simple, requiring only polyhedral modeling. The method is general, producing objects with smooth faces and sharp curved edges without trimming or patching. Finally, subdivision provides a hierarchical representation that allows the design of efficient multi-resolution processing algorithms. This research addresses a combination of theoretical and applied problems whose solution is essential if subdivision is to be of use as a practical method for modeling curved shape. Specifically it develops: Curvature continuous subdivision methods; Subdivision methods for local refinement and introduction of shapes and edges; Functional subdivision methods over irregular triangulations (necessary for FEA) and algorithms for: Conversion to and from other representations such as NURBS, Editing and display of subdividion surfaces, Finite element analysis over subdivision surfaces, Computing the intersection, union, or difference of subdivision surfaces.","title":"Subdivision Methods for Computer-Aided Design and Engineering","awardID":"9500572","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["551026"],"PO":["187585"]},"1639":{"abstract":"The goal of this project is to develop theory, tools, and methods needed to carry out formal specifications of large software systems. The approach is to formalize the Jackson\/Zave (J\/Z) specification techniques using an extension of the Higher-Order Logic (HOL) interactive theorem-proving system. This project focuses on the theoretical and design issues that this entails for HOL, and the methodological implications for the J\/Z approach. The research explores ideas from research on polymorphism and module systems for programming languages, applying them to HOL theories. The J\/Z method has been used to provide a specification of the AT&T 5ESS switch using a first-order model-based approach. HOL has been used for substantial hardware and software specification and verification projects such as the Viper Chip and the dynamic semantics of the Standard Meta- Language (SML). This research explores the possibility that realizing the J\/Z method within HOL can provide a basis for user level validation and, more generally, for formal verification of software. The project is conducted as a joint academic\/industrial enterprise drawing on research in logic, type theory, and semantics at the University of Pennsylvania, and research in interactive theorem proving, application software, and specification techniques at AT&T Bell Labs.","title":"Formalizing Software Specifications and Requirements in Higher-Order Logic","awardID":"9505469","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["553855","549775",3811],"PO":["150697"]},"2629":{"abstract":"IRI-9509165 Peter Haddawy University of Wisconsin - Milwaukee $78,038 - 12 mos. Practical Decision-Theoretic Planning The desire to solve practical real-world planning problems places conflicting demands on domain-independent planning systems. The representation used by the planner must be rich enough to capture all the salient aspects of the application, but at the same time, it must permit the use of efficient algorithms that will scale up effectively to handle large problems. In planning under uncertainty, decision theory allows the consideration of tradeoffs among partially satisfiable objectives. But most of the planning algorithms have either made unrealistic assumptions or been too inefficient for application to large problems. The purpose of this research is to develop efficient methods by using abstraction techniques which permit a planner to focus on important aspects of a domain before considering details. Methods of automatically generating abstractions are being developed, along with methods of applying these to planning problems in dynamic environments. Decision-theoretic planners are being extended ion their representational capabilities with the goal of not sacrificing efficiency. Techniques for efficient reasoning with probabilistic domain theories are being developed. The tangible products are expected to be a theoretical framework for efficient decision-theoretic planning, ore or more implemented planning systems, a theoretical framework for probabilistic domain modeling using probability logic, and an implemented inference system for constructing Bayesian networks from knowledge bases of probability logic sentences.","title":"Practical Decision-Theorectic Planning","awardID":"9509165","effectiveDate":"1995-09-15","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["66687"],"PO":["565227"]},"1805":{"abstract":"TITLE: and MIMD\/SIMD Architectures Parallel computing applications differ widely in the type of computational paradigm that is best suited to efficiently exploit their parallelism. Current software systems for parallel hardware support only single-paradigm computing. The objective of this research project is to investigate system-level support for efficient multiparadigm parallel computation. Previous work on coordination languages and multiparadigm sequential programming languages form a solid foundation for this research, although significant new ideas are required. Although current high-performance computer architectures are moving toward a combined MIMD\/SIMD organization, very little software and system support exists for such hybrid computer architectures. This research will thus also focus on aspects of multiparadigm computing for massively parallel SIMD and MIMD\/SIMD machines, including the Rewrite-Rule Machine as a testbed architecture. The research results will enable future systems designers to better appreciate the engineering trade-offs to efficiently support multiparadigm computing in a parallel environment. The results of this research are expected to enhance the future programming ease of high-performance massively parallel computing systems.","title":"System Level Issues for Multiparadigm Computing and SIMD and MIMD\/SIMD Architectures","awardID":"9505960","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550264"],"PO":["74434"]},"2916":{"abstract":"9510290 Hayes This project connects the Telemedicine Research Center to the Internet over a 56 kbps line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"An Internet Node to Foster International Communication and Collaboration in Telemedicine","awardID":"9510290","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[6847,"516823",6849],"PO":["43608"]},"1948":{"abstract":"9506505 Yates This research looks to extend the application of power control in mobile cellular communications to multihop CDMA packet radio networks. Using soft interference constraints derived from signal to interference ratio measurements, distributed power control algorithms will be studied which adapt to changes in the radio link quality, actively regulate the network topology, achieve desired end-to-end throughput objectives, and integrate power control and multihop routing. ***","title":"Power Control For Packet Radio Networks","awardID":"9506505","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"9171","name":"SCIENCE AND TECHNOLOGY CENTERS"}}],"PIcoPI":["463100","466323"],"PO":["150411"]},"1729":{"abstract":"The aim of this project is to obtain new results which help reduce the time and computational effort required when using the computer simulation models for optimization found in many discrete-event systems. The focus is on the enhancement of the Score Function and Likelihood Ratio methods to provide accurate estimates for derivative and perturbation, respectively. The goals are improvements the existing variance reduction techniques, theoretical unification, some extensions, and advancements in the practical implementation of these `single run` methods. The project's goal is to develop procedures and algorithms, investigate their accuracy versus execution time behavior, and present numerical results for a wide variety of queuing, inventory, and reliability models.","title":"RUI: Optimization of Discrete Event Simulation Models: Single Run Based Approaches","awardID":"9505732","effectiveDate":"1995-09-15","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[4017],"PO":["187585"]},"2719":{"abstract":"The rapidly expanding technology of cellular communications, wireless LAN, and satellite services will make it possible for users to access information anywhere and at anytime. In this environment, users will be mobile, use low powered computers, and communicate with the network over narrow bandwidth links. Such an environment introduces new challenges in the design of communication mechanisms due to constraints such as bandwidth, energy, cost, and the availability of computing resources due to host mobility. Hence, communication protocols should be designed for adaptability to changing environments brought by mobility. The research project will design and build support for mobile communications applications that explicitly take into account bandwidth limitations, energy limitations, and mobility using the following approaches: (1) The communication between the client and the server will be via an intermediary. Indirect interaction allows for optimization and development of specialized protocols for the wireless link and mobile host without having to change any protocol that is running on the fixed hosts. (2) Design environment aware communication primitives that will have access to the current environment state and also be notified about any changes. Thus, the type of communication to use can be tailored to the prevailing conditions.","title":"Designing Communication Support for Mobile Hosts in Distributed Systems","awardID":"9509620","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["483835","6481"],"PO":["74434"]},"1807":{"abstract":"9505963 Mao Data traffic in networks has always been dominated by file transfers. In today's high-volume applications like the Internet bulletin boards, most files are simple text files. In the future, files are expected to consist of hypertext documents, with significant audio and video components. Already, a few seconds of low-quality audio occupy hundreds of kilobytes. These numbers are indicative of the large sizes of future multimedia files. Other applications of the future which are thought to involve large file sizes are those arising from scientific applications, large-scale databases and network-wide system backups. In this proposal the principal investigators take issue with the notion that large files should be routed as small files conventionally are -- by breaking up the file into packets and relying on packet routing algorithms. They examine and propose to study the problem of scheduling large file transfers. Past approaches traditionally avoid collecting information across networks to schedule particular files, simply because the overhead of doing so overwhelms any benefits accrued in computing optimal schedules. However, when file sizes are very large and are also known in advance of transmission, it makes eminent sense to collect information and compute good schedules, thus utilizing network resources efficiently. The researchers will formulate a file transfer scheduling problem, argue its importance, assess shortcomings in the available research on this problem and outline issues for future research. *** ******* Darleen Fisher Program Manager Networking and Communications Research Program 4201 Wilson Blvd. Room 1175 Arlington Va 22230 (703) 306-1949 (703) 306-0621 (FAX)","title":"Routing and Scheduling of File Transfer in Packet - Switched Networks","awardID":"9505963","effectiveDate":"1995-09-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["562052","382158"],"PO":["150490"]},"2709":{"abstract":"Galileo is an investigation into the implications of long range technology advances across the computer field. While projections of narrow scope are difficult and risky because of the rapid progress over a very broad range of technology, it is possible to extrapolate current trends and make intelligent guesses about future computer building blocks. Extrapolating current rates of progress to as little as a decade hence suggesting that incredibly powerful computer systems might not be only possible, but even affordable. Current technology trends will undoubtedly be affected by new discoveries and by limitations long before such performance levels are reached. It is the goal of this research to identify those development directions that are likely to come into conflict or otherwise be retarded, and to investigate the implications of these effects. Future machines will undoubtedly much lower costs of all operations, but some operations will become much cheaper than others. A major goal is to identify the relative improvements on different kinds of operations, and to understand how these changes will affect architecture, the programming environment, and the algorithms used. The processor has long been the heart of a computer system, and though much has been written about other limitations, the CPU still plays a central role in today's architectures. Increasingly the processor is becoming less effective, limited not by its peak processing power, but by the ability of the system to provide work to keep it busy. While processing power is rapidly becoming cheaper, the effective use of memory and communication is becoming the critical challenge in achieving higher performance. Memory costs have declined rapidly and steadily for more than twenty years, and will continue to decline in cost per bit. Access time has not improved dramatically, however, and high-bandwidth, low latency-memory will always be relatively expensive. Limitations in memory access tile and bandwidth are already posing difficult design challenges, and this will only be aggravated by technology trends. This research is investigating how a system can get higher performance form its memory system by applying cheap processing power wherever it can be used effectively. In some sense, the system becomes a collection of memory modules with processing power distributed in ways to maximize the effective use of memory by minimizing communications between memory modules. Memory access time and memory latency are intimately related. Both are critical for a high-performance system, and either can be optimized at the expense of the other. Today memory latency seems to be the more urgent problem, and much current research is devoted to reducing or tolerating memory latency. Assuming that some of these techniques are successful, the more fundamental problem of memory bandwidth emerges. While it may be possible to build systems of arbitrarily high bandwidth, it appears that one of the most important emerging challenges is to make the most effective use of whatever bandwidth is available between modules. By today's standards, future systems will have enormous processing power, huge amounts of memory, and incredible communications bandwidth. Computer systems will be limited by memory modules of insufficient capacity and communication paths of limited bandwidth, with processor distributed generously wherever needed to optimize the effectiveness of memory and communication bandwidth. Galileo is investigating how the architecture of such systems should differ from systems of today. Galileo is investigating how the architecture of such systems should differ from systems of today, and how such systems should be programmed.","title":"A Study of Long-Term Architectural Limits to Computing: Galileo","awardID":"9509589","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["138985"],"PO":["74434"]},"990":{"abstract":"Polymorphism is a key feature of modern, strongly-typed programming languages including Ada, C++, and ML. This research program investigates a new approach to implementing polymorphism, based on associating type information with each activation of a polymorphic function, rather than with data. This approach permits type information to be utilized effectively at runtime or link-time, not just at compile-time. It enables compilers to generate polymorphic object code from parametrically polymorphic source code, while still using specialized, space-efficient data formats that can be shared with other software components. The approach also supports a large variety of powerful non-parametric features in the source language and in the development and runtime environments. The focus of the research will be on generating prototype compiler implementations and language extensions, that can be evaluated using performance benchmarks. The underlying aim of the research is to make polymorphic programs easier to develop and to integrate into existing systems, thereby, hastening the acceptance of modern languages by industrial and commercial users as well as by academics.","title":"Flexible and Efficient Implementation of Polymorphic Programming Languages","awardID":"9503383","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}}],"PIcoPI":[2250],"PO":["150697"]},"781":{"abstract":"9502582 Murat Azizoglu This proposal outlines a career development plan for the principal investigator with a coherent integration of research and teaching goals. The research program addresses important issues in the design of all-optical wide area networks. The education plan includes development of graduate-level courses on optical communication systems and all-optical networking, integration of communication networks into undergraduate curriculum and development of a laboratory in which the students can design, implement, and test prototype optical networks. An all-optical network is a network in which the signals remain in the optical domain from the source to the destination. This approach eliminates the speed mismatch between optical and electronic devices by avoiding optical-to-electrical signal conversion within the network. When the electronic processing is limited to the terminal nodes as prescribed, several challenging problems arise which require new and innovative approaches. Among these issues are traffic scheduling in circuit- and packet-switched networks with Wavelength Division Multiple Access, all-optical interconnection of all-optical LANs, dynamic vs. static wavelength assignment in interconnecting bridges, and architectural issues in interconnected networks. Solution to such problems must take into account optical device limitations, such as laser tuning delay and finite number of resolvable channels.","title":"CAREER: Traffic Scheduling and Network Interconnection in All Optical Networks","awardID":"9502610","effectiveDate":"1995-09-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["119553"],"PO":["150490"]},"682":{"abstract":"The research component involves case-based reasoning (CBR) a technique that stores and later applies cases of known problems and their solutions to solve new problems. Since few stored cases will exactly match a new problem, most cases will be related at best by analogy to the new one. In that case, it is necessary first to retrieve an appropriate analogous case, check to see that it matches the new problem in some essential ways, then adapt it to the new problem in such a way as to infer a solution. In storing and using cases, it is necessary to do some abstraction, either at the time that they are stored away for later use or at the time retrieved, to avoid having to store large numbers of very similar but slightly different cases. This project examines the advantages of developing a hierarchy of abstraction for each stored case, a technique called \"stratified CBR\". The stratified CBR technique will be applied to a typical search task (route planning), two configuration tasks (artifact design and goal-directed activity planning), and an analytical task (legal reasoning), in order to test hypotheses about the superiority of the stratified CBR technique and to gain experience in using the technique. During the period of the grant, an educational plan will be developed that exposes students to the insights, perspectives, and tools of AI by (1) educating undergraduates about AI's basic methods and concepts and about AI's philosophical, social, and cognitive consequences, and (2) educating graduate students in other fields about the AI techniques and tools applicable to their fields.","title":"Abstraction and Hierarchical Problem Solving in Case-Based Reasoning","awardID":"9502152","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[1545],"PO":["565227"]},"594":{"abstract":"This CAREER award supports research in methods and tools for performance prediction of parallel programs. The goal is a tool set that incorporates general and accurate methods to predict the performance of a parallel application in advance of its execution. The approach taken is based on prior work that has built tools to measure the performance of parallel programs (Predicate Profiling) and automatically construct performance models of existing applications (Lost Cycles Analysis). While the prior work has relied principally on dynamic whole-program analysis, this research will add static analysis techniques and apply dynamic tools to program fragments. By applying those tools to program fragments, the research seeks a flexible method for the performance prediction of alternative program structures. The resulting tool is expected to aid computational scientists attempting to tune the performance of programs running on high performance, massively parallel architectures. The educational component of this CAREER award addresses course development and teaching of parallel processing for undergraduates, performance measurement and prediction for graduate students, and a new approach to introductory computer science for freshmen.","title":"Career: Practical Performance Prediction for Parallel Programmers","awardID":"9501822","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["486062"],"PO":["150697"]},"19008":{"abstract":"","title":"NSF Young Investigator","awardID":"9696061","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["520937"],"PO":["125480"]},"782":{"abstract":"NCR-9502614 Leandros Tassiulas Wireless will be a method of choice for accessing the future broadband integrated services network. In wireless access the main problem is to utilize efficiently the limited spectrum capacity in order to accommodate the large traffic demands that will be generated by Personal Communication Services (PCS). In the digital network there will be enhanced flexibility in signaling and control to support sophisticated schemes. Dynamic resource allocation methods should be employed for network control in order to achieve maximum utilization of the system. The fundamental problem of joint base-station assignment, power control and channel allocation will be investigated here. Such a problem arises during hand-off, when the configuration of the system changes, as well as at the time of a new connection. Furthermore it should be solved in a dynamic fashion during the operation of the system and for system configurations that change randomly. The problem is formulated as an optimization problem that involves continuous and discrete components. The traffic capacity is defined as a quantity that reflects the maximum number of mobiles per channel if the optimal allocation algorithm is employed. Preliminary results for two base stations are reported. The study of the general problem with multiple base stations is proposed. Several approaches are briefly discussed including deterministic models for the limiting traffic capacity, randomized search algorithms including simulated annealing and genetic algorithms, and reuse partitioning. ******* Darleen Fisher Program Manager Networking and Communications Research Program (703) 306-1949 (703) 306-0621 (FAX)","title":"CAREER: Wireless Access Control for Optimal Spectral Efficiency","awardID":"9502614","effectiveDate":"1995-09-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["158256"],"PO":["223414"]},"210":{"abstract":"9424639 Murray The objective of this research is to develop, study, and implement algorithms for solving large-scale, nonlinear optimization problems. A large-scale optimization problem is characterized by a large number of variables and constraints. Two solution approaches form the focus of the research. These approaches are respectively, the interior point (barrier) method and the sequential quadratic programming (SQP) method. The interest in the interior point method stems from their success on linear programming problems, and some interesting properties that may be of value when certain difficult constraints are encountered. The interior point method can be used to eliminate constraints on the eigenvalues of a matrix. On the other hand, interest on the use of SQP is prompted by the success of the approach on small and medium-sized problems, and the experiences of the investigators on the performance of the technique on two classes of large, practical problems that differ substantially in character. If successful with these approaches, the developed algorithms will be coded into a software to facilitate their applications by practitioners. These are several engineering, manufacturing, scientific, and business problems that can be described by large-scale nonlinear optimization models. To date, finding a general solution algorithm to large scale optimization community. If successful, the algorithms being investigated in this research could open the window to a better understanding of this class of optimization problems. Many problems in various areas of human endeavor stand to benefit from the results of this work.","title":"Large-Scale Constrained Optimization","awardID":"9500668","effectiveDate":"1995-09-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["214041","526394"],"PO":["150012"]},"463":{"abstract":"Graphs are powerful tools that can be used to model objects and relationships between objects. Indeed, many distinct problems can be cast as optimization problems in graph theoretic terms. Specifically, graph theory provides an excellent way to model problems related to transportation, network design, scheduling, robotics and many other areas. It is used to develop and illustrate the power of different algorithmic tools. There are three broad areas from which the particular problems considered in this proposal are abstracted: (1) Network Design: How can a network that connects a given set of sites be built? How can the network be made reliable, and also provide high bandwidth between sites (while keeping the cost low)? Such fundamental questions are addressed here. (2) Motion Planning: How does an agent navigate in an environment? What are good navigation strategies for navigating in unknown environments? In this case the agent discovers the environment by actually touching obstacles. How does an agent record an approximate map of the environment, when working with limited memory? (3) Scheduling: Precedence based scheduling problems arise in the context of manufacturing and compilation for parallel machines. How can effective heuristics for such problems be designed? For most of these problems it is very difficult to obtain even an approximate solution in polynomial time. Education Plan: Most computer scientists are constantly faced with the task of designing algorithms to solve problems. Although these arise in many different contexts, some basic principles underlie the design of efficient algorithms and data structures. As a part of the Education Program of this CAREER award, the PI is planning: (a) to undertake the training of students in designing algorithms, and (b) to teach them the importance of re-examining existing algorithms so as to make them simpler and more efficient. An algorithms lab where students undertake projects, implement algorithms, and act as consultants to students in other research groups is a significant step in this direction.","title":"CAREER: Approximation Algorithms for Graph-Theoretic Problems","awardID":"9501355","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["538796"],"PO":["150516"]},"871":{"abstract":"ABSTRACT \"NSFNET Connectivity\" Muskegon Community College PI: David Seith NCR-9502991 Muskegon Community College requests support from NSF for connection of their campus networks to Michnet and the Internet. Michnet is the midlevel network located in the state of Michigan that will provide operations and network information services. It will provide Muskegon Community College a 56KB connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The College needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Muskegon Community College as well as K-12 school age children who are offered a hands-on minicomputer camps using the institution resources.","title":"NSFNET Connectivity","awardID":"9502991","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[1961,1962],"PO":["57343"]},"266":{"abstract":"\"High Order Methods for Time Dependent Equations\" The project entails research in long term integrations of genuinely time dependent partial differential equations. It involves the development and application of high order finite differences and finite element schemes as well as Spectral methods. The methods to be developed and applied are suitable for problems in several space dimensions with complicated geometries. A major consideration in developing and assessing high order methods for long term integrations is their scalability. Based on the experience gained already in parallelizing ENO codes, a further effort to parallelize spectral and finite element based ENO codes is proposed. The research has two components, theory and applications, those components are linked together. The theory is motivated by the type of applications under investigation and the applications use the theoretical developments. It has been shown that in order to numerically simulate complicated flows that change in time, high order methods are necessary. However those methods, because of their high accuracy, are less robust. The proposed research deals with the issue of the successful implementations of high order methods. This involved theoretical issues (as solving the 100 years old Gibbs Phenomenon) as well as more applied issues. On the applied side, the problem of mixing enhancement by interactions of Shock waves and hydrogen jets will be studied. This entails the simulation of an air shock passing through an hydrogen jet in high Mach numbers. High order methods are mandatory here since the process of interest is the mixing and combustion inside the jets. The current codes, Spectral and ENO are to be modified to handle more general cases. Parallel versions of ENO and spectral methods are being applied now and will be further modified.","title":"Mathematical Sciences: High Order Methods for Time Dependent Equations","awardID":"9500814","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["387213"],"PO":["562372"]},"18956":{"abstract":"","title":"RIA: Examination of a Neuronal Algorithm Using VLSI-Based Models","awardID":"9696009","effectiveDate":"1995-09-01","expirationDate":"1996-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["73856"],"PO":["549626"]},"973":{"abstract":"The goal of the Polya project is to increase productivity in the development and maintenance of programs, by placing more emphasis on the user interface within the programming language itself. This research seeks new ways to write programs, to make programs efficient, and to reuse program parts. It is concerned directly with software engineering and rapid prototyping. The programming language Polya incorporates new mechanisms that allow a group of people to define and use notations of their problem domain, so that programs can more closely resemble the algorithms being used. Secondly, Polya has mechanisms that make it easier to describe how variables of high-level types should be implemented, requiring fewer modifications to the algorithm than is the case with more traditional languages. The transform, a new kind of program part, can be reused with relative ease. A prototype implementation of Polya uses the Synthesizer Generator as the platform. This research focuses on three areas: (1) research aimed at a significant extension of the pattern matching capabilities of the Polya transformational approach and exploration of new ideas on reverse engineering; (2) experimentation with Polya, in order to develop a library of useful program parts; (3) practical and theoretical improvements to Polya, its implementation, and related tools such as a source-level debugger.","title":"Software Engineering with a Transformational System","awardID":"9503319","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[2210,"320597"],"PO":["150697"]},"775":{"abstract":"NCR-9502582 Konstantopoulos, Takis This is a proposal about the development of a rigorous approach toward network management and performance analysis for high-speed networks considering local and global aspects of a network management system. Local aspects include the design of flow controllers at the edges of the network that take into account the provision of quality of service and the interaction between users in a network switch. The investigator will extend recently developed techniques that are based on the so-called reflection mapping, develop testing techniques and simulations, and compare these to existing schemes. The investigator will also study traffic modeling. He will develop rigorous methods for validating self-similar traffic processes arising from the operation of an integrated services high-speed networks and use such models in establishing performance analysis methods. Studying the global aspects of a management system involves using a macroscopic picture of the network currently being developed by the investigator. The picture strips out the minutiae of the operation of the network, while retaining its dynamic character (it is not static). The investigator proposes the use of such a picture by a network management system in order to predict, prevent, and correct undesirable behavior that might lead to degradation of services across the network.","title":"CAREER: Flow Control and Traffic Modeling: A Rigorous Approach Toward Network Management","awardID":"9502582","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["101899"],"PO":["150490"]},"974":{"abstract":"This research aims to further our understanding of the interplay between randomness and computation in complexity theory. The investigation concentrates on aspects of interactive proof systems, probabilistically checkable proofs, the approximability of problems in combinatorial optimization, and related areas. One goal is to examine several ways in which construction of probabilistically checkable proofs may be improved and in so doing strengthen the derived lower bounds on approximability. In addition, a study is planned of useful structures that may be suggested by these constructions, such as error-correcting codes with novel properties. Other goals are to investigate reducibility among probabilistic constructions and to consider the possibility that there are objects that are universal for such constructions.","title":"Randomness in Computation and Proof","awardID":"9503322","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["399045"],"PO":["150516"]},"6491":{"abstract":"IRI-9528808 Borgman, Christine University of California $35,992 - 12 mos Social Aspects of Digital Libraries The Digital Libraries research has brought together researchers from computer science, communications, library and information science, psychology, linguistics, and from the disciplines in which digital libraries are being created, including the sciences, social sciences, arts, and humanities. Digital Libraries are a prime example of large societal problems that bring human & technological resources to bear on their solutions. Many social aspects of digital libraries need to be addressed, as we come to undertand the full range of issues they encompass. This research workshop will focus on two social problems that are urgent in developing the National and Global Information Infrastructures: Information Needs: Identifying real information needs and developing digital libraries to mee those needs. End User Searching And Filtering: Designing digital libraries in which it is possible to find the right information in a glut of information. These two problems have been chosen because they are urgent, enough research exists to frame them but not enough to solve them, and the work on these problems is scattered across multiple disciplines that need to be brought to form a research community.","title":"Social Aspects of Digital Libraries","awardID":"9528808","effectiveDate":"1995-09-15","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[15938,"517365","184275",15941,"184276"],"PO":["503214"]},"5182":{"abstract":"One of the problems with programming using higher-order procedures is the absence of formal tools for analyzing the time and space complexity of such procedures. This absence is partially due to the fact that the current mathematical models of computation for higher types are very divorced from the complexity-theoretic concerns. The aim of this project is to work toward constructing a usable, realistic complexity theory for higher-order computation. This research model is partially based on Cook and Kapron's basic feasible functionals (BFFs), which are a class of finite-type functionals that are intended to be the finite-type analogue of PF, the polynomial-time computable functions. At type-2 there is a reasonable body of work which appears to confirm that type-2 BFFs are a reasonable type-2 analog of PF. Natural non-sequential extensions of the type-2 BFFs are investigated and a theory of non-sequential `polynomial-time` functionals is constructed. This extended theory of type-2 BFFs is also used to develop a theory of computational complexity for machine learning. Unlike the situation for type-2, for type-3 (and above), there is not the weight of evidence that the BFFs are a reasonable analog of PF. This research tests several models (partly based on the type-2 complexity) at type-3, by analyzing some higher-order algorithms involving monads, continuations, and other higher-order constuctions. An intermediate goal is to use the experience gained from this work on the complexity of finite-type functionals, to develop `complexity theoretic` solutions to domain equations. Such solutions have the potential of providing settings in which one could examine both semantic and complexity-theoretic features of languages such as ML.","title":"Higher-Order Computation and its Computational Complexity","awardID":"9522987","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550560"],"PO":["150516"]},"6073":{"abstract":"9527459 Knapp This award will allow San Jose State University to develop a two course sequence in the field of Human Computer Interfaces (HCI). These courses will by project-oriented and taught in a lecture\/laboratory mode. The projects, along with much of the course content, will by based on the research being performed at the San Jose State University in the HCI areas of biosignal input, sound localization, sonification and visualization. The lectures will cover subjects from pattern recognition to non-linear filtering to graphics algorithms. The laboratory projects will be developed by the course instructors with the close assistance of the Department of Occupational Therapy, and the Computer Art and Design Center (CADRE). Project teams of engineering students will be augmented by \"clients\" from these department who will define the requirements for the projects and evaluate each team's progress toward success. These courses will be taught at San Jose State University and at University of California, Santa Cruz via the new CALREN interactively networked teaching facility. Once the course has been fully developed, sites across the Silicon Valley will be able to present these courses.","title":"The Human-Computer Interface","awardID":"9527459","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["151490",14909],"PO":["297837"]},"920":{"abstract":"Mitchell 9503162 This postdoctoral research will be on developing novel techniques for the automatic programming of decentralized parallel architectures such as cellular automata. Preliminary research performed has shown that genetic algorithms (GAs) are promising techniques for designing one-dimensional cellular automata to perform computations. The major effort will be in extending the work from one- to two-dimensional systems, which will allow the design techniques to apply to real-world parallel computation problems such as image processing, pattern recognition, and image compression. This extension will require a number of advances in the theory of spatial parallel computation as well as in the theory and application of genetic algorithms.","title":"Postdoc: Automatic Programming of Decentralized Parallel Architectures","awardID":"9503162","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["451985"],"PO":["224490"]},"425":{"abstract":"This award supported travel expenses for student participants in CONCUR '95 -- the Sixth International Conference on Concurrency Theory, held August 21-24, 1995, in Philadelphia on the campus of the University of Pennsylvania. The purpose of CONCUR '95 was to bring together researchers, developers, and students from academia, industry, and government so that the science of concurrency theories and the technology of their applications can be advanced. The conference spans all areas of semantics, models, logics, and verification techniques for concurrent systems. Particular topics include, but are not limited to, process algebras, Petri nets, true concurrency, shared-memory and message-passing formalisms, operational and denotational semantics, programming language semantics, concurrent logic and constraint programming, fairness, temporal logics, compositional analysis techniques, model checking, verification tools, and applications. The primary goal of holding CONCUR '95 in the U.S. was to increase participation by American researchers in the area, and to encourage interaction among the various schools, both European and American, that have worked towards formal approaches to concurrency.","title":"CONCUR '95 - Sixth International Conference on Concurrency Theory; University of Pennsylvania; Philadelphia, PA; August 21-24, 1995","awardID":"9501225","effectiveDate":"1995-09-01","expirationDate":"1996-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["553656"],"PO":["150697"]},"6294":{"abstract":"This award is in the Small Grants for Exploratory Research mode. The central idea of this research is to explore ways to reduce the complexity and force and torque requirements of a robotic mechanism by designing the environment to minimize the physical forces that must be overcome in a manipulation task. Thus, for example, for two dimensional manipulation, moving friction can be greatly reduced by use of an air table on which the manipulanda are placed. Reducing the forces should yield great gains in simplicity of required manipulation mechanisms, which can be made much lighter, and which should have far less nonlinearity in their action (due to motor loads, hysteresis, backlash, etc.). This initial year of exploration will be confined to manipulation in planar workspaces. Ultimately, the basic idea should lead to new mechanisms that can be used in low-force, low-torque, or low- gravity applications.","title":"SGER: Scaling of Manipulation Tasks with Gravity","awardID":"9528176","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["560864"],"PO":["125480"]},"7152":{"abstract":"9531011 Raven This award provides initial funding to establish the new U.S. Civilian Research and Development Foundation for the independent States of the Former Soviet Union (CRDF). The CRDF is a nongovernmental, non-profit foundation to support collaborative basic research and collaborative applied research projects between American scientists and engineers and their counterparts in the 12 independent states of the former Soviet Union. The projects should enhance the conservation of the scientific and technological infrastructure in the countries concerned, promote defense conversion, and contribute to the transition to market-based economies. Fields of science and fields of application will be determined in consultations between the CRDF and counterparts in the former Soviet Union. CRDF is being established in accordance with the purposes of Section 511 of the FREEDOM Support Act of 1992. ***","title":"Funding Arrangement for the US Civilian Research and Development Foundation for the Independent States of the Former Soviet Union (CDRF)","awardID":"9531011","effectiveDate":"1995-09-01","expirationDate":"2014-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5224","name":"U.S. CIVILIAN RES & DEVEL FDN"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"9170","name":"NSF PLANNING & EVALUATION"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"H468","name":"NIH"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"I225","name":"Department of Defense"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"J266","name":"National Institutes of Hlth Na"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"J428","name":"NATIONAL INSTITUTE OF HEALTH"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"K186","name":"National Institutes of Health"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"L145","name":"National Institutes of Health"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"S119","name":"NIH"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"T263","name":"NIH-CRDF"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"T271","name":"NIH-CRDF"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"T631","name":"NIH-BIOMEDICAL & BEHAVIORAL RE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"V972","name":"NIH-CRDF"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"8262","name":"U.S.CIV R&D FDN FOR THE INDEP"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"V131","name":"NIH-BIOMEDICAL & BEHAVIORAL RE"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"V855","name":"NIH-CRDF"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"W245","name":"NIH-CRDF"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"W364","name":"NIH-CIVILIAN RES & DEV FDN"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"X164","name":"NIH-HUMAN FRONTIER SCI PROGRAM"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"X214","name":"NIH-FAC SCI & TECH COOPERATION"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Y182","name":"AID-CIVILIAN RES & DEV FDN"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Y183","name":"NIST-IND FIN SUPPORT EQUIP & S"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Y184","name":"NOAA-SURVEY OF THE POLLOCK STO"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Y400","name":"HHS-ECOLOGY & EPIDEMIOLOGY OF"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Y405","name":"NIH-WORKING WITH PARENTS AND S"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Y541","name":"NIH-CRDF"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Y792","name":"NOAA-EASTERN NORTHERN BERING"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Z283","name":"DEFENSE NUCLEAR AGENCY-R&D FDN"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Z478","name":"DEFENSE NUCLEAR AGENCY-"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"Z761","name":"NIH-CIVILIAN RES & DEV FDN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1679","name":"INTERNATIONAL COORDINATION ACT"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1580","name":"INSTRUMENTATION & FACILITIES"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1581","name":"CONTINENTAL DYNAMICS PROGRAM"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5419","name":"INTERNATIONAL SUPPORT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"8278","name":"NATO SCIENCE POLICY INTERNSHIP"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"6891","name":"CLIMATE CHANGE EDUCATION"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1402","name":"Division of ANTARCTIC INFRASTRUCTURE & LOG","abbr":"AIL"},"pgm":{"id":"5205","name":"ARCTIC RESRCH SUPPRT & LOGISTI"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"5219","name":"ARCTIC SYSTEM SCIENCE PROGRAM"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"5221","name":"ARCTIC SOCIAL SCIENCES"}}],"PIcoPI":[17536,17537,17538],"PO":["339390"]},"6096":{"abstract":"9527537 Rappaport This award will allow the Virginia Polytechnic Institute and State University and the University of Missouri-Rolla to develop and distribute a trilogy of electrical engineering courses at the senior\/graduate level. These courses include hardware and software components, combined with a change in teaching emphasis, and they will be offered at both universities, as well as at the University of Canterbury, in Christchurch, New Zealand. This project includes plans for the faculty to develop teaching materials, software modules, educational videotapes, and to provide laboratory\/hardware experiences for students that do not exist today. Using an advisory panel consisting of academic and industry experts from the communications field, the course trilogy will be reviewed and perfected during this curriculum development. Materials developed under this program will be made available to universities throughout the country, through widely available texts, software modules, experiment study guides, and world-wide web postings.","title":"Curriculum Innovation for Simulation and Design of Wireless Communications Systems","awardID":"9527537","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["560140","550857",14979],"PO":["297837"]},"800":{"abstract":"Array signal processing techniques were traditionally limited to military applications. Researchers recently found that these techniques could be applied to significantly expand channel capacity and improve quality of wireless communication systems through exploitation of spatial diversity. Despite significant research activities in array processing during the last decade, conversion of such military technology to cost sensitive commercial technology is not trivial. A significant amount of research and development effort is required to realize these techniques in a wireless communication system. This research is developing innovative antenna array processing techniques and fast implementation schemes for various wireless communication systems. The program scope is not limited to algorithm development, theoretical analysis, and simulation studies; our ultimate objective is to implement the resulting algorithms in real hardware. Industry specializing in digital signal processing and its applications in telecommunications has experienced rapid growth in this world due to high demand for information access and processing. To respond to such a growth, new courses in these areas and innovative teaching methodology must be developed so that students can quickly adapt to various challenges. During the proposed period, the principal investigator plans to develop several new courses in these areas including undergraduate lab courses, continue involving undergraduates in industry sponsored projects, design more computer projects, create opportunities for minority students and students with disabilities, and, what is more important, develop a multimedia teaching method drawing on advanced technology, e.g., live audio, video, and graphical illustrations and real hardware demonstrations.","title":"CAREER: Development and Implementation of Antenna Array Processing Techniques for Wireless Communications","awardID":"9502695","effectiveDate":"1995-09-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[1798],"PO":["564898"]},"745":{"abstract":"The research portion of this CAREER project seeks to develop a conceptual framework and prototypes for an organizational learning approach to software development. The project addresses the codification of knowledge as it emerges in development organizations. The goal is a form that can be used as the basis for the continual improvement of software products and the development process. A domain lifecycle methodology is being developed that shifts the focus from individual projects to recurring design problems and solutions developed by an organization. The research is based on empirical observations of a large software development organization. Project goals include: (1) Creation of reuse-based software development methodologies incorporating organizational learning tools; (2) Development of domain knowledge from individual cases to design guidelines to formal reasoning systems supporting domain-oriented design; (3) Development of prototype systems using case-based technology to support organizational learning; (4) Provision of a body of empirical results based on studies of real world development projects and evaluations of prototypes supporting organizational learning. The educational goals of this project are to: (1) develop active learning techniques for teaching software design concepts; (2) stimulate lifelong learning through organizational learning techniques. While organizational learning is integrated with the research portion of this project, active learning techniques are explored through the development of a multimedia design studio for teaching software design concepts.","title":"CAREER: An Organizational Learning Approach to Software Development","awardID":"9502461","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["356244"],"PO":["150697"]},"1081":{"abstract":"This project focuses on three related areas: (1) No-missing-term p-adic lifting --- Establishing a faster algorithm for recovering final results in multivariate polynomial operations such as GCD (Greatest Common Divisor) and factoring. The lifting method is most effective when the polynomials involved are sparse, containing just a few of all possible terms. (2) Function Evaluation Optimization and Applications --- Speeding up the repeated evaluation of functions in closed- form formulas through the application of recurrence relations. Nested recurrences called ``chain of recurrences'' will be derived by symbolic computation and applied to increase the evaluation speed of formulas at regular intervals. Application in interactive graphical visualization will be made. (3) Interfacing Distributed Scientific Systems --- Seeking to establish an efficient and standardized protocol to connect different autonomous systems for scientific computation. Such a protocol is necessary to build distributed ``problem solving environments''. By exploiting sparseness and solving systems of linear equations, the p-adic lifting procedure of item (1) will be investigated. Feasibility will be studied. Algorithms will be specified, implemented and applied. For area (2), automatic generation of chain of recurrences (CR) for functions of one or more variables will be implemented, and tested for speed and effectiveness. The numeric properties of CRs will be studied. The technique will be applied to speed up interactive graphical visualization of mathematical functions. For area (3), an efficient and protocol(called MP) will be designed. Libraries in C will support the protocol.","title":"Efficient Algorithms and System Interface for Scientific Computation","awardID":"9503650","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["277844"],"PO":["187585"]},"6394":{"abstract":"9528439 Ezekiel Massachusetts Institute of Technology \"Improving Access to High Quality Network-Based Education and Training\" This project was requested and funded by the Advanced Research Projects Agency (ARPA). NSF is handling the award because of its interest in this and related projects, some joint-funded with ARPA. The award supports an 18 month project to investigate seamless delivery of high-quality interactive multimedia programing using CD-ROM (local) and server (network) content over a wide spectrum of bandwidths. In addition to two prmtotypical programs being developed, deliverables include client and server software, research reports, publications and tutorials and colloquia. Most of the effort will be performed by Dartmouth College and Medical School under a subcontract to MIT. MIT is the prime on two related awards and is coordinating the entire effort. The University of Georgia is providing assessment of learning outcomes under a subcontract to Dartmouth.","title":"Improving Access to High Quality, Network-Based Education and Training","awardID":"9528439","effectiveDate":"1995-09-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"Z125","name":"ARPA-NETWORK MULTIMEDIA INFORM"}}],"PIcoPI":[15696,"361033","260188",15699],"PO":["121202"]},"801":{"abstract":"Digital audio and video are increasingly common as data that are manipulated in computer and communication systems. The use of information retrieval mechanisms (e.g., Mosaic, Gopher) that allow the exchange and display of audio, stills, and video is rapidly becoming a major consumer of network bandwidth and storage. Without filtering mechanisms or hierarchical coding schemes one must process a great deal of data to yield sought information. To support future interactive information delivery services such as entertainment, distance learning, home health care, and telecommuting, there is a need to provide efficient means for locating, accessing, and delivering enormous amounts of video content. The research described in this proposal seeks to enable fast access during browsing and retrieval of this video content. The ``fast access'' is proposed to be achieved by a combination of approaches involving: (1) development of domain-specific information models for video content, (2) development of automated information capture for hierarchical coding and scalable delivery in the audio\/video domains, (3) use of video query\/interface techniques tailored to the information models, and (4) mapping of information content to developed delivery protocols. Anticipated results are techniques and proof of concept for the proposed fast access. Proposed teaching activities encompass the development of courses to reflect the changing needs of computer engineers and the use, evaluation, and promotion of computer-based instructional tools.","title":"CAREER: Fast Access Techniques for Video Information Retrieval","awardID":"9502702","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["371069"],"PO":["563751"]},"614":{"abstract":"This research is part of a long term effort to migrate techniques for synchronous design to asynchronous design. The two focus areas are sequential optimization and synthesis for testability. In the former, problem formulations of input, output and input\/output encoding are being investigated. In each case, the problems of optimality, race-free encoding, and hazard free logic are being solved simultaneously. In the latter, synthesis of fully testable asynchronous state machines using partial or no scan is being pursued. Design tools, incorporating the algorithms for optimization and synthesis for test, are being developed.","title":"Testability and Sequential Optimization of Asynchronous State Machines","awardID":"9501880","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["518562"],"PO":["321058"]},"625":{"abstract":"The performance of an integrated circuit depends on the designers' choices and the process engineers' decisions during the manufacture of the device. Typically the choices and decisions are independent of each other with little awareness of the interplay of the two engineering domains. This research develops methods for raising the designers' awareness of the effects of circuit implementation parameters and to sensitize process engineers to the impact of processing decisions on the performance of the final circuit. A statistical model is developed to correlate device and process parameters, primarily to establish circuit performance variations on spatial and process dependencies in replicated circuits. Circuit simulators are used to solve the resultant (huge) set of nollinear differential equations. JUSTIFICATION","title":"A Statistical Modeling Methodology for Submicron MOS Devices and Circuits","awardID":"9501912","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485916"],"PO":["549626"]},"3480":{"abstract":"9512272 DeFanti The main focus of the proposed project is to create virtual-reality and virtual-prototyping instrumentation for viewing scientific and engineering data. The University has been involved in an ongoing development of the CAVE virtual-reality theater, a room-sized, high-resolution, projection-based system that enables users to experience good immersion in full 3D imagery. The goal of this proposed project is to broaden the scope for making the CAVE both smaller and larger. A smaller, software compatible, drafting-table format version, called ImmersaDesk, is being designed. It uses a high-end graphics system and projector for each ImmersaDesk, and a ATM gear to allow remote ImmersaDesk to ImmersaDesk collaborative design sessions. A larger high-resolution (1600 x 2048) stereo screen, called NII\/Wall is being developed for large audiences. The NII\/Wall will serve as a portal into networked scalable computers located around the country so scientists and engineers can interact with simulations running on distributed clusters of shared-memory processors. ***","title":"Development of Instrumentation for Shared Virtual Prototyping: The ImmersaDesk and the NII\/Wall","awardID":"9512272","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"9155","name":"ACADEMIC RESEARCH INFRASTRUCTU"}}],"PIcoPI":["557607"],"PO":["301532"]},"1082":{"abstract":"This research addresses computation of reachable states for VLSI designs described in high-level languages and the application of these results to automatic test pattern generation (ATPG). Methods to compute symbolically the set of states reachable from an initial state are being explored. An extended finite state machine (ESFM) model, which can represent communication protocols and hardware behavior, is being used. A key idea is that the model allows use of arbitrary state variables, such as boolean and arithmetic, which will provide efficiency in computation. Methods and prototype tools to convert automatically a design in VHDL to an ESFM are being developed. These methods and techniques are being applied to ATPG for sequential circuit test.","title":"Reachability Computation Using the Extended Finite State Machine Model and its Application to Automatic Test Generation","awardID":"9503651","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["287642"],"PO":["321058"]},"6340":{"abstract":"9528281 Lindeman \"Enabling Faculty Development in Indiana Extending the Advantages of the Internet\" Indiana University requests support from NSF for two connections to the Internet through the INDnet regional network. One connection will serve Martin University in Indianapolis and the other connection will serve Ivy Tech College at Logansport. INDnet is a regional network located in the state of Indiana that will provide operations and network information services. It will provide Martin University and Ivy Tech College with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The institutions need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connections will benefit the students, faculty and staff of Martin University and Ivy Tech College.","title":"Enabling Faculty Development in Indiana Extending the Advantages of the Internet","awardID":"9528281","effectiveDate":"1995-09-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[15565,15566,15567],"PO":["121202"]},"5020":{"abstract":"9522207 Bernat This award provides infrastructure support for a program designed to substantially increase the number of minorities, particularly Hispanics, who complete degree programs in the areas of computer and information science and engineering. It involves both the Computer Science and Computer Engineering Departments at the University of Texas at El Paso (UTEP). The project is built around the concept of Affinity Groups, groups which are centered about a research area and which involve both graduate and undergraduate students and one or two faculty members at the center of each group. Within the groups, emphasis is on developing social and communication skills as well as on research and technical skills. A strong evaluation component is built into the project. It is anticipated that the structure developed has the potential to become a model for the success of minority students at a wide range of similar urban, commuter institutions. ***","title":"CISE Minority Institutions Infrastructure: Building Affinity Groups to Enable and Encourage Student Success in Computing","awardID":"9522207","effectiveDate":"1995-09-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["139538","209556","318770","559621"],"PO":["557609"]},"5042":{"abstract":"9522297 El-Haggan The Baltimore City Community College requests support from NSF for connection of two college campus networks to SURAnet. SURAnet, a midlevel network will provide operations management and information services and it will give the two campuses access to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The campuses need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Baltimore City Community College campuses as well as the community in general.","title":"Baltimore City Community College Internet Program","awardID":"9522297","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[12341],"PO":["57343"]},"5086":{"abstract":"9522611 Brand This project establishes a Network Information Center at two campuses of the Navajo Community College, and will work toward developing a virtual campus linking all seven campus sites in the Navajo Nation. The eventual goal is to enable \"attendance\" at Navajo Community College at any of the 111 communities within the Navajo nation. Connectivity to the Internet for the Community College is being provided by Westnet and New Mexico Technet under another award. Duration of this award is two years.","title":"Arizona State Public Information Network (ASPIN) Connecting Navajo Community College","awardID":"9522611","effectiveDate":"1995-09-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["465414","30798"],"PO":["121202"]},"8496":{"abstract":"9552952 Kozma The Center for Technology in Learning at SRI International and the Software Publishers Association represent the two constituencies targeted by these objectives. The intended approach of this project is to use the position of these two organizations to bring together members of the academic research and development community with members of the software publisher community to identify issues, discuss their resolution and develop collaborations that will bring NSF-funded ideas and projects to market and increase their impact on education. The vehicle for this meeting is the national meeting of the Software Publishers Association, scheduled for Boston, MA Sept 26-30, 1995. Typically, 1,500 people attend the east cost conference of SPA. We plan a series of activities during this conference that will address the objectives above. Some of these activities will be open to the general audience attending SPA. Other activities will be limited to an invited group of academics and publishers that will begin what is hoped will be an on-going dialog that contributes to the resolution of the identified issues. ***","title":"Increasing the Impact of Advanced Technology on the Education Market.","awardID":"9552952","effectiveDate":"1995-09-01","expirationDate":"1996-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7257","name":"APPLICATS OF ADVANCED TECHNOLS"}}],"PIcoPI":["546530",21303],"PO":["527266"]},"1292":{"abstract":"IRI-9529227 Janikow, Cezary U Missouri Saint Louis $35,544 - 12 mos REU and RUI: Fuzzy Decision Trees The objective of this research is to explore ways to utilize fuzzy representation to increase the representative power of symbolic decision trees. Decision trees are a popular and easilyunderstood inference mechanism for use in knowledge based systems. The use of fuzzy representations for knowledge has similar comprehensibility advantages, and is particularly natural in describing mixtures of continuous and discrete symbolic features. Fuzzy representations can advantageously be combined with decision trees. This project explores merging fuzzy representation and symbolic decision trees by modifying both the tree-building routines and the inference methods. The latter of these is quite challenging, and the results need to be empirically evaluated. The overall goal in doing this is to utilize the existing methodologies while preserving their important advantages, as mentioned above, in the combined forms.","title":"Fuzzy Decision Trees","awardID":"9504334","effectiveDate":"1995-09-01","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[2977],"PO":["54008"]},"2260":{"abstract":"9507756 Condon In an effort to increase the number of women entering graduate school in CISE disciplines, the Computing Research Association (CRA) has been awarded a continuation of the Distributed Mentor Project (Award CDA-9302536) where 20-25 female students are matched with a number of female professors in CISE research areas each of the years 1996-1998, to participate in a summer of research at the mentor's institution. The students will most likely be computer science or computer engineering majors although this is not required. In addition, the pi's have been funded to conduct a longitudinal evaluation of the two projects over the years 1994-1998. The evaluation will measure how well the projects have met the goal on increasing the number of women in CISE disciplines entering graduate school. The most useful aspect of the mentoring\/research will also be assessed on an annual basis in order to provide feedback for improving the remaining years of the project. The CRA is an association of U.S. and Canadian academic departments of Computer Science and Computer Engineering, and Industrial Laboratories engaging in basic computing research. The mission of CRA is to represent and inform the computing research community and to support and promote its interests. Dr. Weingarten is the Executive Director of CRA. Dr. Anne Condon, the academic leader of this project, is an Associate Professor of Computer Science at the University of Wisconsin. ***","title":"Special Project: The CRA Distributed Mentor Project","awardID":"9507756","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1544","name":"RES ON GENDER IN SCI & ENGINE"}}],"PIcoPI":["183023","217930"],"PO":["297837"]},"1094":{"abstract":"This project focuses on the problem of power dissipation, primarily on the fundamental issues of what are the real sources of power dissipation in CMOS microprocessors, and what can be done to minimize it at a more global level. The goal is development and demonstration of techniques that would support Power-efficient Instruction Set Architectures (PISA). For this, there are four major tasks: 1. Developing technology independ models and metrics for power dissipation in CMOS logic. 2. Analyzing current day designs to benchmark the stat of the art and to indentify processor subsystems that are potential power hogs. 3. Development of new techniques that will reduce these metrics. 4. Demonstration of these techniques in a prototype CMOS PISA CPU chip. These new techniqujes will indlude gate disign level approaches, but will focus primarily on organizaitonal and instruction set architectural appropaches that inherently have a lower power requirement. The end goal of this research is to develop a deeper scientific understanding of the relationship between power and computation, and develop techniques that minimize the ratio of the two in ways that can broadly impact the continuing evolution of VLSI technology and its successful use in computing.","title":"Architectural Techniques for Inherently Lower Power Computers","awardID":"9503682","effectiveDate":"1995-09-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["336016"],"PO":[2504]},"5472":{"abstract":"9523976 Hoffman This proposal requests partial support to continue a successfully NSF funded project. The seminar series, which is held on the third Tuesday of each month discusses issues important and relevant to the \"information Superhighway\" like privacy, advertising, crime, regulatory agencies and others. This project will allow the institution to continue this series of seminars and will have the series recorded so persons, not able to attend the session, will be able to view the seminar of choice at a later time. In addition compilation of information from the series will be added to the electronic library of Seminar Series documents and made available via the World Wide Web.","title":"Video Taped Seminar Series II on Interdisciplinary Aspects of the Electronic Superhighway","awardID":"9523976","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["529428"],"PO":["57343"]},"6451":{"abstract":"This is the initial funding of a 36-month cooperative agreement to fund the Linguistic Data Consortium (LDC). Under this funding, the LDC will create new databases and improve infrastructure to continue and improve its work of creating, publishing and distributing data for research on human language technology. Improved speech and text data resources will be created in three areas: multilingual speech, multilingual and parallel text, and human-computer interaction. The LDC will publish and distribute these resources using the same approach of the many databases already in its catalogue. In addition, the LDC proposes to provide improved Internet-based access for its members to essentially its entire archive of data, except where license agreements stand in the way. This access would encompass both WWW-based search and retrieval of modestly sized pieces of the data, and also (on an experimental basis) wide-area remote file mounting for access to entire databases. Significant LDC cost-sharing is proposed for all of these activities, including the donation of time and facilities as well as the expenditure of case for equipment, license fees and additional needed labor.","title":"HLR: Improved Speech and Text Data Resources","awardID":"9528587","effectiveDate":"1995-09-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X092","name":"DEFENSE-LANGUAGE DATA CONSORTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y154","name":"NSA-HUMAN LANGUAGE RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y493","name":"DARPA-LINQUISTIC DATA CONSORTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y662","name":"DEFENSE-HUMAN COMPUTER INTER P"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y678","name":"DEFENSE-DATA COLLECTION UNIV O"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y911","name":"DEFENSE-CELLULAR TELEPHONE COR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y936","name":"DEFENSE-DATA RESOURCES FOR SPE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y957","name":"DARPA-LINGUISTIC DATA CONSORTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z133","name":"ARPA-HUMAN LANGUAGE TECH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z995","name":"ARPA-HLT CONTRACT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1311","name":"LINGUISTICS"}}],"PIcoPI":["507484"],"PO":["565227"]},"6341":{"abstract":"9528286 Grassman Notre Dame College: Connection to the Internet Notre Dame College of Ohio requests support from NSF for connection to the Ohio Academic Resources Network (OARnet). OARnet, a midlevel network in the state of Ohio, will provide operations management and information services and it will give the campus access to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The campus needs the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Notre Dame College campus as well as the community in general.","title":"Notre Dame College: Connection to the Internet","awardID":"9528286","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[15569,15570],"PO":["57343"]},"6000":{"abstract":"The Virtual World Data Server is a multi-user, distributed, real-time data server intended for very large virtual environment simulations. The heart of this system is the Real-Time Storage Server (RTSS). The RTSS is designed to efficiently store and retrieve large amounts ( > 1 terabyte) of spatially distributed heterogeneous data. The RTSS communicates over high speed asynchronous transfer mode (ATM) connections with multiple interactive real-time simulations. It establishes a two-way link with each active simulation in order to determine where the current viewing position is and where the viewer is headed. The RTSS makes a determination of what 3-dimensional information is needed, retrieves that information from disk in an optimized fashion and delivers it to the simulation in a just-in-time manner. The RTSS is complemented by an advanced three-dimensional visual simulation system. Together these two systems are capable of supporting a variety of demanding applications including (but not limited to) urban planning, medical, emergency response, physics, architecture and urban design. This system promises to dramatically improve the way that cities are planned and scientific and medical experiments are visualized. It allows community members and interested citizens to understand and evaluate the impact of policy and planning decisions and it provides capabilities for scientists to visualize datasets over 100 times larger than that which is possible today.","title":"MDC: The Virtual World Data Server","awardID":"9527178","effectiveDate":"1995-09-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[14722,"142856","460714","140393","296399"],"PO":["563751"]},"4450":{"abstract":"IRI-9520243 Prasad Tadepalli Oregon State University $77,772 - 12 mos. Average Reward Reinforcement Learning Reinforcement learning is the improvement of performance of an agent due to rewards and punishments. Most studies of the phenomenon so far have assumed that the learning proceeds through maximizing the discounted total reward from the environment. Discounting tends to favor the sacrifice of higher long-term rewards in favor of short-term rewards. On the other hand, performance is often better enhanced in real situations by the use of average reward per unit time. One such application is the scheduling of automatic guided vehicles (AGVs - robots used for material handling tasks in flexible manufacturing systems), where optimization of discounted total reward will influence the robots to serve machines that are close and neglect those far away, leading to stoppage of the more distant machines, and perhaps to the halting of the entire manufacturing system. The objective of this project is to use the AGV scheduling problem as a means of studying reinforcement learning methods that optimize average reward to avoid such pitfalls, leading to a better understanding of the factors that influence performance under automated average reward reinforcement learning.","title":"Average Reward Reinforcement Learning","awardID":"9520243","effectiveDate":"1995-09-15","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["518680"],"PO":["565227"]},"407":{"abstract":"The research component of this program has two major thrusts: 1) an investigation of the mathematical and computational aspects of the multiframe, bilinear image-recovery problem; and 2) the development and application of solutions for problems in the areas of high- resolution transmission electron microscopy, and ground- and spaced-based astronomy. Theoretical advances in this program are providing a unified approach to many imaging problems in which intensity data are recorded, including those for which satisfactory solutions have not been previously discovered. Collaborations with materials scientists on problems such as the study of atomic scale processes in solid batteries are providing exciting applications for which new methods developed in this program are being used to enhance the resolving and information-gathering powers of electron microscopes. Through the teaching component, an educational program is being established with emphasis on; 1) the development of a multi- disciplinary laboratory in which faculty and students from many departments jointly explore problems in remote sensing and imaging; 2) the development of multi-disciplinary courses in remote sensing imaging in which students from many departments are included, and the educational goals for each student -- ranging from theoretical foundations to specific applications -- are tailored to his or her individual needs; and 3) the use of a strong research-teaching exchange in which cutting-edge technology is used in the classroom and laboratory as a tool to excite, motivate, and retain enthusiasm in the students.","title":"Image Recovery from Multiple Intensity Measurements with Applications to Electron Microscopy and Astronomy","awardID":"9501163","effectiveDate":"1995-09-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["71161"],"PO":["564898"]},"308":{"abstract":"9500909 Walnut The project consists of two parts. First, the investigator proposes to apply new results in sampling theory to do high-resolution signal processing by combining several low-resolution versions of a given signal. It was observed by Berenstein and others that a mathematical model of this problem (called multisensor deconvolution) is uniquely solvable but ill- posed, and difficult to solve numerically. The investigator has found Shannon-type sampling formulas on unions of regular lattices with incommensurate densities, which provide simple solutions to the multichannel deconvolution problem in special cases. The following applications are envisioned: 1) Sharpening measurements taken by CT scanners by combining measurements from several low-resolution detectors. This could ultimately lead to inexpensive measuring devices with resolution comparable to expensive high-resolution machines. 2) A recently proposed scheme to increase resolution in an industrial tomography problem involves sampling on unions of regular grids of incommensurate size. The investigator's sampling results could lead to a complete solution to this problem. 3) New techniques are required to do \"superresolution\" in electronic imaging since the theoretical limit of pixel resolution is rapidly being reached. Deconvolution at high-resolution of several low-resolution images is a natural approach to this problem. Second, the investigator and others have successfully shown that wavelets are a natural tool for recovering edge features of an image from local Radon transform data. The investigator proposes to develop these local algorithms with the following goals envisioned: 1) Find ways to recover locally density as well as edge features of an image, and develop an algorithm competitive with existing local tomography algorithms and 2) Identify the wavefront set of an image using wavelets, and ultimately apply the techniques to the at tenuated Radon transform. The first part of the project is concerned with increasing the resolution of remote sensing devices such as electronic cameras. Suppose, for example, that a CCD camera has a resolution of 1 millimeter, that is, it can distinguish features of a scene that are at least 1 mm on a side. Features smaller than that are blurred into their surroundings. Berenstein and others observed that some classical mathematics led to a possible way to increase resolution without designing an expensive high-resolution device. If one took several images of the scene with cameras identical to the first but which had slightly poorer resolutions than the first (this could also be achieved by repositioning the same camera), then in theory one could recover features of the original scene to arbitrary resolution. In practice, arbitrary resolution is not possible, but it seems that real increases in resolution can be achieved. The investigator has formulated an approach to this problem from the point of view of sampling theory. Using this approach, the investigator has been able to produce numerically stable twenty-fold increases in resolution in a one-dimensional model problem. More work is required, but the following applications are envisioned: 1) Producing high-resolution measurements from CT scanners by combining the measurements from several low-resolution scanners and 2) Increasing the resolution in a specific industrial tomography problem by a direct application of the investigator's new sampling results. The second part of the project is concerned with \"local\" CT scans. In existing CT scanners, an entire slice of a patient's body must be exposed to radiation even if the doctor is interested in looking at only a small region. The investigator proposes to use a new and powerful signal processing technique called wavelets to find efficient algorithms for obtaining an image of a small area of a patient's body while only exposing the area of interest to radiation. It is hoped that these techniques will be competitive with existing so-called local tomography algorithms.","title":"Mathematical Sciences: New Results in Sampling and Wavelet Applications in Tomography","awardID":"9500909","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["113494"],"PO":["565356"]},"804":{"abstract":"The primary emphasis of this Career Development Plan is the coordinated development of research and education programs in high-performance computing for computational science and engineering. Research Plan: The main goals of high-performance computing are high-performance, scalability, and portability. To attain these objectives for modern scientific and engineering applications, new hardware paradigms, new software methodologies, and new numerical algorithms are needed. Moreover, the interdependencies between hardware, software, algorithm, and application have an essential bearing on performance, scalability, and portability and must also be well understood. This work is an inclusive effort to create a substantial, unified base of understanding about high-performance computing for scientific and engineering applications that can be broadly applied. The specific objectives of this work are to: (1) Develop and analyze high-performance, portable, computational kernels and numerical libraries that are capable of exploiting modern computing architectures and operating systems, such as symmetric multiprocessors, operating systems, and gigabit networks; (2) Develop and analyze prototype object-based and object-oriented scalable software libraries for high-performance computing and for computational scientific and engineering applications; (3) Develop and analyze new algorithms for maximizing the scalability of stationary and time-dependent problems; (4) Apply the new algorithms and software libraries to real, substantial, computational science and engineering applications. Education Plan: Because of the increasing importance of computational science and engineering, it is important that computer scientists (and indeed, scientists and engineers in general) understand the intricacies and inter-relationships inherent to high-performance computing. A graduate course in numerical computing has already been developed and incorporated into the graduate core curriculum in the Computer Science and Engineering program at the University of Notre Dame. Building on this course, new graduate-level courses in high-performance computing will continue to be introduced. At the undergraduate level, a senior elective in high-performance computing is being introduced, and there will be continued effort to support and direct undergraduate research.","title":"CAREER: High-Performance Computing for Computational Science and Engineering","awardID":"9502710","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["562709"],"PO":["187585"]},"5782":{"abstract":"9526518 Coleman This award provides support for a workshop on \"Introduction of High Performance Computing in Undergraduate Computing Programs\" to be held at the 1995 ADMI meeting. The annual ADMI meeting brings together faculty from a large number of minority institutions. The goal of this workshop is to provided participants with a comprehensive overview of computational science curricula and hands-on experience with the use of the Internet and HPCC shared resources. The workshop program includes a series of lectures by experts in the field, discussion of possible curricula implementations, and demonstrations and hands-on experiences in the use of the Internet, Netscape, and the World Wide Web. ***","title":"Special Project: Curriculum Workshop on the Introduction of High Performance Computing into Undergraduate Computing Programs","awardID":"9526518","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["126686","427040"],"PO":["564412"]},"5573":{"abstract":"9525936 von der Lippe This project connects four small higher education institutions over 56 kbps lines to the Internet. It also will add a T1 frame-relay connection to NYNEX to support the new connections. They are: Bunker Hill Community College Cape Cod Community College Roxbury Community College Massachusetts College of Art Faculty and students at the new sites will benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they will be able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Massachusetts Public Higher Education Request for Connectivity to the Internet, Proposal No. 4","awardID":"9525936","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[13661],"PO":["57343"]},"6574":{"abstract":"This workshop will bring together over 100 key researchers in computer science, engineering, and educational technology to discuss future trends in research and to develop a research agenda. The workshop will have six parallel working sessions which will focus discussion and develop working papers on a set of key research topics in the field of educational technology. These papers will be assembled with an overview paper and distributed widely.","title":"Working Symposium of New Information Technology and Education: A Research Agenda","awardID":"9529074","effectiveDate":"1995-09-15","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["217930","521278"],"PO":["564412"]},"9731":{"abstract":"","title":"Localized Congestion Control Strategies for Network-wide Performance Guaranties","awardID":"9596244","effectiveDate":"1995-09-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["158256"],"PO":["125800"]},"6222":{"abstract":"IRI-9527982 Wong, Stephen University of California-San Francisco $49,666 - 12 mos SGER: content-Based Retrieval of Multimodel Medical Images Medical images are at the heart of patient's diagnosis, therapy treatment, surgical planning, outcome assessment, and medical education. They, however, impose the most stringent requirements of information management in the future multimedia healthcare environments. Accordingly, this research will explore new techniques of content-based retrieval of multimodal medical images, including magnetic resonance imaging (MRI), positron emission tomography (PET), magnetic resonance spectroscopy (MRS), and magnetoencephalography (MEG), as well as complemented textual reports and image annotations. The term \"content\" is in a general sense, including structural and functional contexts of particular objects in an image, the objects themselves and their three dimensional anatomical structure, and even their semantic relationships across different kinds of medical images. The success of this exploratory research will provide key technical ingredients to construct future multimedia healthcare information systems and open up new vistas for digital medical library.","title":"Content-Based Retrieval of Multimodal Medical Images","awardID":"9527982","effectiveDate":"1995-09-15","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["264468"],"PO":["503214"]},"4980":{"abstract":"9522079 Giguette This award provides support for a comprehensive program that will make substantial infrastructure changes to the computer science and related disciplines at Xavier University. The goals of the program are 1) to increase the number of majors in CISE disciplines by 50%, 2) to increase the number of CISE majors who go to graduate school by 100%, and 3) to expand the research activities of all of the CISE students and faculty. These goals will be addressed by revising and significantly expanding the current summer outreach programs, expanding the undergraduate research and mentoring programs, and establishing new teaching and research laboratories. This project builds on the very successful similar efforts in the health sciences at Xavier. It is anticipated that comparable results can be achieved in the computing disciplines as well and that the model developed in this project has the potential to become a national model for minority student success at other similar institutions. ***","title":"Minority Institutions Infrastructure: Furthering the Goal of Increasing the Number of Minority Undergraduate and Graduate Students in CISE Disciplines","awardID":"9522079","effectiveDate":"1995-09-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["229871",12182,"425180"],"PO":["557609"]},"2692":{"abstract":"This research involves the development, construction and testing of new architectures for high-speed computing. The idea being exploited is that of combining in a loosely-coupled fashion, general-purpose, RISC-based processing nodes each with multiple field-programmable-logic-array(FPLA) based coprocessor systems. With this kind of system, one has the hardware properties of a general-purpose computer, but the advantage, brought about by suitable reconfigurability, of performance more akin to that of a special-purpose engine. In particular, the 20-node Armstrong III system has been built and is operational and provides nearly two-orders of magnitude improvement over current advanced workstations. The hardware system, combined with its configuration compiler, a program that automatically translates a C function subroutine to both machine code and to the hardware design of the reconfigurable coprocessors, are the basic building blocks for this class of architectures. Thus, this research is directly focused on one of the strategic areas of national concern, that of high performance computing. There is uniqueness to this program in that not only has the hardware\/software system been built, but it is also being tested on important, real applications. In particular, the training of a modern hidden Markov model(HMM) based speech recognition system requires hundreds of hours, even with some of the variants developed recently at Brown and elsewhere. The reduction of this training time to ten or so minutes means that research progress in this area may be made at a faster rate and\/or that expensive nonlinear optimization techniques may now be applied to the problem. Also, this means that data from a less cumbersome sensor system (the microphone array systems in place and being developed at Brown) can be suitably incorporated into a more robust speech recognition system. Currently, eight PhD students, two ScM students and five undergraduates are involved with this project; ni ne PhD's have been graduated from this project under past funding.","title":"Parallel Architectures for Speech Recognition: Nonlinear Optimization of Expectation-Maximization (EM) Training of Hidden Markov Models (HMMs) in a Reconfigurable Environment","awardID":"9509505","effectiveDate":"1995-09-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["20783"],"PO":["564898"]},"9710":{"abstract":"","title":"Mathematical Sciences and Computer Research: Higher Order Finite Element Methods and Adaptive Approaches","awardID":"9596223","effectiveDate":"1995-09-01","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["514847"],"PO":["209579"]},"3055":{"abstract":"9510703 Berman The award will support the continued development of the Nucleic Acid Database, a database of three-dimensional structures of oligonucleotides and nucleic acids. The goals of the project are to devise an easily accessible and user friendly resource that serves a broad, international group of users including crystallographers, theoreticians, modelers and other researchers interested in such structures. The goals of the project are to expand the scope of the database and to refine existing and develop new, user-friendly software that facilitate data entry and research on the database, rather than simply on individual entries. The expansion of scope will allow the database to accept direct entry by researchers of structural data on nucleic acids determined by x-ray crystallography. The database will continue to cooperate closely with the Protein DataBank at Brookhaven National Laboratory, and will now itself include structural information on proteins and protein-nucleic acid complexes derived from the Protein DataBank. In addition, the database will provide the first extensive test of the use of the mmCIF, a new, information-rich format for structural data on macromolecules that is expected to become a standard format for such data. ***","title":"Nucleic Acid Structure Database","awardID":"9510703","effectiveDate":"1995-09-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["380674"],"PO":["565136"]},"6135":{"abstract":"9527664 Hughes This project will systematically field test the technical characteristics of a selected variety of wireless devices and digital radio nets which can be integrated into types of telecommunications networks, including the Internet, which serve the broadest purposes of public education and research by linking computers, sensing devices, control systems, servers, LANS and WANS operated by individuals, classrooms, schools and colleges for research, learning and teaching, connectivity, collaboration, and conferencing. In textual, sound and image modes of communications.","title":"Wireless Field Tests","awardID":"9527664","effectiveDate":"1995-09-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["201347"],"PO":["121202"]},"6278":{"abstract":"9528128 Abelson \"Partial Support for the ACM Sixth Conference on Computers, Freedom, and Privacy\" This award helps underwrite speaker travel and publication of proceedings for this conference to be held Cambridge MA in March, 1996. The conference is interdisciplinary, and addresses the potential effects on society and individual freedom and privacy resulting from the use of computers, data banks, computer networks, and communications systems. NSF has provided partial support for the last four annual conferences.","title":"Partial support for the ACM Sixth Conference on Computers, Freedom, and Privacy; March 27-30, 1996; Cambridge, MA","awardID":"9528128","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["551967"],"PO":["43608"]},"4530":{"abstract":"The objective of this project is to study theoretical and practical issues in the evaluation of general globel predicates and functions of distributed software. As an application of the techniques of the research, the project will focus on distributed monitoring systems for fault tolerance. An example of detecting a global predicate arises in implementing the most basic command of a monitoring system: `stop the program when the predicate is true`. To stop the program it is necessary to detect the predicate q, which is not a trivial task if q requires access to the global state. There are three components to the project: theory, algorithms and implementation. There are two questions that will be investigated in terms of theory. First, the class of global predicates that are efficient to detect will be classified. This will also entail studying the limits of efficient detection of global predicates. Second, a predicate logic which is suitable for efficient detection of global predicates will be developed. After developing the logic, efficient decentralized algorithms for detecting occurrence of logic formulas will be designed. This work will be based on the use of a centralized checker process developed by the PI. Finally, the decentralized algorithm will be used to design an experimental distributed monitoring system.","title":"Detection of Global Predicates in Distributed Programs","awardID":"9520540","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["561475"],"PO":["250083"]},"1043":{"abstract":"9503532 Zitter This proposal requests funds for NevadaNet to fund six NSFnet connections to serve five remote community college instruction sites and one remote instruction site for the University of Nevada Medical Scool. On behalf of these institutions NevadaNet request NSF support to connect these sites to the Internet throught NevadaNet and our cooperating network service provider, SprintLink. The six connections sites are: Western Nevada Community College - Hawthorn Campus - Minden Campus Community College of Southern Nevada - Tonopah Campus - Caliente Campus University of Nevada Medical School, Boulder City Hospital The six connections would provide these sites with access ot important state, regional and national computing information resources, and enhancing instruction and research opportunities for their respective students and faculty. The benefits of this Internet connection include e-mail between local and remote researcheps and educators, file transfer capability and the ability to use remote computer resources. Also the college will have the ability to investigate innovation in educational resources and incorporate them into their curricula.","title":"Connections to NevadaNet - NevadaNet Phase III","awardID":"9503532","effectiveDate":"1995-09-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2381,2382,"97571",2384],"PO":["121202"]},"1296":{"abstract":"This project is for research in computational logic. The areas of research stem directly from prior analysis of the structure formulas in negation normal form. That work raised many questions and led to explorations in several directions. Substantial results at the propositional level, preliminary experimental at the first order level, and certain theoretical results that the most important of these may be path dissolution, a rule of inference that is strongly complete at the ground level. This project continues exploration of this and related inference mechanisms, largely through experimentation. One major thrust is to further the implementation of the techniques developed earlier. The current first order system (``Dissolver'') is a solid platform on which the following techniques may be tested: link selection; computing prime implicants; backtracking; theory links and dissolution; and star chains. While abstract proof-theoretic questions are of interest in their own right, enhancing the performance of Dissolver is an important motivation for the theoretical work in this project. The investigations into multiple-valued logics largely fit the category; the study of the following issues contributes to the development of Dissolver: dissolution and multiple-valued logics; dissolution, analytic tableaux, and distributive law; quantifier duplication, proof length, and cycles; algorithms for computing prime implicants; and induction and equality.","title":"RUI: Applications of Classical Inference Techniques to Multiple-Valued Logics and to Prime Implicate Algorithms","awardID":"9504349","effectiveDate":"1995-09-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["337750"],"PO":["187585"]},"2770":{"abstract":"The goal of this project is to develop new algorithms for text categorization, text segmentation, and text summarization based upon a natural language processing technique called `information extraction`. Information extraction techniques provide a level of linguistic analysis that is not supported by word-based information retrieval systems, but are more robust and scalable than in-depth natural language processing techniques. Information extraction is particularly well-suited for text categorization because many categorization problems require the identification of role relationships and contextual distinctions that cannot be captured by keyword analysis. The project involves building a multi-faceted text categorization system that supports multiple text processing capabilities, including multi-class categorization, topic segmentation, and domain-specific text summarization. The objective is to achieve good performance on multiple text corpora and different category sets. This research represents a new approach to text categorization, for which many businesses and government agencies have critical applications including related tasks such as text routing and filtering.","title":"Information Extraction as a Basis for Multi-Faceted Text Categorization Systems","awardID":"9509820","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["451671"],"PO":["563751"]},"917":{"abstract":"Finding a good solution to the cache coherence problem is critical to the effective use of medium and large scale multiprocessors. The high cost of remote memory access in such systems makes it important that processes be able to access data locally, but allowing processes to hold local copies of shared writable data requires finding a good way to keep the copies consistent. This project will investigate a new family of cache coherence protocols called delta cache protocols that maintain cache coherence with little or no synchronization. Delta cache protocols are directory, as opposed to snoopy, protocols. The delta cache protocols are based on isotach time systems, time systems implemented by a class of networks called isotach networks. Isotach networks are characterized not by topology - they can be imp lemented on arbitrary topologies - but by the guarantees they provide about the relative order in which operations appear to be delivered. Isotach systems require custom switching elements, but can be built with off- the-shelf processors and in a variety of configurations ranging from tightly -coupled multiprocessors to clusters of workstations. A simulation study of isotach systems shows that they outperform comparable conventional systems under realistic workloads, in many cases by an order of magnitude or more. In extreme cases, they outperform conventional systems by an arbitrary amount. The project is a three year study of the cache coherence problem with the goals of exploring the design space for cache coherence protocols opened by isotach networks; and evaluating the performance of delta cache protocols. The exploratory work includes protocol and cache design; extending the approach to a variety of topologies and to other levels of the memory hierarchy; and devising ways to reduce the network bandwidth requirements of the protocols and to improve the efficiency of the protocols through data migration. The performance study will simulate isotach and conventional systems with caches and compare their performance under a variety of workloads. The simulation will build on the already completed simulation of isotach systems without caches.","title":"Delta Cache Coherence Protocols","awardID":"9503143","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["373836"],"PO":["74434"]},"4641":{"abstract":"Two topics in the design of combinatorial algorithms are addressed: (1) Parametric problems on graphs with vertex and\/or edge weights, with particular emphasis on Megiddo's method of parametric search; (2) The construction of evolutionary trees for sets of species, focusing on methods where species are described by the characteristics they exhibit. First, parametric computing deals with problems where the input is a continuous function of one or more parameters; it has applications in: (1a) Sensitivity analysis (that is, studying how changes in costs affect the choice of optimum solution to a problem); (1b) Lagrangian relaxation (a powerful heuristic for coping with difficult constraints in optimization problems); (1c) computational geometry; and (1d) computational biology. The primary goal of this project is to study the circumstances under which parametric problems can be solved within the same time bound as their underlying non-parametric problems. This leads to an examination of the roles of parallelism, dynamic algorithms, and graph and space decomposition techniques in parametric search. A secondary goal is to obtain bounds on the number of times the optimum solution to certain parametric problems changes as the parameter is varied across its range. Second, an evolutionary tree or phylogeny describes how a set of species evolved from a common ancestor. The research on phylogeny construction deals primarily (2a) with finding faster algorithms for important special cases, and (2b) with developing dynamic algorithms for updating existing trees. Dynamic algorithms are particularly useful in practice, as they permit scientists to analyze different scenarios for evolution and to modify existing trees to reflect increased knowledge about sets of species. It appears that the development of efficient dynamic algorithms requires clean characterizations of sets of species admitting certain kinds of phylogenies. Such characterizations may be of interest in their own right.","title":"Algorithms in Parametric Optimization","awardID":"9520946","effectiveDate":"1995-09-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"9171","name":"SCIENCE AND TECHNOLOGY CENTERS"}}],"PIcoPI":["451154"],"PO":["528421"]},"2386":{"abstract":"9508274 Towsley Wide-area networks pose new communication-related challenges for multimedia applications as packet loss, longer delays, and larger user populations become important factors. While emerging ATM networks provide communication services for supporting such multimedia applications today's internetworked environment and legacy make end-to-end ATM connectivity between two end hosts unlikely in the foreseeable future. Research in this project represents a timely and important step in developing the network infrastructure needed to support real-time multimedia applications. This proposal includes a mix of theoretical and experimental research aimed at the design and evaluation of scalable services for supporting real-time multimedia applications in a wide-area network or internetwork. Specifically, the researchers will: 1) develop and evaluate receiver-oriented approaches for providing scalable reliable multicast services. The fundamental concerns are to understand how to allocate protocol functionality among the sender and receivers, how to use multicast to provide reliable multicast, and how to use application-specific semantic information in error recovery protocols; and 2) develop and evaluate end host mechanisms, such as playout adjustment algorithms and special-purpose error-recovery protocols, for enhancing the quality of service attained by several different real-time applications. The researchers will exploit application-specific information about the component applications - in this case their different timing constraints. *** ******* Darleen Fisher Program Manager Networking and Communications Research Program 4201 Wilson Blvd. Room 1175 Arlington Va 22230 (703) 306-1949 (703) 306-0621 (FAX)","title":"Multimedia Communication in Wide-Area Networks","awardID":"9508274","effectiveDate":"1995-09-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["499259","545655"],"PO":["150490"]},"6401":{"abstract":"This project's goal is to develop an exposition of a new algorithm for the Traveling Salesman problem. This problem is theoretically intractable, and practical heuristic techniques for large TSP problems have been elusive. In April 1992, a team of researchers established a new world record by solving ten previously unsolved problems, with sizes ranging from 1,060 to 3,038 cities, from a standard library of test data called TSPLib. (In particular, the 3,038-city problem is the largest TSPLib instance ever solved.) The program, developed by four people in the course of four years, has some 50 thousand lines, not counting the code that implements the simplex method. The algorithm consists of new ideas on every level of its design, from novel approaches to finding cutting planes all the way down to the minute details of data structures, not to mention the strategies of parallelizing the computations.","title":"Solving Large Travelling Salesman Problems: The Last Gasp","awardID":"9528462","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[15717],"PO":["150516"]},"7765":{"abstract":"Even the simplest of programs can be full of elusive errors. The study of program checkers, self-testing programs and self- correcting programs was introduced in order to allow one to use a program P to compute a function f without trusting that P works correctly. Many problems are easy to specify, but efficient programs which solve them may be vepy complicated. For such problems, the proposed approaches to program correctness have already show promise. The goal of this project is to understand how broadly these techniques apply. This research will develop a core of algorithmic techniques for writing fast and simple checkers, self-correctors, and self-testers. Previous research on self-correctors and self-testers obtained theoretical tools and insights which have been used in recent results in the theory of interactive proof systems. This research involves the study of the relationships between these areas. Other topics in the area of computational learning theory and game theory will be studied. These topics have applications to algorithms in reinforcement learning, text correction, part-of-speech-tagging, DNA sequencing and handwriting recognition. Interactive activities include teaching a graduate course entitled Program Correctness Probabilistic Proof Checking and Interactive Proofs.","title":"Relationships between Self-Testing\/Correcting Programs and Interactive Proofs","awardID":"9550380","effectiveDate":"1995-09-01","expirationDate":"1996-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"9225","name":"VISITNG PROFESS FOR WOMEN"}}],"PIcoPI":["517766"],"PO":["180153"]},"5004":{"abstract":"9522157 Alo This award provides for infrastructure designed to substantially increase the numbers of minority students going into and completing degrees in the computing disciplines at the University of Houston-Downtown. The project has three primary components: Students, Academic Program, and Research with strong recruitment, mentoring, curriculum enhancement, and research development activities as parts of the project. Collaboration with Rice University has been established and will be an important part of the overall effort. Community college linkages will be initiated, a Saturday Academy for high school students has been established, research experiences for undergraduates will be expanded, and the faculty research environment will be enhanced. It is anticipated that this project has the potential to become a model for development of programs for minority success at other similar urban universities. ***","title":"CISE Minority Institutions Infrastructure: Improving Research and Undergraduate Education in Computer Science","awardID":"9522157","effectiveDate":"1995-09-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["479700",12239,"427040","439528","536592"],"PO":["241298"]},"6588":{"abstract":"IRI-9529108 Mahadevan, Sridhar University of South Florida $29,550 - 12 mos. Support for a Workshop on Reinforcement Learning This is support for a workshop that will bring together researchers in one of the most actively studied paradigms in the study of human and machine learning, reinforcement learning (RL). A three-day meeting of up to 30 leading researchers from a variety of fields, including machine learning, neural networks, artificial intelligence, robotics, and operations research, will attend the meeting. The goals of the meeting include (1) Understanding limitations of current RL systems, and defining promising directions for further research; (2) Clarifying the relationships between RL and existing work in fields such as operations research; (3) Identifying potential industrial applications of RL research. A 10-15 page report on the findings of the workshop will be produced, along with a summary suitable for WWW posting. It is intended also to discuss the establishment of an electronic newsgroup to facilitate communication among disparate groups working in RL-related areas.","title":"Support for a Workshop on Reinforcement Learning","awardID":"9529108","effectiveDate":"1995-09-01","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["544475"],"PO":["54008"]},"6368":{"abstract":"9528352 Hopking St. Thomas University requests support from NSF for connection to Digital Business Systems (DBS). DBS, a midlevel network in the state of Florida, will provide operations management an information services and it will give the campus access to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The campus needs the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the St. Thomas University campus as well as the community in general.","title":"NSFNET Connection Proposal for St. Thomas University","awardID":"9528352","effectiveDate":"1995-09-01","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[15631,15632],"PO":["43608"]}}