{"72727":{"abstract":"This workshop proposal addresses data management research for the semantic web. Semantic web is mainly about technology for machine understandable and machine readable web pages. To date, much of the research on the semantic web has focussed on developing ontologies and languages such as the Resource Description Framework. There is a lot of research that needs to be done on querying and indexing the web pages. The participants of this workshop will be those who are actively conducting research in data management and the semantic web from academia and industrial research laboratories. The workshop will include short presentations by the experts as well as extensive discussions on research directions and challenges. The outcome of this workshop will be a list of recommendations for further research on data management support for the semantic web.","title":"WORKSHOP:Database and Information Systems Research for Semantic Web and Enterprises","awardID":"0211606","effectiveDate":"2002-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["560054"],"PO":["563751"]},"67382":{"abstract":"This research will develop techniques to provide seamless and transparent access to databases on the deep web. In particular, the project will build a metaquery system that helps users to find and query the databases. The specific tasks will include source discovery and modeling, semi-structured unified schema construction, dynamic source selection, metaquery language definition, and metaquerier system development. The career development plan will include modernizing the database curriculum as well as promoting interdisciplinary research.","title":"CAREER: MetaQuerier: Dynamic Ad Hoc Information Integration Across the Internet","awardID":"0133199","effectiveDate":"2002-04-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["451869"],"PO":["563727"]},"58012":{"abstract":"With National Science Foundation support, Dr. Ivan Sag will conduct three years of linguistic research on multiword expressions (MWEs). MWEs are a problem that must be solved on the route to robust and natural natural language technology. Fixed expressions can be entered into a lexicon as words-with-spaces, but this is inadequate even for cases like 'part(s) of speech' and 'kicks\/kick\/kicked\/kicking the bucket' (\"die\"). Further, some semi-fixed expressions exhibit positional variation (e.g., 'look up the answer\/look the answer up'), while others of equal semantic idiosyncrasy do not (e.g., 'falling off a log\/*falling a log off'). Some patterns appear rule-governed, but contain unexpected exceptions (e.g., 'call\/ring\/phone\/*telephone someone up'). Decomposable phrasal idioms allow even greater syntactic flexibility: 'Kim pulled the strings that got Pat the job' and 'The strings that had been pulled in order for Pat to get the job were more extraordinary than those pulled to get Chris employed'. Linguistic research has not yet provided an adequate theory of the diverse phenomena that populate the space between truly fixed expressions and syntactically flexible phrasal idioms. This project will fill that gap, developing a mathematically precise and computationally tractable theory of various classes of MWEs. The research team will analyze and computationally manipulate corpus data, integrating discrete and frequentistic methodologies into a hybrid theory of the different kinds of MWEs. The methods include complex word structures, lexical selection, partially similar grammar rules organized into \"construction hierarchies\", idiomatic construction rules - a new technique for analyzing constructions where idiomatic expressions may be separated from one another by considerable distance. Compositionally structured, institutionalized phrases like 'traffic light' and 'phone booth' will be treated as purely statistical dependencies. The most recent extraction techniques will be used to develop stochastic constraints and integrate them into fundamentally discrete, constraint-based grammars.<br\/><br\/>Since there is at present no comprehensive account of MWEs, this research on MWEs will contribute to both basic grammatical theory and our understanding of lexical knowledge. Because the analyses are mathematically precise and implemented within open-source software, the results will be of immediate utility for the development of robust language processing technology in a variety of constraint-based frameworks currently being explored in the field. Natural language processing applications will benefit from the results, including those involving language understanding, language generation, machine translation, and speech-related systems of various kinds (including speech prostheses for individuals with certain disabilities). All such applications involve scaling grammars up; and scaling grammars up to deal with MWEs will necessitate finding the right balance among various analytic techniques. Of special importance will be finding the right balance between symbolic and statistical techniques, a difficult problem whose solution this project's results bear on.","title":"Idiomatic Language: Multiword Expressions","awardID":"0094638","effectiveDate":"2002-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[149035],"PO":["564500"]},"67373":{"abstract":"This project focuses on studying general purpose visual tracking systems. A model-based approach will be used, emphasizing the particular class of objects to be tracked. The tracking procedure is to be based on solving partial differential equations describing curve flow. Schemes for performing tracking will be developed based on intensity information, which is contained within the region of the curve in question. Faster, more effective, and more robust trackers will be generated by extending the general framework via generalization of the assumptions used, and through formal analysis of the related PDEs. Also addressed will be the more general problem of combining shape and intensity-based information; as above, the algorithm will also look for intensity patterns that match what it knows about the class of objects to be tracked. The education part of the project includes curriculum development, undergraduate independent studies, and exposure of a large number students to an experimental system designed by the PI.","title":"CAREER: Combined Shape- and Intensity-Based Methods for Tracking","awardID":"0133144","effectiveDate":"2002-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["440266"],"PO":["564318"]},"67277":{"abstract":"This research proposes to exploit timing diagrams to improve formal verification for system designs. Formal verification is a valuable debugging technique, but scalability and usability problems hinder its broader use. Timing diagrams promise to alleviate both problems because they arise from the design community and engender more restrictive computational models than existing verification notations. The proposed research (1) enhances timing diagrams with constructs needed to capture realistic verification problems and (2) develops scalable and compositional verification techniques that exploit timing diagrams' unique computational characteristics for improved scalability and efficiency. The educational aspect of this project focuses on increasing students' skills in modeling and reasoning about system designs through a combination of curricular enhancements and hands-on projects. The combination of these research and educational objectives enables wider adoption and increased feasibility of formal verification in real-world design practice.","title":"CAREER: A Computational Infrastructure for Timing Diagrams in Computer-Aided Verification","awardID":"0132659","effectiveDate":"2002-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485803"],"PO":["562984"]},"73394":{"abstract":"EIA-0214690<br\/>Margaret L. Hedstrom<br\/>University of Michigan<br\/><br\/>Digital Government: Proposal for a Workshop to Develop a Research Agenda on Digital Archiving and Preservation<br\/><br\/>Archiving of digital records in the Federal government is rapidly outstripping the need for archiving of physical objects - for example, it is expected that in the next year or so, the National Archive and Records Administration (NARA) must be prepared to accept, index, and make searchable over 20 million Federal emails.<br\/><br\/>Few agencies are thinking beyond the next 2-3 years, though many, such as NARA, will be required to maintain electronic records in perpetuity. Many issues arise, such as the natural 3-5 year obsolescence cycle of computintg systems, and the perhaps longer cycle of operating systems and applications and associated file formats. Research in this area is clearly needed - the question is one of identifying topic areas in detail, and assigning some priority. That is what this workshop is intended to accomplish. Several other agencies will actively participate in this workshop: the National Library of Medicine, the Library of Congress and the National Agricultural Library.","title":"Digital Government: Proposal for a Workshop to Develop a Research Agenda on Digital Archiving and Preservation","awardID":"0214690","effectiveDate":"2002-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["471467"],"PO":["371077"]},"55751":{"abstract":"This project requests incremental funding for the Regional Laboratory for Applied Network Engineering Research and Training (RLANRT) project to build a living on-line repository for network engineering instructional materials and training.<br\/><br\/>Continual exponential growth in traffic and bandwidth usage is imposing severe strain on the Internet, and the gap between the immediate needs of the Internet infrastructure and current classroom content is growing. New computer science and engineering solutions are needed, but producing the necessary skills and talent is hampered by the small size of the current pool of knowledgeable network engineering practitioners.<br\/><br\/>Under the auspices of RLANRT, JSU proposes to coordinate a Web-based repository for network engineering curriculum materials. Resources are the current instructors from within and outside this institution, and Internet vendors such as CISCO, NOVEL, and Microsoft. These vendors have a wealth of training materials related to their hardware and software, and the objective is to draw together the myriad topics in a continual updated resource for both teachers and infrastructure whose reliability and throughput at various levels will be secured by the activities of engineers, users, and service providers alike.","title":"Regional Laboratory for Applied Network Engineering Research and Training (RLANRT)","awardID":"0086198","effectiveDate":"2002-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[142969],"PO":["7594"]},"67521":{"abstract":"This Career Development Plan involves an integrated collection of research and <br\/>educational activities focused on algorithms for high-dimensional <br\/>geometric problems.<br\/><br\/>Geometric computing with high-dimensional data is of crucial importance to <br\/>many areas of computer science, including machine learning, data mining, <br\/>databases and information retrieval, computer vision and computational biology.<br\/>Example problems in this area are: nearest neighbor search, many variants of <br\/>data clustering, and discovering linear structure of the data (e.g. via <br\/>Principal Component Analysis (PCA)). <br\/>Unfortunately, the classical geometric algorithms for many of these problems <br\/>do not scale well with the dimension. For example, the running times of the <br\/>classical algorithms for the nearest neighbor search depend exponentially <br\/>on the dimension, which makes them inefficient for dimension higher than, <br\/>say, 20. This is unfortunate, since many applications involve number of <br\/>dimensions anywhere from a few hundred to a few million.<br\/><br\/>In recent years, new, powerful techniques for solving these<br\/>problems have been discovered, most notably dimensionality reduction and <br\/>random sampling in geometric spaces. The algorithms obtained using those <br\/>techniques enjoy very low (at most linear) dependence on the dimension, <br\/>at the cost of providing approximate answers. The problems amenable to <br\/>these techniques include nearest neighbor search, clustering and PCA.<br\/>However, the algorithmic solutions to these problems still possess <br\/>(sometimes quite severe) limitations. Our goal is to identify methods for <br\/>circumventing these limitations and making the algorithms efficient, both <br\/>in theory and in practice.<br\/><br\/><br\/>The techniques which led to the development of the aforementioned <br\/>algorithms are new and still not widely known. <br\/>They include many tools which have been developed during 70s and 80s <br\/>in the field of mathematics called functional analysis. <br\/>However, computer scientists became aware of those methods only very recently,<br\/>and many of the fundamental results are still not widely known or used.<br\/>Therefore, it is important to make these results accessible to large computer <br\/>science audience so that they can be successfully used, investigated and <br\/>developed. In the Education Plan section we outline a plan on how to make <br\/>them more accessible to students as well as computer scientists.","title":"CAREER: Approximate Algorithms for High-dimensional Geometric Problems","awardID":"0133849","effectiveDate":"2002-04-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["560190"],"PO":["499399"]},"75089":{"abstract":"The University of Kentucky will provide engineering and computational equipment support to the AMPATH Project's First International Conference in Valdivia, Chile, April 10-12, 2002. The main objective of the conference is to create an environment for AMPATH participants in Latin America, potential participants and those with a regional, hemispheric or international interest in the project to exchange ideas, form new partnerships and solidify existing collaborations.<br\/><br\/>The University of Kentucky had agreed to lend AMPATH the technology required for this conference to be accessible via the Access grid. The Grid node will be connected to the REUNA network, and through this connection, to the UCAID Abilene network. Interested participants worldwide, who are unable to attend personally, will be able to monitor the conference from their own sites, using the Access grid connection.<br\/><br\/>The conference support offered by UK includes shipping of the portable Access grid node, sending engineering staff to set up and maintain the equipment, as well ad international airfare, meals and lodging for the UK and AMPATH engineers, and the cost of the network connection to the Abilene backbone. In addition, the University of Kentucky will receive technology support from the University of Illinois at Chicago, which will send equipment for its AGAVE (Access Grid Augmented Virtual Environment) system and an engineer to maintain this equipment. The AGAVE system will connect to the Access Grid using the University of Kentucky's node.<br\/><br\/>The workshop will continue the exploration of connectivity of research and education networks between USA and South America.","title":"First AMPATH International Conference: Valdivia, Chile: University of Kentucky Computational Support: April 10-12, 2002","awardID":"0221430","effectiveDate":"2002-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["461236"],"PO":["198445"]},"68347":{"abstract":"In this project funded jointly by the Theoretical and Computational Chemistry Program of the Chemistry Division, the Computational Mathematics Program of the Division of Mathematical Sciences, and the Molecular Biophysics Program in the Division of Molecular and Cellular Biosciences, Stuchebrukhov will develop theoretical and computational methods to study long-distance electron tunneling in biological systems. The Tunneling Currents Method, developed earlier by Stuchebrukhov, will be further tested and applied to specific experimental systems. Among the issues this work will focus on are refining the computational approach to make it useful for calculating very small tunneling interactions and incorporating the inelastic effects that are due to protein nuclear dynamics. The work will examine a number of issues that are important to experimentalists, such as how protein dynamics affect the rates of long-distance electron transfer, whether electron-transfer pathways are real or not, and the problem of coupling proton-transfers with electron transfer steps over long distances. <br\/><br\/>This project focuses on improving the accuracy of calculating electron transfer rates in biological systems, an important problem at the interface of chemistry and biology. The issues examined relate to understanding the function and dynamics of a number of important systems whose molecular structures have recently become known, such as photosynthetic reaction centers, allowing a comparison between theory and experiment. Ultimately this work is valuable in understanding how to utilize new technologies, including nanoscale science and biotechnology, as well as in training undergraduate, graduate, and postdoctoral students in the applications of theoretical and computational chemistry to important problems in contemporary science.","title":"Theoretical and Computational Methods for Long-Distance Electron Tunneling in Biological Systems","awardID":"0137652","effectiveDate":"2002-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1956","name":"STATISTICAL AND SIMULATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1144","name":"Biomolecular Dynam,Struc,Func"}}],"PIcoPI":["469081"],"PO":["308458"]},"71010":{"abstract":"The IEEE International Symposium on Information Theory (ISIT) is held yearly at<br\/>different locations in the world. The 2002 ISIT will be held at the Palais de<br\/>Beaulieu in Lausanne, Switzerland, from Sunday, June 30, to Friday, July 5,<br\/>2002.<br\/><br\/>This grant provides support for the travel expenses of ISIT participants from<br\/>the U.S. These participants would be individuals whose papers have been<br\/>selected for presentation at the Symposium, but who lack funds and would not be<br\/>able to attend without travel support.","title":"Travel Grant for the 2002 IEEE International Symposium on Information Theory","awardID":"0204893","effectiveDate":"2002-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["523728"],"PO":["188393"]},"68854":{"abstract":"EIA-0139576<br\/>Pless, Robert<br\/>Washington University<br\/><br\/>TITLE: Summer Undergraduate Research Program<br\/><br\/><br\/>The department has a long history of supporting undergraduate summer research opportunities, and these opportunities will exist with or without external support. However, external support does further particular NSF objectives having to do with the size of the program, the quality of the student experience, and the balance f student recruiting.<br\/>In particular, the requested funding would:<br\/><br\/>oMaintain an efficient size of the program, sixteen summer students. In addition to summer research projects funded from their research funds, this gives a critical<br\/>mass of students that improves the overall student experience.<br\/><br\/>oFoster a broader range f student projects.<br\/><br\/>oClearly separate the objectives of the program from individual faculty research agendas. Faculty who support students from individual research grants tend to be conservative in hiring and must choose projects that serve the objectives of their funding sources. This may negatively impact both the student experience and the student selection.<br\/>There are three explicit goals for this REU program. First, to give undergraduates from many backgrounds the opportunity and training to participate in frontier research.<br\/>Second, to foster and extend the undergraduate research culture already present at Washington University. Third, to create a supportive and encouraging environment to do research.<br\/>This first goal will be met with a targeted advertising campaign. This campaign will not exclude any source of potential students, but will focus n (a) predominately teaching colleges, (b) historically minority schools, (c) non-computer science departments.<br\/>Second, a coherent program involving a designated group of summer research program students gives a reason to organize events, a social group, and a critical mass for which it is appropriate to offer programs which aid all undergraduate students involved in research. Finally, we propose a program that includes an explicit training component to teach students the tools t attack research problems effectively. A set of defined check points during the course of the summer will allow program coordinators to identify and solve potential problems.","title":"REU Sites: Summer Undergraduate Research Program","awardID":"0139576","effectiveDate":"2002-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["547864","483609"],"PO":["564181"]},"75168":{"abstract":"This project will examine the framework for supporting cybersecurity research. It will consider where and how important topics are covered (building on past work, which has identified many important and often enduring topics), the distribution of research effort among actors (with emphasis on universities, in part to address the link between the conduct of researchers and the education and training of cyber security experts to ensure that there are enough researchers to perform the needed work), and the distribution and range of support programs among federal funding organizations. The project will examine issues regarding and options for improving coordination and efficacy in the national pursuit of cybersecurity research. A brief report with recommendations will be developed.","title":"Improving Cybersecurity Research in the United States","awardID":"0221722","effectiveDate":"2002-04-15","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2802","name":"TRUSTED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["298189","234699","235705","298190",195457,"560890"],"PO":["521752"]},"68535":{"abstract":"DMS-0138456<br\/>Leonidas J. Guibas<br\/><br\/>The wide availability of scanning technologies for <br\/>3-d shape acquisition has led to the development of <br\/>algorithms and software, in both academia and industry, <br\/>for building surface meshes from the raw data returned <br\/>by the scanner. For most optical and contact sensors<br\/>this raw data is in the form of an unorganized point <br\/>cloud, or PCD set (point cloud data); current scanners <br\/>are able to generate object surface samplings at <br\/>submillimeter accuracy. At such high resolutions,<br\/>these dense PCD sets become adequate representations <br\/>of object geometry in themselves, without any need to <br\/>fit a mesh or surface. The work undertaken under this <br\/>grant will exploit tools from algebraic topology and <br\/>computational geometry to perform local and global<br\/>analysis directly and efficiently on PCD data. Specifically,<br\/>algorithms for PCD feature detection, segmentation, matching, <br\/>fitting, and compression will be developed and analyzed.<br\/><br\/>It is expected that PCD sets will become a lightweight <br\/>and convenient representation of object geometry not <br\/>only in reconstruction or visualization applications, <br\/>but even more so in the largely unexplored area of directly interrogating object geometry in the PCD format for<br\/>applications such as robotic exploration or product<br\/>customization. Over the next five years we can expect <br\/>to see wide commercial deployment of 3-d scanning and <br\/>the appearance of compact, portable scanning devices. <br\/>By exploiting the acquired PCD data it will become <br\/>possible to customize and tailor manufactured products <br\/>to their user to a degree that has been impossible up <br\/>to now. Technology developed under this proposal should <br\/>facilitate this transition in the apparel, footwear, <br\/>hearing-aid, orthodontic, prosthetics, and automotive <br\/>industries.","title":"CARGO: Shape Analysis From Point Cloud Data","awardID":"0138456","effectiveDate":"2002-04-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["521232","521231","549998"],"PO":["565211"]},"88049":{"abstract":"9908578<br\/>Ji<br\/><br\/>Managing large computer communication networks through distributed agents is an emerg-ing area of research towards automated and scaleable network management. In the context of this research, an agent is a simple algorithm which can reside at a network node, and perform local decisions on the state of a network using local information. As many such agents can be used in a distributed fashion at a large network, little is known how local decisions result in collective effects at network level, and what decentralized algorithms can be used by agents at network nodes so that a good global performance can be achieved network-wide. To provide answers to these questions is crucial to advancing network management from device-centric to network-centric which is required by the next generation networks.<br\/>The goal of this project is to investigate adaptive learning approaches as potential solutions to these open problems. In particular, dynamic probabilistic graph models will be investigated and shown to provide a systematic approach for accomplishing the following tasks:<br\/>(1) developing (local) models to cooperate and aggregate information form a neighborhood of agents,<br\/>(2) using the (local) models developed to perform distributed decisions at network nodes adaptively,<br\/>(3) developing (global) model by aggregating local statistics to characterize resulting global effects of a network of agents.<br\/>A rich set of methods in the area of adaptive learning systems, especially the dynamic graph models, will be shown to provide both a theoretical foundation, and practical approaches in managing large networks with an irregular and a changing topology, and inaccessible network components.<br\/>***","title":"Managing Large-Scale Computer Communication Networks Using Adaptive Learning Systems","awardID":"0334759","effectiveDate":"2002-04-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["432210"],"PO":["563109"]},"70351":{"abstract":"This workshop seeks to bring together experts in the area of parallel manipulators from around the globe for two days in order to disseminate recent research progress and to identify the most promising future research directions for parallel manipulators. This meeting is not a routine conference, wherein the primary responsibility of the participant is to present his or her paper. Instead, through a series of focused keynote presentations, round-tables, focused paper and poster sessions and in-depth discussion sessions the participants will seek convergence on key issues related to parallel manipulators.<br\/><br\/>The objectives of the workshop include: (1) Identify roadblocks that must be resolved to increase the industrial use of parallel manipulators; (2) Identify promising approaches that may yield significant advances in the theoretical framework; (3) Discuss educational needs and methods; (4) Develop a strategy for the research community as a whole to accelerate the development and use of parallel manipulators; (5) Establish and reinforce international collaboration and collaboration between academia and industry. The workshop will be held in Quebec City, Quebec, Canada, on Oct 3-4, 2002, immediately following the ASME DETC conferences in Montreal (Sept 29-Oct 2, 2002).","title":"Workshop on Fundamental Issues and Future Research Directions for Parallel Mechanisms and Manipulators; October 3-4, 2002; Quebec City, Quebec, Canada","awardID":"0202595","effectiveDate":"2002-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1468","name":"Manufacturing Machines & Equip"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}}],"PIcoPI":[182123],"PO":["564651"]},"72188":{"abstract":"This award subsidizes expenses of student participants in the Student Research Workshop organized in conjunction with the 2002 Association for Computational Linguistics Conference, to be held July 7-12 in Philadelphia, Pennsylvania. The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing and language engineering, with two regional chapters, Europe (EACL) and North America (NAACL), of approximately equal size. The Association's annual conference, which rotates between North America and Europe, is the major international meeting in the field. The workshop format allows students to present their research and receive feedback from a panel of established researchers in the field. It will provide students with invaluable exposure to outside perspectives on their work at a critical time in their professional development, through feedback from the panel and other student participants. The ACL Student Workshop is an inexpensive yet highly effective means of encouraging young and upcoming computational linguists. The intimate format encourages the student participants to begin building a rapport with established researchers. This nurturing effort should pay dividends by more effectively guiding students in this rapidly changing research field. In addition, by building a supportive environment for these students, it is more likely that down the road they will in turn lend a supporting hand to other students who follow. <br\/><br\/>Computational lingustics is a multidisciplinary field of increasing importance to science, commerce, and society. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades.","title":"Workshop: Student Research in Computational Linguistics at the Joint ACL\/NAACL 2002 Conference, July 7-12, 2002, Philadelphia, PA","awardID":"0209283","effectiveDate":"2002-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[186932],"PO":["246649"]},"75213":{"abstract":"EIA-0221927<br\/>Sharon Dawes<br\/>SUNY Albany<br\/><br\/>Turning to Digital Government in a Crisis: Coordinating Government Business & Non-Profit Services in Response to the World Trade Center Attacks of September 11, 2001<br\/><br\/>This Small Grant for Exploratory Research will examine what government agencies did in the midst of and immediately after the attacks on the World Trace Center, and the role of information technologies in the events. Starting at Pier 92, where New York City's Emergency Operation Center was re-established, this work will document the network of relationships, information flow, and actions through interfiews with key participants. Research topics and policy questions will be identified.","title":"Turning to Digital Government in a Crisis: Coordinating Government, Business & Nonprofit Services in Response to the World Trade Center Attacks of September 11, 2001","awardID":"0221927","effectiveDate":"2002-04-15","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["433032"],"PO":["371077"]},"74388":{"abstract":"This workshop is the annual IDM (Information and Data Management) Program's Principal Investigator meeting. The IDM principal investigators as well as invited visitors from academia, industry and government attend this workshop. The purpose of this workshop is to review the progress made during the past year and formulate strategy for IDM research. The abstracts of projects funded by IDM are compiled and distributed at the workshop. The workshop consists of invited presentations, panels and breakout sessions.","title":"WORKSHOP: IDM 02 Workshop","awardID":"0218377","effectiveDate":"2002-04-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["533183",193182,"421169","456688"],"PO":["563751"]},"68405":{"abstract":"EIA 0137943<br\/> William Aspray<br\/> Computing Research Association<br\/><br\/>WORKSHOP: The Future Grand Challenges of Computer Science and Engineering<br\/><br\/>This effort supports a conference to ask the question: What is the nature of the future \"grand challenge\" problems in computer science and engineering? The conference organizers believe that many deep and exciting issues remain. The purpose of the proposed conference is to provoke \"out-of-the-box\" thinking and thus to hasten the next \"golden age\". The conference will serve as an experiment and possible prototype for a series of conferences on grand research challenges in computer science and engineering.","title":"The Future Grand Challenges of Computer Science and Engineering, Spring 2002","awardID":"0137943","effectiveDate":"2002-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["208531","209556"],"PO":["289456"]},"70496":{"abstract":"This U.S.-Czech mathematics project is a cooperative effort between Thomas Lada at North Carolina State University and James Stasheff of the University of North Carolina with their counterpart in Prague, Martin Markl at the Mathematical Institute of the Czech Academy of Sciences. Their goal is to clarify the homotopy invariance properties of various algebraic structures. To do so they intend to utilize operads to study the question of homotopy invariance in several algebraic settings. While homotopy invariant structures in the topological setting have been well studied, similar questions in algebraic settings still require attention. The problems to be investigated by this U.S.-Czech team deal with the category of strongly homotopy algebras and their homotopy theoretic properties. If successful, their investigation will integrate these ideas with several sophisticated algebraic structures that arise in mathematical physics. Results should improve the theoretical underpinning for cross-disciplinary advances in perturbation theory and deformation quantization. <br\/><br\/>This international project in topology fulfills the program objective of advancing scientific knowledge by enabling experts in the United States and Central Europe to combine complementary talents and share research resources in areas of strong mutual interest and competence.","title":"U.S.-Czech Mathematics Research on Homotopy Invariant Algebraic Structures","awardID":"0203119","effectiveDate":"2002-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1267","name":"TOPOLOGY"}}],"PIcoPI":["463050",182478],"PO":["561352"]},"56911":{"abstract":"Computational models of networks of neurons in the brain usually are based on following the details of activity patterns in large numbers of individually explicit neuronal elements and their synapses. Simulations of activity in functional units based on hundreds or even thousands of such neural units, such as a column within the sensory cortex, can take hours of computer time to model seconds of real time. The goal of this project is to develop new techniques to facilitate large-scale modeling of neural networks in the mammalian brain. The theory of probability (population) density function, borrowed from the field of statistical mechanics, uses large numbers of elements to advantage. In the population density method, similar neurons are lumped together in a population, and one tracks the distribution of neurons over 'state space' in each population. The state of a neuron is determined by the dynamic variables in the underlying single-neuron model, to allow deriving a population firing rate from a flux of probability across a particular surface in state space, taking into account coupling between neurons by excitatory and inhibitory input events at stochastic synapses. The present project will extend the population density theory by incorporating realistic synaptic kinetics. This consequent increased computational complexity will lead to developing and testing new simulation methods to compare with conventional direct simulations for accuracy and speed. Population density methods will be applied to the well known primary visual cortex, including interactions among cortical layers and columns, to account for physiologically known features such as sensitivity to orientation of visual bar stimuli, and the relation of responses to stimulus contrast levels.<br\/> Results will have an impact on visual neuroscience as well as computational neuroscience, and on understanding information processing in the brain in general. These new methods could accelerate network simulations by orders of magnitude, with the promise of applications in computer and information sciences. Cross-disciplinary graduate training is an important added feature of this project.","title":"Population Density Methods and Applications in Large-Scale Modeling of Neural Networks","awardID":"0090159","effectiveDate":"2002-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1162","name":"COMPUTATIONAL NEUROSCIENCE"}}],"PIcoPI":[146447],"PO":["322092"]},"74732":{"abstract":"The main objective of the conference is to create an environment for AMPATH participants, potential participants and those with a regional, hemispheric or international interest in the project to exchange ideas, form new and solidify existing collaborations.<br\/><br\/>The conference will continue the work of identifying the universities and research centers in the AMPATH service area who require, or would take advantage of, high-performance connectivity to research institutions in the U.S. and worldwide if it were available. Proposed speakers at the conference include researchers that participate in projects between collaborators in the U.S., Canada, the AMPATH service area, Europe and Asia\/Pacific.<br\/><br\/>AMPATH is a project of Florida International University in collaboration with Global Crossing, in support of scientific research applications that either involve collaboration between U.S. and multi-national researchers or wholly run U.S. projects in the AMPATH service area. Research and Education networks to the UCAID Abilene network and the Central America, Mexico and the Caribbean and the rest of the world to further advance U.S. science and education.","title":"First AMPATH International Conference: Valdivia, Chile; April 12, 2002","awardID":"0220176","effectiveDate":"2002-04-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["564024","564025"],"PO":["198445"]},"67505":{"abstract":"This research project will advance intelligent search engines by developing query-concept learners. Techniques for detecting concept drifts as well as multi-resolution image characterization will be developed. In particular the research will be based on two online algorithms, MEGA and SVMActive. It will also integrated text attributes in image searching and apply the technology to video data. The career development plan will include sponsoring undergraduate and graduate projects as well as incorporating the research into the Computer Science curriculum.","title":"CAREER: Intelligent Sampling for Learning Complex Query Concepts","awardID":"0133802","effectiveDate":"2002-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["550824"],"PO":["563751"]},"68847":{"abstract":"EIA-0139564<br\/>Shirazi, Behrooz<br\/>University of Texas at Arlington<br\/><br\/>REU: Research Experiences for Undergraduates in Distributed Rational Agents<br\/><br\/><br\/><br\/>The University of Texas at Arlington (UTA) is one of the leading research-oriented institutions of higher education in Texas. The purpose of this proposal is to sustain a highly successful NSF REU site program in UTAs Computer Science and Engineering Department. Through this program, we intend to continue to provide opportunities for highly talented and qualified upper division women, minority, and disabled undergraduate students to participate in research programs in the field of distributed rational agents. The goal here is to augment the students' educational experience and to attract qualified undergraduates to graduate studies in computer science and engineering. The student participants will be recruited nationally, but due to the geographical location of UTA, one of our goals is to emphasize recruitment of students from women and minority institutions as well as institutions lacking research facilities in the southwest region. In the course of previous and current REU site projects we have already established contacts to a number of these schools and we intend to utilize these contacts in order to optimize our recruitment efforts.<br\/>.","title":"REU Site: Research Experiences for Undergraduates in Distributed Rational Agents","awardID":"0139564","effectiveDate":"2002-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["559679","505936","505936"],"PO":["564181"]},"73658":{"abstract":"EIA-0215673<br\/>Gerald A Higgins<br\/>Federation of American Scientists<br\/><br\/>The Digital Human: Towards Unified Ontology for Biomedical Modeling and Simulation<br\/><br\/>This workshop is bringing together researchers from a variety of disciplines to develop a unified ontology for biomedical modeling and simulation. The goal is to develop an ontology that can specify both lower-level cellular models and higher-level tissue, organ and systems models in a manner that is most useful for modeling and simulation. The workshop is organized to specify requirements for the ontology, based on existing models such as the Digital Anatomist Foundation Model of Rosse et al and the emerging BioSPICE ontology. An initial draft of a unified ontology that extends from gross anatomy to cellular components and a detailed plan for converting this draft into a system that can be widely accepted by the research community and can serve as the basis for developing interoperable simulations and other representations of these systems is in preparation. The draft is being prepared by the principle investigators supported by graduate students and post-doctoral fellows, prior to the workshop that will provide an in-depth peer review of the proposed ontology and the plan for next steps<br\/><br\/>A final document being generated by the participants will be a concrete action plan for establishing a framework though which existing ontologies may be unified, expanded and enhanced. As a result, unification of cell-organ ontologies is enhancing the ability of researchers and developers to prepare interoperable simulation models in biomedicine, leading to advancement of our understanding of multiple levels of biological structure and function.","title":"The Digital Human: Towards a Unified Ontology for Biomedical Modeling and Simulation","awardID":"0215673","effectiveDate":"2002-04-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":[190804],"PO":["565136"]},"63836":{"abstract":"This project proposes to develop an application delivery system, in collaboration with the Universidad Nacional Autonoma de Mexico (UNAM), which will provide real-time distance learning opportunities. This system will be created by:<br\/><br\/>(1) Establishing a high-speed, high-bandwidth Internet2 gateway at the Texas A&M University (TAMU) Center at UNAM<br\/>(2) Connecting the Texas A&M University Virtual Networking Lab to the gateway<br\/>(3) Linking distance learning studios at Texas A&M University and UNAM<br\/><br\/>The user population for the project is as diverse as the institution's populations and includes:<br\/><br\/>(1) Texas A&M University Educational Broadcasting Services<br\/>(2) Texas A&M University Architecture Study Abroad students and faculty<br\/>(3) Texas A&M University Latin American Study Program<br\/>(4) Texas A&M University Chemistry Department<br\/>(5) DGSCA-UNAM<br\/>(6) Mexican students in U.S. continuing education programs<br\/>(7) Mexican networking students and personnel needing hands-on continuing networking education.","title":"CONAcYT: Texas A&M University - UNAM Two-Way Video Infrastructure","awardID":"0116631","effectiveDate":"2002-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["359702"],"PO":["565090"]}}