{"11909":{"abstract":"Compiler infrastructure is a key and enabling component of cutting-edge computing systems research. Whether the research is focusing on developing new optimization algorithms, designing a new programming language, creating new software tools, developing and analyzing real-time systems, or exploring new or experimental architectural features, a complete, robust, and flexible compilation system is required to perform realistic experiments in a timely fashion. This research project will develop a compiler infrastructure, called Zephyr, to meet the current and future needs of computing system researchers. The leitmotiv of Zephyr's organization is the separation of the representation or form of Zephyr's intermediate languages from their content. Decoupling the content of an intermediate language from its representation permits researchers to use an intermediate language most appropriate for their needs, to extend an existing intermediate language, or to develop a new HIL, yet still use Zephyr infrastructure and leverage off the efforts of other research groups also using the infrastructure.","title":"Compiler Infrastructure: Development of a HIL\/LIL Framework for a National Compiler Infrastructure","awardID":"9612756","effectiveDate":"1996-12-15","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["109202","385658"],"PO":["179296"]},"13084":{"abstract":"9616500 Ewing, R. Stiller, Peter Texas A&M University Collaborative Research On Learning Technologies: A Center for Collaborative Research in Learning Technologies - Planning Proposal Texas A&M University has been awarded $50,000 for a period of 08 months to provide support for planning to develop a proposal for a Center for Collaborative Research on Learning Technologies (CRLT) at Texas A&M. The Center would serve as a major focal point for on-going research projects, and would provide leadership and administrative support for large scale collaborative projects involving interdisciplinary teams of researchers and participants from a multiplicity of locations and backgrounds. The Center would also provide for the dissemination of research and newly developed technologies, and serve as a link to the telecommunications and other related hi-tech industries, working actively with private industry to commercialize successful technologies for their introduction into the classroom of the 21st century.","title":"CISE\/EHR\/ENG\/MPS CRLT: A Center for Collaborative Research in Learning Technologies - Planning Proposal","awardID":"9616500","effectiveDate":"1996-12-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["393782","283030","292276","68595"],"PO":["297837"]},"16022":{"abstract":"This research explores the application of fuzzy logic methodology to logic and architectural synthesis. Constructive and iterative design strategies as well as adaptive capabilities are being introduced in design algorithms. Theoretical aspects of adaptation of design algorithms are being investigated. Methodologies and tools being developed include: 1. Multi-objective iterative algorithms for physical design; 2. Adaptive placers; 3. A system for logic synthesis and list scheduling; 4. Technology mappers for FPGAs. These are being implemented in software and tested on variety of benchmarks.","title":"Application of Fuzzy Logic in CAD of Digital Systems","awardID":"9628022","effectiveDate":"1996-12-15","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["276918"],"PO":["321058"]},"29376":{"abstract":"","title":"Integration of Planning and Control Using Multiple Models, Switching, and Tuning","awardID":"9796241","effectiveDate":"1996-12-15","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["537487"],"PO":["335186"]},"13175":{"abstract":"This research is exploring the development of a very different approach to image coding based on representing an image by a large collection of statistics. The approach is motivated by the recognition that state-of-the-art wavelet image coders owe their superior coding performance to more accurate statistical modeling of coefficients. The accuracy of these models is limited by the cost in bitrate of transmitting the statistics needed to support the modeling. Our approach makes more explicit use of model statistics to allow direct representation of the image with those statistics. The statistics serve both to maximize the accuracy of the statistical modeling and to represent the image itself. Consequently, many more statistics can afford to be transmitted and modeling accuracy is greatly improved. The approach has shown very promising preliminary results, and promises to substantially advance the state-of-the-art in image coding. The approach also suggests new opportunities for managing the perceptual quality of coding algorithms through perceptually optimized quantization of the new representation. These perceptual issues will also be investigated.","title":"Coding Images with Statistics: An Exploratory Study","awardID":"9616716","effectiveDate":"1996-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["98336"],"PO":["564898"]},"17597":{"abstract":"Global competition and rapidly changing technology make it critical that we understand how organizations can adapt to a changing environment so that they can maintain or improve their performance. Organizations respond to the environment through redesign (downsizing, upsizing, or re-engineering various tasks). Further, organizations frequently cope with changes such as journeymen personnel who pursue their careers by moving among organizations. Organizational adaptation presumably contributes greatly to organizational productivity, even as individual learning contributes to personal productivity. However, little is known about organizational adaptation, and particularly about whether such adaptation even has the theoretical possibility of improving performance given that individuals are themselves learning. A computational framework for theorizing about organizational adaptation and performance will be developed and used to explore the conditions under which adaptation leads to performance improvements. This framework employs simulated annealing algorithms for locating optimal organizational structures in fixed and volatile environments. The effect of organizational adaptation, particularly when personnel are journeymen will be examined. Questions to be addressed include: What adaptation strategies are most effective? What types of organizations emerge as high performers, particular when personnel are journeymen? Does the technology transfer that occurs when personnel journey among organizations lead to organizational performance improvements?","title":"Organizational Adaptation: The Use of Simulated Annealing to Study Organizational Adaptation","awardID":"9633662","effectiveDate":"1996-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["268366"],"PO":["495796"]},"13330":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an DS3 ATM connection to the Very High Performance Backbone Network Service (vBNS). The connection is to be upgraded to an OC-3c circuit during the second year. Applications include: - Superkamiokande detector analysis of atmospheric and solar neutrino interactions information - Rapid earthquake Alerts and Information Distribution and Real-time seismic waveform data exchange between networks - IRIS Data Management Center data distribution - Optical Astronomy from a Remote Facility Collaborating with: Institution of Cosmic Ray Research, University of Tokyo University of California at Irvine University of New York at Stonybrook (SUNY) University of California at Berkeley University of California at San Diego Apache Point Observatory Princeton University University of Chicago Johns Hopkins University Fermilab New Mexico State University Washington State University Mount Stromlo Observatory, Australia Cerro Tololo Interamerican Observatory, Chile The award provides partial support of the project for two years.","title":"vBNS Connectivity for the University of Washington","awardID":"9617039","effectiveDate":"1996-12-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["447088","559300","216537","530092"],"PO":["121202"]},"13333":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an DS3 ATM connection to the Very High Performance Backbone Network Service (vBNS). Applications include: - NACSE research on interactive, Web-based techniques for enhancing HPC training and access - NERO research on RSVP, MARS, IP over ATM and QoS issues Collaborating with: - the Cornell Theory Center, the San Diego Supercomputer Center, and the Pittsburgh Supercomputing Center.","title":"Connecting NACSE - the Northwest's Metacenter Regional Alliance - to the vBNS","awardID":"9617043","effectiveDate":"1996-12-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["355791",33768,"543493"],"PO":["121202"]},"19749":{"abstract":"This award supports a two day conference in February 1997 entitled, \"Capturing Internet History\". The purpose of the conference is to begin recording the creation and development of the Internet through oral and written histories from the people involved. A plan for recognizing and recording significant future events also will result. MCI, Microsoft and NSF are contributing approximately equally to the conference.","title":"Capturing Internet History","awardID":"9701827","effectiveDate":"1996-12-15","expirationDate":"1997-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["555427"],"PO":["57343"]},"11910":{"abstract":"This proposal aims to establish a royalty-free, national compiler infrastructure that serves the needs of the research community and industry. A successful infrastructure will have a major impact on computing . The availability of such a system will make compiler research and development more accessible to a larger community, and the system itself can form the basis of a modern compiler for commercial use. The investment in this infrastructure is expected to be greatly amplified through community participation. As a focal point to bring together all the talents in the compiler area, the infrastructure can develop into a super-system that surpasses any existing system. Such an infrastructure can bring about the kind of acceleration in compiler development needed to match the phenomenal advances in processor architectures. The proposed infrastructure includes robust front ends and back ends, as well as many different state-of -the-art program analyses and optimizations.","title":"Compiler Infrastructure: The SUIF Compiler Infrastructure","awardID":"9612757","effectiveDate":"1996-12-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["382726"],"PO":["179296"]},"12914":{"abstract":"(A) This project focuses on the design and analysis of efficient algorithms for network and combinatorial optimization problems. In particular, the project concentrates on (1) theoretical analysis and experimental evaluation of algorithms and (2) algorithmic challenges that arise in applications such as telecommunication networks and information management. Specifically at AT\\&T, development of new and enhanced communication and information services necessitates algorithmic research and formulation of new models and problems. (B) A principal component of the project is the design of fast algorithms for fundamental network problems (such as shortest path flow computations, and transitive closure). For large problem instances where a quadratic time exact algorithm is infeasible, approximate linear time algorithms are investigated, by considering these well known problems in new contexts. For example, availability of multi-processor systems warrants development of parallel and distributed algorithms, and large interactive databases necessitate the design of dynamic and online algorithms. (C) This award enables the PI to visit the Department of Computer Science, University of California, Berkeley for six months, so that fruitful collaborations with faculty and graduate students can be initiated. In particular, her activities include (3) the development and teaching of a graduate course in network algorithms and combinatorial optimization, and (4) an outreach program to women and other under represented groups. It is anticipated that this university\/industrial collaborative effort will be continued at both Berkeley and AT\\&T Laboratories.***","title":"Design of Efficient Algorithms","awardID":"9616139","effectiveDate":"1996-12-01","expirationDate":"1997-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[32736],"PO":["125792"]}}