{"92846":{"abstract":"This award is for NSF sponsorship of the first national conference on the Social and Economic Implications of Information Technology (IT). The two-day conference will bring together academic researchers, commercial research and consulting firms and the policy community to review research that contributes to a broad and contextual understanding of social and economic change, as it relates to IT. It will stimulate debate on research strategies, policy implications and a future research agenda, and it will offer a prototype annual conference for this area of research. The conference will reflect the concerns of the Presidents Information Technology Advisory Committee (PITAC) that we have insufficient scientific understanding of the actual scope and trajectory of the socio-technical transformations related to IT and that we need to build a national infrastructure to support this area of research.","title":"Conference on Economic and Social Implications of Information Technology held at University of Maryland, College Park in June 2001","awardID":"0402706","effectiveDate":"2003-06-30","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["297929"],"PO":["564456"]},"81517":{"abstract":"PROPOSAL NUMBER.: 0304421<br\/>INSTITUTION: Northwestern University<br\/>NSF PROGRAM: NANOTECHNOLOGY UNDERGRAD EDUCATION<br\/>PRINCIPAL INVESTIGATOR: Hersam, Mark C.<br\/>PROPOSAL TITLE: NUE: Development of a Nanotechnology Undergraduate Education Global Network<br\/><br\/>ABSTRACT:<br\/><br\/>This award is part of the Nanoscale Science and Engineering Initiative, NSF 02-148, within the Nanotechnology Undergraduate Education (NUE) Category and is administered by the Design Automation for Micro and Nano Systems Program. Led by Professor Mark Hersam of the Materials Science and Engineering Department at Northwestern University, this program entitled \"NUE: Development of a Nanotechnology Undergraduate Education Global Network\" is developing an internet infrastructure for the worldwide exchange and dissemination of nanotechnology undergraduate educational ideas and materials. Initially, a pre-existing course in nanomaterials at Northwestern University will be used as a prototype for developing modules on the NUE Global Network in collaboration with the International Virtual Institute led by Professor Robert Chang. The nanomaterials course employs novel pedagogical techniques, including interdisciplinary problem-based learning and peer assessment, that are well-suited for undergraduate teaching and learning in the emerging field of nanotechnology. Once the web-based interface has been formalized for this course, the NUE Global Network will be expanded to other courses at Northwestern University and other institutions of higher learning. Ultimately, the NUE Global Network is designed to evolve into a nanotechnology educational forum that will allow educators, students, government, and industry to interact in a truly global sense.","title":"NUE: Development of a Nanotechnology Undergraduate Education Global Network","awardID":"0304421","effectiveDate":"2003-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["475732","488119"],"PO":["562984"]},"90648":{"abstract":"This research project will develop adaptive, personalized, topic-driven crawlers to help search engines. The current search engines do not scale in a dynamic environment. The proposed research will overcome this limitation. The research will utilize an autonomous agent-based approach to building new scalable algorithms. The career development plan will include integrating the results into the undergraduate and graduate curriculum. The students will also carry out projects using the results of this research.","title":"CAREER: Scalable Search Engines via Adaptive Topic-driven Crawlers","awardID":"0348940","effectiveDate":"2003-06-16","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["478203"],"PO":["563727"]},"88072":{"abstract":"April 21, 2003 is the closing date for NSF's High Performance Network Connections (03-529) solicitation. HPNC proposals are complex documents that include many nuances and requirements. This workshop will take the participants through the proposal preparation process and assist investigators in developing their proposals. This workshop will cover the technical, administrative and research justifications that are required, and the workshop will address budget, format and narrative requirements. <br\/><br\/>This workshop, while open to representatives of both minority and non-minority serving institutions, is targeted specifically to minority serving institutions, capitalizing on previous work done to assist this community by Ms. McLean and her associates. The workshop will be one and one-half days in length and will be facilitated by several experienced individuals.","title":"High Performance Network Connections 2003 HPNC Proposal Writing Workshop","awardID":"0334856","effectiveDate":"2003-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[230896],"PO":["565090"]},"79460":{"abstract":"The Internet revolution has led organizations worldwide to rely heavily on information sharing over the Internet to conduct their daily business. Information sharing on the Internet usually occurs in broad, highly dynamic network-based environments, and formally accessing the resources in a secure manner poses a difficult challenge. Our focus is on the problems of secure information exchange and secure information access in Internet-based collaborative environments. The research objectives are as follows. <br\/><br\/>Secure group communication. In collaborative work and research environments, group members must be able to set up a reliable, secure information sharing and communication medium among them. Techniques will be developed for setting up secure group communication and providing a set of accesses to group members for a variety of digital data in highly dynamic networks.<br\/><br\/>Security services. Digital information in database systems generally represents sensitive and confidential information that organizations must protect and allow only authorized personnel to access and manipulate them. The research will address the issue of how to advocate selective information sharing in role-based systems while minimizing the risks of unauthorized access proposing a delegation framework. The objective is to demonstrate the feasibility of our framework through policy specification, enforcement, and a proof-of-concept implementation.","title":"Collaborative Research: Secure Information Sharing in Internet-Based Collaborative Applications","awardID":"0242384","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}}],"PIcoPI":["250083"],"PO":["469867"]},"79472":{"abstract":"Watermarking is the technique of embedding un-detectable information into objects (e.g. images and video) mainly to protect the data from unauthorized duplication and distribution by enabling provable ownership over the content. Whereas considerable work has been invested in this topic, little has been done to enable the same concept in the area of relational databases. There is much to be gained from the ability to watermark relational databases, in particular considering current mainstream migration of business interactions towards distributed computing technologies. Effective watermarking can decrease the reluctance of vendors to provide public availability or sharing of valuable data.<br\/><br\/>Compared to multimedia, watermarking in the area of relational data presents a whole new set of challenges. Relational data are characterized by value lying both in the actual values stored as well as the organization of these data. A major challenge for watermarking relational databases is simply the \"lack of bandwidth\", deriving from the inherent lack of a major noise component in that domain. To further add to the challenge, these constraints are data and application dependent.<br\/><br\/>This project explores the issue of watermarking valuable outsourced relational data. In particular, it addresses: the design of a resilient watermarking method, a proof-of-concept implementation for numeric relational data, deployment on real outsourced commercial data, and an evaluation of the resilience of the algorithm.","title":"Watermarking Relational Databases","awardID":"0242421","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}}],"PIcoPI":["553652","470080"],"PO":["469867"]},"88063":{"abstract":"Proposal : IIS- 0334824<br\/>Institution: Simmons College<br\/>PI: Ching-chih Chen<br\/><br\/><br\/>This proposal requests travel support for US researchers to participate in the \"Designing Multimedia (MM) in Digital Libraries\"to be held in Crete, Greece The workshop is cosponsored by the DELOS Forum, a major organizer of digital libraries research and planning activities in Europe. DELOS receives support from the Information Societies Technologies (IST) 5th Framework Programme of the European Commission.<br\/><br\/>The workshop contin;ues the dialogue and research agenda begun under an US-EU\/DELOS working group on \"Digital Imagery for Significant Cultural and Historical Materials\" The working group has met over the past year to discuss and evaluate fruitful joint activities and research paths for collaborative activities in this general topical area and produced and circulated an influential report on their findings. <br\/><br\/>Importantly, this workshop will include in the agenda pressing issues related to the recent loss of antiquities in Iraq. This will be addressed in coordination with an interagency effort convened to explore possible remediation and recovery efforts for irreplacable cultural heritage artifacts.","title":"Designing multimedia (MM) in digital libraries and travel support for DELOS MM Workshop, Crete, Greece","awardID":"0334824","effectiveDate":"2003-06-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[230874],"PO":["433760"]},"87471":{"abstract":"Proposal : IIS-0331314<br\/>Institution: University of Pittsburgh<br\/>PI: Ronald Larsen<br\/><br\/><br\/>The grant will support a two and one-half day workshop to identify and develop research agendas for future digital libraries research and information infrastructure programmatic activities as envisioned in a number of major commissioned Federal and NSF reports and international working group reports. Funding will support the participation of approximately 40 invited scholars and researchers who have distinguished themselves in disciplinary and organizational achievements in the area of digital libraries and networked knowledge environments, and who have demonstrated leadership in the national and international community. The workshop is being organized by senior members of the digital libraries community, some of whom have been instrumental in designing past agency and interagency programs. The event is scheduled to be held June 15-17, 2003 in Chatham, Massachusetts.","title":"Ubiquitous Knowledge Environments: The Cyberinfrastructure Information Ether","awardID":"0331314","effectiveDate":"2003-06-01","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["464231"],"PO":["564456"]},"87592":{"abstract":"This award provides funds to subsidize the travel and housing expenses of students selected to participate in the User Modeling Doctoral Consortium, which will be held in conjunction with the ninth International Conference on User Modeling on June 22-26, 2003, in Johnstown, Pennsylvania. <br\/><br\/>At the consortium, Ph.D. students who are doing their dissertations on AI-related topics present their proposed research, and receive feedback from a panel of established researchers as well as from the other students. This provides the students with invaluable exposure to outside perspectives on their work, at a critical time in their research, and also enables them to explore their career objectives. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades.","title":"Supporting Students Attending User Modeling 2003 Conference","awardID":"0331799","effectiveDate":"2003-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["496622"],"PO":["564318"]},"79013":{"abstract":"This research project focuses on foundations for a new kind of advanced communication infrastructure referred to as a content-based network. A content-based network is intended to complement traditional uni-cast and multicast networks, providing improved support for the communication modes underlying large-scale, loosely coupled, multi-party, distributed applications such as auctioning, information sharing, fusion and dissemination, sensor grids, personalized news distribution, service discovery, and multi-player games. The main research challenge in this project is to formulate a viable technological basis to support the service model of a content-based network. In particular, the work involves six basic technical thrust areas: Network Configuration, Subnetting, Routing, Forwarding, Quality of Service and Security. For Network Configuration, research involves design of an expressive, yet tractable, data model and associated predicate language for messages. Subnetting is expected to simplify network configuration and reconfiguration, as well as to reduce the computational cost of forwarding. Based on the chosen approach to addresses and subnets, an appropriate routing algorithm must be selected and adapted. Fundamental to the efficiency of content-based networking will be the availability of the compact forwarding tables and fast forwarding algorithms. The range of delivery guarantees for Quality of Service in a content-based network is conceivably rich. Finally, content-based networking introduces some challenging twists to traditional communication security, which have to be identified, thoroughly characterized and evaluated. The results in all these thrust areas are subject to rigorous evaluation. Two-pronged evaluation strategy is planned: simulation-based experimentation and prototype-based measurement. The simulations will provide a means to evaluate the robustness and scalability of the service under a variety of synthetic usage scenarios, while the prototype will allow the utility and comparative performance of the service to be demonstrated in implementing a variety of higher-level applications.","title":"Foundations of Content-Based Networking","awardID":"0240412","effectiveDate":"2003-06-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["290193",205760],"PO":["565090"]},"82060":{"abstract":"We propose to build on the existing MEMS (micro-electromechanical systems) simulator, SUGAR, and turn it into a design synthesis tool that supports the early stages of conceptual design. Our approach is to develop a broad base of MEMS building blocks and hierarchies of clusters and assemblies that can be integrated into a \"MEMS\/NEMS (micro\/nano) Design Automation and Synthesis\" framework for constructing a large range of MEMS and submicron devices. Our goal is to make MEMS and appropriate extensions to NEMS technology widely accessible to universities and small businesses.<br\/><br\/>Specific tasks are to develop an expanded set of modular building blocks for MEMS\/NEMS design and to create corresponding engineering models for the SUGAR MEMS simulator. Using a case base of existing designs, we will build a prototype of an indexed library of these MEMS building blocks, clusters and design examples. An exploratory MEMS synthesis environment will be based on stochastic search algorithms that will produce conceptual designs for further deterministic refinement, fabrication, testing and evaluation. During the third year will make recommendations for scalability and extension to nano-scale designs (NEMS). To achieve broad impact, we will make our revisions to SUGAR freely available through source code, a web service and educational workshops.","title":"MEMS\/NEMS Design Automation and Synthesis","awardID":"0306557","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["457562","555580"],"PO":["562984"]},"83160":{"abstract":"This work brings together methods of differential geometry and statistics to construct learning algorithms for high dimensional data sets. At the heart of our approach is the assumption that although natural data is embedded in high dimensional spaces, they lie on a low dimensional manifold embedded in this space. The dimension of this manifold is related to the number of degrees of freedom of the data generating process. Consequently, the proper domain on which classifiers should act is this low dimensional manifold. Using the Laplace Beltrami operator, an appropriate basis of functions can be invariantly and intrinsically defined on this manifold. The classifier is then expressed in terms of this basis and the coefficients are estimated from training examples. If the manifold is unknown, we construct a graph approximation from discretely sampled data points, replace the Laplace Beltrami with the graph Laplacian and perform analogous computations on the graph.<br\/><br\/>In general, we plan to explore the manifold structure of natural data, apply our geometrically motivated learning techniques to practical applications such as partially labeled classification and data representation, and consider theoretical questions of convergence of our sample estimates to the desired true values. In an age where massive high dimensional data sets are being collected in domains ranging from bio-informatics to the Internet, the techniques proposed here will provide new ways to represent, classify, and access such data.","title":"Statistical Learning Using Differential Geometry","awardID":"0310643","effectiveDate":"2003-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}}],"PIcoPI":["225717"],"PO":["321058"]},"84051":{"abstract":"0314651<br\/>Cushman<br\/>Historically the major advances, or radical paradigm shifts, in subsurface hydrology have been the result of ideas or tools borrowed from other disciplines. Among these ideas and tools are geostatistical data synthesis, stochastic models, numerical solutions to PDE's, and generalized scaling and coarse graining concepts.<br\/><br\/> Though significant progress has been made over the past few decades in modeling subsurface flows and transport, we are a long way from being able to quantitatively predict the movement of miscible and immiscible fluids and colloids in the deeper subsurface (aquifers), and of water and dissolved constituents in the near-surface (soils). Difficulties abound with theories of multiphase flow, flow in swelling media, descriptions and ramifications of spatial heterogeneity, hysteresis, chemical aging, microbial transport and degradation, multiscale processes, and etc.<br\/><br\/> There are two purposes for the proposed workshop:<br\/><br\/>i. To bring together researchers from disparate disciplines (e.g., math, physics, chemistry, engineering sciences) to discuss their approaches to related problems in other fields of science, and allow them to interface with hydrologists.<br\/><br\/>ii. To write a white paper for NSF-hydrology on modern tools and approaches which have the potential to seriously advance hydrologic modeling.<br\/><br\/>It is anticipated that a wide variety of topics and approaches will be discussed: Among these are chaos and nonlinear dynamics, homogenization, CTRW and fractional approaches, stochastic dynamics, nonequilibrium statistical mechanics, percolation, renormalization, projection operators, stochastic perturbation theories, complexity theory, as well as many others. The conference will not focus on numerical methods, but rather on novel approaches to describe multiscale physics, chemistry and microbiology.","title":"Workshop on: Modern Mathematical\/Physical Tools That May Lead To Improved Models in Subsurface Hydrology","awardID":"0314651","effectiveDate":"2003-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1579","name":"HYDROLOGIC SCIENCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["556537"],"PO":["376131"]},"78551":{"abstract":"In recent times much has been said about how, once deployed, networks<br\/>of devices with wireless communication capabilities will affect the way<br\/>we work, learn, interact, organize, get entertained, fight wars, and<br\/>recover from disasters. This interest in wireless networks has led to<br\/>a fair amount of research activity in the areas of mobile and ad-hoc<br\/>networking, addressing both systems and theory issues. However, not<br\/>much research work has been done on fundamental information theoretic<br\/>concepts related to wireless *sensor* networks, i.e., networks of tiny,<br\/>low power, unreliable devices equipped with very limited sensing and<br\/>communication capabilities, and embedded in the environment. This<br\/>project is primarily about the study of fundamental performance limits<br\/>for large-scale wireless sensor networks. Specifically, there are<br\/>three problems, deeply intertwined with each other, and very relevant<br\/>in practice, on which we concentrate our efforts:<br\/><br\/> - Source Coding problems, dealing with the design and performance<br\/>analysis of codes and signal processing algorithms for the random fields<br\/>generated by sensor nodes.<br\/><br\/> - Routing problems, dealing with design and performance analysis of<br\/>protocols and signal processing algorithms for moving sensor data *within*<br\/>the network.<br\/><br\/> - Reachback Communication problems, dealing with the design and<br\/>performance analysis of codes and signal processing algorithms for moving<br\/>sensor data *out* of the network.<br\/><br\/>The solution to problems of source coding, routing, and reachback<br\/>communication in sensor networks requires a \"marriage\" of networking<br\/>and communication theoretic concepts. This presents an interesting<br\/>opportunity for innovation in education, since networking is typically<br\/>regarded as a \"pure CS\" topic, whereas communication theory is typically<br\/>regarded as a \"pure EE\" topic. All of my educational and outreach<br\/>activities (undergraduate and graduate course development, lab development,<br\/>undergraduate textbook development, service to community) are designed<br\/>around the general goal of providing a solid theoretical basis to our<br\/>students in networking and communications, as well as the more specific<br\/>goal of highlighting the interplay between these concepts in the context<br\/>of wireless sensor networks.","title":"CAREER: Fundamental Performance Limits of Large-Scale Wireless Sensor Networks","awardID":"0238271","effectiveDate":"2003-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[204732,"228373"],"PO":["348215"]},"89057":{"abstract":"This research focuses on data-intensive computing---embedding processing capability in the memory and I\/O subsystems of traditional computer systems and shipping the code to the data rather than moving the data through the main microprocessor. Novel architectures that can exploit this newfound flexibility in the memory and I\/O system have the potential to significantly improve performance and robustness. They will also remove three important limitations in current parallel and uniprocessor architectures: hardwired cache coherence protocols in scalable multiprocessors, poor cache performance for applications with bad stride accesses or poor spatial locality, and latency and bandwidth bottlenecks in I\/O-intensive applications. This research specifically addresses those limitations and includes the development of novel coherence protocols and fairness mechanisms for programmable memory systems; and the development of the necessary protocol extensions to convert the FLASH multiprocessor into an active memory machine. This will be done by exploiting the existence of a hardware prototype to run real-world problems and gain insight into the potential of flexible memory and I\/O systems. Finally, the design of Active Fabric, a high performance novel unified architecture for data-intensive computing will be accomplished.","title":"CAREER: Flexible Architectures for Data-Intensive Computing","awardID":"0340600","effectiveDate":"2003-06-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[233573],"PO":["248088"]},"79025":{"abstract":"This collaborative project concentrates on four main research thrusts: (i) a detailed study to statistically characterize protocol interaction, (ii) a scalable agent-based service to provide all nodes with state information, (iii) a Media Access Control (MAC) protocol utilizing smart antennas, and, (iv) the usage of inverse optimization as a framework for characterizing algorithmic protocol interaction. The focus on the network and MAC layer protocol interaction in wireless mobile ad-hoc networks is in the context of a generalized location service that provides a mechanism to obtain the current position of a mobile node by using smart antennas. This service, called Network Environment Wireless State service (NEWS) service, is generalized to obtain other aspects of node state, such as its local traffic characteristics, velocity, and energy usage, in addition to its location; it provides current \"news,\" i.e., state, to the rest of the system. Such a service can improve the performance of protocols and provide information for emerging services based on location and other state information. This project also aims at identifying the impact of protocol interaction, both algorithmic and statistical, first in an implementation of a NEWS service wherein different network and MAC solutions are mixed and matched. Furthermore, this project defines a hierarchical agent-based NEWS service that uses local traffic conditions and node density to spawn (slay) agents to operate in a recursively defined grid area. The design of this protocol complements a MAC layer solution that can take advantage of location and the ability to control transmit power level to directionally transmit within the appropriate grid level. Finally, this project will use a framework based on inverse optimization to decide when to spawn agents at the network layer to obtain successful transmissions at the MAC layer, i.e., to optimize the interlayer interaction.","title":"Collaborative Research: Characterizing Protocol Interaction in NEWS: A Network Environment Wireless State Service","awardID":"0240524","effectiveDate":"2003-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["521384"],"PO":["565090"]},"78541":{"abstract":"This is a Faculty Early Career Development (CAREER) award. The research portion of the work will develop a single, general Evolvable Hardware (EH) framework that allows for the creation of self-designing, self-configuring computational devices usable across a variety of application areas. EH seeks to create self-designing computational machines, especially those capable of exploiting design principles outside of conventionally understood engineering techniques, and self-configuring devices capable of automatically adapting as a problem domain changes. The generality of the framework will be demonstrated by using it to evolve devices to address problems drawn from several traditional computer science areas.<br\/><br\/>The research plan focuses on the development of a general framework for the evolution of practical neuromorphic computational devices as well as the development of specialized VLSI chips to embody those devices. The framework will be applied to generate novel neuromorphic devices to address problems in control (jet engine combustion stabilization) and pattern recognition (active sensing for machine olfaction). By combining evolutionary learning and analog neuromorphic computing on the same chip, the project aims to deliver controllers that can adapt and improve while in service. <br\/><br\/>The education plan for this project is based on the idea that professional practice requires both a strong command of theory and the skill to apply theory to solve problems of practical import. As such, engineering practice is best learned with the assistance of a mentor who can provide both theoretical knowledge and practical coaching. The educational activities are geared toward fostering mentor\/student relationships among faculty, graduate students, undergraduate students, and members of the general public outside the university community. These activities will be designed to integrate research into the undergraduate and graduate curriculums, to encourage students to pursue advanced degrees in computer science and engineering, and to educate the general public in the advantages of supporting computer science and engineering research in general.<br\/><br\/>This CAREER award recognizes and supports the early career-development activities of a teacher-scholar who is likely to become an academic leader of the twenty-first century. The research will have broader impacts in addition to the educational benefits. Self-designing computational machines would be of enormous value both as tools in their own right and as generators of new design principles to be exploited by humans. Self-configuring devices would be invaluable in autonomous situations where they needed to remain in service for long periods of time or in environments where human adjustment was not practical. This research aims to establish the generality of the Evolvable Hardware framework, to provide immediately useful computational devices, and to expand basic scientific knowledge.","title":"CAREER: Evolvable Hardware Neuromorphic Computational Devices for Sensing and Control","awardID":"0238200","effectiveDate":"2003-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["526918"],"PO":["387198"]},"79421":{"abstract":"Traditionally, access controls have been used to restrict users to <br\/>limited views of available data. Although early access control models were devised for structured data, they are being extended to deal with XML data. Access controls, however, are not always sufficient to secure complex information environments. Threats may come, <br\/>for example, from incorrect categorization of information or users, <br\/>derivation of inferences from legally obtained data, unauthorized exchanges of information between users, and combining data obtained from different internal sources.<br\/><br\/>This proposal will use a complementary approach to current access <br\/>control mechanisms based on checking data not before they are extracted from data sources, but when they are released across a gate representing a critical security boundary. The checking process is <br\/>not based simply on source\/destination addresses as in current firewall <br\/>systems, or on simple ``dirty word'' matching as in current filtering software, but on a deeper content analysis based on release constraints. <br\/><br\/>In order to achieve this objective, a comprehensive framework is <br\/>required that takes into account the different formats outgoing data can have, the complexity and diversity of release control rules, and the necessary support for the security officers in the definition <br\/>and management of these rules. A major characteristic of this approach <br\/>to separate the specification of critical data, called the controlled items, from the way it is matched against any outgoing information. Technical problems involved in the definition of such a framework include (i) the specification of appropriate formalisms to represent controlled items and matching rules, (ii) the automatic derivation of controlled items from access control rules and their integration with controlled items provided by security officers, (iii) the computation of complete and minimal representation of controlled items and matching rules, and (iv) the design of efficient matching algorithms that are capable of dealing with different matching rules and data formats.","title":"Controlled Release of Information Based on Contents","awardID":"0242237","effectiveDate":"2003-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}}],"PIcoPI":["339912","540637","427499"],"PO":["371077"]},"77155":{"abstract":"Lehigh University is partnering with middle and high schools in the Allentown and Bethlehem Area School Districts in the Lehigh Valley, industry experts from Air Products and Chemicals, Agere Systems, Insaco, Inc. and the Discovery Center for Science and Technology Pennsylvania on \"A Lehigh Valley Partnership to Enhance STEM Education Through G4-12 Teaching Fellows.\" The involvement of industry and the Discovery Center is novel and evidence of the project's intellectual merit. This project builds upon established outreach programs at Lehigh and will continue to enhance the educational experience of students in Lehigh Valley schools by placing graduate and advanced undergraduate Teaching Fellows in STEM classrooms and establishing STEM outreach teams. Teaching Fellows are helping grade 4-12 teachers introduce inquiry-based learning and use multimedia, wireless and other innovative technologies in local classrooms. Outreach teams consisting of Fellows, Lehigh faculty and industry experts are training and exchanging ideas with STEM teachers and administrators from the two schools districts. The great diversity within the school districts served promise broad impacts from these activities. This project is partially supported by funds from the Directorate for Engineering and from the Directorate for Computer and Information Science and Engineering.<br\/><br\/>Title of Project: A Lehigh Valley Partnership to Enhance STEM Education through G4-12 Teaching Fellows<br\/>Institution: Lehigh University<br\/>PI\/Co-PI: William M. Pottenger, Glenn D. Blank, Horace Moo-Young, Henry U. Odi, Michael J. Schulte (all from Lehigh University)<br\/>Partner School District: Allentown and Bethlehem Public School Districts<br\/>Funding: $1,223,068<br\/># of Fellows\/year: 6 Graduate Fellows and 6 Undergraduate Fellows<br\/>Target Audience: Middle and High School (grades vary based on discipline)<br\/>Setting: Urban<br\/>Disciplines: Computer Science, Information Technology, Physics, Chemistry, Earth Science and Mathematics","title":"A Lehigh Valley Partnership to Enhance STEM Education through G4-12 Teaching Fellows","awardID":"0231768","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}}],"PIcoPI":["322848","322848","322851",201308,"377734","451739","451739"],"PO":["559975"]},"79465":{"abstract":"This research investigates distributed trust management as an<br\/>alternative to traditional authentication and access control schemes<br\/>in dynamic and pen computing environments such as multiagent systems,<br\/>web services and pervasive computing. Distributed trust management<br\/>handles security with techniques used in human societies, where people<br\/>are judged on their abilities, assets, relationships and reputations.<br\/>Authorization decisions are made through the application of relevant<br\/>security and trust policies, expressed in a high-level declarative<br\/>language. The policies define rules and constraints on agents (human<br\/>or software) and the actions they can take on objects in terms of<br\/>their credentials and properties. This work extends the principles of<br\/>trust management with deontic notions of rights, obligations, and<br\/>prohibitions. An ontology grounded in a semantic language (e.g., RDF,<br\/>DAML or OWL) is used to represent security information constituting<br\/>credentials, policies, beliefs, and proofs as well as relevant<br\/>domain-specific properties to characterize the agents, actions and<br\/>objects. An important results will be a better understanding of how<br\/>the semantic web can address the critical issues of security, trust<br\/>and privacy in distributed open environments. The new concepts and<br\/>techniques will be evaluated and demonstrated through the<br\/>implementation of prototype tools and applications","title":"Trust and Security for the Semantic Web","awardID":"0242403","effectiveDate":"2003-06-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V242","name":"CIA-MACHINE TRANSLATION(MT)"}}],"PIcoPI":[206900,"563576","533183"],"PO":["469867"]},"79026":{"abstract":"This project focuses on creation and deployment of the new network virtualization mechanisms to support mobile communication and, in particular, efficient transparent migration of end-to-end live network connections without any changes to existing network protocols. To this aim, novel mobile communication architecture is proposed, called Virtual Network Address Translation (VNAT), which enables connection mobility for a spectrum of computation units, ranging from a single process to the entire host. Three key mechanisms are used to enable transparent live connection mobility: connection virtualization, connection translation, and connection migration. Connection virtualization virtualizes end-to-end transport connection identification by using virtual endpoints rather than physical endpoints (e.g., IP addresses and port numbers). As a result, connection identifications no longer depend on lower layer network endpoints and are no longer affected by the movement of network endpoints. Connection translation translates virtualized connection identifications into physical connection identifications to be carried on the physical network. As connections migrate across the network, their virtual identifications never change. Instead, they are mapped into appropriate physical identifications according to the endpoints' attachment to the physical network. Finally, VNAT connection migration keeps states and uses protocols to automate tasks for connection migration such as keeping connection alive, establishing a security key, locating migrated end-point (s), and updating virtual-physical endpoints mappings. In this project, the VNAT architecture is implemented and is fully compatible with, and does not require any modifications to, existing networking protocols, operating systems, or applications. The results of this research will have a fundamental scientific impact by providing crucial networking mechanisms for future innovations in mobile networking research.","title":"Network Virtualization Mechanisms for Mobile Communication","awardID":"0240525","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["508477"],"PO":["565090"]},"83173":{"abstract":"ABSTRACT<br\/>This is a collaborative research project between the Universities of Utah and North Carolina at Chapel Hill. The project is advancing the state of the art in geometric modeling by constructing a set of new surface representations that are sufficiently general to solve a wide range of problems in geometric surface design, estimation, and analysis. This work is founded on the assertion that no single representation is adequate to solve efficiently and accurately the myriad computational and analytical problems arising in modern applications. The strategy, therefore, is to develop a framework that systematically combines parametric and implicit surface representations. This project will examine the complementary nature of two particular representations: non-uniform B-splines (NURBs) and level sets. It will develop methods which provide: mutual tracking of the representations, analysis of the topology and singularities which occur, and mechanisms for communicating important topological events between representations. This project will also examine applications of this framework to computer aided design and terrain modeling and analysis. <br\/><br\/>When modeling 3D objects with surfaces, one is faced with a wide range of different surface representations. Each representation has corresponding drawbacks and advantages. Many modeling applications, such as computer-aided design and terrain analysis, require shapes to be modified in order to match some input data or to suit the needs of a user or designer. Therefore, one of the most important aspects of a surface representation is how it affords a user or a computer algorithm the facility to modify a shape, i.e. to deform one shape into another slightly different shape. Some representations provide a user with a great deal of control, but are constrained to a limited specific set of shapes. Other representations can represent a wide range of shapes, but only with a limited accuracy. An important concern in modifying a shape is how the representation handles cases where the surface folds back and touches itself. This is called a singularity and it indicates that the surface might be transitioning from one class of shapes to another. Different surface representations handle such singularities in different ways. This work will try to improve the technology for modifying shapes and handling singularities by combining two different shape representations and extending relevant singularity theory. This exploration should yield new tools for designing shapes and new tools for building and analyzing the shapes of measured surfaces, such as those generated from terrains. The collaboration between Utah (031075) and the University of North Carolina Chapel Hill (0310546) provides this project with specialized skills in singularity theory and unique educational opportunities for computer science students to learn more about this important subject in mathematics.","title":"COLLABORATIVE RESEARCH PROPOSAL: Hybrid Modeling for Geometric Design, Estimation, and Analysis","awardID":"0310705","effectiveDate":"2003-06-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}}],"PIcoPI":["293059","486565","515717"],"PO":["321058"]},"78993":{"abstract":"This research project focuses on scalable reconciliation methods that enable ubiquitous information sharing in a networked mobile environment. It develops, applies, and experiment with the most recent advances in information and coding theory and computational methods relevant to data reconciliation. The proposed approach entails addressing the problem from three related perspectives: peer-to-peer reconciliation, network-wide reconciliation, and, usage modeling. The latter specifically aims at investigating and modeling practical usage of mobile devices in order to tune reconciliation parameters. The comprehensive approach to the issues of data reconciliation promises to impact a large number of individuals and corporations who use PDAs and other portable devices for maintaining personal and work data. In addition, the results of this research will be applicable to a wide variety of networking areas, including improving of the efficiency of content delivery in general networking architectures, minimizing the overhead of ad-hoc routing protocols, and reducing the delay of gossip protocols.","title":"A Scalable Middleware for Data Reconciliation in PDAs and Mobile Networks","awardID":"0240333","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["486132","449083"],"PO":["565090"]},"79005":{"abstract":"This research project addresses some fundamental issues related to routing in dense networks that are expected to be the key enabler of new facets of computing exemplified by embedded-, ubiquitous-, and pervasive computing. Specifically, a radically new framework for routing in dense networks called Trajectory Based Forwarding is proposed. This novel method is a generalization of source based routing and Cartesian forwarding in that the trajectory is set by the source as a continuous trajectory, but the forwarding decision is based on the relationship to the trajectory rather than the final destination. Trajectory Based Forwarding has a number of features that makes it an ideal candidate as a low level primitive in dense ad-hoc networks. First, it decouples the path name from the path itself. This is the most critical aspect in a dense network, where nodes might move, go into doze mode, or fail, thereby rendering a source based path useless or make route maintenance expensive. Second, the specification of the trajectory is independent of the destination. This makes the Trajectory Based Forwarding usable both as a routing support, when the destination is indicated, as a discovery support primitive, when the destination is not known, or as a flooding replacement. In addition to the simple unicast, trajectory routing and forwarding have significant advantages for many other important network functions such as flooding, discovery, multicast and broadcast, path resilience and even positioning. The objective of this research is to test routing methods using trajectories, to explore ways of specifying trajectories, and to implement many of the networking functions such as discovery, flooding, and network management. A specific domain where Trajectory Based Forwarding can be effectively deployed, used, and evaluated is in monitoring transportation systems or physical infrastructure. It is expected that Trajectory Based Forwarding can radically change the way we think about routing in networks and lead to a new area of research with a rich problem space.","title":"FourierNet: Routing in Dense Networks","awardID":"0240383","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["483835"],"PO":["565090"]},"81491":{"abstract":"PROPOSAL NO: 0304274<br\/>INSTITUTION: U of Cal Berkeley<br\/>PRINCIPAL INVESTIGATOR: King, Tsu-Jae<br\/>TITLE: Scaling Si-based FET's Atomic Dimension<br\/>Abstract:<br\/>This project will pave the technological pathway for scaling silicon transistors down to atomic dimensions (~1 nm minimum feature size). A promising new transistor structure (the back-gated thin-film MESFET) will be developed, one that is more scalable and much simpler to manufacture than the conventional MOSFET structure employed in integrated-circuit (IC) devices today. The MESFET will provide for tremendous gains in functional density, not only by transistor scaling but also by three-dimensional integration (stacking multiple layers of transistors in an IC) for maximum circuit layout efficiency and system performance. This work will enable improvements in performance and cost to continue for at least 20 more years, supporting the growth of the semiconductor industry over this time period. It will also serve to bridge the technological gap between CMOS devices (scaling limit ~10 nm) and molecular\/nanotube devices (~1 nm minimum dimensions), while easing the manufacturing challenges of nanometer-scale fabrication. Given the key role of information technology and emerging role of nanotechnology in modern society, this project will have very broad impact. Graduate and undergraduate students will directly benefit from it via hands-on research and course lectures, and new knowledge will be disseminated widely via presentations at international workshops and conferences, as <br\/>well as in archival journals.","title":"NER: Scaling Si-based FET's Atomic Dimension","awardID":"0304274","effectiveDate":"2003-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["498207","505955"],"PO":["562984"]},"83460":{"abstract":"Abstract<br\/>Ariola, Zena<br\/>Oregon University<br\/><br\/>The goal of the project is the development of a summer school to prepare graduate students, faculty and industrial people to conduct research on the foundations of security. Three types of material is presented and discussed: <br\/>Background<br\/>This material consists of well established results developed in the late 80's and early 90's. This provides an introduction to the essential concepts and methodologies. <br\/>Advanced Topics<br\/>This material consists of more recent results that extend and generalize the earlier work. This provides students with insights into research and open questions.<br\/>Applications<br\/>This material demonstrates how theoretical results can be used by practitioners in dealing with security problems in a concurrent setting.<br\/>This provides students with skills in the use of formal methods to reason about and generate solutions to practical problems, such as verification of protocols or Java specifications.<br\/><br\/>Following the summer school the material presented by the speakers will be made available through the summer school web site. Thus, the the school can have a broader impact on the community.","title":"Foundation of Security and Concurrency: Fellowships & Support","awardID":"0312132","effectiveDate":"2003-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2802","name":"TRUSTED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["489107"],"PO":["564388"]},"78411":{"abstract":"Today, high-performance clusters of shared-memory multiprocessors (SMPs)<br\/>are employed to cope with large data sets for scientific<br\/>applications. On these SMPs, hybrid programming models combing<br\/>message passing and shared memory are often less efficient than pure<br\/>message passing although the former fits SMP architectures more<br\/>closely.<br\/><br\/>The objective of this work is to determine the sources of<br\/>inefficiencies in utilizing memory hierarchies of SMPs and to optimize<br\/>memory behavior. The novelty lies in the reliance on<br\/>dynamic binary rewriting, i.e., performance analysis and tuning are<br\/>performed on the application while it executes.<br\/><br\/>The technical challenges are to<br\/><br\/>1) develop a framework for dynamic binary rewriting,<br\/>2) determine coherence traffic resulting in misses for<br\/>non-deterministic orders of executions in the presence of parallelism,<br\/>3) identify memory bottlenecks,<br\/>4) determine data dependencies between data references for<br\/>hot-spots for binaries,<br\/>5) study the potential for memory-improving program transformations<br\/>on the executing binary and<br\/>6) evaluate the merits of optimizations for large-scale benchmarks<br\/>among others.<br\/><br\/>The key intellectual merit is in providing additional, dynamic<br\/>optimizations for long-running applications. The broader impact of<br\/>this work lies in its contribution to counter the increasing gap<br\/>between processor and main memory speeds by fully<br\/>exploiting software optimizations.","title":"CAREER:Exploiting Binary Rewriting to Analyze and Alleviate Memory Bottlenecks for Scientific Applications","awardID":"0237570","effectiveDate":"2003-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["553590"],"PO":["565272"]},"79566":{"abstract":"Existing vulnerabilities are a serious threat to computer systems and organizations. Research in security is needed to identify vulnerabilities in systems, evaluate the threat, and devise mechanisms that avoid them. Formalizing vulnerability, building quantitative models of threat, and experimental studies are needed to discover and evaluate solutions for dealing with threats to life and economy. This will result in algorithms, observations based on experiments, and infrastructure that can deal with expected and unexpected attacks in an adaptable and graceful manner. It will lead towards guidelines for building secure systems and databases. The research will build upon results in failure identification, fault-tolerance and reliability\/safety. Vulnerabilities will be reduced by keeping an attacker uncertain and unaware about the latest version of databases\/software and routing information that are in operation.<br\/>This research will contribute to fundamental principles and policies for providing homeland security in information systems and applications in nuclear waste shipping, e-commerce, and disaster management. A better understanding of vulnerabilities in a variety of institutions such as schools, government agencies, air space and airports, and industrial plants will be explored. We will contribute to the outreach program of CERIAS security center at Purdue through preparation of education material and organizing workshops.","title":"Vulnerability Analysis and Threat Assessment\/Avoidance","awardID":"0242840","effectiveDate":"2003-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["540775",207154],"PO":["427499"]},"77168":{"abstract":"CUNY Graduate School is partnering with the Bronx High School Superintendency of the New York City Board of Education, The College Board, and the New York Academy of Sciences to address the need to increase the participation of low-income and underrepresented minority students in high-school-level Advanced Placement (AP) courses in mathematics and sciences, particularly in urban schools. This will have broad impacts not only for New York City, but also for other urban school districts eager to challenge all of their students. Project activities include: training for GK-12 Fellows in STEM education so that they can play a new role as an AP Fellow; enhancing the abilities of AP teachers of science and mathematics to deliver AP courses to urban students; and developing an exportable model that can be used by other school districts for increasing the successful participation of urban students in AP courses. The Graduate Fellows are assisting 20 new or novice AP teachers of science and mathematics and both are receiving intensive summer and academic-year training and support including College Board Summer Institutes, and workshops on such topics as science and mathematics content, inquiry-based instruction, science and math standards, educational technology as applied to formatting, AP course instruction, and post-secondary programs and career opportunities in STEM. In addition, of intellectual merit, AP teachers and university faculty who teach parallel courses are working together toward improving AP course delivery and articulation with post-secondary settings. This project is partially supported by funds from the Directorate for Engineering from the Directorate for Computer and Information Science and Engineering.<br\/><br\/>Title of Project: The AP Fellows Program: Enhancing Low-Income Urban Students Participation and Achievement in Advanced Placement Courses<br\/>Institution: The Graduate School and University Center of the City University of New York <br\/>PI\/Co-PI: Theodore Brown and Victor S. Strozak, both from CUNY Graduate School<br\/>Partner School District: Bronx High School <br\/>Other Partners: The College Board and the New York Academy of Sciences<br\/>Funding: $1,498,818<br\/># of Fellows\/year: 10 AP Graduate Fellows and 20 AP Science and Math Teachers<br\/>Target Audience: High School <br\/>Setting: Urban<br\/>Disciplines: Biology, Biochemistry, Chemistry, Computer Science, Earth and Environmental Sciences, Engineering, and Physics","title":"The AP Fellows Program: Enhancing Low-Income Urban Students' Participation and Achievement in Advanced Placement Courses","awardID":"0231800","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}}],"PIcoPI":[201349,"355542"],"PO":["559975"]},"82020":{"abstract":"Cheap and tiny processors, radios, sensors, and actuators resulting from progress in microelectronics are leading to a new class of embedded systems, often called Wireless Sensor Networks, that consist of a large number of individual nodes that are physically-coupled, energy-constrained, spatially-distributed (often in an ad hoc fashion), and wirelessly-networked. Such systems provide information about the physical environment at an unprecedented level of detail, and to manipulate the physical environment based on this information, in diverse applications such as security and surveillance, monitoring of wildlife habitats, smart sensor-instrumented environments, and condition-based maintenance of complex systems. This research involves the study of techniques to systematically design, optimize, and manage Wireless Sensor Networks so as to meet applications requirements such as how long the system should last, what space should it cover, and how accurately and how rapidly should it sense the environment. <br\/><br\/>Wireless Sensor Networks are autonomous, self-configuring, and adaptive distributed systems that perform collaborative computation among energy-constrained nodes to produce the desired information about the physical world. The study is developing design-time resource allocation and run-time resource management methods for such systems while exploiting the inter-play of energy, space, time, and accuracy dimensions that underlies the notion of quality of service in these systems. The focus is on trade-offs that manifest themselves at the level of the entire \"sensor field' as opposed to the individual sensor nodes. This study is important both for understanding the fundamental performance limits of wireless sensor networks, as well as for developing practical methods to systematically deploy and operate sensor networks for specific applications.","title":"Run-time and Design-time Exploration of Field-level Energy, Space, Time and Fidelity Trade-offs in Distributed Sensor Networks","awardID":"0306408","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["560926","515835"],"PO":["543507"]},"82042":{"abstract":"CCR-0306494<br\/>Robert Cartwright<br\/>William Marsh Rice University<br\/><br\/>The Java platform has won acceptance as a superior vehicle for building software applications, but it is still in the early stages of evolution. Its most serious deficiency is a crude type system which does not support generic types, separates primitive types from object types, and includes the null pointer in every object type. As a result, programmers cannot express many important program invariants in the type system. An improved Java type system could simplify the structure of many Java programs and enable programmers to catch more bugs at compile time.<br\/><br\/>The next major release (1.5) of the Java platform will support a restricted formulation of generic types. While this extension represents a major step forward, restrictions on the use of generic types will prevent them from being used in many important object-oriented coding patterns.<br\/><br\/>In this project, we propose to design and implement a compatible extension of Java 1.5 with a more advanced type system in which generic types can be used anywhere that conventional types can. The extended Java language will enable programmers to express important new data abtractions, to eliminate most type casts, and to catch more bugs at compile time--without compromising program performance.","title":"First-Class Genericity for Java","awardID":"0306494","effectiveDate":"2003-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["495364"],"PO":["564388"]},"78533":{"abstract":"Abstract <br\/>0238174<br\/>Zhi Tian <br\/>Michigan Tech Univ.<br\/><br\/>With the recent release of the Ultra Wideband (UWB) signal spectral mask by the Federal Communications Commission (FCC) in 2002, UWB has emerged as an exciting technology whose ``time has come'' for commercial wireless communications, and local area networking. Conveying information over Impulse-like Radio (IR) waveforms, UWB comes with uniquely attractive features: low-power-density carrier-free<br\/>transmissions, ample multipath diversity, low-complexity baseband transceivers, a potential for huge increase in capacity, and the capability to overlay existing RF systems. However, to bring the potency<br\/>of IR to fruition, UWB research and development has to cope with formidable challenges that include: high sensitivity to timing the reception of ultra-short pulses, mitigation of fading propagation effects with pronounced frequency-selectivity, low-complexity constraints in decoding high-performance multiple access protocols, and the strict power limitations imposed by the desire to minimize interference between UWB communicators, and co-existing RF systems. <br\/><br\/>This research addresses timely signal processing issues arising in UWB communications, with focuses on: (1) The development of optimal and low-complexity sub-optimal timing epoch estimators along with metrics to assess their performance, and influence on the bit error probability and throughput of UWB systems. (2) The derivation and convergence analysis of low-complexity near-optimal soft-decision based multiuser detectors, and multi-channel equalizers for UWB multiple access protocols. (3) The investigation of overlay issues, modulation schemes, coding, decoding, and interference suppression algorithms to enable UWB spectral mask compatibility, and co-existence with other wireless services. (4) The deployment of multiple transmit-receive antennae to improve performance of low-complexity decoding, timing estimation, and multiuser detection. The outcome of this research will impact the basic theory, design, and deployment of forthcoming multiple access UWB wireless systems.","title":"CAREER: Signal Processing Research in Ultra Wideband Communications","awardID":"0238174","effectiveDate":"2003-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["565205"],"PO":["564898"]},"88037":{"abstract":"The Information and Data Management Principal Investigators' Workshop (IDM03) is held September 14 - 16, 2003 in Seattle, Washington. The objective of the annual workshops is bringing together researchers and practitioners to discuss the focus topics as well as to identify and elaborate on particular emphases for future activities.<br\/><br\/>The IDM03 Workshop is focusing on bringing together IDM researchers as representatives of two communities; that is, information management (often referred to as database management), along with selected industry and government invitees, to: (1) cooperatively (i) analyze and focus on the research and development issues of problems that are fundamental in making progress towards this new challenge; (ii) specify areas where major breakthroughs appear possible; (iii) identify needed collaborations (e.g., inter-disciplinary, academic-industry); and (iv) identify research initiatives and facilities needed to meet this and future challenges; (2) share, provide demonstrations and interact with each other on the objectives, contributions and challenges of major research activities funded by the IDM Program and explore fruitful collaboration and synergism; (3) provide an opportunity to NSF program officers, other funding agencies, and industry representatives to learn more about the current research efforts and successes of projects funded by IDM, and for such officers to share their program highlights and concerns.<br\/><br\/>The IDM03 Workshop Web site (http:\/\/www2.cs.washington.edu\/nsf2003\/) will contain reports on all projects currently funded by the IDM Program, providing up-to-date project information searchable by different criteria, including information relevant to NSF's Government Performance and Results Act (GPRA) goals (e.g., connections between discoveries and their use in service to society). The IDM03 Workshop discussions will result in a report that will help in formulating future directions of research in IDM and related areas and will suggest promising modalities of research in academia and industry with an aim to foster innovation as well as technology transfer. The Web site will also include links to other relevant material.","title":"NSF IDM PI Workshop 2003","awardID":"0334623","effectiveDate":"2003-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["376063"],"PO":["563751"]},"79029":{"abstract":"This collaborative project concentrates on four main research thrusts: (i) a detailed study to statistically characterize protocol interaction, (ii) a scalable agent-based service to provide all nodes with state information, (iii) a Media Access Control (MAC) protocol utilizing smart antennas, and, (iv) the usage of inverse optimization as a framework for characterizing algorithmic protocol interaction. The focus on the network and MAC layer protocol interaction in wireless mobile ad-hoc networks is in the context of a generalized location service that provides a mechanism to obtain the current position of a mobile node by using smart antennas. This service, called Network Environment Wireless State service (NEWS) service, is generalized to obtain other aspects of node state, such as its local traffic characteristics, velocity, and energy usage, in addition to its location; it provides current \"news,\" i.e., state, to the rest of the system. Such a service can improve the performance of protocols and provide information for emerging services based on location and other state information. This project also aims at identifying the impact of protocol interaction, both algorithmic and statistical, first in an implementation of a NEWS service wherein different network and MAC solutions are mixed and matched. Furthermore, this project defines a hierarchical agent-based NEWS service that uses local traffic conditions and node density to spawn (slay) agents to operate in a recursively defined grid area. The design of this protocol complements a MAC layer solution that can take advantage of location and the ability to control transmit power level to directionally transmit within the appropriate grid level. Finally, this project will use a framework based on inverse optimization to decide when to spawn agents at the network layer to obtain successful transmissions at the MAC layer, i.e., to optimize the interlayer interaction.","title":"Collaborative Research: Characterizing Protocol Interaction in NEWS: A Network Environment Wireless State Service","awardID":"0240558","effectiveDate":"2003-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["546219"],"PO":["565090"]},"82461":{"abstract":"Robotics and Human Augmentation Program<br\/><br\/>ABSTRACT<br\/><br\/><br\/>Proposal #0308224<br\/>Title: Pattern Formation in Parts Sorting, Feeding, and Assembly<br\/>PI: Lynch, Kevin<br\/>Northwestern University<br\/><br\/><br\/>This project is to study the design of shape and motion control strategies for nonprehensile robotic devices (e.g., vibratory surfaces) inducing self-assembly of parts. This includes designing sensor-based motions to automatically (1) sort parts, (2) orient parts in fixtures (feeding) and (3) bring two or more parts into a desired relative configuration (assembly). Such systems are characterized by the complex dynamics of repeated frictional impacts. We describe the behavior of the system dynamics in terms of qualitative features from dynamical systems theory, such as stable fixed points and limit sets, chaotic regimes, etc. This abstraction of the descriptive mechanics allows us to use emergent behaviors, the existence of which are robust to uncertainties in the mechanics model, to design sensor-based motion plans to stabilize a desired sorting, fixturing, or assembly.<br\/><br\/>Success of this work will lead to formal strategies for automated design of industrial parts feeding and assembly systems that are currently designed by trial and error. Our work on sensor design and sensor-based control could find applications to self-assembly in other domains (e.g., on the micro- or nano-scale where the low-level mechanics are quite different). Formal sensor-based manipulation planning approaches, originally developed in robotics, may be applicable to these other domains.<br\/><br\/>This project will have an impact on undergraduate education by involving undergraduates in the research. The project will also impact graduate education through Northwestern's IGERT on Nonlinear Science and the course ME 449 Robotic Manipulation taught by the PI. Results of the project will be broadly disseminated through project websites, conference talks, and journal papers.","title":"Pattern Formation in Parts Sorting, Feeding, and Assembly","awardID":"0308224","effectiveDate":"2003-06-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["522422"],"PO":["335186"]},"82483":{"abstract":"This project addresses current limitations in automatic information extraction technology. Specific objectives are to:<br\/>1. use bootstrapping techniques to greatly increase the number of types of entities and relations that can be extracted and the rate at which one is able to create new extractors,<br\/>2. improve the performance of supervised training for entity and relation extractors by using bootstrapping to add additional training features and by applying new supervised learning techniques, including new perceptron and discriminative training techniques,<br\/>3. address meta-data issues of provenance, confidence, and temporal extent of facts, focussing particularly on the construction of a model of the expected lifetime of facts based on a longitudinal corpus of Web data.<br\/><br\/>The outcome of the project will be scientific understanding and technology for automatic information extraction from free text, making it possible to convert large document collections into formal databases suitable for automated processing. This will represent a significant enhancement in the utility and societal benefit of digital libraries and the World Wide Web. Project results will be disseminated in the form of publications and publicly available code for information extraction and learning of extractors.","title":"Collaborative Research: Semantic Entity and Relation Extraction from Web-scale Text Document Collections","awardID":"0308370","effectiveDate":"2003-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["508222"],"PO":["565215"]},"82010":{"abstract":"CCR-0306372 and CCR-0306023<br\/>Title: Collaborative Research: Scalable Integration Testing o<br\/> Object-Oriented Software: An Empirical Research Program<br\/>PIs: Mary Jean Harrold, Alessandro Orso, Gregg Rothermel<br\/><br\/>When object-oriented and component-based software systems are developed, they must be integration tested. Integration testing methods proposed to date for such systems, however, suffer from three limitations: they fail to consider system evolution, they fail to accommodate heterogeneous engineering models and sources of nformation, and they provide little or no empirical investigation or understanding of the factors influencing the testing effort. This research addresses these limitations. The initial objective of the work is to design and conduct families of experiments to compare the cost-benefits of existing techniques for integration testing applied to evolving object-oriented and component-based software, and evaluate the potential tradeoffs among those techniques. The results of these studies will guide the development of evolution-aware integration testing techniques, capable of accommodating heterogenous sources of testing information, and responding to the wide range of engineering models associated with object oriented and component-based software. By making experimental data, infrastructure, and new experimental methodologies available to the research community, the proposed work will enable scientific progress on the issues investigated to accelerate. By providing methodologies for testing this important class of software systems, the work will reduce the risks these systems present to society.","title":"Collaborative Research: Scalable Integration Testing of Object-Oriented Software: An Empirical Research Program","awardID":"0306372","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["530729","550999"],"PO":["564388"]},"85596":{"abstract":"We propose to hold a 2-day NSF-sponsored workshop in Chicago, Illinois in October 2003 to study future research directions of the interplay between Information Theory and Computer Science. The tentative proposed workshop dates are Friday and Saturday October 17-18, 2003.<br\/><br\/>The objective of the workshop is to bring together leading researchers and innovators from both academia and industry in order to discuss the open problems and future directions of information theory and computer science. More specifically, the goals of this workshop are to:<br\/><br\/>Provide a contextual basis for understanding the interplay between information theory and algorithmic aspects of computer science;<br\/><br\/>Assess the potential impact of computer science and information theory on emerging areas and technology such as bio-informatics and multimedia informatics, and vice versa;<br\/><br\/>Identify and characterize the major research issues associated with the design, development, and deployment of information systems and algorithms behind them;<br\/><br\/>Develop a conceptual framework for future cross-cutting research activities;<br\/><br\/>Present recommendations to NSF on how to promote research excellence in the interplay between IT and CS.","title":"Information Theory and Computer Science Interface","awardID":"0321451","effectiveDate":"2003-06-15","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["425343"],"PO":[223414]},"83088":{"abstract":"0310376<br\/>Bernd Girod<br\/>Stanford U<br\/><br\/>With conventional compression, the encoder exploits the statistics of the source signal. However, efficient compression can also be achieved by exploiting source statistics - partially or wholly - at the decoder only. <br\/>This surprising insight is the consequence of information theoretic bounds established in the 1970s, particularly those by Wyner and Ziv for lossy coding with side information. We refer to compression that builds on these results and exploits receiver side information as Wyner-Ziv coding. While still in its infancy, practical Wyner-Ziv coding has the potential to widely impact distributed communication systems. For video signals, it might find applications ranging from enhanced digital television broadcasting, low-complexity networked cameras, and improved visual surveillance systems for military and civilian applications.<br\/>In this project, we develop and explore new Wyner-Ziv coding techniques and apply these to two different video communication problems. Wyner-Ziv coding is a radical departure from conventional, non-distributed coding, and, therefore, a significant part of our effort is devoted to fundamental problems of code design, quantizer design, and the role of transforms. In the first application, we consider a novel video compression system with asymmetric complexity, useful for wireless mobile cameras. Since Wyner-Ziv coding exploits the source statistics in the decoder, the encoder can be very simple, at the expense of a more complex decoder. In the second application, we devise a novel unequal error protection scheme for video broadcasting that protects the video waveform with a lossy source-channel code. Such a scheme does not require a layered, embedded representation of the video signal to achieve graceful degradation with worsening channel <br\/>conditions and is hence compatible with deployed single-layer video compression standards.","title":"Wyner-Ziv Coding of Video","awardID":"0310376","effectiveDate":"2003-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["226086"],"PO":["564898"]},"78534":{"abstract":"Data management has become a core function of computing, strongly<br\/>influencing not only performance but also energy consumption, program<br\/>security, fault tolerance, and other program properties. While many<br\/>programs use a large amount of data, they do not access all data at<br\/>all times. Hence, data adaptation can improve cache efficiency by<br\/>identifying and compacting precisely those data required at a given<br\/>point of computation. Such fine-grained and dynamic data management<br\/>may significantly alleviate the bottleneck on communication and<br\/>strengthen the control of data.<br\/><br\/>This research studies fine-grained data adaptation through a<br\/>compiler-based approach. It develops three compiler-assisted<br\/>techniques. First, program monitoring analyzes selected data; then,<br\/>locality analysis identifies their group locality; and finally, data<br\/>transformation changes their layout while maintaining program<br\/>correctness using run-time data maps. The new system improves cache<br\/>optimization for data-intensive applications on conventional machines<br\/>and memory management for general-purpose programs on embedded<br\/>devices. In parallel to research, the investigator develops<br\/>data-analysis tools to support teaching of memory issues in computer<br\/>organization, compiler, and programming courses. The investigator<br\/>also develops an advanced course that focuses on memory optimization<br\/>techniques at all system levels.","title":"CAREER: Compiler-Assisted Data Adaptation","awardID":"0238176","effectiveDate":"2003-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["550486"],"PO":["565272"]},"88379":{"abstract":"The 2003 ACM SIGCOMM Conference on Communications Architectures, Protocols and Applications will be held in Karlruhe, Germany, from August 25-August 29, 2003. This conference is the premier technical meeting that examines the state-of-the-art in computer networks and communications. This proposal requests funding to assist approximately 15 United States-based graduate students in attending this meeting. Participation in conferences such as SIGCOMM is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work in the field. The support requested in this propoal will enable the participation of students who would otherwise be unable to attend ACM SIGCOMM 2003.","title":"Travel Support for ACM SIGCOMM Conference 2003; Karlsruhe, Germany; August 25-29","awardID":"0336856","effectiveDate":"2003-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["522280"],"PO":["565090"]},"81681":{"abstract":"The investigators have developed a set of parallel algebraic multilevel techniques for solving distributed sparse linear systems of equations, leading to the ``parallel Algebraic Recursive Multilevel Solver'' (pARMS), a portable and general purpose library for solving sparse linear systems on parallel computers. One of their goals is to begin to address the `efficiency gap' between `special purpose' and `general purpose' methods. On one extreme of the spectrum of solvers available, lie sparse direct methods which are robust, general-purpose, but expensive. On the other extreme, are special purpose methods, such as multigrid, which utilize information about the underlying problem to tailor-design certain solution procedures. Such methods can be optimal but they aim at solving the original physical problem instead of the resulting linear system. In between these extremes are the preconditioned Krylov methods whose performance is variable.<br\/><br\/>This research is characterized by a different vision of what a library of parallel iterative solvers should offer. The investigators strongly believe that a new paradigm is required where a solver is no longer a monolithic box comprising a set of preconditioners, but allows the user to input specific information, indeed even parts of the solution algorithm, in order to tailor the multilevel solution procedure. This approach, which is enabled by the modular design of pARMS, is in perfect agreement with the standard approach used in industry. The new paradigms and methods envisioned in this research will also<br\/>include a number of other key issues which arise in a typical solution process. Thus, it is important to exploit the underlying context when solving nonlinear systems of equations. It is also important to ensure that the pARMS code provides a fall-back option to an efficient sparse direct solver for situations where the iterative solver fails. The investigators also plan to explore new questions which are starting to emerge with the advent of the Computational Grid. Finally, they will keep in mind architecture- and problem-dependent tuning of solution algorithms.<br\/><br\/>The software developed by the investigators will continue to be made publicly available. Both investigators have major interactions with researchers in important applications areas. The pARMS-X code is also likely to have an impact on graduate education, as was the case with SPARSKIT in the past.","title":"ALGORITHMS: Parallel Large-Scale Sparse Linear System Solvers: New Methods and Paradigms","awardID":"0305120","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["466669","550000"],"PO":["565272"]},"83133":{"abstract":"This is a collaborative research project between the Universities of Utah and North Carolina at Chapel Hill. The project is advancing the state of the art in geometric modeling by constructing a set of new surface representations that are sufficiently general to solve a wide range of problems in geometric surface design, estimation, and analysis. This work is founded on the assertion that no single representation is adequate to solve efficiently and accurately the myriad computational and analytical problems arising in modern applications. The strategy, therefore, is to develop a framework that systematically combines parametric and implicit surface representations. This project will examine the complementary nature of two particular representations: non-uniform B-splines (NURBs) and level sets. It will develop methods which provide: mutual tracking of the representations, analysis of the topology and singularities which occur, and mechanisms for communicating important topological events between representations. This project will also examine applications of this framework to computer aided design and terrain modeling and analysis. <br\/><br\/>When modeling 3D objects with surfaces, one is faced with a wide range of different surface representations. Each representation has corresponding drawbacks and advantages. Many modeling applications, such as computer-aided design and terrain analysis, require shapes to be modified in order to match some input data or to suit the needs of a user or designer. Therefore, one of the most important aspects of a surface representation is how it affords a user or a computer algorithm the facility to modify a shape, i.e. to deform one shape into another slightly different shape. Some representations provide a user with a great deal of control, but are constrained to a limited specific set of shapes. Other representations can represent a wide range of shapes, but only with a limited accuracy. An important concern in modifying a shape is how the representation handles cases where the surface folds back and touches itself. This is called a singularity and it indicates that the surface might be transitioning from one class of shapes to another. Different surface representations handle such singularities in different ways. This work will try to improve the technology for modifying shapes and handling singularities by combining two different shape representations and extending relevant singularity theory. This exploration should yield new tools for designing shapes and new tools for building and analyzing the shapes of measured surfaces, such as those generated from terrains. The collaboration between Utah (031075) and the University of North Carolina Chapel Hill (0310546) provides this project with specialized skills in singularity theory and unique educational opportunities for computer science students to learn more about this important subject in mathematics.","title":"Collaborative Research: Hybrid Modeling for Design, Estimation, and Analysis","awardID":"0310546","effectiveDate":"2003-06-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}}],"PIcoPI":["480387"],"PO":["321058"]},"87005":{"abstract":"This award subsidizes expenses of student participants in the Student Research Workshop organized in conjunction with the 2003 Association for Computational Linguistics Conference, to be held July 7-12, 2003 in Sapporo Japan. The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing and language engineering. The Association's annual conference, which rotates among the Americas, Pacific-rim countries, and Europe\/Africa, is the major international meeting in the field. <br\/><br\/>The workshop format allows students to present their research and receive feedback from a panel of established researchers in the field. It provides students with invaluable exposure to outside perspectives on their work at a critical time in their professional development through feedback from the panel and other student participants. Also, student participants will be able to see each other's presentations and feedback, which could lead to a general raising of standards and expectations, strengthening future student research. The ACL Student Workshop is an inexpensive yet highly effective means of encouraging young and upcoming computational linguists. The intimate format encourages the student participants to begin building a rapport with established researchers. The workshop should contribute to the maintenance and development of a skilled and diverse natural language processing workforce, helping to produce a pool of researchers with the scientific and engineering knowledge required for future applications of natural language processing. It should help to foster international scientific exchange, providing merit-based opportunities for future leaders of the field to attend a conference that might otherwise be less geographically diverse than is desirable for the field. In addition, by building a supportive environment for these students, it is more likely that down the road, they will lend a supporting hand to other students who follow.<br\/><br\/>Computational linguistics is a multidisciplinary field of increasing importance to science, commerce, and society. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades.","title":"Student Research in Computational Linguistics at the ACL 2003 Conference","awardID":"0328222","effectiveDate":"2003-06-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["384542"],"PO":["246649"]},"79009":{"abstract":"This research project aims at applying the swarm intelligence framework to design a new class of networking protocols for mobile wireless ad hoc networks, facilitated attractive features such as scalability, autonomy, robustness, and fault-tolerance for routing, topology control and energy conservation. The basic idea is inspired by the collective activities of social insects, and utilizes small packets equivalent to ants in the real world. These packets, traveling like ants, deposit some information at nodes they visit similar to the way ants lay pheromone trails. This information, in turn, affects the behavior of other ant packets. With this form of indirect communication, the deployment of ant-like packets resembles a distributed reinforcement learning system that evolves itself to an optimal state, based on the current condition of the environment. This project will characterize the behavior and study the performance of swarm intelligence for ad hoc networking protocols based on probability, reinforcement learning, and stochastic control theories, in addition to large-scale simulation studies. To cope with network dynamics and mobility efficiently, the ad-hoc networks based on swarm intelligence are expected to learn and inherently adapt to changes in network states.","title":"Ad hoc Networking with Swarm Intelligence","awardID":"0240398","effectiveDate":"2003-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["528443"],"PO":["565090"]},"85950":{"abstract":"ABSTRACT: EIA 0323215, Georgia Tech, H. Mitchell, PI<br\/><br\/>This project provides support for thirty current and future educators including faculty from historically black colleges and universities (HBCUs), minority serving institutions, public universities that supply teachers and in-service educators from minority school districts to attend and participate in the National Educational Computing Conference (NECC) in Seattle, Washington in June, 2003. Extensive dissemination plans are incorporated in the project to insure that the knowledge gained at the conference will be extended both to others at the institutions that are participating and to others at other institutions. The project also includes a substantial evaluation plan. The overall project is expected to be successful in its goals of increasing awareness and knowledge of uses of new technology in education to a broad audience.","title":"Special Projects: Increasing IT Capacity of Minority Edcuators in Georgia via NECC 2003","awardID":"0323215","effectiveDate":"2003-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":[224406,224407],"PO":["289456"]},"83112":{"abstract":"Complexity theory addresses the question of how much resource <br\/>is needed to solve a given computational problem. In recent <br\/>years complexity theory has found connections and applications <br\/>in many scientific and engineering disciplines. This project <br\/>plans to investigate complexity theory across a broad front. <br\/>The topics include communication complexity, decision trees, <br\/>quantum algorithms, quantum cryptography, and other foundational <br\/>issues in complexity theory. Te goal is to gain deep insights <br\/>into the nature of computation, so that one can most effectively <br\/>perform computational tasks in any model. It is expected that <br\/>a variety of algebraic and combinatorial techniques will be <br\/>called upon to explore these topics.<br\/><br\/>Two of the most interesting scientific developments in recent years <br\/>spring from the realization that complexity theory can be utilized <br\/>for cryptography, and that quantum mechanics can be used for <br\/>performing powerful computation. Advances in these fronts have <br\/>attracted interest from scientific communities at large, <br\/>as their relevance is far-reaching. The research of this project <br\/>could lead to substantial further progress in these two areas.<br\/><br\/>In the broader domain of public education, the Principal Investigator <br\/>has given many speeches in recent years on various topics on <br\/>complexity, cryptography and quantum computing. Many of these talks <br\/>are geared toward general audiences and often undergraduate students. <br\/>These lectures, if thoughtfully designed, can stimulate the <br\/>intellectual curiosity of young minds and develop their interest <br\/>in the computing sciences. With further advances of research in <br\/>these areas, one can expect that public awareness and interest <br\/>will be further enhanced to the good of a stronger scientific education.","title":"Foundations of Complexity Theory","awardID":"0310466","effectiveDate":"2003-06-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["382705","542007","257042"],"PO":["499399"]},"83145":{"abstract":"DMS-0310589<br\/>Karen Daniels, Daniel Klain, Koonstantin Rybnikov<br\/><br\/>This is a CARGO incubation award made under solicitation <br\/>http:\/\/www.nsf.gov\/pubs\/2002\/nsf02155\/nsf02155.htm.<br\/>The investigators will develop new techniques and algorithms for solving a <br\/>collection of problems that address the verification and reconstruction of <br\/>geometric objects from partial information. The approach is to have two <br\/>stages: first, verify if the partial information is consistent with the <br\/>desired outcome. Second, if the answer is positive, reconstruct the object. <br\/>If the answer is negative, find an approximation to the desired reconstruction. <br\/>The group will focus on four major types of problems. The first type is a <br\/>general class of NP-hard containment, covering and packing problems. Although <br\/>complete information about the objects may be available, partial information <br\/>will be used due to the hardness of the problems. In addition to <br\/>strengthening existing algorithms for polygonal shapes, this work will <br\/>design the first containment and covering algorithms using objects <br\/>bounded by spline curves. For the other three problems only partial <br\/>information about the objects is available. The second problem is <br\/>the verification of convexity and reconstruction of convex polyhedra <br\/>and convex smooth shapes from partial data. Reconstruction of <br\/>convex polytopes from partial data is a fascinating classical problem <br\/>going back to Maxwell, Steinitz, and Minkowski. While much work has <br\/>been done on recognition and reconstruction of convex polyhedra <br\/>from projections, reconstruction of smooth convex shapes with a <br\/>given discrete set of parameters is a problem that has not been <br\/>adequately addressed. Our work will emphasize reconstruction of <br\/>convex smooth bodies using splines. The third problem is that <br\/>of statistical determination of topological properties of a body, <br\/>such as the Euler characteristic, from a finite set of sample points. <br\/>The fourth problem, tightly related to the third one, is the determination <br\/>of the topology of a non-convex body from its projections on a <br\/>finite number of planes. Dissection and subsequent use of valuations, <br\/>i.e. finitely additive probability measures, will play an especially <br\/>important role in the third and fourth problems. The team of mathematics <br\/>and computer science investigators will combine computational geometry <br\/>techniques, mathematical programming approaches, methods of graph theory <br\/>and discrete geometry, methods of convexity theory, and work on <br\/>multivariate splines to design verification and reconstruction algorithms. <br\/><br\/>In addition to their significance in the context of pure mathematics and <br\/>theoretical computer science, these problems are important to applications <br\/>of computational geometry and geometric software design. For example, <br\/>verification of metric and topological properties of geometric software <br\/>outputs is important for implementing and testing geometric algorithms. <br\/>Containment algorithms are useful in 2D packing and layout for manufacturing. <br\/>Containment for 3D shapes is applicable to modeling tasks such as molecular <br\/>docking and to medical treatment planning. Covering problems arise in practical <br\/>settings such as military sensor coverage and targeting, telecommunications, <br\/>spatial query optimization, and graphics. Work involving splines is applicable <br\/>to CAD and design of numerical methods. Determination of the topology of a <br\/>body from finite samplings, projections, and sections is a hard problem <br\/>important for computer tomography and pattern recognition.","title":"Verification of Properties of Geometric Structures and Reconstruction of Geometric Objectsfrom Partial Information","awardID":"0310589","effectiveDate":"2003-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["223722","526856","245574"],"PO":["218970"]},"83398":{"abstract":"The most pressing obstacle to achieving high computer performance is<br\/>that CPUs compute faster than the computer can move data to the CPU. <br\/>Because programs usually have regular and repetitive accesses, current<br\/>computers cache recently accessed data in a hierarchy of fast, flat<br\/>inclusive memories to improve performance. Technology trends are<br\/>making the data delivery problem much worse and will force changes to<br\/>to memory design such as partitioned cache levels. We propose a rich<br\/>software\/hardware interface to manage next generation caches. We<br\/>propose new compiler algorithms to translate programs to perform<br\/>better on this new hardware, and new hardware designs that enable the<br\/>compiler to inform the hardware of current and future data access<br\/>patterns. These new techniques will go well beyond the current<br\/>minimalist load and store architecture\/compiler interface to achieve<br\/>high performance. The result will enable end users of computer systems<br\/>to solve their problems more quickly and easily. The research will<br\/>have broad impact on the design and implementation of software and<br\/>hardware cache architectures. It will add new and enhanced tools to<br\/>the compiler, tool, and simulation national research infrastructure.<br\/>This work will also train graduate students in advanced research.","title":"Compiling for and Designing Next Generation Memory Systems","awardID":"0311829","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["519591",217452,"424003"],"PO":["565272"]},"83299":{"abstract":"Co-Designed Virtual Machines use a combination of concurrently designed hardware and software to implement a conventional instruction set architecture (ISA). An implementation-specific instruction set is directly supported by hardware, and a co-designed dynamic binary translation system completes the processor implementation by translating binaries of conventional ISAs. Translated implementation-specific binary code is cached in a concealed region of memory and executed directly by the processor core. The obstacles to using this approach involve potentially detrimental overheads -- at startup, during steady state, and in required memory resources. The proposed research will tackle each of these overhead problem areas by 1) providing micro architecture support to improve translation times by an order of magnitude, 2) adding features to eliminate steady state overheads of executing cached translated code, and 3) using memory compression to reduce the fraction of physical memory that must be dedicated to holding translated code.<br\/><br\/>The co-designed virtual machine paradigm will greatly simplify the hardware design process and enable performance improvements by providing a better match between computer hardware and software. A simpler design process will lead to reduced design times, lower engineering costs, and hardware innovations coming to market sooner. Performance improvements will be accompanied by better energy efficiency because some hardware-intensive tasks are shifted to less-<br\/>Frequently used software tasks.","title":"Achieving High Performance with Co-Designed Virtual Machines","awardID":"0311361","effectiveDate":"2003-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["552216"],"PO":["325495"]},"88887":{"abstract":"The focus in modern computer networks has started to shift towardsservices and functionality rather than efficiency andoptimization. This calls for algorithms that combine user-centricperformance metrics such as fairness, availability, and latency withmore traditional objectives such as the total bandwidth cost or totalthroughput; it is desirable for these algorithms to provide formalguarantees in abstract models, as well as general rules of thumb forsystem developers. This research involves the study of severalproblems within the above framework.The first problem is to design efficient distributed algorithms forachieving approximate fairness in computer networks, and to studysimple mechanisms that induce convergence of selfish users toapproximately fair solutions. The second problem is to study routingissues in peer-to-peer systems; peer-to-peer systems are groups ofend-nodes that collaborate to implement new network services at theapplication level. Another problem is to study the packet-injectionrate at which common packet scheduling protocols such as FIFO becomeunstable.In an attempt to overcome the gap between theoreticians andpractitioners in this field, a new course titled \"Algorithms forcomputer networks\" will be developed, and the course material will bemade publicly available. Another course titled \"Modern algorithmictechniques\" will also be developed.","title":"CAREER: Algorithms for Services - Oriented Communications Networks","awardID":"0339262","effectiveDate":"2003-06-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["429621"],"PO":["562944"]},"82431":{"abstract":"The goal of this project is to use perceptual abilities developed in machine vision as foundations for a system that provides dynamic access to useful physical-world knowledge in a form that natural-language understanding and reasoning systems can meaningfully employ in the course of interactive dialogue with human users. To accomplish this goal, mid-level abstractions called \"perscripts\" are being developed that correspond roughly to the information content of simple phrases and implement an associated class of recognition operations grounded in state-of-the-art machine vision technology. Such abstractions possess sufficient richness and power to bridge the representational gap, while remaining absolutely tied to perceptual processes that operate in interesting real-world environments. The knowledge obtained in the investigation is also of basic interest from a machine vision standpoint since it provides a validated, higher level architecture for visual perception of a sort that is currently lacking in most implemented, real-world systems.<br\/><br\/>The work is being validated in the context of a particular application, a \"Household Assistant\" whose purpose is to provide people living in a \"smart house\" with information useful in activities of daily living (e.g., \"where did I leave my glasses?\" or \"did I take my meds?\") via a user interface employing natural language dialogue. This application is being developed in conjunction with the University of Rochester Center for Future Health, which has a smart home environment in place, and with the natural language group in the Computer Science Department.<br\/><br\/>This project will provide for the training of graduate students in an area (practical machine vision coupled to natural language interfaces) that has growing economic potential. It will provide basic principles for, and working prototypes of, intelligent computer systems that will stand between people and the physical world. Undergraduates are involved through associated projects. The application in the Center for Future Health addresses the needs of the elderly and the disabled, and has the potential to have a significant economic impact as part of an overall system that unloads caregivers for this population.","title":"Grounding Language in Visual Percepts","awardID":"0308049","effectiveDate":"2003-06-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[214928],"PO":["565215"]},"83311":{"abstract":"This project will investigate the complexity of problems in logics.<br\/>The focus will be on results that classify the complexity of an<br\/>infinite number of problems. The first such result dates from 1978,<br\/>when Schaefer proved his famous dichotomy theorem for generalized<br\/>satisfiability problems. He defined an infinite number of propositional<br\/>satisfiability problems (nowadays usually called Boolean constraint<br\/>satisfaction problems), showed that all these satisfiability problems are<br\/>either in P or NP-complete, and gave a simple criterion to determine<br\/>which of the two cases holds. In recent years, quite a few dichotomy<br\/>theorems have been shown about problems in logics. Almost all of<br\/>these problems have the following three properties in common: They<br\/>are variations of satisfiability, they are problems in propositional logic,<br\/>and they use Schaefer's constraint framework.<br\/><br\/>This project's goal is to extend the existing research in three<br\/>different directions, seeking dichotomy theorems for problems that<br\/>are not related to satisfiability, for problems in logics other than<br\/>propositional logic, and for frameworks other than Schaefer's<br\/>constraint framework.<br\/><br\/><br\/>Broader Impacts:<br\/><br\/>Through her school's commitment to, as voluntary cost-sharing,<br\/>reduce the proposer's teaching load by one course per year,<br\/>and through the direct support of her summer months,<br\/>this grant will have the broader impact of helping support<br\/>research at an undergraduate institution. This harmonizes<br\/>well with RIT's desire to become a more research-friendly<br\/>institution. The travel support will allow the proposer and<br\/>her students to attend conferences to develop professionally<br\/>via learning of new advances, and presenting their results to<br\/>the broader theory community.","title":"Randomness and Non-Determinism","awardID":"0311411","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["467800"],"PO":["499399"]},"81881":{"abstract":"The objective of this research is on developing a new concept and foundation for efficient one-step preimage computation for sets of states in large sequential circuits based on novel automatic test pattern generation (ATPG) techniques, where current <br\/>binary-decision-diagram (BDD)-based approaches fail. This is by taking the advantage that ATPG engines are not vulnerable to the space explosion problem, and thus the ATPG-based techniques can be applicable to very large designs. However, computation of preimages will stretch ATPGs in a way that they were not required before - they must<br\/>return all solutions instead of merely one solution. In other words, even though the state-of-the-art ATPGs are efficient in finding one solution, simply making them continue to search all other solutions will result in temporal explosion, in which exponential time will be required to compute the complete preimage. To remedy this problem, a new ATPG algorithm that intelligently prunes the redundant search spaces due to overlapping solutions is needed. In doing so, this new approach can significantly accelerate the search for all solutions necessary for preimage computation. Once the building block for preimage computation can be efficiently performed, it can naturally be plugged into formal model checking and equivalence checking engines for large sequential systems. This research addresses the following relevant issues: (a) identification of previously explored spaces that contain solutions; (b) pruning of the spaces that only contain conflicts; (c) combination of multiple solutions in a compact form; and (d) iteration of the <br\/>computation process to obtain preimage for multiple cycles. As this research brings about a new approach via which implicit state-space traversal can be performed, it offers an entirely new and effective dimension to the design verification arena for verifying large and complex sequential systems.","title":"Formal Verification of Large Sequential Systems Using Success-Driven ATPG","awardID":"0305881","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["494757"],"PO":["562984"]},"82322":{"abstract":"This project will develop machine learning algorithms, software tools, and supporting theory for solving structural supervised learning problems. Existing theory and algorithms have focused on learning an unknown function from training examples, where the unknown function maps from a feature vector to one of a small number of classes. Emerging applications in science and industry require learning much more complex functions that map from complex input spaces (e.g., 2-dimensional maps, time series, sequences, and graphs) to complex output spaces (e.g., other 2-dimensional maps, time series, sequences, and graphs). Examples include detecting fraudulent transactions in a transaction sequence, assigning parts of speech (noun, verb, etc.) to each word in a sentence, identifying genes in DNA sequences, and assigning a land cover class to each pixel in a remote-sensed image. However, existing statistical, machine learning, and data mining packages do not provide any support for these complex tasks, nor has machine learning theory been developed to analyze these tasks. This project will develop a general formulation of the structural supervised learning (SSL) problem, design and test a collection of algorithms for solving SSL problems, and develop a prototype system that will provide \"off -the-shelf \" tools for practitioners to develop SSL applications. <br\/><br\/>This project will have several broader impacts. First, many important problems confronting society involve finding patterns in sequential, spatial, or structural data. These include (a) law enforcement challenges, such as detecting theft of credit cards and health insurance fraud, (b) security challenges, such as detecting attempts by terrorists to send bombs in shipping containers, (c) health and safety applications, such as detecting outbreaks of diseases from temporal and spatial data about emergency room admissions, and (d) ecological applications, such as monitoring the health of ecosystems by analyzing sequences of remote-sensed images. The tools and techniques developed in this work can address all of these problems. Second, the project will train graduate students, including women (who are underrepresented in computer science), and provide them opportunities to attend scientific conferences and workshops.","title":"Off-the-shelf Learning Algorithms for Structural Supervised Learning","awardID":"0307592","effectiveDate":"2003-06-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["554550"],"PO":["317663"]},"81376":{"abstract":"Robotics and Human Augmentation Program<br\/><br\/>ABSTRACT<br\/><br\/><br\/>Proposal #: 303750<br\/>Title: Multi-Finger High Fidelity Haptic Exploration<br\/>PI: Hannaford, Blake<br\/>U of Washington<br\/><br\/><br\/>Haptic interfaces apply ideas from robotic manipulation science and technology to human interfaces and human augmentation. Current haptic interfaces have proven their feasibility for a variety of applications. Better haptic interfaces could dramatically improve medical training through high fidelity simulators for invasive medical procedures. Such procedures must be taught today on human patients. <br\/><br\/>However, the richness and fidelity of most haptic interfaces is still limited. It is very difficult to engineer a haptic interface with many degrees of freedom (DOF) and also the high bandwidth and low friction necessary for rendering subtle but important details. Before we expend this effort, we should know what if any perceptual benefit is provided by multiple fingered\/multi DOF devices. This project will study how human performance in haptic perception and exploration varies as increasing number of fingers are supported through increasing degrees of freedom. An existing high fidelity haptic device for the index finger will be duplicated to support haptic exploration with up to four fingers and two degrees of freedom per finger. This will allow independent variation of number of fingers and number of DOF. A preliminary evaluation of the device will measure performance in detecting small haptic features, and demonstrate haptic exploration of novel surfaces. We will learn whether and how haptic perception performance and strategies vary with the number of fingers and number of fingers per DOF.","title":"Multi-Finger High Fidelity Haptic Exploration","awardID":"0303750","effectiveDate":"2003-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["434705"],"PO":["335186"]},"82025":{"abstract":"PROPOSAL NUMBER: 0306440<br\/>INSTITUTION: United States Naval Academy<br\/>PRINCIPAL INVESTIGATOR: Brown, Christopher W.<br\/>PROPOSAL TITLE: RUI: Practical Computing with Semi-Algebraic Sets via Cylindrical Algebraic Decomposition<br\/><br\/>ABSTRACT<br\/>The purpose of this research is to develop algorithms and produce programs that are able to perform practical symbolic computations with semi-algebraic sets. The primary tool for this is Cylindrical Algebraic Decomposition (CAD), which provides a data-structure for explicitly representing semi-algebraic sets. CAD is a powerful and general tool, which has been implemented several times and already shown itself to be of more than just theoretical value. However, the consensus in the literature is that interesting application problems cannot be solved by current CAD programs within a reasonable amount of time and space. The three principal goals of the project are to extend the theory of CADs to deal efficiently with the types of semi-algebraic sets that arise in applications, produce efficient algorithms and programs that compute with CADs, and promote the use of CADs to solve problems in other disciplines.<br\/><br\/>A wide variety of problems from many areas of science and engineering reduce to questions about semi-algebraic sets, that is sets containing both numeric and symbolic entities. Problems come, for example from control theory, robotics, computer-aided design, geometric theorem proving, and even epidemiology. There are many advantages to performing these computations symbolically, foremost among them is that free parameters in the problem description remain free parameters in the solution, so that a single computation provides solutions to whole families of problems. The primary disadvantage to computing symbolically with semi-algebraic sets is simple but profound: the time and space requirements are typically prohibitive. To be an effective tool for applications, symbolic methods for computing with semi-algebraic sets must be able to solve practical sized problems in a reasonable amount of time and space, which is precisely the goal towards which this project aims to contribute. Since this work focuses on practical computing with semi-algebraic sets, its theoretical improvements are incorporated into actual programs. Furthermore, these programs are freely and easily available (via the Web) to others to encourage experimentation with their use in science and engineering. Finally, the results of such experiments help direct further theoretical effort. Student participation is an integral part of this research.","title":"RUI: Practical Computing with Semi-Algebraic Sets via Cylindrical Algebraic Decomposition","awardID":"0306440","effectiveDate":"2003-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["540805"],"PO":["565157"]},"83158":{"abstract":"Synchronization is an important component of reliable<br\/>data transmission. The problem of avoiding conflicts in asynchronous<br\/>multiple-access channels is investigated by utilizing methods from<br\/>algebraic and combinatorial coding theory.<br\/>Difference systems of sets are combinatorial structures<br\/>that are being used to facilitate the design of codes with good<br\/>synchronization properties. Comma-free codes are brought into play <br\/>in the organization of protocols for transmission over collision <br\/>channels in the absence of word synchronization.<br\/> Group testing techniques have numerous applications in fault <br\/>detection, error-control codes, and experimental designs.<br\/>In recent years, group testing has been studied in connection <br\/>with emerging new applications in multi-access communications,<br\/>the analysis of genetic information, chromosome mapping,<br\/>and DNA library screening. This project explores the link between <br\/>optimal 2-stage testing schemes and combinatorial designs that <br\/>minimize the expected number of tests, as well as algorithms <br\/>for the reconstruction of sequences by their subsequences or <br\/>super-sequences.<br\/> Packet loss is a common source of errors in Internet transmissions <br\/>that has renewed the interest in deletion-correcting codes. <br\/>The research concerning deletion and insertion correcting <br\/>codes will focus on finding bounds on the optimal size of a code <br\/>with prescribed error-correcting capacity, as well as<br\/>constructions of good 2-deletion-correcting codes that exceed<br\/>the Gilbert bound, and constructions of ordered Steiner<br\/>systems that yield optimal deletion-insertion correcting<br\/>codes.<br\/> The proposed research program presents an excellent <br\/>opportunity for introducing graduate and upper level undergraduate<br\/>students to the use of computers for learning and solving problems<br\/>that involve large scale algebraic and combinatorial operations <br\/>applied on data structures of formidable size, and utilizing<br\/>the computer as a tool for learning and solving real-world problems<br\/>that arise in various areas of science and engineering<br\/>of today's information age.","title":"U. S.-Russian Collaborative Research: Codes for Multiple-Access Channels, Genetic Testing, Deletion-Insertion Correction, and Synchronization","awardID":"0310632","effectiveDate":"2003-06-01","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[216722],"PO":["348215"]},"87756":{"abstract":"0332819<br\/>Helal<br\/>The EU\/US International Conference on Aging, Disability, and Independence (Washington, DC, December 4-6, 2003) is comprised of seven tracks: High Technology; Low Technology; Consumer Prospective; Home Modification\/Universal Design; Injury Prevention; Business Perspective; Transportation. The specific objectives of the Preparatory Workshop, June 26-27, 2003, Royal Academy of Engineering, London, England, are 1) to develop the Smart Home portion of the technical program for the High Technology Track of the International Conference, and 2) to identify strategies for future research and development. Support for United Kingdom participants in the workshop is provided by the UK Engineering and Physical Sciences Research Council and is hosted by the UK Focus for Biomedical Engineering.<br\/><br\/>The EU\/US International Conference builds on two White House initiatives: the October 2000 White House Forum on Technology for Successful Aging, and the current New Freedom Initiative. In the United Kingdom the EQUAL (Extend Quality Life) activity has much the same purpose. The year 2003 is the European (EU) Year of People with Disabilities wherein progress is expected to be driven towards achieving equal rights for people with disabilities. Both the Preparatory Workshop and the International Conference are elements of the EU program.<br\/><br\/>The EU\/US International Conference will focus on research, practice, and policy in areas outlined in the New Freedom Initiative. In recognition of the challenges faced by the aging of our population, the Preparatory Workshop and the EU\/US International Conference bring together experts in technology, research, development, and applications to document the state-of- the-science and to identify research needs in Smart Home technologies. <br\/><br\/>The EU\/US International Conference web site is http:\/\/www.asaging.org\/icadi\/03\/index.cfm","title":"Preparatory NSF Workshop for the EU\/US International Conference on Aging, Disability, and Independence, June 26-27, 2003, Royal Academy of Engineering, London, England","awardID":"0332819","effectiveDate":"2003-06-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["561046"],"PO":["317420"]},"79429":{"abstract":"The project will develop a model for secure survivable transaction processing system. Special emphasis will be on integrity and availability issues for transactions. The outcome of the research will be a flexible framework for transaction processing. Specifically the following activities will be carried out:<br\/>(i) Investigate how the different types of data and control flow dependencies impact secure transaction processing<br\/>(ii) Formalize the notion of well behaved transaction<br\/>(iii) Develop the secure multiform transaction model as a tool-kit approach<br\/>(iv) Explore recovery issues for secure transactions","title":"A Framework for Secure and Survivable Transaction Processing","awardID":"0242258","effectiveDate":"2003-06-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}}],"PIcoPI":[206810,"402347"],"PO":["469867"]},"81586":{"abstract":"NUE Award: Freshman Laboratory for Nanoscience<br\/><br\/>This award is part of Nanoscale Science and Engineering initiative, NSF 02-148, and is supported by the ENG\/EEC division (program director Dr. Mary Poats) and the Design Automation for Micro and Nano Systems Program in the CCR division (program director Dr. Sankar Basu) of the CISE directorate. The NUE award supports new facilities for a freshman course to motivate students to pursue careers in nanotechnology. In this two-term course, undergraduate students obtain hands-on experience in the fabrication and characterization of semiconductor, microfluidic and microelectromechanical devices. Students will learn how to fabricate, measure, and understand the operation and integration of basic solid state semiconductor circuit elements such as diodes and transistors in the first term. In the second term, students build and test their own microfluidic and micro-electromechanical devices such as micro-electromechanical microphones, micro-fluorescently activated cell sorters, and other micro-sensors. These tasks require high resolution lithography equipment as well as imaging techniques which will be acquired through this NSF award. This course will allow undergraduate students, and in particular freshmen interested in nanotechnology, to train on state of the art lithography equipment during the class, and later pursue diversified interdisciplinary research topics during the summer. Much of the instructional material developed under this program will be made available on the internet for use by other colleges and universities and by incorporation into the NSDL.","title":"NUE: Freshman Laboratory for Nanoscience","awardID":"0304713","effectiveDate":"2003-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}}],"PIcoPI":["438201",212811],"PO":["562984"]},"81146":{"abstract":"EIA-0302692<br\/>Anne O'Leary-Kelly<br\/>University of Arkansas<br\/><br\/>Title: The Influence of Professional Identification on the Retention of Women and Racial Minorities in the IT Workforce<br\/><br\/>This ITWF award provides support to study whether differences in individual characteristics and situational experiences lead women and minorities to develop different levels of professional identification (compared to majority individuals), and to examine the influence of professional identification on the career persistence of IT workers. The PI and co-PI's postulate a multivariate model and 14 specific hypotheses around which their proposed research project is based. Their general proposition is that many antecedent factors that have the potential to influence career retention operate through professional identification. In terms of women and racial minorities, the researchers propose to determine which and\/or if antecedent factors are experienced differently by members of these groups and how these differences influence attachment to the profession. The antecedent factors they will study include: (1) motivation for choosing the IT profession; (2) socialization into the IT profession; (3) self-efficacy regarding a career in IT; (4) experiences in the IT workplace; and (5) congruence of professional and other valued identities. <br\/><br\/>The researchers plan to use the cooperation of a number of employers of IT workers to identify and contact a panel of respondents in a program of original data collection. They will develop a data collection instrument that will be used to create longitudinal records on individuals at 3 time periods.","title":"ITWF: The Influence of Professional Identification on the Retention of Women and Racial Minorities in the IT Workforce","awardID":"0302692","effectiveDate":"2003-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":[211306,211307,211308,211309],"PO":["361119"]},"81872":{"abstract":"As the performance gap between processor and disk increases, buffer caches are playing a more and more important role in computer system performance. Many applications including web browsers, web servers, file servers, database servers, storage servers etc need to implement buffer cache modules. Many of these codes can potentially be shared to save development efforts and decrease the opportunity for software bugs. In addition, buffer cache management has become increasingly complex due to (i) ever so many different workloads with dynamic access patterns, (ii) many recently proposed cache managed schemes each tailored for specific access pattern, and (iii) the multi-level buffer cache hierarchy distributed among multiple heterogeneous software components on different machines. <br\/><br\/>This research addresses the above problems by investigating a unified, autonomic and collaborated buffer cache library called CacheLib. CacheLib will implement most existing cache replacement and prefetching algorithms. Software can use CacheLib to create and manage a buffer cache, relieving developers from implementing their own buffer cache modules. This research will also explore autonomic and collaborative caching schemes. With autonomic caching, the system can automatically select caching schemes to dynamically adapt to access patterns. With collaborating caching, multiple buffer caches residing in heterogeneous software are managed collaboratively to deliver the expected performance commensurate to the aggregate cache size.","title":"Collaborative and Autonomic Buffer Cache Management Library","awardID":"0305854","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["551097"],"PO":["543507"]},"81795":{"abstract":"The EURESCO Conferences (modeled on the Gordon Research Conferences in the<br\/>USA) were started in 1990 by the European Science Foundation, with funding from the<br\/>European Commission. Each conference consists of a series of five day-long scientific<br\/>meetings on one and the same general topic, spread over several years (typically one<br\/>meeting every other year). These are discussion meetings at which scientists discuss new<br\/>developments in their particular scientific discipline. Participation, by invitation upon<br\/>application, is limited to about 100. About 30 per cent of the participants should be young<br\/>researchers. In this proposal we are requesting travel support for 15 young USA based<br\/>scientists to participate in the 2003 EURESCO conference.","title":"NGS: WORKSHOP: Travel Support for Young Scientists to attend the EURESCO 2003 Conference on Adv Enviroments and Tools for High Performance Computing, Albufeira (Algarve), Portugal","awardID":"0305493","effectiveDate":"2003-06-15","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["226214"],"PO":["551712"]},"82434":{"abstract":"Many programmers, instructors, and programming students have a strong intuitive belief that visualization is valuable for communicating information about the state and behavior of programs. In particular, in the area of algorithms and data structures, traditionally regarded as a core area of computer science that students find difficult, the advent of algorithm animation created great expectations in the CS teaching community, as animation was seen as a better way to portray the dynamic workings of algorithms than was the use of purely static media. However, an apparent disconnect exists between the prevalence of a belief in the usefulness of visualization and the extent to which visualization is actually employed. In this project, the PIs will investigate the hypothesis that present PV systems have failed to live up to expectations because they have largely ignored the issue of appropriate perceptual properties for effective viewing, and that in order to be effective PV systems must support perceptually appropriate animation, graphical design and layout, as well as good pedagogical design. In order to address this problem, the PIs will identify and evaluate perceptual, attentional, and cognitive aspects of program visualization and will quantify and categorize these results. They will perform observational studies of how instructors teach in order to identify the tasks that instructors perform in preparing and presenting visualization-based lesson, and will develop improved presentation and interaction techniques for program visualization and more generally for process visualization. The PIs expect that critical evaluation of the effects of relevant attributes of PVs, the development of metrics for quality of PVs, and the tuning and evaluation of models based on these metrics through empirical studies, will serve to provide normalizing parameters for future studies of the benefits of program visualization. More importantly, this work will serve as the basis for design guidelines for the effective use of PV and other forms of process visualization.<br\/><br\/>Broader Impacts: This project will advance the state of knowledge in human-computer interaction and perceptual psychology; will provide design guidelines applicable to program visualization and process visualization in particular, with potential benefit to all viewers of such displays (students, scientists, and the general public); will engage both undergraduate and graduate students in research in both computer science and perceptual psychology; will include participants from under-represented groups (the PIs students include African Americans, Asians, and women); and will result in publications that will appear in journals and conference proceedings, and in software and evaluation metrics that will be disseminated through the web.","title":"Collaborative Research: Program Visualization: Using Perceptual and Cognitive Concepts to Quantify Quality, Support Instruction, and Improve Interactions","awardID":"0308063","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[214934],"PO":["565227"]},"82445":{"abstract":"Many programmers, instructors, and programming students have a strong intuitive belief that visualization is valuable for communicating information about the state and behavior of programs. In particular, in the area of algorithms and data structures, traditionally regarded as a core area of computer science that students find difficult, the advent of algorithm animation created great expectations in the CS teaching community, as animation was seen as a better way to portray the dynamic workings of algorithms than was the use of purely static media. However, an apparent disconnect exists between the prevalence of a belief in the usefulness of visualization and the extent to which visualization is actually employed. In this project, the PIs will investigate the hypothesis that present PV systems have failed to live up to expectations because they have largely ignored the issue of appropriate perceptual properties for effective viewing, and that in order to be effective PV systems must support perceptually appropriate animation, graphical design and layout, as well as good pedagogical design. In order to address this problem, the PIs will identify and evaluate perceptual, attentional, and cognitive aspects of program visualization and will quantify and categorize these results. They will perform observational studies of how instructors teach in order to identify the tasks that instructors perform in preparing and presenting visualization-based lesson, and will develop improved presentation and interaction techniques for program visualization and more generally for process visualization. The PIs expect that critical evaluation of the effects of relevant attributes of PVs, the development of metrics for quality of PVs, and the tuning and evaluation of models based on these metrics through empirical studies, will serve to provide normalizing parameters for future studies of the benefits of program visualization. More importantly, this work will serve as the basis for design guidelines for the effective use of PV and other forms of process visualization.<br\/><br\/>Broader Impacts: This project will advance the state of knowledge in human-computer interaction and perceptual psychology; will provide design guidelines applicable to program visualization and process visualization in particular, with potential benefit to all viewers of such displays (students, scientists, and the general public); will engage both undergraduate and graduate students in research in both computer science and perceptual psychology; will include participants from under-represented groups (the PIs students include African Americans, Asians, and women); and will result in publications that will appear in journals and conference proceedings, and in software and evaluation metrics that will be disseminated through the web.","title":"Collaborative Research: Program Visualization: Using Perceptual and Cognitive Concepts to Quantify Quality, Support Instruction, and Improve Interactions","awardID":"0308117","effectiveDate":"2003-06-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["565220"],"PO":["565227"]},"81389":{"abstract":"How do the concepts and applications of identity change as citizens move into the digital networked realm? In this project, identity is defined as a collection of transactions, associations, and achievements that are connected to a single person in the physical world, and correlated with a digital identifier in the networked world. This question must be framed by current implementations of digital government for the answer to be relevant to democracy and governance as practiced in the Internet age. Answering this question requires forging a common vision of identity from the organizational and technical knowledge of public sector decision-makers, academic experts, and private sector practitioners. Progress toward a trustworthy definition and implementation of digital identity is a key hurdle which must be gotten over in order for government to move to the next phase of service delivery.<br\/><br\/>This workshop will include participants from multiple disciplines and sectors in order to answer the identity question posed above. The goal of this civic scenario process is a coherent, technically sound, compelling view of the use of identity in digital government and an associated research agenda. Such a view necessarily encompasses the intrinsically related topics of risk, privacy, and authentication in digital government. This vision will offer decision-makers a framing for technical choices in the development of e-government.","title":"Digital Government: Identity: The Civic Scenario","awardID":"0303792","effectiveDate":"2003-06-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["537066"],"PO":["371077"]},"81972":{"abstract":"As the amount of test data required to test new generations of complex system-on-chip (SOC) designs continues to grow rapidly, conventional external testing approaches where all test data is stored on the tester and transferred to\/from the chip is becoming increasingly difficult. Testers have limited speed, memory, and I\/O channels. The limited test data bandwidth between the tester and the chip is becoming a major bottleneck that is projected to become much worse. This project involves developing hybrid schemes that combine external testing and self-testing approaches in novel ways to ease the burden on the external tester. Such techniques can provide the best of both worlds. The overhead and fault coverage limitations of self-test approaches can be overcome by intelligently making use of deterministic data from the tester to guide the self-test hardware, while the test data bandwidth and storage requirements for the external tester can be reduced by orders of magnitude. Some of the questions to be answered in this research include: <br\/><br\/>1. What are the most efficient ways to use deterministic data from the tester to guide test pattern generation hardware on the chip.<br\/>2. How to minimize the hardware under a constraint on test data bandwidth<br\/>from the tester.<br\/>3. For a system-on-chip (SOC) with multiple cores, what is the best way to<br\/>configure the hybrid test hardware for each core.<br\/>4. How can deterministic data from the tester be used to reduce power<br\/>dissipation during self-test.<br\/>5. How can delay fault coverage be improved with a hybrid scheme.","title":"Hybrid External\/Built-In Self-Test Techniques","awardID":"0306238","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["517957"],"PO":["562984"]},"82457":{"abstract":"In today's society, people constantly face the challenge of acquiring new skills and knowledge. Such learning tasks are easier for those who are able to use available sources of help judiciously and who can accurately assess their own knowledge. The proposed research will test the hypothesis that computer-based interactive learning environments can help people become better at metacognitive skills such as help seeking and self-assessment. Building on successful work in Cognitive Tutors, the project will involve the creation and evaluation of a computer tutor that guides students at the metacognitive level, as they solve problems. The <br\/>tutor will be equipped with a detailed model of help-seeking skills. A series of controlled experiments will be conducted to evaluate the added value of metacognitive tutoring. The proposed research addresses open questions in the fields of intelligent tutoring systems, cognitive science, and educational psychology. The proposed research will make it clear whether intelligent tutoring systems are suitable vehicles for helping <br\/>students acquire metacognitive skills. It will produce models of help seeking that are more detailed than those described in the literature and, if successful, will demonstrate instructional methods that improve students' skill in seeking help and self-assessment and thereby their ability to learn.","title":"Improving Life-Long Learning Skills with Interactive Learning Environments","awardID":"0308200","effectiveDate":"2003-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["533937","550769"],"PO":["564456"]},"82006":{"abstract":"Decreasing feature sizes and increasing package densities are making thermal issues extremely important in integrated circuit (IC) design. Uneven thermal maps and hot spots in ICs cause physical stress and performance degradation, and they also reduce reliability. This research project is focused on embedded cooling methods and an IC design flow for<br\/>thermal management.<br\/><br\/>The goal of the project is to develop new techniques for chip cooling based on droplet microfluidics, and to relate this technology to the integrated circuit (IC) design flow. It leverages a recent DARPA-funded research effort at Duke University that led to a novel<br\/>electrowetting-based droplet transport technology. It is based on high-speed electrowetting transport of discrete microliter- and nanoliter-sized droplets under voltage control. Cooling liquids can be transported, in user-defined patterns, under clocked-voltage control over a 2D-array of electrodes without the need for external pumps and valves.In addition, liquid flow is inherently increased with increasing temperature. Thus, local hot areas on a chip will have increased cooling applied locally without the need for external sensors.<br\/><br\/>The project is also focused on the design of the architecture for fluidic pathways, which will transport droplets for convective cooling. While the droplet paths are statically allocated during design time, the rate of droplet transport is dynamically determined during run-time. Simulation and profiling tools are being developed to determine the rate of droplet transport on different channels and at different times during field operation. Additional topics being investigated include protocols for droplet routing and optimization techniques for droplet layout. <br\/><br\/>This project will result in a self-contained, self-regulated, and low power (< a microwatt) chip cooling technique. The insights gained from this work are expected to pave the way for a new generation of embedded systems for computing and communications, as well as high-end, high-speed computation platforms. Power management and thermal problems are being widely seen as major roadblocks in the evolution of ICs; this project is expected to help overcome these roadblocks. This project also serves as an important bridge between two diverse research communities. It provides researchers from the microfluidics area with a major application driver for continued research into droplet-flow methods at the nanoliter and picoliter scales. On the other hand, it enables IC designers to leverage advances in droplet-flow technology for chip cooling.","title":"Investigations into Droplet-Based Microelectrofluidic Technology for Hot Spot Cooling and Thermal Management in Integrated Circuits","awardID":"0306349","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["506171"],"PO":["562984"]},"83953":{"abstract":"ABSTRACT: EIA 0314231, ACM, L. Israel, PI DRAFT<br\/><br\/>In September 2003 the standard high school computer science curriculum, including the AP exam, will shift from C++ to Java. This project, \"Bridging the Gap\", provides funds to support a pilot effort with workshops and distance learning activities for high school computer science teachers to assist and enhance their learning of Java. This is part of ACM's Jett Project-Java Engagement for Teacher Training and is specifically directed at the pilot efforts involving Tufts University and Columbia University. The project includes two one-day training workshops and incorporates a distance-learning course including video-taped lectures, on-line exercises, on-line help via email and a resource web site for teachers where they can interact with a community of other teachers and share course and learning materials.","title":"Special Projects: Bridging the Gap","awardID":"0314231","effectiveDate":"2003-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["426503",218905,"523503"],"PO":["289456"]},"82425":{"abstract":"This project addresses current limitations in automatic information extraction technology. Specific objectives are to:<br\/>1. use bootstrapping techniques to greatly increase the number of types of entities and relations that can be extracted and the rate at which one is able to create new extractors,<br\/>2. improve the performance of supervised training for entity and relation extractors by using bootstrapping to add additional training features and by applying new supervised learning techniques, including new perceptron and discriminative training techniques,<br\/>3. address meta-data issues of provenance, confidence, and temporal extent of facts, focussing particularly on the construction of a model of the expected lifetime of facts based on a longitudinal corpus of Web data.<br\/><br\/>The outcome of the project will be scientific understanding and technology for automatic information extraction from free text, making it possible to convert large document collections into formal databases suitable for automated processing. This will represent a significant enhancement in the utility and societal benefit of digital libraries and the World Wide Web. Project results will be disseminated in the form of publications and publicly available code for information extraction and learning of extractors.","title":"Collaborative Research: Semantic Entity and Relation Extraction from Web-Scale Text Document Collections","awardID":"0308024","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["466946","286532"],"PO":["565215"]},"82436":{"abstract":"Robotics and Human Augmentation Program<br\/><br\/>ABSTRACT<br\/><br\/><br\/>Proposal #: 308067<br\/>Title: Toward Dynamically Stable Mobile Robots in Human Environments<br\/>PI: Hollis, Ralph<br\/>Carnegie Mellon U.<br\/><br\/><br\/>The goal of the research is to gain deeper understanding of how dynamic agility can be achieved in mobile machines interacting with people and operating in normal home and workplace environments. The work develops and utilizes a novel dynamically stable rolling machine research platform. To illuminate many of the issues surrounding the operation of agile machines in human environments, in particular the ability to traverse narrow, cluttered rooms and to function robustly in the presence of people, we are investigating what could be one of the simplest possible dynamically-stable mobile robots: a machine whose body locomotes using only a single spherical wheel. This enables the machine to be tall and narrow, have a high center of mass, respond compliantly to nudges and shoves, and rapidly move in any direction. The machine will have a vestibular system based on an inertial measuring unit and other sensors with an on-board computer to provide closed-loop control of movement and balance. The efficacy of this new type of rolling locomotion will be evaluated in the context of human environments. Insights will be gained toward the development of agile motive platforms that in the future could be combined with the research community's ongoing work in perception, navigation, and cognition, to yield truly capable intelligent mobile robots for use in physical contact with people. Such robots, if realizable and economically viable, would function as aids to elderly or disabled persons; provide guidance and assistance in public spaces; help with education and entertainment; perform domestic cleaning and housekeeping; or fetch and carry everyday objects. Many other uses such as entry into hostile environments, rescue, and automated surveillance to safeguard people or property can be envisioned.","title":"Toward Dynamically Stable Mobile Robots in Human Environments","awardID":"0308067","effectiveDate":"2003-06-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["524687"],"PO":["335186"]},"83888":{"abstract":"EIA-0314012<br\/>James Foster<br\/>University of Idaho<br\/><br\/>Title: Conference Support for GECCO<br\/><br\/>Project Summary<br\/><br\/>This proposal requests funds to support and encourage student participation in the Genetic and<br\/>Evolutionary Computation Conference (GECCO), to be held 12-16 July 2003 in Chicago,<br\/>Illinois. Our overall objectives are:<br\/>1. Encourage and support student participation at GECCO 2003, targeting<br\/>underrepresented groups and including both undergraduates and graduates<br\/>2. Encourage undergraduates to pursue graduate research in genetic and evolutionary<br\/>computation<br\/>3. Encourage students to pursue academic or industrial careers that research or use genetic<br\/>and evolutionary computation<br\/>This funding opportunity will be advertised with all conference advertising. This will include<br\/>physical mailings, email broadcasts, listsere<br\/>Intellectual merit: this proposal will enhance development and dissemination of research in<br\/>evolutionary computation by helping students attend a major international meeting to present<br\/>their work, attend tutorials and other events, and establish collaborations. Our primary target for<br\/>student support is students from underrepresented groups that are presenting peer reviewed<br\/>work-specifically, those who are already making a scientific contribution. Evolutionary<br\/>computation is still considered an experimental and innovative approach, so this is responsive to<br\/>the mission of NSF\/EIA. It is also biologically inspired, and events at GECCO 2003, particularly<br\/>workshop, tutorials, and one of the technical tracks, will specifically emphasize applications to<br\/>bioinformatics problems, so this is responsive to the mission of NSF\/DBI as well.<br\/>Broader impact: this proposal funds student participation at a major international meeting, with<br\/>an emphasis on underrepresented groups and undergraduates. We will disburse the funds from<br\/>this grant to students in the form of registration fees, travel, and housing awards. All funds from<br\/>this grant will go to students. Students will be selected for awards by the general chair, the PI of<br\/>this proposal. I will give precedence to students who: are presenting a paper that will be<br\/>published in the conference proceedings; are self-identified as being from underrepresented<br\/>groups; are participating in workshops; are undergraduates","title":"Conference Support for GECCO","awardID":"0314012","effectiveDate":"2003-06-01","expirationDate":"2003-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}}],"PIcoPI":["560806"],"PO":["565136"]},"81842":{"abstract":"This research addresses design technologies for Systems on Chips and<br\/>proposes a paradigm shift in their design, by focusing on a communication-centric approach that accepts and tolerates electrical-level errors within on-chip communication. The challenges of providing a fast, reliable and energy-efficient communication means on chip are addressed by designing SoCs as micro-networks of components and exploiting network technology to satisfy quality of service requirements (e.g., reliability, performance and energy bounds) under the limitation of unreliable signal transmission and non-negligible communication delays on wires.<br\/><br\/>In particular, this research addresses the design of tools to support synthesis of control protocols for micro-networks, with particular emphasis on encoding (for error detection and correction), data packetization, switching and routing issues. The merits of the proposed research relate to demonstrating how networking techniques can solve on-chip communication problems, in view of the use of advanced fabrication technologies with <br\/>large spread of physical parameters, unpredictable physical layouts and on-chip information traffic.","title":"Design Technologies for On-chip Networks","awardID":"0305718","effectiveDate":"2003-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[213464,213465],"PO":["562984"]},"81963":{"abstract":"Abstract<br\/><br\/>In the not too distant future, semiconductor designs are expected to integrate billions of transistors on a single chip and will operate at frequencies in excess of 10GHz. This dramatic progress will introduce unforeseen challenges and will require dramatic changes of the tools and methods used to design highperformance processors. With high operating frequencies, accurate performance verification of the design will be come paramount. At the same time, noise in the design will rise to dramatic new levels due to the coupling between closely spaced devices on the same die. High noise levels will impact the performance by slowing down the critical delay paths in a circuit and will therefore threaten the achievable operating frequencies. We therefore propose new methods for the analysis of processor performance in the presence of high-noise levels. Furthermore, we intend to develop new methods for performance optimization in noise dominated circuit environments for future high-performance processor and systems-on-chip designs.","title":"Performance Analysis and Optimization for Nanometer Design","awardID":"0306206","effectiveDate":"2003-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["517835"],"PO":["562984"]},"81974":{"abstract":"Convex optimization is an important area of mathematical optimization. Recently a new and powerful theory of condition numbers for convex conic linear optimization problems has been developed. These numbers capture the intuitive notion of problem conditioning as a measure of problem sensitivity to perturbations in the input data. They are important in studying many of the behavioral characteristics of these problems. This research investigates the role that conditioning plays in problem behavior. Of particular interest is the performance of algorithms for solving the problem, and the ability to perform meaningful sensitivity analysis on the problem data. Two distinct but related avenues of this research are developing methods of preconditioning of optimization problems (i.e., finding an equivalent reformulation of the problem at hand which possesses better properties) with the eventual goal to explore and quantify various preprocessing methods in practical optimization algorithms, and extending the notion of problem conditioning to practical problems which often lie outside the conic linear form, leading to better understanding of problem behavior, ability to perform meaningful sensitivity analysis, and potential improvement in performance of algorithms. <br\/>The broad goal is to improve the modeling and solution capabilities of optimization, which is a fundamental tool of operations research. The specific focus is on exploring the methods to measure and improve the so-called \"conditioning\" of optimization problems, i.e., identifying the underlying properties of the problem at hand that dictate problem behavior, such as sensitivity of the solutions to perturbation in the problem data, the relative ease or difficulty of solving the problem via numerical algorithms, etc. Recognition of these properties motivates obtaining improved formulations and solution techniques of many optimization problems of great practical importance.","title":"Problem conditioning in convex optimization: theory and algorithms","awardID":"0306240","effectiveDate":"2003-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["555213"],"PO":["399214"]},"82019":{"abstract":"This research is on symbolic-numeric techniques for the solution of over-constrained polynomial systems with inexact coefficients. The objective is to develop and implement highly efficient and provably robust techniques that radically improve previous results. Topics are: (1) establish a mathematical framework for perturbation analysis (2) introduce novel iterative tools for symbolic methods (3) extend the applicability of existing numerical techniques. The tools being applied in the research include non-linear generalization of singular values, multivariate generalization of certified approximate GCD, non-standard applications of global Newton's method, local Weierstrass iteration, and the theory of general sub-resultants. Results being obtained include: (1) a meaningful and verifiable notion of \"near-solutions\" of over-constrained systems with inexact coefficients, (2) backward error and conditioning analysis, (3) simplification of the global behavior of existing numerical techniques, (4) utilization of the possible small cardinality of the near-solution set, and (5) improved complexity bounds for over-constrained systems both with inexact and exact coefficients. The ultimate goal of the research is an algorithm, which is polynomial in the input plus the output size. <br\/><br\/>In many physical and engineering applications one needs to solve over-constrained polynomial systems such that the existence of the solutions is guaranteed by some underlying physical reason. However, the coefficients of the input polynomials may be given only with limited accuracy due to measurement or rounding error. Such problems arise for example in geometric modeling, robotics, or machine vision. From the traditional numerical point of view these problems are considered ill-conditioned, and are avoided by numerical analysts. On the other hand, traditional symbolic methods would declare these input systems inconsistent, thus providing no information about the solutions of the underlying physical system. The proposed research is intended to radically improve efficiency of the solutions of over-constrained systems in a wide range of application areas. The educational objectives of this work include the design of a graduate level course on the above topic together with lecture notes and a list of research projects on both the graduate and undergraduate levels. The course and the projects are oriented towards applications and implementation in order to make the students attractive to both industry and academia. The investigator is working to create an environment that is supportive of underrepresented students to participating in high-level research.","title":"Approximate Solution of Degenerate Algebraic Systems","awardID":"0306406","effectiveDate":"2003-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["517853"],"PO":["321058"]},"81843":{"abstract":"X-ray computerized tomography (CT) and related imaging modalities (e.g., PET) are notorious for their excessive computational demands. While early CT algorithms such as filtered backprojection are now trivial in two-dimensions and scalable in three-dimensions, the more noise-resistant probabilistic methods such as regularized tomography are still prohibitive.<br\/><br\/>The basic idea of regularization is to compute a smooth image whose simulated projections (line integrals) approximate the observed (but noisy) X-ray projections. The computational expense in previous methods stems from explicitly applying a large sparse projection matrix (to compute line integrals of the image) and its transpose to enforce these smoothness and data approximation constraints during each of many iterations of the algorithm. <br\/><br\/>We propose to study a new formulation of regularized tomography in which the smoothness constraint is analytically transformed from the image to the projection domain, before any computations begin. As a result, iterations take place entirely in the projection domain, avoiding the repeated sparse matrix-vector products. A more surprising benefit is the decoupling of a large system of regularization equations into many small systems of simpler equations. The computation thus becomes ``embarassingly parallel'', so that latency tolerant and ideally scalable parallel computations are possible, as our preliminary results show in 2-d. We propose to apply this technique to modalities other than CT, to implement it in three-dimensions, and to embellish the probability models. Further, the network-friendly nature of this method will allow us to study the feasibility of harnessing the increasingly wasted desktop compute power in a typical hospital. We see decoupled regularization as an exciting development in tomography, benefiting society by providing images to doctors, patients, and scientists with fewer artifacts, at higher resolutions, and with greater interactivity.","title":"ALGORITHM: Scalable Algorithms for Regularized Tomography via Decoupling","awardID":"0305719","effectiveDate":"2003-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["457516"],"PO":["565272"]},"85837":{"abstract":"In this project we are investigating a scalable architecture for building hundreds and thousands of Shape Memory Alloy (SMA) actuators housed in a compact body. SMA filaments submerged in special fluids are arranged in matrix form, so that heat can be removed from and delivered to each of the SMA filaments rapidly and efficiently. With this matrix architecture, only 2N valves are needed for delivering fluids to each of N2 SMA array actuators. The architecture is therefore scalable for building a vast number of actuators: 20 valves for 100 array actuators, and 30 valves for 225 array actuators. In this exploratory project a test bed for testing 4 by 4 (16 axes) array actuators is being built in order to study the dynamics and control of the vast array SMA actuators as well as to investigate scalability of the design. The proposed method can be integrated with other energy sources, such as fuel cells, micro gas turbines, and internal combustion engines, for energy saving. These energy sources eventually produce heat as waste energy, which can be collected with fluids and used for activating the SMA actuators. This co-energy generation system has the potential to revolutionize the design of mobile robots, automobiles, and other mobile platforms. The vast number of SMA array actuators powered by a co-generation system would allow a mobile platform to perform highly complex, multifunctional tasks. Like biological creatures, robots will one day be able to run, leap, and fly, if the vast DOF actuator technology becomes available.","title":"SGER: Exploratory Research on Wet SMA Array Actuators","awardID":"0322601","effectiveDate":"2003-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["351676"],"PO":["234178"]},"82339":{"abstract":"Robotics and Human Augmentation Program<br\/><br\/>ABSTRACT<br\/><br\/><br\/>Proposal #0307651<br\/>Title: A GENERALIZED FRAMEWORK FOR THE CONTROL OF CHEMOFLUIDIC ACTUATORS<br\/>PI: Goldfarb, Michael<br\/>Vanderbilt University<br\/><br\/><br\/>The proposed work focuses on the formulation of a framework for the control of chemofluidic actuators for self-powered robots. The control of these actuators is markedly different from standard types of actuators and as such requires the development of unique approaches to their motion and force control. In order to make such chemofluidic actuators broadly available to the robotics community, a formalized theoretical framework for the low-level (i.e., position, force, impedance) control of such actuators will be developed. The proposed work includes system identification for establishing a first-principles lumped-parameter model of reaction dynamics, energetic transport delays, hydraulic flow dynamics, pneumatic flow dynamics, and the transduction of thermal energy through the constitutive behavior of a gas into the mechanical domain. Nonlinear observers will be developed to enable elimination or minimization of sensor requirements, which in turn will reduce the cost of implementation of such a system. Thirdly, nonlinear control design will be fused with nonlinear optimization methods to render the multi-input single-output system energetically efficient. The result of this work will be a chemofluidic actuator modeling and control framework that will enable others in the robotics community to safely and effectively incorporate similar actuators into self-powered robots.","title":"A Generalized Framework for the Control of Chemofluidic Actuators","awardID":"0307651","effectiveDate":"2003-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["277252","460493"],"PO":["335186"]},"83901":{"abstract":"Solid state chemistry is currently experiencing rapid growth in the development of new synthetic tools aimed at the creation of new materials. One such example is the synthesis of extended solid state materials by assembly from two or more molecular building blocks -- for example, inorganic clusters linked by organic polytopic ligands to form polyhedra, rods, layers and three-dimensional extended structures. This new area is being referred to as \"reticular synthesis\" where by a suitable choice of geometry the dimensionality and topology of the synthesized product can be predesigned to yield materials with predictable properties. This workshop will explore ways to advance the new area of reticular chemistry by stimulating the interplay of mathematics, chemistry, and materials science and engineering to explore the fundamentals of designing and preparing new materials with desireable properties. The goal of the Conference on Reticular Chemistry: Principles of Designing Extended Chemical Structures is to integrate and order the vast amount of geometrical knowledge and the availability mathematical tools with the experimental and theoretical expertise of organic, inorganic, biochemical, and materials researchers to identify key problems and progress in the following areas: enumerating mathematical structures such as minimal surfaces, knots and three-dimensional networks; describing classification schemes and inventing nomenclature; exploring relevant mathematical properties such as symmetry, complexity, and transitivity; to advance the a priori (top-down) design of functional materials with desired properties (magnetic, optical, catalytic, porosity); designing secondary building units (SBUs) for optimal 'bottom-up-synthesis' of new materials; describe challenges and opportunities for the assembly of biological structures and hybrid bio-organic and bio-inorganic structures; address educational challenges including the teaching of geometry to chemists and chemistry to mathematicians.","title":"Conference on Reticular Chemistry, Paris, France","awardID":"0314056","effectiveDate":"2003-06-01","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1762","name":"SOLID STATE & MATERIALS CHEMIS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1942","name":"UNIMOLECULAR PROCESSES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1966","name":"SYNTHETIC INORGANIC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["480055","503671"],"PO":["562893"]}}