{"141592":{"abstract":"This award is to the Computer Research Association (CRA) to coordinate a Principle Investigators' (PIs') meeting in November 2007 for the NSF FIND (Future Internet Network Design). The PIs' meeting is a chance to bring researchers together to learn about the work of other research projects and to provide a forum to discuss new ideas and future directions. CRA supports the important work of the FIND programs by acting as the facilitator and organizer of the FIND Workshop for FIND researchers to foster information sharing, community building and the generation of research directions for participants in the FIND programs. CRA is in a unique position to provide support to the FIND workshop because this organizational mission is to support research and advanced education in computing and in this capacity brings CRA staff into regular contact with many of the departments funded by FIND grants. <br\/><br\/>CRA facilitates the workshop by providing staff support. As the workshop organizer, CRA is responsible for a number of tasks both prior to and during the workshop such as registering participants, organizing the program, distributing handouts, and arranging and staffing the meeting site. The 2007 NSF Future Internet Network Design PI Meeting will be held November 27-28, 2007, at the Westin Hotel in Ballston. CRA will work with the FIND program staff to assemble the program elements. The purpose of the FIND meetings that bring together principal investigators and invited experts is to build a research community to meet the challenges of creating new internet architectures that meet the demands of the 21st century. This meeting focuses on preliminary ideas on how to begin to build architectures by beginning with ones that address the needs of particular classes of applications such as content based applications, real-time applications with high need for security, and networks under times of crises. In addition this meeting will bring together relevant researchers from industry and from other countries to discuss potential collaborations. <br\/><br\/>Intellectual Merit: <br\/><br\/>The presentations at the meeting will provide PIs with education on what other research efforts are being funded through NSF FIND, as well as interactions with other researchers and invited guests who do work related to FIND topics, and will revitalize efforts to generate new and exciting research endeavors. CRA has organized similar workshops for research community the last 7 years. <br\/><br\/>Broader Impacts: <br\/><br\/>With this information attendees have the opportunity to associate themselves with other researchers in their field and possibly form research collaborations.","title":"The 2007 FIND PIs Meeting","awardID":"0822518","effectiveDate":"2008-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["209556"],"PO":["565090"]},"134563":{"abstract":"Wireless networks now constitute a critical component of the national communications infrastructure, and information theory has served as the guiding light for the growth of wireless. However, the critical role that space, i.e., the physical locations of devices, plays in wireless networks has been largely downplayed in wireless research. Indeed, the wireless revolution would not have been possible without spatial reuse (i.e., reuse of spectrum at physically separated locations). If a link or system is studied while ignoring reuse, design conclusions can be vastly different than when reuse is considered. As wireless usage continues to grow, it is becoming increasingly important that a fundamental understanding of the limits and optimal design of networks be developed.<br\/><br\/>This research introduces a framework for modeling spatial interactions in wireless networks and develops methodologies for analyzing such networks. Spectrum sharing is perhaps the most basic wireless network: <br\/>transmit-receive pairs wish to communicate with each other but not with other pairs, but are forced into a shared environment because they must use common spectrum. A canonical model that explicitly models node locations, dubbed the spatial interference channel, is introduced. <br\/>Different communication techniques are analyzed and fundamental bounds on information flow are derived. Ad hoc networks are a more sophisticated type of network in which nodes potentially work together to aid communication. The role of space has been acknowledged in this setting, but many theoretical questions remain unanswered. Generalized scaling laws that capture the interplay between network size, throughput, power, and bandwidth are studied, and spatial models are used to quantify the benefit of techniques such as relaying, network coding, and power control.","title":"CAREER: Exploring the Design and Fundamental Limits of Wireless Spatial Networks","awardID":"0747332","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":[357689],"PO":["564924"]},"131054":{"abstract":"This project involves designing approximation algorithms for<br\/>fundamental problems arising in computer networks in which nodes need<br\/>to communicate with each other under some constraints.<br\/><br\/>Building a direct link between any two nodes has a cost associated<br\/>with it. This cost is different for different pairs of nodes. There<br\/>are several constraints, for example, a typical requirement would be<br\/>that every node would be able to reach every other node by a sequence<br\/>of links. Examples of some other constraints are making the network<br\/>robust in case of node failures, communication paths between nodes<br\/>being short on average, and buying enough bandwidth for links to<br\/>support the expected traffic (more bandwidth costs more but allows<br\/>larger quantity of data to be delivered on the link per time unit).<br\/><br\/>Given the link costs, and the network constraints, the goal is to<br\/>design a network satisfying the constraints, such that the network<br\/>cost is not too large.<br\/><br\/>The proposed problems have applications in VLSI, manufacturing, buying<br\/>large set of items at bulk and more. Theoretical insight into these<br\/>problems is likely to lead to better understanding of the problems.","title":"Approximating Bicriteria Network-Design Problems","awardID":"0728787","effectiveDate":"2008-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["518386"],"PO":["499399"]},"134585":{"abstract":"Participatory sensing is a revolutionary paradigm where<br\/>people sense their environment, and voluntarily share this<br\/>information using pre-existing communication infrastructure. It<br\/>has tremendous potential to advance knowledge in diverse fields<br\/>including urban planning and intelligent transportation by enabling<br\/>large-scale sensing without dedicated infrastructure. Achieving this<br\/>potential hinges on encouraging sensor data sharing between users<br\/>who may not trust each other. <br\/><br\/>The objectives of this project are to design and implement a trustworthy<br\/>participatory sensing system, encompassing algorithms for (i)<br\/>certifying the integrity of published sensory content, so users can<br\/>trust it, (ii) sensory content protection, so more users contribute<br\/>data, and (iii) anonymous content sharing between producers and<br\/>consumers. It explores a novel approach for trustworthy<br\/>participatory sensing with a trusted hardware platform for each<br\/>sensor, which besides the main processor, has a tamper-proof trusted<br\/>hardware element that only executes code signed by a trusted third<br\/>party. This recasts the integrity and privacy problems in a new way,<br\/>allowing for simple, scalable and versatile solutions. Such a system can<br\/>curb potential abuse, encourage user participation and thereby enable<br\/>participatory sensing.<br\/><br\/>Expected project results include a new system model and algorithms for<br\/>trustworthy participatory sensing, an implementation on the Intel AMT<br\/>platform, and system demonstration in a real-world intelligent<br\/>transportation application. The results will be disseminated via<br\/>open-source software, conference publications and exhibits at the Oregon<br\/>Museum of Science and Industry. The project also consists of<br\/>multi-level educational activities to promote under-represented groups<br\/>in computing.","title":"CAREER: Towards Trustworthy Participatory Sensing","awardID":"0747442","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[357733],"PO":["565303"]},"136312":{"abstract":"This funding renews a Research Experience for Undergraduates site focused on interdisciplinary research incorporating the science of design at Humboldt State University. Via an experiential-based learning approach, students expand their understanding of creativity and design in the course of building their own design toolkits. They then use their toolkits to pursue open-ended research in the areas of software systems, embedded systems and mobile robotics, geographical information systems, mathematics modeling, industrial technology, and graphical and studio art. The project includes mentorship by experienced computer science faculty members, oral presentations and seminars, ethics training, and other professional development opportunities. The site emphasizes recruitment of groups traditionally underrepresented in computer science and related fields through a well-established institutional infrastructure. This site is co-funded by the Department of Defense in partnership with the NSF REU program.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the team. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly women and students from underrepresented groups. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Role Model in Sciences (REU-RMS)","awardID":"0755582","effectiveDate":"2008-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"H433","name":"AIR FORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"J103","name":"AIRFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"T787","name":"AIR FORCE - ASSURE PROGRAM"}}],"PIcoPI":[362158,362159],"PO":["562669"]},"134520":{"abstract":"Today's networks are all based on the same fundamental principle: the network forwards data but the information itself is processed only at the end-nodes. The network coding paradigm breaks this assumption by enabling intermediate nodes to process and combine incoming packets into one or more outgoing packets. This idea has generated significant interest originally in the information theory and computer science communities and more recently in the networking community, when it was demonstrated that it can improve the performance of peer-to-peer and wireless mesh networks. However, network coding does not come for free: it adds complexity, increases processing and storage costs, and requires that we re-think the protocol stack. Currently, the full potential and limitations of network coding in the Internet are still poorly understood.<br\/><br\/>The goal of this research is to bridge this gap between the theory and practice. The project starts by identifying application areas that can benefit from network coding, including network security, multimedia delivery, and network inference. It designs novel network coding mechanisms to solve practical problems in each area and evaluates the cost-benefit tradeoffs. Building on this experience, the project then identifies common building blocks and studies deployment and architectural issues. <br\/><br\/>Intellectual Merit: the project designs innovative mechanisms based on network coding. It also studies the role of network coding in the future Internet architecture. <br\/> <br\/>Broader Impacts: The project integrates graduate student training, interactions with industry and foreign academic institutions, and course development. Results will be disseminated through research publications and communication with industry.","title":"CAREER: Network Coding Mechanisms for the Internet","awardID":"0747110","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["536897"],"PO":["565090"]},"134531":{"abstract":"This project focuses on an integrated research, educational, and outreach plan in the design of efficient management techniques in both centrally-administered enterprise wireless networks and un-administered wireless networks, typically at homes, by exploiting hitherto untapped mechanisms --- client participation. Network management involves a range of complex tasks that are often not visible to the user unless there are failures that affect them. Traditionally, network management has been solely performed through specialized entities deployed within the infrastructure. While such an approach is natural for most management tasks, this project demonstrates that unique characteristics of wireless networks, such as time-varying RF behavior, mobility and energy constraints at clients, make such an infrastructure-only management approach quite inadequate. Hence, the project posits that some form of client participation is crucial to efficient design of wireless network management. The core challenges include (i) making such management capability ubiquitous, (ii) ensuring that management overheads at clients are minimal, and (iii) insulating the user from such management processes, while improving the overall manageability of wireless networks. If successful, this project will help significant improve manageability of wireless networks, allow cost cutting of IT departments of enterprises, and eliminate significant .headaches. current home users have in fixing their network problems. The project is also making all software components publicly for use by a broad community of users.<br\/>Finally, the PI is developing new curriculum in mobile and wireless networking systems that trains the next generation of engineers and scientists with new tools of wireless network management.","title":"CAREER: Towards Client-assisted Management in Wireless Networks","awardID":"0747177","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560207"],"PO":["557315"]},"134212":{"abstract":"ABSTRACT<br\/>0745523<br\/>Thomas B. Horton<br\/>U of VA <br\/><br\/>A special one-day Academy for Software Engineering Educators & Trainers will be offered on the day prior to the start of the 2008 Conference on Software Engineering Education and Training (CSEE&T). The purpose of the Academy is to provide an opportunity for software engineering educators and trainers to learn from master instructors in a highly dynamic, hands-on, interactive environment. The Academy is especially designed as a unique learning opportunity for PhD students who will be entering academic careers in the near term, for new faculty members, and for mid-career faculty members who are beginning to teach software engineering course(s). Subsequent to the Academy, attendees will participate in CSEE&T'08 conference sessions, providing further educational opportunity and exposing them to the software engineering education community and to integrating research and education in their careers.","title":"Academy for Software Engineering Educators and Trainers","awardID":"0745523","effectiveDate":"2008-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["430657"],"PO":["564388"]},"133013":{"abstract":"The University of Puerto Rico at Mayaguez (UPRM) and the University of Houston Downtown (UHD) propose to establish a model for significantly increasing the number of undergraduate female, especially Hispanic, students that pursue a professorship career in computing. The objectives include increasing the number of female students that continue on to graduate studies towards a Ph.D. in computing, increasing the number of those students who become professors, and providing a model program that can be used by other institutions and disciplines. The project employs four strategies. Firstly, student recruitment identifies students with key characteristics to succeed in the program. Secondly, research mentoring helps the students develop research skills and experience that can motivate them to pursue graduate studies. Thirdly, career path mentoring guides the students in getting prepared for graduate studies and an academic career. Fourthly, empowerment activities help students overcome gender bias barriers that might prevent them from pursuing an academic career. This project will inform the BPC CAHSI Alliance.","title":"Collaborative Research: BPC-DP: Paving the Road to Professorship for Female Students","awardID":"0739249","effectiveDate":"2008-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["444649","429093",353763],"PO":["561855"]},"134498":{"abstract":"CAREER: Collaborative Optimization with Limited Information Disclosure<br\/><br\/>With the rapid increase in computing, storage and networking resources, data is not only collected and stored but also analyzed. This creates a serious privacy problem which often inhibits the use of this data. This project explores the problem of performing optimization analysis over distributed data without conflicting with privacy and security concerns. This is especially challenging due to the complexity and iterative nature of the solutions. An inherent aim is to also solve some of the fundamental problems underlying privacy-preserving analysis \/ secure computation and make it more accessible and applicable. Some of the innovative expected results include: (1) novel formulations of security definitions that are more relaxed than the traditional definitions yet still model the real security concerns; (2) new algorithms, computational complexity results, and tools for specific widely used optimization problems; (3) a more generalized view of privacy; (4) game theoretic interpretations and modeling of the multi-party computation; and (5) result analysis ? a quantification of privacy loss through results. The project will have tremendous broader impact via fundamental research and integrative education. Direct outcomes of the research can significantly help in widening co-operation between organizations and minimize loss through data isolation. This would result in cost savings and new income realization potentially worth billions of dollars through joint resource usage. Translation of the research to real use has the potential to revolutionize the mediator\/consolidator industry. The integrative education activities will foster actual use of the technology and open up its acceptance into the real world","title":"CAREER: Collaborative Optimization with Limited Information Disclosure","awardID":"0746943","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["498231"],"PO":["565327"]},"134510":{"abstract":"Storage systems are rapidly increasing in both complexity and size. There is a general consensus among both researchers and practitioners that self-management is a critical next step in their evolution. Self-managing storage systems will automatically adapt to changes in the operational environment and the application workload characteristics, to meet administrator-specified system goals. However, such systems are extremely hard to build and deploy correctly due to the complexities of the programming environment itself - the operating system, as well as the poorly understood behavioral, correctness, and interaction properties of self-management extensions. As a consequence, the pace of innovation of reliable, self-management extensions is far from adequate to meet current needs. The Active Block Layer Extensions (ABLE) project develops a library of core block layer primitives, a reasoning engine that analyzes individual and collective service behavior, and accompanying reasoning, testing, and configuration tools. The ABLE project also develops self-management solutions targeting power management, performance, scalability, and security, that serve as development examples and help refine the software infrastructure. The project will produce an OS infrastructure API and several self-management extensions as software artifacts. These will simplify and standardize block layer service development and deployment by reducing developer error, accelerating the development cycle, and providing reasoning and configuration tools to the administrator that aid robust deployment. The ABLE project will also provide cutting-edge research experience to students at Florida International University, a minority institution. All ABLE software will be open-source and made available through the project web-site.","title":"CAREER: Active Block Layer Extensions: A Foundation for Building Self-Managing Storage Systems","awardID":"0747038","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550842"],"PO":["565303"]},"134400":{"abstract":"The design complexity of current microprocessor systems is such that practically every system released to the market incorporates latent bugs. Manufacturers and design houses alike strive to validate and verify their designs as much as possible during system development, and then attempt to contain the impact of escaped bugs through publicly available errata reports. Some escaped bugs are innocuous, and can be easily overcome through a BIOS or OS update, but still others are potentially dangerous to the users of the system, or they might compromise its security and adversely affect its performance.<br\/><br\/>This project focuses on developing integrated hardware and software solutions to guarantee that a processor chip operates correctly, even if its design is flawed. The key idea driving this research is to create two modes of operation for the processor: a complex high-performance mode to be used when executing within the portion of the system that has been verified at design time, and a simple low-performance mode guaranteed to be correct under all execution scenarios. By carefully selecting the appropriate mode of operation at runtime, it is possible to always execute correctly: in high-performance when the operation is one that has been verified at design-time or in low performance otherwise. In addition, because of the extreme simplicity of the low-performance mode, it is possible to guarantee that this mode of operation always provides correct results but at a performance price. Related research has shown that, in practice, the low-performance mode intervenes only in very rare occasions, making its performance impact negligible overall. The research challenges to be undertaken in this project include devising low-cost mechanisms to select execution between fast and correct mode, developing the simple mode of operation in such a way that can be fully verified, and developing techniques to efficiently encode the correct states of operation.","title":"CAREER CPA-CSA: Correctness-Constrained Execution for Processor Designs","awardID":"0746425","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["517965"],"PO":["366560"]},"134521":{"abstract":"Despite significant advances in information theory and its application <br\/>to point-to-point communications, a general theory governing optimal <br\/>information flow over networks does not yet exist. Except for a few <br\/>simple network models, the capacity region of a general memoryless <br\/>network remains unknown, due to the complex tradeoff between <br\/>competition and cooperation among many nodes in the network. Modern <br\/>applications such as sensor networks, peer-to-peer systems, and <br\/>distributed storages further bring up a new set of challenging <br\/>problems spanning control, estimation, compression, computation,<br\/>communication, as well as networking.<br\/><br\/>This research program provides a common set of conceptual, <br\/>mathematical, and algorithmic tools for the emerging convergence of <br\/>computation, control, and communication over networks, with the <br\/>ultimate goal of developing a unified framework for characterizing <br\/>fundamental performance limits of such systems. Towards this goal, we <br\/>focus on three concrete problems representing the intersection of <br\/>computation, control, and communication -- 1) the capacity of the <br\/>relay channel (how to summarize the relay's noisy observation of the<br\/>codeword: a list intersection technique via coding for distributed <br\/>computing), 2) networked control (how to summarize the observation to <br\/>stabilize a linear dynamical system: a variant of rate distortion <br\/>coding for control), 3) collision avoidance for multiple access (how <br\/>to build cooperation from a common source of randomness: a distributed <br\/>generation of correlated random variables). Novel coding schemes will <br\/>be proposed, while classical coding techniques will be reinterpreted <br\/>and extended to broader applications. An algebraic framework for <br\/>capacity regions is also developed to check the optimality of such <br\/>coding schemes. The research program is complemented by educational <br\/>activities that include the curriculum development for a graduate <br\/>course on network information theory and the writing of an accompanied <br\/>textbook.","title":"CAREER: Network Information Theory: Coding for Communication, Control, and Computing","awardID":"0747111","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["551039"],"PO":["564924"]},"141198":{"abstract":"The proposal requests partial support for young researchers and students to participate in<br\/>2008 MobiSys Conference in Breckenridge, Colorado. The NSF support will provide<br\/>opportunities for up to twenty young participants to interact with established researchers.<br\/>The focus of the conference is on the design, implementation, usage, and evaluation of<br\/>mobile computing and wireless systems, applications, and services.<br\/><br\/>The broader impact of the proposal is fostering an environment of technical discussions<br\/>and debates among the communities of mobile computing and wireless systems. In<br\/>addition the conference is set out to encourage participation by young scientists and<br\/>researchers.","title":"A Proposal to Support Students and Young Scientists in 2008 ACM SIGMOBILE and the USENIX Association Mobile Systems, Applications, and Services Conference","awardID":"0820889","effectiveDate":"2008-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["543625"],"PO":["564777"]},"134477":{"abstract":"Wireless networks, by virtue of their untethered nature, ease of set-up, and mobility support, have been heartily welcomed into our daily work and lives. Crucial to the continuing success and even wider deployment of wireless networks is automatic management of these networks.<br\/> <br\/>The goal of this research is to investigate two fundamental questions of fault management in wireless networks: (1) What are suitable management architectures and what data\/measurements need to be collected for effective management? (2) What are suitable techniques for fault management? To be focused, this research mainly investigates two ?extreme? forms of wireless networks -- wireless LANs (WLANs) and sensor networks. More specifically, it proposes a novel management architecture and develops a series of fault management techniques for WLANs. It also develops a suite of diagnostic tools for static and mobile sensor networks, respectively. The techniques for the various management tasks utilize statistical analysis, optimization, stochastic modeling, and machine learning techniques, and will be evaluated using a combination of analysis, simulation and experiments. Although necessarily focused on a subspace in the large realm of wireless network management, by synthesizing lessons learned from this subspace, this project aims to provide insights into wireless network management in general.<br\/><br\/>The outcome of this project will greatly advance the state of the art in wireless network management, potentially impacting many aspects of our daily lives. The education plan includes developing one undergraduate lab course on WLANs, and one graduate-level course on wireless network measurement and inference.","title":"CAREER: Automating Wireless Network Management: Lessons from Managing Wireless LANs and Sensor Networks","awardID":"0746841","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["559204"],"PO":["565303"]},"146611":{"abstract":"The availability of low-cost devices with sensing and networking capabilities has opened up an exciting opportunity to observe the physical world like never before. Many envisioned applications of sensor networks involve monitoring of mobile objects, such as vehicles or animals. This project designs, analyzes and implements lightweight sensor-aided distributed directories, which can guide users to current locations of (mobile) objects, and answer individual or aggregate queries about them. Directories are designed using locality as a primary criterion: the effect of a perturbation in an object's position or in the network structure must be local, and should not cascade beyond a restricted region that is close to the perturbation. Directories are designed to simultaneously manage multiple mobile objects or groups of objects moving together. <br\/><br\/>The project investigates the construction of novel directory schemes based on various distributed computation techniques, including link reversal, path reversal, hierarchical methods, and sketching of distributed data streams. The resulting directories are scalable, energy-efficient, and resilient to network failures. The performances of the directories are evaluated through a combination of theoretical analysis, simulation, and implementation on a sensor network testbed that has been built at Iowa State University. It is expected that the research will enable sensor-aided object monitoring at a much larger scale than is now possible, and will benefit any application of sensor networks that involves tracking mobile objects. The research will involve students at various levels of the educational system. The results of this research will be widely disseminated through publications in journals and conferences, and will be posted online at CoRR.","title":"Collaborative Research: NeTS-NOSS: Distributed Algorithms for Sensor-Aided Directories to Mobile Objects","awardID":"0846081","effectiveDate":"2008-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["551019"],"PO":["557315"]},"134434":{"abstract":"The investigator seeks to discover novel ways of harnessing quantum phenomena to advance the computational capabilities of information processing devices. This fundamental research leads to new efficient quantum algorithms for problems that cannot be solved efficiently by any known classical algorithm. These quantum algorithms make it possible to solve more efficiently larger instances of computationally hard real-life problems, such as those arising in optimization theory, machine learning, and signal processing. A second component of the research focuses on developing new quantum algorithms for algebraic problems which helps to design more secure cryptographic protocols that are immune to quantum attacks. This is important as today's encryption schemes have to withstand attacks employing more advanced computational devices in the future. More fundamentally, this research provides a deeper understanding of the computational capabilities of information processing devices operating in the quantum regime. As the end of scalability of conventional silicon-based devices approaches, it is essential to explore such novel paradigms of information technologies.<br\/><br\/>The investigator finds new quantum algorithms for computing with large matrices. This research leads to new applications in machine learning, signal processing, and data analysis by achieving speed-ups for principal component analysis and kernel methods. These quantum algorithms also find applications in optimization theory and topology by providing better approximate solutions for NP-hard optimization and counting problems and more accurate evaluations of topological invariants, respectively. A second component of the research focuses on quantum algorithms for identifying group-theoretic and non-linear structures. The research goal is to extend them to a broad collection of structures arising in number theory and algebraic geometry, especially those that are relevant to cryptographic applications.","title":"CAREER: Algebraic Approach to the Design of Novel Quantum Algorithms","awardID":"0746600","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[357424],"PO":["565157"]},"134941":{"abstract":"This project supports a workshop to bring together:<br\/><br\/> a) computer scientists working on formal semantics methods,<br\/> e.g., ontologies, knowledge representation languages<br\/><br\/> b) accounting and accounting information systems faculty,<br\/><br\/> c) developers of standards for financial reporting systems,<br\/> such as XBRL, UN CEFACT, SDMX, ...<br\/><br\/> d) government statisticians working on the generation of<br\/> economic statistics<br\/><br\/> e) staff from government financial and securities<br\/> regulatory agencies<br\/><br\/>to consider research issues and the potential utility <br\/>and impact of formal semantics methods (e.g., ontologies,<br\/>knowledge representation languages, description logic, etc.)<br\/>for the specification of financial reporting systems <br\/>and standards for financial information (reporting)<br\/>systems.<br\/><br\/>Intellectual Merit<br\/>----------------------<br\/><br\/>Financial reporting systems consist of financial transaction systems<br\/>(e.g., general ledger), classification schemes (notably charts of<br\/>accounts), and aggregation mechanisms (e.g., summing all of the<br\/>transactions for particular accounts).<br\/><br\/>Historic practice in the specification of financial information<br\/>system standards is to specify the semantics via natural language<br\/>texts. The PI and others believe that this is<br\/>inadequate to assure reliable semantic interoperability among <br\/>the various accounting standards and systems.<br\/><br\/>This workshop is the first to bring together researchers from<br\/>the formal semantics \/ KR \/ ontology communities and the accounting<br\/>community. It is to explore the prospects for interaction of these<br\/>two communities and write a report with a research agenda for <br\/>work in this interdisciplinary area of formal semantic specification<br\/>of financial information systems and the implications for <br\/>interoperatibility of these financial reporting systems.<br\/><br\/>Broader impacts:<br\/><br\/>Financial information systems are an essential component in<br\/>the management of large organizations - business, government,<br\/>and nonprofits. They are an essential component of the <br\/>securities and banking industries, securities and banking regulatory <br\/>agencies and operation of taxation systems.<br\/>Financial reporting systems are also the basis from which <br\/>economic statistics, such as national income statistics and<br\/>trade statistics are generated. Improvements in the semantic<br\/>specification of these financial information systems will <br\/>facilitate the automation of the financial reporting chain,<br\/>and improve the reliability of interoperability and integration<br\/>of such financial reporting systems within businesses, and between<br\/>businesses and regulatory and taxation agencies.<br\/><br\/>Finally, the adoption of formal semantic specifications for <br\/>financial reporting systems will entail substantial changes in the<br\/>training of accounting information system professionals.<br\/><br\/>Project web page: http:\/\/www.msu.edu\/user\/mccarth4\/NSFontology\/","title":"Ontological Specification of Interoperability Semantics for Financial Information Systems","awardID":"0749219","effectiveDate":"2008-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[358519],"PO":["560586"]},"131146":{"abstract":"Many problems in application domains including engineering design, robotics, inverse kinematics, graphics, solid modeling, CAD-CAM design, geometric construction, molecular biology, drug-design, and control theory, can be modeled using parametric polynomial systems with many variables. Solving multivariate polynomial systems, especially symbolically, is however a major challenge. Whenever successful, symbolic methods have considerable advantage over numerical methods, since a symbolic solution has to be computed only once whereas numerical solutions must be computed every time parameter values change. Experimental and theoretical analyses indicate that the generalized Cayley-Dixon resultant formulation developed by Kapur, Saxena and Yang is very effective in practice for solving a large class of such parametric polynomial systems arising in practical applications. A particularly attractive feature of this formulation is its problem-adaptiveness: it implicitly exploits the sparse structure and non-genericity of a polynomial system.<br\/><br\/>Kapur and Chtcherba have identified a geometric object, the support hull, characterizing the terms appearing in a polynomial system (which is related to the associated convex hull) as a powerful concept. Time and space complexity as well as whether the resultant is computed exactly or not using the Cayley-Dixon resultant formulation, are governed by the support hull. Further, the problem-adaptiveness feature of the Cayley-Dixon resultant formulation appears also to be due to the support hull and the nature of the nonzero coefficients of the terms in the support hull. This project will use the support hull as the key technical concept for developing new methods for computing resultants and investigating symbolic-numeric methods. Techniques will be developed to extract resultants efficiently for mixed non-generic polynomial systems (where polynomials have different subsets of terms) since problems arising from applications are mixed. Geometric methods that approximate the support hull of a polynomial system by well behaved support hulls for which the resultant can be computed easily, will be developed. Incremental construction of dialytic resultant matrices guided by support hulls will be explored. These approaches are expected to generate resultant matrices of much smaller size, leading to significant gains in computational performance and solutions of problems beyond the reach of existing methods.","title":"Analyzing Polynomial Systems using Cayley-Dixon Resultant Matrices based on Support Hull","awardID":"0729097","effectiveDate":"2008-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["531861"],"PO":["565157"]},"134457":{"abstract":"Irregular computations occur in many important science and engineering application domains such as solving partial differential equations over irregular grids, molecular dynamics simulations, and computations over sparse matrices. To address this problem, inspector\/executor strategies have been developed where the inspector dynamically analyzes memory reference patterns and generates communication schedules and\/or reorganizes computation and data, and the executor executes the irregular computation in parallel. Although inspector\/executor strategies have been incorporated into many applications and libraries, these strategies are still hindered by two main problems: (1) Currently, no general framework exists for automating the process of incorporating inspector\/executor strategies into programs despite the complexity and difficulty that by-hand synthesis entails. (2) The performance of irregular applications significantly lags that of regular applications ? and this gap is widening for current and next-generation high-end multi-core systems.<br\/>This research involves developing a tool suite called PIES (Parallelization using Inspector\/Executor Strategies) for the automatic incorporation of inspector\/executor strategies into irregular applications. The PIES tool suite includes the Mapping Intermediate Representation (MapIR) for specifying irregular code and inspector\/executor strategies, a program analysis tool capable of determining the legal application of various inspector\/executor strategies, a code generator capable of automatically generating inspectors and executors, and performance models to guide the selection of inspector\/executor strategies and their parameters. This research includes an outreach program for local high school students based on applying the PIES tool suite to molecular dynamics simulations. Use of the PIES tool suite reduces software development time by automating the incorporation of inspector\/executor strategies into existing code and enables the development of new inspector\/executor strategies.","title":"CAREER: Parallelization using Inspector\/Executor Strategies (PIES)","awardID":"0746693","effectiveDate":"2008-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["499736"],"PO":["565272"]},"138868":{"abstract":"Need-Based Sponsorship Of Student Travel<br\/>to the<br\/>2008 Information Processing In Sensor Networks (IPSN) Conference<br\/><br\/><br\/>The Information Processing in Sensor Networks (IPSN) conference is an annual event co-sponsored by the IEEE Signal Processing Society and the ACM. IPSN convenes the leading researchers in the field of sensor networks. This includes the topics of novel network architectures, software systems, coding, data processing, data storage and management, information and communication theory, distributed algorithms and reasoning, programming models and languages, and other topics. Also, IPSN 2008 introduces a new format with two focus areas to be included in this single-track conference. This includes the information processing (IP) and the Sensor Platforms, Tools, and Design Methods (SPOTS) areas. IPSN has traditionally included the vanguard of research in this community including the highlights in the Networking Technology and Systems (NeTS) program. Another important feature for the 2008 conference is that this will be co-located with the new Cyber-Physical Systems Week conference series including the IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS) and the International Conference on Hybrid Systems: Computation and Control (HSCC'08). This NSF program is directed to sponsorship of student travel to IPSN. This will promote the broad impact of including students who will receive guidance and mentorship at IPSN and would not otherwise be able to attend. Students will be selected by an application processing that includes both student application and faculty recommendations.","title":"Need-Based Sponsorship of Student Travel for the IPSN 2008 Conference","awardID":"0808952","effectiveDate":"2008-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["539241"],"PO":["564777"]},"141212":{"abstract":"In this SGER, BBN is proposing to engage in preliminary work on two untested and novel ideas. The first idea focuses on the challenge of how to generate and support realistic traffic flow on experimental, network infrastructure. Other network infrastructure typically relies on artificial traffic generation methods or user communities that are composed of the experimenters themselves. But, in order to provide experimenters with real traffic at scale, novel approaches and mechanisms need to be developed. If such mechanisms can be developed and real traffic is carried on the infrastructure, many hard problems remain. For example, how many and what types of opt-in mechanisms are actually needed? Will the infrastructure have enough ?user pull? (e.g., applications, capabilities, etc.) to attract users? What kind of guarantees can be given to the users ? in terms of privacy, reliability, security, etc? These questions can not currently be answered as new interdisciplinary knowledge needs to be generated. This SGER will allow for the development of a series of white papers on this topic, including 1) strategies to encourage opt-in, 2) applications that could drive user opt-in, 3) legal, ethical, privacy and security implications of user opt-in, 4) prospective user communities and methods for accessing them, and 5) the potential benefits of user opt-in for the commercial sector. The authors of these papers will meet at the Engineering Conferences to discuss and share their findings and how they might be implemented in an experimental network infrastructure.<br\/><br\/>The second novel idea revolves around broadening research engagement and interest in network infrastructure. It is essential that the widest range of scientists and engineers with research interests beyond networking and distributed systems be allowed to carry out their own experiments on novel, network infrastructure. Other disciplines that might be interested include the social sciences, economics, business, law, medicine, and alternative energy, for example. Such a broad purview helps to ensure that new network infrastructure will widely influence research and education. But it is essential that their requirements for experimental workflow, data access and measurement, for example, be generated now so that they can influence infrastructure design. If those requirements are not known early, some areas of science may be locked out from use of the infrastructure. It is critical that experts be engaged now to generate those requirements. This SGER will help to generate infrastructure requirements for network researchers in the social sciences, law, economics, and other disciplines interested in network science and engineering, which will allow for new network infrastructure to have the broadest possible impacts.","title":"SGER: Exploratory Research on End-User Opt-In and Broadening Research Engagement","awardID":"0820944","effectiveDate":"2008-02-15","expirationDate":"2010-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7917","name":"NetS RESEARCH RESOURCES"}}],"PIcoPI":["521729"],"PO":["495796"]},"134601":{"abstract":"This project explores the power and limitations of quantum computers using new analytical techniques from algebraic geometry and the physics of semi-classical systems. Whether or not we decide to spend large amounts of resources on the construction of a scalable quantum computer will depend largely on the expected benefits of such a machine, but our current understanding of this issue is still very limited. The research of this project should give us a better picture of the usefulness of processing information in a quantum mechanical way by providing a dictionary between the properties of quantum circuits and some of the more intuitive ideas in geometry. The outreach component consists of the design and implementation of an authoritative, annotated bibliography of online sources of information on quantum computing, which will be made freely available to those outside of academia.<br\/><br\/>The evolution of a quantum computer is best described as a weighted sum of classical computations, where each weight is a complex valued probability amplitude. As a result, the overall probabilities of the quantum computation can be calculated using the corresponding exponential sums of amplitudes, which is a concept that has been studied extensively in algebraic geometry. In this project we translate the geometric and topological ideas behind these exponential sums to the properties of the corresponding quantum circuits. From a physical point of view, the phase of an amplitude is proportional to its `action', which, through the Least Action Principle, plays a crucial role in connecting quantum mechanics with classical mechanics. <br\/>We use this viewpoint to relate quantum computation to its sum of classical computational paths.","title":"CAREER: Algebraic and Semiclassical Methods for Quantum Computing","awardID":"0747526","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["548398"],"PO":["565251"]},"134513":{"abstract":"Distributed systems that allow any user to enroll his node as a participant<br\/>must resolve two main challenges to achieve reliability: selecting trustworthy<br\/>participants, and detecting and containing the damage of deviant nodes. This<br\/>research addresses these challenges by (a) presenting a new system<br\/>architecture, F2F, that incorporates decentralized trust relationships among<br\/>users in determining trustworthy nodes and (b) devising new techniques to<br\/>detect and contain faults of misbehaving nodes in the context of concrete<br\/>applications using this new architecture. <br\/><br\/>This research demonstrates the usefulness of F2F through the design and<br\/>implementation of two case-study systems: cooperative backup and censorship<br\/>circumvention. Friendstore provides inexpensive and reliable backup by storing<br\/>each user's data on a subset of trusted neighbors. Such an architecture allows<br\/>Friendstore to use less expensive technical means to detect and recover from<br\/>faults but makes it harder to fully utilize storage resources. This project <br\/>addresses this challenge using coding techniques that allow a node to<br\/>efficiently provide data redundancy for multiple neighbors simultaneously. The<br\/>second case study system, Kaleidoscope, helps users inside censored domains<br\/>access blocked websites by relaying traffic via a network of proxies.<br\/>Kaleidoscope uses a novel protocol to disseminate proxy identities over the F2F<br\/>trust graph so that each node can only collect limited information about<br\/>others' identities. A few malicious nodes, then, cannot discover a significant<br\/>fraction of proxies. <br\/><br\/>This project will produce systems that, if successfully deployed, provide<br\/>inexpensive online storage to home users and help circumvent censorship for<br\/>millions of affected users.","title":"CAREER: Decentralizing Trust in Open Distributed Systems","awardID":"0747052","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["518136"],"PO":["565264"]},"134656":{"abstract":"Abstract<br\/>ECCS-0747766<br\/>Dimitrios Peroulis, Purdue University<br\/> <br\/>The objective of this research is to provide new fundamental insights for liquid-based high-frequency circuits and antennas simultaneously optimized in the electrical, thermal and mechanical energy domains. The approach is to synthesize liquid microwave devices and circuits with the ability to exploit their liquid nature for adapting and cooling themselves.<br\/><br\/>Intellectual merit: Although researchers have already addressed many challenges associated with heterogeneously integrated three-dimensional circuits, thermal management remains one of the most difficult problems in such architectures. This research merges two powerful technologies, high-frequency electronics and microfluidics, to provide an attractive solution with substantial improvements in power efficiency and agility. In particular, the envisioned liquid radio frequency devices will offer considerably enhanced adaptivity because of the natural ability of a liquid to reconfigure its shape. Furthermore, they will utilize the same liquid materials (dielectrics and metals) for both tuning their performance and cooling themselves.<br\/><br\/>Broader impacts: The outcome of this effort is expected to be a critical enabling technology for the future generation of three-dimensional multifunctional circuits. This will constitute a convincing demonstration that electrical and thermal designs need and can be combined into one electro-thermal co-design process. New design rules are expected to evolve and become available into the next generation design software. This research is also integrated with an educational plan focused on attracting and retaining domestic minority students and in engaging undergraduate students to research activities early in their careers. This effort will be well-coordinated with appropriate established service-learning and project-oriented programs at Purdue University.","title":"CAREER: Liquid Radio Frequency Electronics","awardID":"0747766","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I435","name":"Defense Intelligence Agency"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":["531741"],"PO":["565185"]},"144336":{"abstract":"Dynamics of Internet-scale events such as worm propagation, distributed denial-of-service attacks, flash crowds, routing instabilities, and DNS attacks depend on the configuration of all the networks that generate or forward legitimate and malicious traffic. To fully understand these events researchers need simulation tools that reproduce all the relevant event details and event traffic?s interaction with the Internet architecture. Collaborative defenses against Internet-scale attacks have also been proposed. The effectiveness of these defenses depends on the underlying Internet topology and the deployment locations, so high-fidelity Internet simulation is necessary to properly evaluate these defenses.<br\/><br\/>Current network simulators cannot be used to study Internet-scale events. They are general-purpose, packet-level simulators that reproduce too many details of network communication, which limits scalability. Even distributed versions of network simulators such as GTNetS and PDNS, designed for large-scale events, have limited scalability because each packet and its handling are simulated in minute detail. For example, PDNS requires powerful, 100+ CPU clusters, to simulate worm propagation with up to 1.28 M vulnerable hosts. Many researchers do not have an access to such a large cluster. Another drawback of the current network simulators is that they lack a built-in Internet model. Researchers that aim to simulate Internet-scale events must themselves assemble the Internet topology, and determine end-host communication patterns, link bandwidths and routes. The effort required to set up a realistic Internet model from scratch is considerable so many researchers adopt simplfied models (e.g., assuming infinite bandwidth links, assuming highly symmetric Internet topology etc.) which leads to incorrect results. The iSim work builds upon our recent achievements in creating an Internet-scale simulator of worm propagation events, called PAWS. PAWS is a distributed simulator, deployed on the Emulab testbed. This project will explore the potential of the PAWS simulator as a community resource.","title":"CRI: CRD: iSim - Simulator of Internet-Scale Events","awardID":"0836531","effectiveDate":"2008-02-07","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["550312"],"PO":["434241"]},"134579":{"abstract":"Abstract:<br\/><br\/>Flash memories have become by far the most widely used type of electronic non-volatile memories. To fundamentally push the performance of flash memories toward their limit, a new coding theory for data storage is needed. The main challenges facing flash memories include low efficiency in writing, data reliability and limited memory longevity. This research studies novel information theoretic approaches to substantially increase the writing speed, power efficiency, reliability and longevity of flash memories. The new storage schemes can be used by numerous mobile devices, embedded systems and mass storage systems.<br\/><br\/>This research explores new coding theories for data storage in flash memories. A new family of codes called floating codes, which jointly encode data and minimize block erasure operations, are developed to improve the speed, power efficiency and longevity of flash memories. Error-correcting codes and interleaving schemes are designed to correct characteristic errors in flash memories.<br\/>The coding schemes are further extended to the usage of continuous cell levels for optimal performance. New storage schemes and algorithms are studied for data storage applications in flash disks, databases and sensor networks, three highly representative and important applications of flash memories respectively at the device, system and network level. In those applications, codes are designed to support page-based writing, data aggregation and in-network distributed storage.","title":"CAREER: Information Storage in Flash Memories: From Devices to Networks","awardID":"0747415","effectiveDate":"2008-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["518046"],"PO":["564924"]},"138935":{"abstract":"Crisis Management Organizations (CMOs) have been criticized for their less-than-ideal-performance through the major disasters of the past few years. In order for emergency responders to make right decisions under extreme time constraints and psychological pressure,it is necessary to begin to understand the information retrieval and exchange behaviors of emergency responders, and trace the information back to find out which CMO produces and consumes what types of information, how they interact, and what facilitates developing more readily acceptable information exchange systems for emergency responders.<br\/><br\/>This grant will begin the process of analyzing information retrieval and exchange behavior in various pseudo emergency response exercises. These are Dutch COPI(Commander Place Incident Team) exercises that will be conducted in the Port of Rotterdam. The US research will collect data from participants of the exercises, which will shed light on relationships between a) the value of information and the value of optimal decision timing, b) control over shared information systems and valuation of information quality, c) immediate public safety needs and security of sensitive information, and d) (dis)aggregation of information and (de)centralization of information processing under severe pressure. This grant will support the development of an international research partnership with Dutch researchers who have access to the inter?organizational disaster response exercises (i.e., COPI) in Dec. 2007, February 2008 and May 2008.<br\/><br\/>Intellectual Merit<br\/>This research will build a foundation (i.e., categorization and scaling schemes for information and relationships) for larger, potentially transformative research that can fundamentally change the way that CMOs share information. Future research will develop mechanisms and protocols for an adaptive Emergency Responder Information Exchange (ERIX) system. The envisaged system can ensure a satisfactory level of inter?organizational information sharing in extreme pressure conditions and help establish information exchange relationships among relevant CMOs, even if the CMOs have never shared their information before. The proposed research will provide initial parameters (e.g., taxonomy, metrics, attributes of emergency information and organizational relationships) and feasibility measures to the transformative research, Information systems for emergency responders can also be improved by incorporating findings from this project.<br\/><br\/>Broad Impact<br\/>The data to be collected under this grant will contribute to a better understanding of the flow of information and related decisions in the crisis management and response arena. Expansion of our knowledge and understanding of these topics clearly stand to benefit the broader society; this is only made more appealing by the international aspects of the research.","title":"SGER: Information Retrieval and Exchange under Extreme Pressure","awardID":"0809186","effectiveDate":"2008-02-01","expirationDate":"2009-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["563364",369415],"PO":["563751"]},"134415":{"abstract":"Modern enterprise networks run a variety of services and impose a variety of constraints on network communications, which require pain-staking configuration within the network. Today, there is no way to systematically quantify how complex a network's configuration is. This is important because the more complex the configuration is, the more error-prone and fragile the network becomes. In particular, extreme complexity makes it difficult to modify or upgrade the network in a consistent and accurate fashion.<br\/><br\/>Intellectual Merit: The goal of the Hydra project is to develop techniques for estimating the complexity of enterprise networks and for automating the process of making sophisticated changes to networks, while keeping the network configuration simple, accurate and in tune with the enterprise-wide policies. The primary component of this project is a suite of complexity metrics which describe various aspects of a network's configuration and functioning, such as the \"conservativeness\" of policies and dependencies in the configuration state, in a simple and abstract fashion. In turn, these metrics will be used to build centralized software tools for automating the tasks of configuring, upgrading and planning enterprise networks. Another key component of the Hydra project is an empirical study of the complexity of existing networks based on real configuration data and an analysis of changes in network complexity over time.<br\/><br\/>Broader Impact: The Hydra management framework will help minimize manual involvement in important network management tasks, and make network management and configuration more automated than it is today. Thus, Hydra can enhance the operational efficiency of enterprises and improve the availability of key services. The results from this project apply both to today's complex enterprises and to future clean-slate architectures. The results from this research will be incorporated into undergraduate and graduate curricula.","title":"CAREER: Managing the Complexity of Modern Enterprise Networks","awardID":"0746531","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["553786"],"PO":["565090"]},"133007":{"abstract":"The University of Puerto Rico at Mayaguez (UPRM) and the University of Houston Downtown (UHD) propose to establish a model for significantly increasing the number of undergraduate female, especially Hispanic, students that pursue a professorship career in computing. The objectives include increasing the number of female students that continue on to graduate studies towards a Ph.D. in computing, increasing the number of those students who become professors, and providing a model program that can be used by other institutions and disciplines. The project employs four strategies. Firstly, student recruitment identifies students with key characteristics to succeed in the program. Secondly, research mentoring helps the students develop research skills and experience that can motivate them to pursue graduate studies. Thirdly, career path mentoring guides the students in getting prepared for graduate studies and an academic career. Fourthly, empowerment activities help students overcome gender bias barriers that might prevent them from pursuing an academic career. This project will inform the BPC CAHSI Alliance.","title":"Collaborative Research: BPC-DP: Paving the Road to Professorship for Female Students","awardID":"0739213","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[353731,"427040","536592"],"PO":["561855"]},"133018":{"abstract":"Illinois State University (ISU) proposes a demonstration project to recruit a greater number of women, African-Americans, and Hispanics into an IT-related major. There are six such majors at ISU: Information Systems, Telecommunications Management, Computer Science, Industrial Computer Systems, Business Information Systems, and Accounting Information Systems. This range of majors allows students to express their varied interests and talents in the field. A collateral project goal is to generate positive student attitudes toward the diverse career opportunities in computing. The project targets first and second-year college students who may never investigate IT as an academic option. It aims to overcome one of the chief impediments to attracting these students to computing: they are not interested enough to take an initial course in the field. This obstacle will be overcome by targeting students who have proven mathematical ability but are not enrolled in a computing course: it will draw from a population of 1700-plus ISU students in a Finite Mathematics course taken by mostly first- and second-year students. There is a realistic possibility that these students could succeed in completing an IT-related major. The project will have a number of objectives, including highlighting the opportunities in, and diversity of computing careers, providing role models from on and off campus who will humanize the field, motivating students to explore careers in computing, using tech-enabled popular venues like blogs, creating an academic and social environment, and educating Math faculty about connections between the Finite Math course and computing fields. It will feature 1) learning communities seminars, 2) online learning communities, and 3) faculty learning communities, all aimed at fostering an academic and social environment that is supportive of female and minority participation in a computing major. A team of two external evaluators will focus on both the process and outcomes of the project.","title":"BPC-DP: Using Learning Communities to Recruit Women and Minorities in Computing","awardID":"0739267","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["558330","558331"],"PO":["561855"]},"139937":{"abstract":"This grant funds the Second Engineering Conference, the second conference in a projected series for designers and experimenters of a network science and engineering infrastructure. The conference will be held over two days with a \"newcomers\" session prior to the start of the conference. The conference will consist of a mix of plenary sessions with invited speakers and working group meetings. The particular goals of this second conference are:<br\/><br\/> 1. To build on the sense of community that developed at the First Engineering Conference held at the University of Minnesota in the fall of 2007;<br\/> 2. Prepare the Working Groups for a more aggressive pace of effort; and<br\/> 3. Reconcile future visions with concrete engineering challenges.<br\/><br\/>This conference and all subsequent conferences in this series are critical to the design of infrastructure for network science and engineering. If such an infrastructure is developed in the future, new kinds of network science and engineering research will be enabled. Experiments that cannot be carried out on today's testbeds promise to reveal new scientific insights and understanding of network behavior, performance, design, security, and economics, for example. In addition, new products will result as well as new opportunities for industry. These conferences provide a place where industry, researchers, students, international participants and agency program directors can discuss future visions and how to most effectively manage the risks inherent in such an endeavor. The funding from this grant will allow for increased diversity at the Second Conference -- both in attendees and speakers -- and to educate new attendees during a \"newcomers\" session.","title":"Support for the Second Engineering Conference","awardID":"0813589","effectiveDate":"2008-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7917","name":"NetS RESEARCH RESOURCES"}}],"PIcoPI":[371861],"PO":["495796"]},"133008":{"abstract":"The University of North Carolina, Charlotte proposes to extend the size, scope and impact of the existing BPC STARS Alliance. STARS is a cohesive system of regional partnerships that aims to broaden participation in computing. It collaboratively and systematically implements, disseminates, and institutionalizes effective practices for increasing the number of women, under-represented minorities, and persons with disabilities in the computing disciplines. This proposed Extension focuses on the recruitment, bridging, and retention of under-represented student populations, the advancement of junior faculty, and the sustainability and dissemination of the STARS Southeastern Constellation as a replicable network of regional partnerships, that can be implemented in other geographic regions. It includes new activities aimed at K-6. The Extension will grow the Alliance to include at least 20 academic institutions and 80 regional partners, and it will double student participation in the STARS Student Leadership Corps (SLC), including community colleges, as well as middle and high school students, teachers and guidance counselors. Finally, it will extend the existing program evaluation to explore STARS impact on the computing culture at member institutions.","title":"BPC-AE: The STARS Alliance: A Southeastern Partnership for Broadening Participation in Computing","awardID":"0739216","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["464128","561854"],"PO":["561855"]},"139707":{"abstract":"ABSTRACT<br\/>0812795<br\/>Vijay K. Vaishnavi<br\/>Ga State U Res Fdn<br\/><br\/>Student Participation in 3rd International Conference on Design Science Research in Information Systems & Technology and Associated Doctoral Consortium<br\/>This proposal seeks funding for supporting and encouraging research students interested in design science research and the science of design within the information systems, information technology, and computer science disciplines. Emphasis will be placed on supporting students from underrepresented groups. The consortium will take place as a component within the 3rd International Conference on Design Science Research in Information Systems and Technology (DESRIST 2008) being organized by Georgia State University, May 7 through 9, 2008 in Atlanta, GA.","title":"Student Participation in 3rd International Conference on Design Science Research in Information Systems & Technology and Associated Doctoral Consortium","awardID":"0812795","effectiveDate":"2008-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[371336,371337,371338],"PO":["564388"]},"132998":{"abstract":"The University of Michigan proposes a pilot project to increase the representation of American Indians in computing by engaging high school and community college students in a project to build virtual museums. The proposal takes advantage of the fact that tribal communities are increasingly gaining control over their artifacts, giving them the ability to determine which stories are told regarding their history and culture, and to determine how they are represented. Building a physical museum can be an expensive task, however, and digital museums could be a more affordable first step for many tribes. Unfortunately, American Indians are profoundly underrepresented in both the computing and broader cultural heritage fields, and most tribal members do not have the computing skills necessary to build and maintain a digital museum. This proposal seeks to address the lack of computing education in Indian Country by developing a program that is pedagogically effective with a curriculum that is culturally relevant. The project will demonstrate that American Indians can be engaged in computing through experience in developing software systems to meet local interests and needs. The goal of the project is to generate interest in Computer Science and Information academic tracks among American Indians while at the same time having students build IT- based cultural heritage systems that will garner respect and enthusiasm from their peers and local communities. As the University of Michigan offers free tuition to enrolled tribal members, this project offers a direct path for American Indians to matriculate into Computer Science and Information programs and after that, into the computation and information professions. This pilot will serve as a planning grant.","title":"BPC-DP: Learn by Doing: Encouraging Computation by Building Digital Tribal Museums","awardID":"0739183","effectiveDate":"2008-02-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["353697",353697,"452599","400168","400168"],"PO":["561855"]},"134516":{"abstract":"Shape analysis, in particular shape characterization and matching, is a fundamental problem appearing in a broad range of research fields. In particular, in molecular biology, it is generally believed that the functionalities of proteins are largely determined by their three dimensional structures. Hence understanding molecular functionality, a task essential to fundamental biological problems such as protein folding and drug design, depends on precise analysis of molecular structures. However, while much success has been achieved in molecular sequence analysis, success on the structural side is more limited, to a large degree due to a lack of accurate and efficient characterization and matching algorithms. To address these challenges, this project focuses on shape characterization and matching using geometric and topological methods, with driving applications coming from molecular shape analysis. <br\/><br\/><br\/>The geometric shapes investigated in this project include not only standard objects such as curves and surfaces, but also other complex shapes, such as the union-of-balls representation. The project studies a broad range of fundamental issues involved in their analysis, such as comparing multiple shapes, efficient searching in structural databases, matching with flexibility, and developing mathematically justified methods to describe features for both static and deformed shapes. It investigates the mathematical structure behind these problems, and develops practical algorithms that are also theoretically sound. The main tools involved in this research are computational geometry and computational topology, which form a natural platform for analyzing shapes. <br\/><br\/>Finally, by developing effective computational frameworks for manipulating and processing various geometric shapes, this project provides an important step towards large-scale molecular structural analysis, which is essential to understanding life at the molecular level. At the same time, this multi-disciplinary project helps to broaden the scope of theoretically sound computational methods for real-life problems, as well as to further bridge computer science, mathematics, and structural biology.","title":"CAREER: Geometric and Topological Methods in Shape Analysis, with Applications in Molecular Biology","awardID":"0747082","effectiveDate":"2008-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["550392"],"PO":["565157"]},"134538":{"abstract":"The edge of the internet continues to grow rapidly over the wireless medium. Sustaining this growth rate <br\/>is not trivial. The vagaries of the wireless channel, in conjunction with the distributed nature of large scale <br\/>networks, raises diverse challenges in capacity, scalability, reliability, and security. Every new opportunity <br\/>has to be maximally exploited to cope with the escalating end-user demands. Emerging antenna capabilities <br\/>offer one such opportunity. Crucial advances have been made in antenna systems, as well as in the wireless <br\/>protocol design community. Early evidence shows that significant end to end performance benefits can be <br\/>extracted by effectively integrating antenna-awareness into the network protocol stack. However, such inte- <br\/>gration is not trivial, and entails a rich set of research challenges. This project, named Spotlight, is oriented <br\/>to achieve this goal, through theory, protocols, and a prototype demonstration. Instead of attempting all- <br\/>encompassing solutions, the project categorically targets wireless mesh network architectures. <br\/><br\/>Spotlight takes an active step towards integrating independent innovations from diverse research disciplines. <br\/>Specifically, it brings the two communities of antenna systems and wireless networking closer to each other. <br\/>Research results is being disseminated through technical publications, seminars, and tutorials. Moreover, the <br\/>project is committed to tightly integrate research and educational plans. Techniques from Electrical Engi- <br\/>neering is being unified with algorithms from Computer Science, and presented in new courses for graduates <br\/>as well as undergraduates. Hands on experiences are integral components of these courses, enabling stu- <br\/>dents to appreciate the translation of theory to real life systems. <br\/><br\/><br\/>PI: Romit Roy Choudhury<br\/>ECE, Duke University","title":"CAREER: Exploiting Antenna Capabilities in Wireless Mesh Networks: Theory, Protocols, and Practice","awardID":"0747206","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["462630"],"PO":["557315"]},"134439":{"abstract":"Wireless sensor networks (sensornets) have the potential to enable an unprecedented amount of visibility and control over the world around us. There are major obstacles to realizing this potential, however: the methods and tools available for constructing sensornet software are too brittle, and require specialized training to use effectively. This CAREER project is investigating ways to overcome these obstacles. In particular, this project involves creating programming and middleware artifacts, specification and reasoning techniques, and toolsets that can be easily used by \"non-programmer\" specialists -- researchers outside of the field of computing.<br\/><br\/>The project has four major thrusts: (i) a system of programming that will enable non-programmer specialists to express applications in a form that is natural for them to develop sensornet applications on their own, (ii) a notation for specifying the functional behavior as well as performance and quality-of-service (QoS) profiles of software components that provide various services, (iii) a set of tools that will support application development, integrating the programming and specification systems, and (iv) integration of research findings into the graduate and undergraduate curricula, and outreach into the K-12 preparatory curricula.<br\/><br\/>The success of this project will be validated through collaborative efforts along with researchers in transportation engineering, automation systems, and environmental science. The results from this project will be disseminated via papers in conferences and journals, and all the software created will be distributed to the research community under open-source licenses.","title":"CAREER: Improving the Productivity of the Sensor Network Programmer","awardID":"0746632","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["558299"],"PO":["565303"]},"133758":{"abstract":"This project addresses the problem that, to be trustworthy yet practical, mechanisms for enforcing software security must (1) undergo rigorous analysis that provides formal security guarantees and (2) be developed quickly. The project addresses this problem by creating (1) formal, foundational theories of software security and (2) convenient tools for quickly generating provably sound enforcement mechanisms. The foundational theories consist of formal definitions and rules for precisely specifying and reasoning about general security principles: threats, policies, mechanisms, and the means by which mechanisms enforce policies to prevent attacks. These theories aim to enable researchers and developers to analyze real mechanisms precisely and to prove which attacks those mechanisms can and cannot prevent in practice. The enforcement tools consist of technologies for converting expressive specifications of policies to be enforced into concrete mechanisms guaranteed to enforce those policies. These tools aim to enable researchers and developers to quickly and conveniently define, concretize, and deploy new security mechanisms. The enforcement tools and foundational theories are connected in that the theories provide models in which to establish the trustworthiness of tool-generated mechanisms. Taken together, these research tasks for creating and connecting theories and tools enable rapid development and deployment of trustworthy enforcement mechanisms for secure software systems.","title":"CAREER: Foundational Theories and Enforcement Tools for Secure Software Systems","awardID":"0742736","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["382087"],"PO":["564388"]},"134506":{"abstract":"Computation and Collaboration in the Era of the Internet<br\/><br\/><br\/><br\/>The field of Cryptography has evolved far beyond its traditional goal of securing message transmission. Through the notion of a secure computation, a set of mutually distrustful agents can collaborate to accomplish a common goal while preserving each agent's privacy---examples include anonymous electronic elections, privacy-preserving electronic auctions or contract biddings, privacy-preserving datamining, fault-tolerant distributed computations and more. Protocols for secure computation have been extensively studied since the 80's, but key obstacles remain unresolved. <br\/><br\/><br\/><br\/>In particular, the design of cryptographic protocols must prevent rogue interactions between executions of multiple protocols. Cryptographic protocols that are secure when executed in isolation, can be completely insecure when multiple (even two) such instances are executed concurrently, as is unavoidable on the Internet. New ideas and techniques recently developed (some by this PI) suggest that the intellectual tools are at hand for overcoming this problem. One of the principal goals of the PI?s research is to develop secure computation protocols that remain secure under concurrent executions---without assuming any trusted set-up assumptions. Another goal is to develop new techniques for both preventing and analyzing rogue interactions between protocols.<br\/><br\/><br\/><br\/>Broader Significance: This research is expected to develop ideas and techniques which hold the potential to fundamentally change the way we collaborate towards common goals, and in particular to enable the development of protocols for securely collaborating on the Internet. In a connected world, rogue interactions between processes is a central problem; if successful this research will provide new tools and techniques for tackling this problem","title":"CAREER: Computation and Collaboration in the Era of the Internet","awardID":"0746990","effectiveDate":"2008-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["517989"],"PO":["565157"]},"134539":{"abstract":"While there have been many efficient point solutions to the in-network processing problems in wireless sensor networks (WSNs), there has been little effort to address the underlying root research problem of devising an in-network collaboration and coordination framework that can achieve standardization and integration of in-network processing protocols. The objective of this project is to design and implement such a framework.<br\/><br\/>This framework introduces a decentralized transactional model that enables a node to update the state of its singlehop neighborhood consistently and atomically. One of the key insights in this framework is to observe that singlehop wireless broadcast has many useful features for facilitating collaboration and coordination. By exploiting the atomicity and broadcast properties of singlehop wireless communication, the framework provides a simple\/clean abstraction and yet manages to retain the efficiency of execution.<br\/>Moreover, this project also investigates the practical uses of receiver-side collision detection in singlehop collaborative feedback collection in WSNs.<br\/><br\/>By addressing the communication and concurrent execution challenges under the hood of its simple abstractions, the framework will provide a platform for developing and deploying distributed control applications as well as WSN in-network processing protocols. As such, this framework will be useful for multi-robot cooperative control applications and WSN-robotics integration for distributed sensing.<br\/>More specifically, the framework will be demonstrated by developing a distributed multiple-pursuer\/multiple-evader tracking application in WSNs. The proposed career plan integrates research and education through interdisciplinary coursework development and dissemination of systems software.","title":"CAREER: An In-Network Collaboration and Coordination Framework for Wireless Sensor Actor Networks","awardID":"0747209","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["511692"],"PO":["565303"]},"140876":{"abstract":"Diary Note<br\/><br\/>Abstract<br\/>Proposal: 0819615, John Carter, Utah<br\/><br\/>Funding is provided for the 14th annual IEEE Symposium on High Performance Computer Architecture (HPCA-14). HPCA is one of the top conferences in the field of computer architecture, with an acceptance rate of under 20%. The conference addresses a broad spectrum of concerns, including micro-architecture, cache and memory system design, parallel architectures, embedded and reconfigurable architectures, I\/O systems, and performance evaluation. The conference includes four workshops and three tutorials.<br\/><br\/>Funding in the amount of $10,000 is being provided to support travel for 20-40 students to attend the conference. Priority is given to student authors who are presenting papers, then to non-presenting authors, and then to other students. Students must apply for the travel grant and write a post-conference summary of their experience. Grants will fund or partially fund travel to Salt Lake City and hotel costs during the conference.","title":"Student Travel Grants for 14th International Symposium on High Performance Computer Architecture (HPCA '08)","awardID":"0819615","effectiveDate":"2008-02-15","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["481348"],"PO":["532791"]},"134508":{"abstract":"Proposal Number: CCF-0747009<br\/><br\/>TITLE: CAREER: Configuration-Aware Testing Through Intelligent Sampling to Improve Software Dependability<br\/><br\/>PI: Myra B. Cohen<br\/><br\/>The advent of modern software systems and the rise of system configurability add a new dimension of complexity to the task of ensuring system quality. A single configurable software system encapsulates thousands or millions of unique program configurations or instantiations, and each configuration may behave differently under the same software test sequences acting as a unique program from the tester?s point of view. Testing techniques should not assume configuration heterogeneity, but should instead sample a representative set of program instantiations. This project focuses on the configuration-definition layer (CDL) of software to develop a set of scalable and adaptive configuration-aware testing techniques. It leverages research from combinatorial interaction testing for sampling, and work in satisfiability solving to handle complex dependencies. Specifically, it creates new algorithmic techniques to sample test configurations, creates models for cost-based sampling in time-constrained or risk-based environments, and explores several domain specific customizations. The impact of this work is that it explores a new avenue of research for software testers that focuses on the CDL, while providing theoretical results of interest to a broader community. It includes a tightly woven educational plan that involves both graduate and undergraduate students.","title":"CAREER: Configuration-Aware Testing Through Intelligent Sampling to Improve Software Dependability","awardID":"0747009","effectiveDate":"2008-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["511534"],"PO":["564388"]},"134519":{"abstract":"Future sensor networks will be more versatile in data recording. The sensors will not only collect information in numerical form, they will also collect and store textual data. The data will be accumulated in large quantities over a long period of time, and, many times, the data have to be stored in the network. This project aims to build an advanced sensor network data management system that extracts information from this widely distributed, massively accumulated, mixed and somehow unstructured data in an efficient and secure fashion. <br\/><br\/>The scope of this project goes beyond the prior research in sensor network data management by considering more sophisticated schemes of data storage, information retrieval, data mining, security and privacy support. It encompasses algorithm design, system design, real implementation and experiments to test the new ideas emerging in this future computing platform. Expected results include an information retrieval system for sensor networks, data mining algorithms for various problems (e.g., outlier detection), public key implementation and protocols for security and privacy support.<br\/><br\/>This project has a high impact in enriching the sensor network applications by supporting physical world search and more advanced queries for small devices. The research conducted in this project is expected to not only empower the future sensor networks, but also, in a more general sense, contribute to the research for the pervasively deployed small devices around people. Results from this project will be disseminated via conferences, journals, and the Internet.","title":"CAREER: Advanced Data Management for Sensor Networks","awardID":"0747108","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["551983"],"PO":["565303"]},"134509":{"abstract":"Securing Active Information<br\/><br\/>Abstract<br\/><br\/>When multiple parties attempt to collaborate, they often end up having to<br\/>compromise the confidentiality of their private information. Cryptographic<br\/>primitives like secure multiparty computation and obfuscation are aimed at<br\/>mitigating this situation. We view many such problems as part of a unifying<br\/>paradigm that we call Active Information: various parties in a system can have<br\/>access to prescribed actions of the information in the system, but nothing<br\/>more.<br\/><br\/>The first focus area of the project is secure multiparty computation, which<br\/>lets mutually distrusting parties emulate a commonly trusted party, by means<br\/>of a protocol. We identify and investigate crucial properties required for<br\/>this to be useful in practice: \"network-awareness\" addresses issues that arise<br\/>in a realistically complex environment, and a new class of \"context-awareness\"<br\/>features are vital in integrating secure multiparty computation into a larger<br\/>application. We also derive insight into the fundamental nature of various<br\/>multiparty computation tasks by classifying them into complexity classes.<br\/><br\/>Another focus of this project is on \"secure active objects\" that offer far<br\/>more flexibility in their use, compared to protocols. We study well-known (but<br\/>little understood) concepts like obfuscation, as well as new tools we develop<br\/>like \"remotely primed obfuscations,\" and \"active encryptions,\" and also<br\/>features like anonymity and unlinkability that are important for applications.<br\/>Secure active objects also serve as a platform to integrate the study of<br\/>hardware-based security solutions into the theory of cryptography.<br\/><br\/>The tools developed span a wide spectrum, ranging from low-level algebraic<br\/>techniques used in constructions, to high-level frameworks for conceptualizing<br\/>security definitions.<br\/><br\/>Towards bringing the subtle concepts from theoretical cryptography to a<br\/>broader audience of current and future practitioners, two online resources are<br\/>being developed: (1) a wiki-based tutorial\/reference website, and (2) a blog<br\/>aimed at students and a non-specialist audience.","title":"CAREER: Securing Active Information","awardID":"0747027","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["521634"],"PO":["543481"]},"136191":{"abstract":"This award, for a new Research Experience for Undergraduates (REU) site, <br\/>builds a Supercomputing Undergraduate Program in Maine (SuperMe). This <br\/>new site provides ten-week summer research experiences at the University <br\/>of Maine (UMaine) for ten undergraduates each year for three years. With <br\/>integrated expertise of ten faculty researchers from both computer <br\/>systems and domain applications, SuperMe allows each undergraduate to <br\/>conduct meaningful research, such as developing supercomputing techniques <br\/>and tools, and solving cutting-edge research problems through parallel <br\/>computing and scientific visualization. Besides being actively involved <br\/>in research groups, students attend weekly seminars given by faculty <br\/>mentors, formally report and present their research experiences and <br\/>results, conduct field trips, and interact with ITEST, RET and GK-12 <br\/>participants. <br\/><br\/>SuperMe provides scientific exploration ranging from engineering to <br\/>sciences with a coherent intellectual focus on supercomputing. It <br\/>consists of four computer systems projects that aim to improve <br\/>techniques in grid computing, parallel I\/O data accesses, <br\/>high-resolution scientific visualization and information security, <br\/>and five computer modeling projects that utilize world-class <br\/>supercomputing and visualization facilities housed at UMaine to <br\/>perform large, complex simulation experiments and data analysis in <br\/>different science domains. SuperMe provides a diversity of cutting-edge <br\/>research opportunities to students from under-represented groups or from <br\/>universities in rural areas with limited research opportunities. Through <br\/>interacting directly with the participant of existing programs at UMaine, <br\/>including ITEST, RET and GK-12, REU students disseminates their research <br\/>results and experiences to middle and high school students and teachers. <br\/><br\/>This site is co-funded by the Department of Defense in partnership <br\/>with the NSF REU Site program.","title":"REU Site: Supercomputing Undergraduate Program in Maine (SuperMe)","awardID":"0754951","effectiveDate":"2008-02-15","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"H433","name":"AIR FORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"J103","name":"AIRFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"T787","name":"AIR FORCE - ASSURE PROGRAM"}}],"PIcoPI":["481809","486060"],"PO":["523800"]},"136290":{"abstract":"IIS - 0755462<br\/>Title: REU Site: Integrated Machine Learning Systems<br\/><br\/>PIs: Andrew H. Fagg and Amy McGovern<br\/>Institutions: University of Oklahoma and University of New Mexico<br\/><br\/>URL: www-symbiotic.cs.ou.edu\/reu<br\/><br\/>This REU site focuses on integrating machine learning into real-world applications though interdisciplinary collaborations. Machine learning techniques enable computing devices to automatically discover how to extract salient information from complex data sets and how to optimally perform tasks. Applications include robot control, severe weather prediction, computer security, brain-machine interfaces, computational neuroscience, bioinformatics, law, and interactive art. Students will receive training in a variety of areas, including statistical machine learning, embedded system design, empirical methods, sensor processing, control, embedded interfaces, technical writing, oral presentation, ethics, and graduate school preparation. Each student will be paired with a faculty mentor who is an expert in machine learning and with a supporting mentor who is an expert in the real-world application area. Due to the advanced nature of this topic, students will be involved during both the summer and academic year (March - October) for up to two years. During the summer, students will spend a 12- week period working full time at either the University of Oklahoma or the University of New Mexico. During the academic year, students will participate from their home institution via video- and tele- conference. This latter time (about 5 hours per week) will be used to prepare for the coming summer and to complete experiments and writing projects.","title":"REU Site: Integrated Machine Learning Systems","awardID":"0755462","effectiveDate":"2008-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["513358","538251"],"PO":["562760"]},"136172":{"abstract":"Abstract:<br\/><br\/> The focus of the Berkeley CS REU site will be computer science projects that show clearly how the research solves important problems for our society. Information technology represents one of the most critical technological developments of our era. In this context, the CSIS REU site will bring students together in computational and systems biology, graphics and multimedia, cyber-security, reliable, adaptive and distributed systems, and information technology for developing nations.REU students will be required to understand and report on specific applications of their research for the betterment of humankind. For example, REU students working in the area of cyber- security will deal with the social, technical, commercial, and policy aspects of preserving privacy and defending critical infrastructure, which are key factors in realizing the full benefits of IT. A second example is the project in Intensive Care, developing an infrastructure and methodology to manage large amounts of clinical data for patients with life-threatening illness or injury. Student researchers will join the effort to establish a scalable warehouse for critical care data to facilitate multi-institution collaboration in the interest of healing. Another project opportunity involves human-centered designpractices:contextual inquiry into the needs of clients to understand the needs of a user community, with particular interest in assistive technology for the disabled. This site is co-funded by the Department of Defense in partnership with the NSF REU program.","title":"REU Site: Computer Science in the Interest of Society (CSIS)","awardID":"0754843","effectiveDate":"2008-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"H433","name":"AIR FORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"J103","name":"AIRFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"T787","name":"AIR FORCE - ASSURE PROGRAM"}}],"PIcoPI":["401938"],"PO":["564316"]},"134491":{"abstract":"Multi-core architecture with 4 to 8 cores on a die is a reality today and future generations of processors are expected to contain even more cores per chip. This project targets to realize the full potential of large-scale multi-core processors as a secure and trustworthy computing substrate. First, in \"many-core\" processors, the availability of a large number of processing elements together with constraints on power consumption alleviates the need for heavy time-sharing of resources, which often results in various types of side-channels. This change enables the use of more dedicated and statically allocated resources in this project to provide strong isolation and a simplified trusted software base. Second, many programmable processing elements in large-scale multi-cores can serve as a general substrate for various types of fine-grained inspection. This project is developing a flexible architecture framework for various run-time checks with minimal overheads in order to automatically detect, diagnose, and recover from malicious software attacks. Finally, the project extends the architectural framework to other aspects of trust beyond security, focusing on post-silicon verification, where the dynamic inspection can ensure various correctness properties. The research will deliver the benefits of hardware support in security and verification without requiring dedicated resources for a single fixed mechanism. Users can use each \"extended core\" for various security purposes, for verification and reliability purposes, or even for general computing. At the same time, the research will also enable highly secure execution environments where critical software components can be better protected.","title":"CAREER: Flexible Multi-Core Substrate for Trustworthy Computing Systems","awardID":"0746913","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["519715"],"PO":["565264"]},"134470":{"abstract":"This CAREER project is devoted to the fundamental research of highly efficient and reliable wireless networks through advanced multilayer methodologies. We focus on two problems: (i) Before a user enters the network, how to ensure efficient user-based access control? (ii) After a user is authorized to access the network, how to ensure efficient and reliable information transmission, especially, under malign environments? The intellectual merit of this research lies in the development of practical techniques for highly efficient and reliable wireless networks, and in the development of analytical and design tools that are broadly applicable to related engineering problems. For access control, our mutually interactive MAC-PHY framework identifies itself as a crosscutting research thrust in addressing the limitations in existing network and re-defining the reference framework for communications based on the network-centric paradigm. For information transmission, we break new ground in developing highly efficient, inherently reliable airlink interfaces. By exploiting cryptographic techniques and inherent ambiguity in signal detection over multiple access channels, our design of inherently secure and efficient wireless systems guarantees strong information confidentiality and integrity over wireless networks.<br\/><br\/>The broad impacts of this project are multi-fold. First, it lays a solid foundation for the development of an ideal human technology platform for e-commerce, national security, environmental protection, health monitoring, as well as many future applications that can benefit from fast and reliable information exchange. Second, by integrating the technological advances resulting from this project into the undergraduate\/graduate curricula, significant impacts are expected from this project on training a highly skilled and diverse workforce in the area of wireless communications and networking. Third, from this project, works supported by NSF provides important input to the standard committees in generating broad engineering and societal impacts.","title":"CAREER: On Highly Efficient and Reliable Wireless Networks","awardID":"0746811","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["523634"],"PO":["557315"]},"137264":{"abstract":"The 3rd International Conference on emerging Networking EXperiments and Technologies (CoNEXT) will be held December 10-13, 2007 at the Columbia University campus in New York. CoNEXT 2007 is sponsored by ACM SIGCOMM, which is ACM's Special Interest Group on Data Communications. This award will assist approximately 12 United States-based graduate students in attending this conference. Participation in conferences such as CoNEXT is an extremely important part of the graduate school experience, providing students an opportunity to interact with more senior researchers and to be exposed to leading edge research in the field. There is also a special student workshop that will be organized with CoNEXT that is especially oriented to: (i) further such opportunities, (ii) allow students to get targeted feedback on their work, (iii) inform them about good strategies for conducting effective research, and (iv) educate them about different career paths past their degrees. The support requested in this proposal will enable students to participate in this workshop and to attend the CoNEXT 2007 conference, who would be other-wise unable to do either. The travel grant chairs are committed to encouraging the participation of women and under-represented minorities.<br\/><br\/>Intellectual Merit: This project proposes to provide travel support for graduate students to attend CoNEXT 2007 and the associated workshops, which includes the student workshop and a workshop on future Internet design. This rich program will expose them to new ideas and allow for interaction with other researchers. In particular, the student workshop is geared to provide students an opportunity to present their current work, to receive explicit verbal as well as documented feedback on their work and their oral presentations, and to expose them to important issues such as how technical papers should be written to improve dissemination of results and how research problems should be judged for relevance and potential for impact.<br\/><br\/>Broader Impact: This project integrates research and education of students through exposure to a premier technical meeting in computer networks and communications. Students will have the opportunity to observe high-quality presentations and interact with senior researchers in the field both in the main conference and the associated workshops. The proposed student participation will have a positive impact on students' interest and the quality of their research. Women and other minorities will be encouraged to participate. Among the papers submitted to the conference, the US has the single largest number of authors (approximately one-third). However, the remaining authors of submitted papers span 28 other countries. This diversity is also in evidence from the composition of the technical program committee of the conference. This truly international flavor of CoNEXT 2007, therefore, presents a tremendous opportunity to students to increase their breadth of ideas, research approaches, and technical perspectives.","title":"Student Travel Support for CoNEXT 2007 Conference","awardID":"0801799","effectiveDate":"2008-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560207"],"PO":["565090"]},"139993":{"abstract":"This symposium is a premiere forum for research involving the interaction of computer architecture, compilers, and operating systems. It brings together leading researchers from these diverse communities to facilitate significant collaboration and cross-fertilization of research ideas to advance the state of the art in computing. The purpose of this outreach activity is to support travel for students and faculty who might otherwise not attend ASPLOS. The primary goal is to increase participation of underrepresented minorities (including women) and faculty members from non-Ph.D.-granting institutions by actively seeking out and giving priority to these persons when awarding travel grants.","title":"Support for the Thirteenth International Conference on Architectural Support for Programming Languages and Operating Systems, 2008","awardID":"0813759","effectiveDate":"2008-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["539055"],"PO":["550859"]},"134494":{"abstract":"Proposal #: 0746925<br\/>Title: CAREER: Non-Conventional Solutions for Ensuring Security in Cognitive Radio Networks<br\/><br\/>The PHY and MAC layers of cognitive radio networks are very different from those of conventional wireless networks. The distinguishing attributes of cognitive radio networks such as cooperative spectrum sensing, on-demand spectrum contention, incumbent- and self-coexistence mechanisms, and spectrum etiquette mechanisms raise new security implications that have not been studied previously. The overarching goal of this research is to contribute to the ongoing research and standardization efforts of cognitive radio technology by investigating crucial security issues that hold the key to the success and wide deployment of cognitive radio networks. We are currently focusing on problems that cannot be addressed using conventional security solutions. To solve these challenging problems, research is needed in areas that are considered \"non-conventional\" within the context of network security. These areas include RF signal identification, data smoothing, cyclic spectrum analysis, distributed detection and data fusion, etc. This research involves conducting high risk and high impact research in the aforementioned areas. We are investigating several security issues unique to cognitive radio networks, including incumbent node emulation and security vulnerabilities in network self-coexistence. The research findings from this research will serve a critical need in the cognitive radio research community by addressing security issues that have not been studied previously. We expect that our research findings will also benefit regulators and manufacturers involved in cognitive radio standardization and development.","title":"CAREER: Non-Conventional Solutions for Ensuring Security in Cognitive Radio Networks","awardID":"0746925","effectiveDate":"2008-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["548204"],"PO":["565239"]},"134583":{"abstract":"Proposal Number 0747431<br\/>TITLE CAREER: Multi-stage Programming for Object-Oriented Languages <br\/><br\/>PI Walid Taha, Rice University<br\/><br\/>Over the past decade, multi-stage programming (MSP) has emerged as a unifying approach that captures the disciplined essence program generation. Early work on MSP focused on purely functional languages. The goal of this proposal is to put what we know about MSP to work in the context of mainstream languages such as Java and C#. This will be achieved by means of carefully designed, minimal extensions that provide an expressive, statically checked mechanism for effectively eliminating the interpretive overhead.<br\/><br\/>The project will design an object-oriented language that provides statically checked support for the writing of program generators. The language, called The Java Program Mint (Mint) will support: <br\/><br\/> 1. Staging constructs that are statically checked before expansion\/generation,<br\/><br\/> 2. Indexed types, to enable further optimizations that are particularly synergistic with staging, and<br\/><br\/> 3. Disciplined, statically typed compile-time computation. <br\/><br\/>The design of Mint will be evaluated by establishing formal safety and expressivity results, and the implementation will be evaluated by building demonstration applications. The novel features of Mint will have the most impact on applications that use reflection and that constitute domain-specific language (DSL) extensions, such as serializers, JavaBeans customization facilities, and synchronization libraries.","title":"CAREER: Multi-stage Programming for Object-Oriented Languages","awardID":"0747431","effectiveDate":"2008-02-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["495365"],"PO":["564388"]},"133021":{"abstract":"The University of California, Irvine proposes an American Indian Summer Institute in Computer Science (AISICS) that aims to broaden participation in the computer sciences by actively engaging American Indian and Alaskan Native (AI\/AN) students in cross-disciplinary culturally relevant hands-on information and computer science educational and social activities. For each of three summers, AI\/AN high school students will work with computer science professors, graduate students, undergraduates, and high school teachers to develop interactive story projects. These projects will utilize technologies and concepts used in computer game development, will draw on the significant interest that many high school students feel for computer games, and will provide a means to present culture and history shared by American Indian storytellers in a modern context. About 100 AI\/AN high school students will experience a cross-disciplinary culturally relevant curriculum, and their work will become part of a repository that provides a resource for digital curricular content made available to K-12 educators. The students will also participate in an American Indian studies course, a communication skills course, and informational workshops about college and the college admissions process. UC Irvine has offered a previous model of AISICS for eleven summers since 1991. This new AISICS project will enhance the partnership among the University, Title VII American Indian high school education programs, and other American Indian organizations.","title":"BPC-DP: American Indian Summer Institute in Computer Science: LInking Native Culture to Computer Game Culture","awardID":"0739304","effectiveDate":"2008-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[353790,"422697","392002"],"PO":["561855"]},"138884":{"abstract":"IIS-0808994<br\/>PI: Jonathan Furner<br\/>University of California, Los Angeles<br\/>$34,880 - 12 mos<br\/><br\/>i-Conference Doctoral Research Colloquium<br\/><br\/>This is a 12-month standard award to support a Doctoral Colloquium program at the i-Schools i-Conference to be held on the campus of the University of California, Los Angeles (February 28 - March 1, 2008). This will bring together 30 dissertation-stage doctoral students in diverse information and informatics subfields for one day of talks and interaction with 9-10 faculty members selected from among distinguished information researchers. This project provides support for the travel, lodging and registration of students, plus the registration for the participating faculty mentors, as well as the direct expenses of putting on the Doctoral Colloquium at the meeting.<br\/><br\/>Intellectual Merit<br\/><br\/>The focus of the i-Conference Doctoral Colloquium is the students' doctoral dissertations. These represent state-of-the-art research in the field of information. The Doctoral Colloquium provides an opportunity both for these projects to be shaped through intellectual exchange and to communicate the character of the work to a key group of young professionals.<br\/><br\/>Broader Impact<br\/><br\/>The i-Conference Doctoral Colloquium brings together the best of the next generation of information researchers. This allows them to create a social network both among themselves and with several senior researchers, which plays a major role in their enculturation into the profession. Since the students and faculty are a very diverse group on several dimensions (nationality, scientific roots, methods), the students' horizons are broadened at a critical stage in their professional development.","title":"Workshop: i-Conference Doctoral Research Colloquium","awardID":"0808994","effectiveDate":"2008-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[369288],"PO":["564456"]},"134584":{"abstract":"This project attacks the high costs of architecting, implementation,<br\/>and verifying computer systems as well as developing system and<br\/>application software through the use of FPGA-Accelerate Simulation<br\/>Technologies (FAST) simulators. Rather than having to develop a<br\/>distinct set of simulation and evaluation tools for each task, FAST<br\/>simulators have been demonstrated to be both accurate enough and<br\/>sufficiently easy to write to be useful to architects and are both<br\/>full-system and fast enough to be useful to software developers.<br\/>Initial FAST prototypes were not, however, directly useful to computer<br\/>system implementation and verfication. In addition, there is no<br\/>mature methodology to verify FAST simulators themselves.<br\/><br\/>The specification of a FAST simulator, however, contains sufficient<br\/>information to specify a set of implementations, thus begging the<br\/>question of whether one or more implementations could be automatically<br\/>generated from such a specification. This project is developing a<br\/>tool chain to automatically transform a FAST simulator specification<br\/>into an implementation, thus coupling architecture, implementation and<br\/>software development, permitting all to be co-developed and making it<br\/>easy for each to influence the other two. An implementation can also<br\/>be verified using conventional methods, meaning such an automatic<br\/>transformation provides a conventional method to verify FAST<br\/>simulators.","title":"CAREER: Transforming Computer System Design","awardID":"0747438","effectiveDate":"2008-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["535119"],"PO":["535244"]}}