{"129888":{"abstract":"The annual IEEE International Conference on Robotics and Automation (ICRA), sponsored by the IEEE Robotics and Automation Society, has become the premier annual conference in robotics and automation worldwide, and has served as a forum gathering international researchers together for the exchange of ideas on technical problems and their solutions. This proposal requests group travel funds from the NSF to assist approximately 40 US graduate students and junior faculty, in the form of partial airfare reimbursement, to participate in the 2007 IEEE International Conference on Robotics and Automation, which will be held in Rome, Italy, April 10-14, 2007.<br\/><br\/>The purpose of this Group Travel Grant Proposal is two-fold:<br\/>. To assist U.S. participation in this key international conference, and<br\/>. To help U.S. researchers who could not otherwise attend the Conference.<br\/><br\/>A three member Selection Committee will be formed to select applicants according to a set of criteria such as applicant's technical area of interest, the expected impact of the conference participation on the applicant's professional development, the opportunities for planned visits, talks, interactions before, during, and\/or after the Conference by the applicant, and the additional funding that the applicant may have available for traveling.","title":"Travel Support for International Conference on Robotics and Automation (ICRA) 2007 Conference","awardID":"0723374","effectiveDate":"2007-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["449805"],"PO":["543539"]},"120374":{"abstract":"Adversarial Contention Resolution<br\/><br\/>Michael A. Bender, Stony Brook<br\/>Martin Farach-Colton, Rutgers<br\/><br\/>In computer systems in which jobs contend for a common resource, two jobs are said to collide when they request the resource at the same time.<br\/>Randomized backoff remains the method of choice for resolving such resource contention. The idea of backoff is that whenever a job collides, it retries after some random delay. Backoff is at the core of how the internet and many other complex systems work.<br\/><br\/>Given the prominent role played by randomized backoff, it is surprising that many aspects of backoff are not understood. To date, most analysis has focused on statistical arrival of jobs on relatively simple channels.<br\/>The assumption of statistical arrival rates dangerously neglects the worst-case, however, because bursty and other pathological inputs are a common case. Furthermore, many actual channels are not simple.<br\/><br\/>This research aims to develop a theory of the worst-case performance of backoff algorithms under various assumptions about the channel. The research will be guided by contention-resolution problems in shared-memory applications, such as transactional memory. Transactional-memory applications have multiple channels, support jobs sizes that differ by orders of magnitude, may provide rich feedback on collisions, and could allow one job to succeed when there are conflicts.<br\/><br\/>The research will provide a solid theoretical foundation and performance model for the many applications having multiple-access channels. Without these performance models, implementations are likely to exhibit unpredictable and buggy performance. For the target application of transactional programming in shared memory, a proper understanding of contention resolution is on the critical path for creating a viable system.","title":"Collaborative Research: Adversarial Contention Resolution","awardID":"0632838","effectiveDate":"2007-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["531670"],"PO":["432103"]},"123542":{"abstract":"Title: REU Sites: Interdisciplinary Graphics Research in Rhode Island<br\/><br\/>PI: Joan Peckham<br\/><br\/>Institution: University of Rhode Island<br\/><br\/>REU Site: Research Experiences in Computer Science for Students at Undergraduate Institutions<br\/><br\/><br\/><br\/>This REU will address undergraduate retention rates, especially among women and minorities, by providing an interdisciplinary research experience in computer graphics, visualization, with supporting database and conceptual design techniques. The primary focus is students from undergraduate art and computer science programs in Rhode Island. Students from other institutions nationwide will also be invited to participate. There will be a preference to students from schools where no formal research programs are in place. The applications will be interdisciplinary in nature and will be from a number of domains to take advantage of the existing skills and interests of the students. The research projects will present opportunities for the students to apply their skills in a technical arena. A special focus is graphical design, art and new media as the partnership of design and technology is vitally important in computer graphics applications. In this REU eight to ten students each year over the summer and the fall semester will conduct a self-contained research project that takes each student completely through the research process from proposal to implementation, and through data assessment and preparation for publication.<br\/><br\/> Students will work on compelling problems that link graphics research with activities that benefit society. The expected outcomes include higher computer science retention rates, greater numbers of students who are women and from minority groups who continue in computer science and related majors, higher recruitment rates to graduate programs, and the development and use of technology transfer skills among those students who continue to careers in industry. <br\/>Another outcome will be publications that the REU students co-author to advance knowledge and understanding in the area of graphics and graphical design. The intent is for the REU student participants to become leaders of a new generation of computer scientists, aligned with the intellectual rigor of their mentors, and able to flourish as productive members of an intellectually and culturally diverse society.<br\/><br\/>This project is jointly funded by the Division of Information and Intelligent Systems (IIS) and the Office of International Science and Engineering (OISE) at NSF.","title":"REU Sites: Interdisciplinary Graphics Research in Rhode Island","awardID":"0649059","effectiveDate":"2007-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["528329",327815,327816,"361119"],"PO":["562760"]},"122497":{"abstract":"As the capability of data acquisition has increased over the last few years, the challenges of computing with these large datasets has increased as well. In many scenarios investigating the entire data repeatedly to answer questions is becoming an infeasible strategy. The emerging trend in these contexts is to summarize the information content, perhaps with some loss, such that reasonably accurate answers can still be provided but the algorithm will only inspect the summarized representation. This approach has already gained currency in database query optimizers, network monitoring, and sensor networks. For the above two phase strategy to work the summarization should be geared towards the end use of the information. However, in many scenarios the two phases are being investigated separately and their development is not being guided by end use but by mathematical and algorithmic tractability. As a consequence the solutions obtained are far from optimal. The goal of this project is to investigate the finer mathematical structure of several of these problems and provide provably near optimal solutions.<br\/><br\/>Intellectually this project seeks to develop algorithmic understanding of several representation problems that arise from the interaction of approximation theory and information theory. The existing analytical treatment of these problems, typically, does not consider computational efficiency which is necessary to cope with the ever increasing problem sizes. The focus this research is to use techniques from combinatorial optimization as well as recent developments in sampling, embeddings, and approximate data structures to develop efficient approximation algorithms for these problems. These representation problems are ubiquitous in a broad range of areas such as signal processing, networks, databases. Efficient solutions to these problems will play a significant role in monitoring, reconnaissance and network forensics and is likely to impact practice.","title":"CAREER: Information, Optimization and Approximation","awardID":"0644119","effectiveDate":"2007-03-15","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["486185"],"PO":["565251"]},"125401":{"abstract":"This award supports participant expenses for a workshop on Cyber-Physical Systems, held October 16-17, 2006, in Austin, Texas. Participants were drawn from computer science, engineering, applied mathematics, physics, and biology. The aims of this meeting were to explore and document future joint research in computer science and engineering. The focus was on effort that is needed to advance the design and implementation of physical and engineered systems that are fundamentally integrated through cyber capability.","title":"National Workshop on Cyber-Physical Systems","awardID":"0703283","effectiveDate":"2007-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["461012"],"PO":["561889"]},"129999":{"abstract":"Although service-oriented environments and technologies are receiving a great deal of attention in both academic and corporate arenas, the ability to automate the discovery and composition of such services into higher-level capabilities remains elusive. This is funding to support the third international web service discovery and composition competition, the WS-Challenge, whose objective is to identify, evaluate and baseline approaches to solving that problem. Building on the success of the first two competitions, which were held in 2005 in Hong Kong and in 2006 in San Francisco (the latter with NSF funding), the PI will organize the planning and enactment of the 2007 competition to be held in conjunction with the IEEE International Conference on e-Technology, e-Commerce, and e-Services (EEE'07), which will take place in Tokyo in July. The first competition was limited to syntactical matching using the Web Services Description Language (WSDL); participants were required to identify and compose WSDL-specified services based on their input and output messages as specified in a directory of WSDL documents. In 2006, the competition focused additionally on the semantic linking of web services using XML-based semantic notations. The 2007 competition will further explore these topics. NSF funding will support participation in the competition of up to 7 teams from the United States, consisting of 2-3 students apiece. A small amount is earmarked for support of the competition by one part-time undergraduate student during the summer prior to the event, as well as to cover the cost of travel by the PI and his students to the competition.<br\/><br\/>The IEEE International Conferences on e-Technology, e-Commerce and e-Service bring together researchers and developers from diverse areas of computing. The conferences provide a venue for developers and practitioners to explore and address challenging research issues surrounding e-technology, in order to develop a common research agenda and vision for e-commerce and e-business. The focus is two-fold: to investigate enabling technologies to facilitate next generation e-transformation; and to disseminate application and deployment experience in e-themes such as e-business, e-learning, e-government, e-finance, etc. The EEE conferences are particularly timely and relevant because they focus on the application of electronic services as they cut across several \"e-domains\", whereas other conferences tend to either focus on a specific technology or on a single domain.<br\/><br\/>Broader Impacts: The workshop and resulting artifacts will serve as a centralized repository of algorithms, software, and techniques in a timely emerging area. The workshop will provide participants with an opportunity to gain exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. The workshop experience will integrate well with the goals of a software engineering education, as participants are evaluated on their design in addition to the performance of their approaches. To engage a broader audience in this year's event, the PI will expand his previously successful efforts to solicit teams from under-represented universities.","title":"WORKSHOP: Web Services Discovery and Composition Systems Challenge (WSC2007) July 2007 in Toyko, Japan","awardID":"0723990","effectiveDate":"2007-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["444191"],"PO":["565227"]},"127349":{"abstract":"Proposal 0712792<br\/>\"RI: Doctoral Consortium for International Conference on Cognitive Modeling, 2007\"<br\/>PI: John E. Laird<br\/>University of Michigan<br\/><br\/><br\/><br\/> ABSTRACT<br\/><br\/><br\/>This award partially subsidizes the participation of approximately 10 doctoral student's in a one-day consortium that will precede the International Conference on Cognitive Modeling (ICCM) to be held July 27-29, 2007 at the University of Michigan in Ann Arbor. ICCM is the premier conference for research on computational models and computation-based theories of human behavior. The Doctoral Consortium will bring together top graduate students in cognitive modeling, enable them to present their ongoing research, and to receive feedback and mentoring from senior leaders in the field. By contributing to the doctoral research and education of the participants and introducing them to the network of other scientists in the field of cognitive modeling, this award has significant Intellectual Merit and Broad Impact.","title":"RI: Doctoral Consortium for International Conference on Cognitive Modeling, 2007","awardID":"0712792","effectiveDate":"2007-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["402253"],"PO":["387198"]},"123785":{"abstract":"The IEEE International Symposium on Information Theory (ISIT) is held yearly at sites<br\/>alternating between the U.S. and abroad. The 2007 Symposium will be held at the Acropolis<br\/>Congress and Exhibition Center, Nice, France on June 24 to 29, 2007<br\/>This proposal requests support for the travel expenses of ISIT participants from the U.S. These<br\/>participants would be individuals whose papers have been selected for presentation at the<br\/>Symposium, but who lack funds and would not be able to attend without travel support. It is<br\/>proposed that the co-chairs of the symposium, Giuseppe Caire and Marc Fossorier make the<br\/>awards. The total amount requested is $15,000; this is based on 30 awards (averaging $500<br\/>apiece).","title":"Travel Support for the 2007 Institute of Electrical and Electronics Engineers (IEEE) International Symposium on Information Theory","awardID":"0650035","effectiveDate":"2007-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["508212",328464,"492224"],"PO":["432103"]},"123235":{"abstract":"Title: Research Experiences for Underrepresented Undergraduates in Smart Environments<br\/><br\/>PIs: Behrooz Shirazi and Diane Cook <br\/>Institution: Washington State University<br\/><br\/>The goal of this REU site program (REU-SE) is to broaden undergraduate research in underrepresented groups, particularly Hispanics from the Pacific Northwest region.<br\/>The Pacific Northwest has recently witnessed a rapid growth in its Hispanic population, reaching 37% of the population in South Central Washington State. State officials have decried the low enrollment of Hispanics in four-year colleges and say the situation is nearing crisis levels. The REU-SE program's aim is to attract the targeted Hispanic student groups to engineering careers and graduate education. The research theme of this REU program is smart environments. This is an exciting area of research that draws from a variety of engineering fields and finds application in home automation, health monitoring, and energy conservation. Because the students will be living in apartments that also serve as test sites, they will be fully immersed in the project and given abundant opportunity to interact with other faculty, graduate students, and REU students in the program. Our approach to broadening participation of undergraduate students in engineering research is based on the proposition that by engaging students in interesting applied research early in their baccalaureate studies, we will instill a strong sense of confidence, achievement, and belonging in the fields of CS\/CE\/EE in the targeted student groups. In addition to getting engaged in research, the REU participants will be trained in literature searching, technical reading and writing, and presentation skills. The participants will be closely mentored by the PIs, the faculty mentors, and the graduate student mentors. They will also be invited back to the program to serve as mentors for future REU participants. While the focus of the REU-SE program is on attracting and retaining underrepresented Hispanic students to the computing and electrical engineering fields, the model proposed here is broadly applicable to other student groups and other disciplines. In addition, the program will have a positive impact on increasing the number of students who will pursue their advanced degrees, beyond baccalaureate. Because of a strong planned recruitment effort and a strong mentoring component in REU-SE, we expect the \"word of mouth\" effect to spread the knowledge of the benefits of the program among the targeted populations, resulting in broadening participation in CS\/CE\/EE research programs for many years to come.","title":"REU Sites: Research Experiences for Underrepresented Undergraduates in Smart Environments","awardID":"0647705","effectiveDate":"2007-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["559679","547675"],"PO":["433760"]},"122433":{"abstract":"This research project addresses the issue of efficiently modeling large urban environments for applications in urban planning, training and simulation in urban contexts, the movie industry, computer games, architecture, and virtual heritage. Modeling large urban environments is a difficult challenge and it can take several man years to create detailed models. This research project investigates methodology to quickly create detailed models that respect high-level constraints and contain additional plausible details based on architectural knowledge and knowledge about urban design.<br\/><br\/>The research project addresses five aspects of this general research challenge. (1) The investigation of new procedural modeling techniques in general: the investigators study procedural modeling techniques for urban environments. In the context of constraints, it is not only important to have an expressive and powerful modeling system to specify urban models, but it is equally important to have knowledge representations that are simple enough to allow the incorporation of constraints. (2) The investigation of parametric modeling techniques constrained by three-dimensional scans: the investigators study how to fit complex parametric models to acquired three dimensional data. The procedural models are controlled by several parameters and can be very complex. Temples will be studied as example models. (3) Procedural modeling of buildings constrained by building footprints and LIDAR: the research examines knowledge representations for buildings and algorithms to procedurally generate buildings when they are constrained by geometric data, such as building footprints and LIDAR. (4) Procedural modeling of facades constrained by images: the investigators develop knowledge representations for faades and algorithms to procedurally generate faades when they are constrained by images. (5) The project contains an outreach and education component that includes the integration of the research into the Computer Science curriculum and provides access to the tools and libraries to the Computer Graphics communities and the general public.","title":"CAREER: Constrained Procedural Urban Modeling","awardID":"0643822","effectiveDate":"2007-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["455161"],"PO":["532791"]},"127911":{"abstract":"This endeavor is to provide need-based student travel grants to attend the Symposium on Information Processing in Sensor Networks, held April 25-27th, 2007, in Cambridge, Massachusetts. The symposium traditionally brings together researchers in the broad field of wireless and sensor networks including distributed signal processing, network protocols, architectural considerations, wireless communication, network middleware, network services and applications, platform design, and communication resource management. The symposium is well-aligned with the goals and thrusts of the NSF Networking Technology and Systems<br\/>(NeTS) Program. The purpose from the aforementioned travel grants is to encourage the attendance of those students who otherwise would not have the opportunity to visit the conference. The effort is directed at promoting student exposure to research and enhancing the integration of research and education, pursuant to NSF policy.","title":"NeTS-NoSS: Need-Based Sponsorship of Student Travel to IPSN","awardID":"0715012","effectiveDate":"2007-03-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["553633"],"PO":["434241"]},"122533":{"abstract":"The intent of this research is to better understand the processes of technology transfer and adoption for e-medicine in developing countries. The importance and impact of these medical-support-at-a-distance technologies are well documented; what is not well understood is how these are adapted to fit national policies, available infrastructure, regional practices, and local culture. This project will longitudinally track e-medicine initiatives in Sub-Saharan Africa, specifically in Ethiopia and Rwanda. The resulting technology transfer models should inform e-medicine efforts in general. <br\/><br\/>Telemedicine initiatives have revolutionized medical care for people who live in remote communities traditionally underserved by health services. By allowing medical staff to interact with patients via videoconferencing, collect samples, run tests, and exchange data remotely, they are able to provide a more timely, high-quality level of service than otherwise possible. There is now a growing collection of case studies, documenting the successes and failures of adapting these technologies to particular communities. However, there is limited understanding about the factors that affect these implementations. Through field work, this research will examine a variety of factors (e.g., national policies, available infrastructure, regional medical practices, local culture) that impact specific telemedicine efforts in Sub-Saharan Africa, specifically in Ethiopia and Rwanda. These are regions with grave medical needs where interest in and funding for telemedicine efforts is increasing rapidly. <br\/><br\/>This is a five-year longitudinal study to be supported by a CAREER award. This award is co-funded by NSF's Office of International Science and Engineering.","title":"CAREER: Information Technology Transfer to Developing Countries: An E-Medicine Model for Sub-Saharan Africa","awardID":"0644305","effectiveDate":"2007-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["460923"],"PO":["550147"]},"122423":{"abstract":"Most optimization problems arising in practice involve uncertainty: some parameters of interest may arise from a future process (such as market forces affecting the demand for a good), or from an imprecise measurement, or may be ``fudged'' on purpose in the interest of privacy. However, one can usually obtain some limited distributional information about such parameters, such as through past observations of the same process or by repeated measurements. How can this limited information be utilized to find solutions to the optimization problem that mostly work well? This question forms the crux of stochastic optimization. Recent theoretical work has introduced novel techniques for dealing with uncertainty, as well as exposed challenges unique to stochastic optimization. A primary focus of this research is to further this theory of approximability of stochastic optimization problems.<br\/><br\/>The PI will investigate optimization problems arising in scheduling, robot motion planning, network design, and resource allocation, with emphasis on the following issues: (1) How, and for what problems, can we transform algorithms that work well in the full-information setting to those that work well in the stochastic setting?; (2) How much information do we require about input distributions in order to obtain a good approximation?; (3) Optimal solutions to multi-stage stochastic problems can be complex exponential-size decision diagrams. For which problems can such complex solutions be approximated by much simpler ones?; (4) For which multi-stage stochastic problems is it inherently hard to obtain approximation factors independent of the number of stages? Another area of focus for this project is the design of approximately optimal algorithms for Bayesian mechanism design and pricing problems arising in contexts such as online retailing and sponsored search auctions. This research program will involve students at all levels, including undergraduate projects aimed at experimentally evaluating algorithms. In addition, the PI plans to revamp algorithms courses at the University of Wisconsin-Madison, adding new undergraduate course content related to practical applications of algorithms, and new graduate courses based on advanced applications of algorithms such as algorithmic game theory.","title":"CAREER: Approximation Algorithms for Optimization under Uncertainty","awardID":"0643763","effectiveDate":"2007-03-15","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["551023"],"PO":["565251"]},"127978":{"abstract":"ABSTRACT<br\/><br\/>This award supports participation of doctoral students from U.S. universities in the eleventh SIGART\/AAAI Doctoral Consortium to be held July 22 and 23, 2007 in Vancouver, B.C. in conjunction with the 22th National Conference on Artificial Intelligence (AAAI-07), July 22-26, 2007. The Doctoral Consortium aims to: (1) provide a setting for feedback on participants' current research and guidance on future research directions; (2) develop a supportive community of scholars and a spirit of collaborative research; (3) support a new generation of researchers; and (4) contribute to the conference through interaction with other researchers at the conference. The Doctoral Consortium strives to recruit and include students from underrepresented groups (e.g., women and underrepresented minorities) and smaller schools or schools with less established programs in artificial intelligence. Each student will give a 25-minute presentation to be followed by 20 minutes of discussion guided by a faculty participant; there were also be a one-on-one meeting with the faculty mentor. There will also be opportunities to discuss career issues in both academic and other career pathways. A report on the Consortium will be published in the AI Magazine.","title":"RI: SIGART\/AAAI Doctoral Consortium 2007","awardID":"0715239","effectiveDate":"2007-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["456810"],"PO":["387198"]},"127648":{"abstract":"This research aims to methodically explore and categorize the various instantiations of design-based studio models and to investigate the benefits of interdisciplinary design-centered studio-based education on students' ability to identify and solve real-world ubiquitous social computing problems. Ubiquitous computing technologies blend digital, physical, and social spaces into a single socio-computing learning space that will fundamentally improve students' creativity. This project develops and evaluates two prototypical interconnected, interdisciplinary and collaborative design studios that will foster creative problem seeking and problem solving. In these studios, students from multiple colleges and departments, such as computer science, information systems, architecture, engineering, and management, will form interdisciplinary teams and use collaborative cyber-infrastructure to explore and address key socio-technical challenges in USC. Creativity will be stimulated through an emphasis on a design-thinking approach, semester-long design projects and real-world problem solving in a more interactive environment where they can freely exchange ideas.<br\/><br\/>Broader impact is achieved by deploying cutting-edge educational infrastructure and technologies in ubiquitous social computing that advantage under-represented student groups, so that these students are positioned as solution-creators for problems they will be uniquely trained to perceive and confront. Research has shown that women are more effectively engaged in information technology through two of the core themes of this proposal, user-centered design and social computing, than other aspects of computing. In the long term, this educational model can attract creative young people toward science and technology.","title":"Fostering Creativity in Ubiquitous Social Computing through Casual and Formal Interactions in Interdisciplinary Design Studios","awardID":"0714158","effectiveDate":"2007-03-15","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":[338467,"538322","446868","383971",338471],"PO":["424970"]},"120774":{"abstract":"Mandayam, Narayan<br\/>Rutgers Univ New Brunswick<br\/><br\/>Cooperation and Conflict: Coalitional Games in Spectrum Sharing<br\/><br\/>Cooperative communication techniques hold the promise of promoting efficient spectrum sharing and a good deal of important research has studied approaches such as collaborative signal processing, cooperative coding, relaying and forwarding. What is perhaps less generally considered in research studies is that cooperation may involve significant costs, and that the greatest immediate benefits will not necessarily go to the users that bear the greatest immediate cost. For example, cooperation may require that a terminal delay its own transmissions and use its limited energy budget to relay messages for other terminals. Moreover, even if there were no added cost in terms of energy or delay, the rules by which the benefit is distributed may create yet another type of disincentive to cooperation. Thus, even in the absence of any transaction costs for cooperation, the aggregate benefits of user cooperation can only be realized through techniques that provide adequate incentives to each user, and for each transaction.<br\/>This project is using coalitional game theory as a framework to provide significant insight into the dynamics of cooperative communications as well as the incentives through which such cooperation might be achieved. Integrating models from game theory with communications and information theory, the cooperation mechanisms being studied are: (1) coalitions in receiver cooperation, (2) coalitions in transmitter cooperation, and (3) incentives and costs in coalition formation. This project is contributing to the knowledge and technology of coalition formation that can result in improved spectrum sharing in cognitive radio networks. An educational supplement to the theoretical research activities is using the ORBIT Testbed for evaluating simple practical coalition formation mechanisms.","title":"Cooperation and Conflict: Coalitional Games in Spectrum Sharing","awardID":"0634973","effectiveDate":"2007-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["475434"],"PO":["432103"]},"120676":{"abstract":"Rice University, in an alliance with Boston University; the University of California at Berkeley; Southern Illinois University at Carbondale; the University of Colorado at Boulder; the University of Texas at Austin, and additional partners, proposes the Empowering Leadership: Computing Scholars of Tomorrow Alliance (EL Alliance). It will develop a national network of colleagues who share the common experience of being a minority student or faculty at a majority institution, and others deeply committed to the success of these students and faculty. The EL Alliance has enlisted many of the leaders in computing research to this network, including faculty, directors of national laboratories, leaders in industry, junior faculty, grad students, undergraduates, and professionals. The network will provide multiple, integrated, reinforcing programs and experiences to ensure that the few minority scholars in the computing disciplines at top departments matriculate and go on to make their mark in graduate education, research, industry, or national policy. These programs will include the national support network, local and online communities, and annual meetings, using technology to reach, inspire, and support isolated minority students. Furthermore the Alliance will be aligned with well-recognized programs such as AGEP Alliances, NSDL, CI-TEAM, the TeraGrid, and other Broadening Participation in Computing awardees. The EL Alliance will directly impact many of the finest underrepresented minority students in the country, encouraging, preparing, and retaining them as they pursue degrees in computing. In turn these students, as they take their places in the leadership of the community, will be in a position to impact additional students.","title":"BPC-A- Empowering Leadership: Computing Scholars of Tomorrow","awardID":"0634516","effectiveDate":"2007-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["563532","483386","425870",320626,320627],"PO":["561855"]},"122557":{"abstract":"This proposal presents a research program for developing and evaluating dynamic policy models, adaptive composition approaches, and risk management strategies. The main<br\/>thrust of his proposal is the development of proof theoretic reasoning and analysis algorithms to enable system integrators and end users to leverage diverse and heterogeneous Web services through local policy specifications. A primary focus of the work is web services workflow-related issues. It has become increasingly difficult to build services-based systems that can effectively achieve distributed services composition and coordination in increasingly dynamic, uncertain and error-prone open system environments. The research will develop one model which can provide a means for specifying the interactive behavior of the underlying services to align their capabilities according to the requirements of their owners and consumers. The policy enforced Web services composition can be an important conduit for information and event sharing in smart environments. The project will enable students at ASU to experiment with various aspects of information and Web services management, thereby increasing students' awareness of learning, computation, and research issues. The Center for Cognitive Ubiquitous Computing (CUBIC) at ASU will work closely with the PI and his development partner, Microchip Technology Inc, to test and disseminate prototype technologies, such as smart and aware environments.","title":"CAREER: A Logic-Based Dynamic Policy Model for Adaptive Workflow Management","awardID":"0644459","effectiveDate":"2007-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["464839"],"PO":["469867"]},"122469":{"abstract":"CAREER: Scalable Combinatorial Scientific Computing<br\/>PI: Umit V. Catalyurek<br\/><br\/>Abstract:<br\/><br\/>Combinatorial algorithms are an important enabling technology for scientific computing, especially for large-scale problems and high performance computing. The overarching goals of this project are development of 1) a mathematical and computational infrastructure for solving graph and hypergraph-based combinatorial problems on extreme-scale architectures and 2) techniques and tools for analysis of complex and multivalent interaction networks.<br\/><br\/>In this project, effective novel combinatorial models, such as hypergraph, k-partite hypergraph and directed hypergraph models, are developed for modeling complex workflows (computation, communication and data dependencies, and data access patterns) of large-scale scientific applications and the complicated interactions of chemical and biological entities. New scalable algorithms, based on a multi-level framework, are designed for graph and hypergraph clustering and partitioning, and dynamic load balancing problems. Scalable graph coloring techniques and graph search-based analysis techniques for semantic graphs are developed on top of an extensible distributed memory graph\/hypergraph runtime middleware.<br\/><br\/>The technical impact of this work will be in designing efficient models and algorithms for the above mentioned computationally challenging problems. Hence, in many fields of science the work will allow the use of parallel computing where it was not possible before. The education and outreach activities of this project include a summer program for high school students from underrepresented groups, significant expansion of graduate courses, undergraduate student involvement in research projects, and graduate student education through multi-disciplinary projects. The implementations of the novel models and algorithms developed in the project will be distributed as open source to maximize the impact and dissemination of the research results.","title":"CAREER: Scalable Combinatorial Scientific Computing","awardID":"0643969","effectiveDate":"2007-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["530803"],"PO":["535244"]},"120842":{"abstract":"Scattered data points in space arise in many contexts: the interpretation and analysis of scientific data; laser scanning of three-dimensional real-world objects and scenes; and the generation of meshes for scientific computing techniques like the finite element method. These tasks are often most effectively performed with the aid of geometric structures called triangulations, especially the well-known Delaunay triangulation. While the most apparent applications of these techniques are in three dimensions, people often want to analyze scattered data points in much higher-dimensional spaces. For instance, scientific experiments may produce data involving many variables. These data are modeled as points in a high-dimensional space. Unfortunately, geometric data structures such as Delaunay triangulations suffer ``the curse of dimensionality'' and can be prohibitively large. This project explores special cases in which Delaunay triangulations or other triangulations are computationally tractable, thereby enabling more effective scientific data analysis.<br\/><br\/>The related problems of scattered data interpolation, surface reconstruction, Delaunay triangulation, and mesh generation form a central research area within computational geometry, and have a major impact in computational science. Algorithms in these areas have mostly been applied in dimension three. This research studies triangulations embedded in higher-dimensional ambient spaces, of up to one thousand, in the most tractable cases: when the input points are distributed on or near manifolds either of very low dimension or of very low co-dimension. A new technique called star splaying constructs Delaunay-like triangulations of low-dimensional manifolds in high-dimensional spaces. The research also seeks to show that well-spaced points scattered on manifolds of low co-dimension have low complexity, and are therefore tractable. These results have applications to the interpretation and parameterization of scientific data sets.","title":"Collaborative Research: Triangulating Manifolds of Low Dimension and Low Co-Dimension","awardID":"0635381","effectiveDate":"2007-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["408891"],"PO":["565157"]},"120820":{"abstract":"Scattered data points in space arise in many contexts: the interpretation and analysis of scientific data; laser scanning of three-dimensional real-world objects and scenes; and the generation of meshes for scientific computing techniques like the finite element method. These tasks are often most effectively performed with the aid of geometric structures called triangulations, especially the well-known Delaunay triangulation. While the most apparent applications of these techniques are in three dimensions, people often want to analyze scattered data points in much higher-dimensional spaces. For instance, scientific experiments may produce data involving many variables. These data are modeled as points in a high-dimensional space. Unfortunately, geometric data structures such as Delaunay triangulations suffer ``the curse of dimensionality'' and can be prohibitively large. This project explores special cases in which Delaunay triangulations or other triangulations are computationally tractable, thereby enabling more effective scientific data analysis.<br\/><br\/>The related problems of scattered data interpolation, surface reconstruction, Delaunay triangulation, and mesh generation form a central research area within computational geometry, and have a major impact in computational science. Algorithms in these areas have mostly been applied in dimension three. This research studies triangulations embedded in higher-dimensional ambient spaces, of up to one thousand, in the most tractable cases: when the input points are distributed on or near manifolds either of very low dimension or of very low co-dimension. A new technique called star splaying constructs Delaunay-like triangulations of low-dimensional manifolds in high-dimensional spaces. The research also seeks to show that well-spaced points scattered on manifolds of low co-dimension have low complexity, and are therefore tractable. These results have applications to the interpretation and parameterization of scientific data sets.","title":"Collaborative Research: Triangulating Manifolds of Low Dimension and Low Co-Dimension","awardID":"0635250","effectiveDate":"2007-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["538707"],"PO":["565157"]},"131657":{"abstract":"This is a 12 month standard award. This is funding to support participation by approximately 10 researchers from the United States in a joint U.S.-France workshop to be held May 2-3, 2007 in Bordeaux, France. Recent advances in computer science and engineering have realized new and unprecedented opportunities to benefit individuals through computer-based treatments that use life-like computer characters that behave like sensitive and effective tutors or therapists. This workshop will bring together researchers in computer science and speech and language pathology from the United States and France who desire to collaborate to advance the technology needed to realize virtual therapy systems that can provide accessible and effective treatments to individuals with neurological disorders. Research and development of virtual tutoring and therapy systems requires a deep understanding of the communication processes that occur during effective behavioral therapies, and knowledge about how to design human computer interfaces that model these communication processes to optimize user engagement and treatment effectiveness. The workshop will allow researchers to share insights gained from their research and to propose future work to advance knowledge about human communication, clinical treatments and the design of effective treatments based on this knowledge. The first day of the workshop will involve presentations by U.S. and French researchers related to ongoing efforts to develop the tools, technologies and treatments that can benefit individuals with neurological disorders. The second day of the workshop will bring together a smaller group of researchers who will work together to explore ways to initiate and sustain collaborative research projects. <br\/><br\/>Broader Impact: Virtual human systems with optional online clinician oversight can offer an accessible and inexpensive means to provide effective behavioral treatments to millions of individuals. The proposed workshop has the potential to accelerate research and development of virtual therapy systems through international collaboration. This workshop is expected to lead to collaborations among U.S. and French researchers that will result in new knowledge and in virtual therapy systems in French and English that will be evaluated in each country with individuals with Parkinson disease and aphasia.","title":"Virtual Therapist - U.S.-France Workshop May 2-3, 2007 in Bordeaux, France","awardID":"0732198","effectiveDate":"2007-03-15","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551122"],"PO":["565227"]},"120778":{"abstract":"Geometric data derived from sensors is becoming ubiquitous, ranging from temperature and pressure data sampled over wide areas to continuous 3D scans of entire city streets. Although many more examples can be given, the above share the common characteristics that the relevant sensors are geographically dispersed and that the data itself is dynamically generated, often unstructured, highly variable, and possibly massive. The goal of this project is to investigate the intrinsic computational complexity and to develop fundamental algorithms for geometric problems involving such distributed networked spatiotemporal data. Potential applications include analyzing environmental data for ecological forecasting (e.g., predicting bio-diversity), landslide or debris flow prediction over extended areas, mining data on trajectories of vehicles or people for traffic management, detecting similar shapes across geographically separated regions for security or asset tracking, and many others.<br\/><br\/>Traditional geometric algorithms assume that all data is centrally available and that random access to the data is efficient --- assumptions that are clearly violated in the distributed networked setting. A key component of the project is to develop geometric summaries that preserve the essential features and structure of the data and to study the fundamental trade-offs between the relevant parameters, including the size, accuracy, utility, stability, and computational complexity of these summaries. The project builds upon the existing sophisticated techniques such as epsilon-nets and approximations, coresets, discrepancy theory, range searching, persistent homology, surface reconstruction and simplification, kinetic data structures, and others. The research involves developing lightweight distributed and streaming algorithms as well as enhancing the theoretical underpinnings of large-scale sensor networks.","title":"Collaborative Rsearch: Large-Scale Analysis of Sensor Based Geometric Data","awardID":"0635000","effectiveDate":"2007-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["554177"],"PO":["565157"]},"120668":{"abstract":"The University of Massachusetts Amherst proposes to develop a Commonwealth Alliance for Information Technology Education (CAITE) to design and carry out comprehensive programs that address under representation in information technology (IT) education and the workforce. CAITE will focus on women and minorities in groups that are underrepresented in the Massachusetts innovation economy; that is, economically, academically, and socially disadvantaged residents. The project will pilot a series of outreach programs supported by educational pathways in three regions (one rural, one suburban, and one urban). The project will include work with high school teachers, staff, and counselors. CAITE will identify best practices and disseminate, deploy, extend and institutionalize these best practices statewide and nationally. Community colleges are the centerpiece of CAITE because of the central role they play in reaching out to underserved populations and in serving as a gateway to careers and further higher education. This project will build a broad alliance built on its leadership in and partnership with the Commonwealth Information Technology Initiative (CITI), the Boston Area Advanced Technological Education Center (BATEC), regional Louis Stokes Alliances and NSF EGEP programs, and other partnerships and initiatives focused on information technology education and STEM pipeline issues.","title":"BPC-A: Commonwealth Alliance for Information Technology Education","awardID":"0634412","effectiveDate":"2007-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["558309","536735","533875","385767","424075"],"PO":["561855"]},"122329":{"abstract":"Multiresolution Foundations for Physics-Based Computer Animation and Interactive Engineering Design<br\/>PI: Eitan Grinspun, Columbia University<br\/><br\/><br\/>Physical simulations enable scientists and engineers to study complex systems for which direct, controlled experimentation is costly, dangerous, or intractable. Exploratory studies enable engineers to gather qualitative intuition, or feel for the subject system, which in turn leads to the posing of new hypotheses and directions for experimentation. While exploratory processes are inherently interactive, today's computational barriers limit the exploration of important systems to non-interactive modalities. This research seeks to overcome these obstacles with novel methods that quickly but coarsely resolve the physics, skipping over irrelevant data to capture only the coarse variables that drive design decisions. The investigators develop simulation techniques that address the vision of a rapid, interactive design cycle, with a specific focus on the physical simulation of thin shells flexible surfaces such as air bags, biological membranes, and textiles, with pervasive applications in automotive design, biomedical device optimization, and feature film production. In a synergistic pedagogical thrust, this project trains young scientists with a deep understanding of computation, mathematics, and application domain areas despite being in high demand, this combination of skills remains rare.<br\/><br\/>The investigators are developing a principled, methodical approach to coarsening an existing discrete geometric model of a mechanical system, using adaptive, multi-resolution decompositions. Whereas adaptivity is commonly studied in the context of error estimators for mesh refinement, interactivity suggests a focus on how best to give up precision in a simulation. Therefore, this research (i) builds on early work in the field of discrete differential geometry to formulate coarse geometric representations of physical systems that preserve key geometric and physical invariants, (ii) investigates the convergence, resolution- and meshing-dependence of discrete differential operators, and (iii) contributes toward a software platform for interactive design space exploration with concrete applications in automotive, biomedical, and feature-film engineering.","title":"CAREER: Multiresolution Foundations for Physics-Based Computer Animation and Interactive Engineering Design","awardID":"0643268","effectiveDate":"2007-03-15","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["554341"],"PO":["532791"]},"120735":{"abstract":"Adversarial Contention Resolution<br\/><br\/>Michael A. Bender, Stony Brook<br\/>Martin Farach-Colton, Rutgers<br\/><br\/>In computer systems in which jobs contend for a common resource, two jobs are said to collide when they request the resource at the same time.<br\/>Randomized backoff remains the method of choice for resolving such resource contention. The idea of backoff is that whenever a job collides, it retries after some random delay. Backoff is at the core of how the internet and many other complex systems work.<br\/><br\/>Given the prominent role played by randomized backoff, it is surprising that many aspects of backoff are not understood. To date, most analysis has focused on statistical arrival of jobs on relatively simple channels.<br\/>The assumption of statistical arrival rates dangerously neglects the worst-case, however, because bursty and other pathological inputs are a common case. Furthermore, many actual channels are not simple.<br\/><br\/>This research aims to develop a theory of the worst-case performance of backoff algorithms under various assumptions about the channel. The research will be guided by contention-resolution problems in shared-memory applications, such as transactional memory. Transactional-memory applications have multiple channels, support jobs sizes that differ by orders of magnitude, may provide rich feedback on collisions, and could allow one job to succeed when there are conflicts.<br\/><br\/>The research will provide a solid theoretical foundation and performance model for the many applications having multiple-access channels. Without these performance models, implementations are likely to exhibit unpredictable and buggy performance. For the target application of transactional programming in shared memory, a proper understanding of contention resolution is on the critical path for creating a viable system.","title":"Collaborative Research: Adversarial Contention Resolution","awardID":"0634793","effectiveDate":"2007-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["533341"],"PO":["565251"]},"120736":{"abstract":"The availability of DNA microarray chips and other high-throughput technologies for measuring genomic variables fosters the hope that engineering can successfully address a key problem of translational genomics: using genomic signals to classify disease. Classification can serve to diagnosis the existence or category of a particular pathology or it can be used to prognosticate the effect of a treatment. In cancer, diagnosis can be between different stages of tumor development, and prognosis can be to predict the toxicity or benefit of a drug relative to the particular genetic make-up of an individual an example of personalized medicine. Error estimation is critical because the error of a classifier determines its worth. Gene-based classification typically involves small samples (numbers of microarrays), so that the same data must be used to train and test a classifier. Error estimators that work on the training data tend to suffer from low bias or high variance. <br\/> This research improved the performance and widens the range of applicability of three recently proposed small-sample estimation paradigms: (1) bolstered error estimators place a kernel at each sample point and then apply the designed classifier to the distribution formed from the bolstering kernels to estimate its error; (2) convex error estimators are formed by an optimal weighted average of low- and high-biased estimators; and (3) calibrated error estimators are formed by using the data to optimally calibrate standard error estimators. This research generalizes the estimation rules, provides methods to obtain estimator parameters, and applies the estimators to genomic diagnosis and prognosis. Properties are mainly studied via simulation: however, analytic results are derived in cases where the error-estimator distributions are known.","title":"Collaborative Research: Small-Sample Error Estimation for Classification with Application to Genomic Signal Processing","awardID":"0634794","effectiveDate":"2007-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["331729"],"PO":["564898"]},"123838":{"abstract":"Abstract<br\/>This award supports student travel to the doctoral consortium associated with the International Conference on Software Engineering to receive feedback from an international group of panelists on their graduate research. The event will build community and help train the next generation of researchers in the field.","title":"Student Travel Support to the International Conference on Software Engineering (ICSE) 2007 Doctoral Symposium","awardID":"0650366","effectiveDate":"2007-03-01","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["438877"],"PO":["564388"]},"120649":{"abstract":"Texas A&M University, together with Portland State University and Rice University, proposes a set of mentoring activities for minority faculty. Mentoring is critical for successful promotions in the professoriate, and it is especially important for faculty who often find themselves one of very few ethnic minorities at their institution. Further, it is important to have interactions with mentors who have similar experiences and background. There are, however, very few minority researchers in the professoriate who can serve as role models and mentors. To address this problem, the PIs will run a series of Academic Career Mentoring Workshops, targeted toward junior faculty from underrepresented ethnic communities. The workshops will be scheduled annually over a three year period. Their goal is to work with underrepresented junior faculty around the tenure and promotion process, thereby increasing the number of underrepresented minorities at the associate and full professor ranks. Topics will include starting a research program, networking, and navigating the tenure and promotion process, as well maintaining one's identity and overcoming misconceptions. The speakers will include senior faculty from the underrepresented ethnic groups who can serve as role models and present proven strategies. The proposed workshops complement the CRA-W Workshops, which focus on gender, and CRA Workshops, which do not target issues faced by women or ethnic minorities. The workshops will also provide an environment for networking and establishing multi-institutional and interdisciplinary research collaborations to advance the knowledge base of computer science. The attendees will be invited to join the ongoing mentoring groups of the PIs.","title":"BPC-DP: Academic Mentoring Workshops for Underrepresented Participants","awardID":"0634272","effectiveDate":"2007-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["353752","541641","541024"],"PO":["561855"]},"123608":{"abstract":"Binghamton University in general, and its Computer Science (CS) Department<br\/>in particular, are successfully complementing an outstanding reputation<br\/>for undergraduate education with vibrant and growing graduate-level<br\/>research programs. This combination provides fertile ground for<br\/>outstanding undergraduate research experiences in the area of experimental<br\/>computer systems. The combination of a high quality research environment,<br\/>dedicated and talented Faculty Research Mentors, and a feedback loop driven<br\/>by a local educational evaluation professional, ensure the strong<br\/>intellectual merit of this REU site. An attractive high-quality Web space,<br\/>papers published in high-profile venues, and faculty talks describing<br\/>student research, will demonstrate that undergraduates can be valuable and<br\/>effective researchers, thereby encouraging other CS departments to<br\/>increasingly employ them in this capacity.<br\/> <br\/>Current research projects directed by Binghamton CS faculty include improving<br\/>the performance, energy-efficiency, and reliability of modern microprocessors<br\/>and memory systems; using Grid computing to solve computationally complex<br\/>distributed scientific applications; combining and scaling wide-area Web-based<br\/>information retrieval techniques; advancing face recognition, processing,<br\/>analysis, and animation research; and creating new combinatorial optimization<br\/>techniques for VLSI computer aided design problems. Specific goals of the<br\/>Binghamton REU Site include exposing students to high-quality computer systems<br\/>research, training them to be effective and productive computer science<br\/>researchers, and attracting them through exciting and positive experiences<br\/>to continue to pursue a research-oriented career path.","title":"REU Sites: Experimental Computer Systems Research at Binghamton University","awardID":"0649252","effectiveDate":"2007-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["553586",328010],"PO":["562944"]},"120739":{"abstract":"Geometric data derived from sensors is becoming ubiquitous, ranging from temperature and pressure data sampled over wide areas to continuous 3D scans of entire city streets. Although many more examples can be given, the above share the common characteristics that the relevant sensors are geographically dispersed and that the data itself is dynamically generated, often unstructured, highly variable, and possibly massive. The goal of this project is to investigate the intrinsic computational complexity and to develop fundamental algorithms for geometric problems involving such distributed networked spatiotemporal data. Potential applications include analyzing environmental data for ecological forecasting (e.g., predicting bio-diversity), landslide or debris flow prediction over extended areas, mining data on trajectories of vehicles or people for traffic management, detecting similar shapes across geographically separated regions for security or asset tracking, and many others.<br\/><br\/>Traditional geometric algorithms assume that all data is centrally available and that random access to the data is efficient --- assumptions that are clearly violated in the distributed networked setting. A key component of the project is to develop geometric summaries that preserve the essential features and structure of the data and to study the fundamental trade-offs between the relevant parameters, including the size, accuracy, utility, stability, and computational complexity of these summaries. The project builds upon the existing sophisticated techniques such as epsilon-nets and approximations, coresets, discrepancy theory, range searching, persistent homology, surface reconstruction and simplification, kinetic data structures, and others. The research involves developing lightweight distributed and streaming algorithms as well as enhancing the theoretical underpinnings of large-scale sensor networks.","title":"Collaborative Research: Large-Scale Analysis of Sensor-Based Geometric Data","awardID":"0634803","effectiveDate":"2007-03-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["521232"],"PO":["565157"]},"118262":{"abstract":"Today's user of scientific computing facilities has easy access to thousands of processors. However, this bounty of processing power has led to a data crisis. A conventional computing system often dispatches hundreds or thousands of jobs that simultaneously access a centralized server, which inevitably becomes a bottleneck. To support large data intensive applications, clusters must expose control of their internal storage and computing resources to an external scheduler that can make more informed placement decisions. This technique is called deconstructing clusters.<br\/><br\/>This project attacks a particular data-intensive problem in high-end biometric research: the pair-wise comparison of hundreds of thousands of face images. The technique of deconstructing clusters will be used to parallelize the workload across large computing clusters. If successful, this project will reduce the time to develop and analyze a new biometric matching algorithm from years to days, thus improving the productivity of biometric researchers. The broader impact upon society will be an improvement in the accuracy and efficiency of biometric identification for commercial and national security. The software will be published in open source form in order to benefit other scientific computations with a similar pair-wise computation model.","title":"HECURADeconstructing Clusters for High End Biometric Applications","awardID":"0621434","effectiveDate":"2007-03-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[313372,"565244"],"PO":["565272"]},"128002":{"abstract":"This proposal develops and evaluates a specific example of a critical creative technology as an exploratory research platform. Using this research platform, the project has an environment for designing and evaluating information technology applications that provide a common-ground for collaborative creative activities shared among people co-located in public spaces. This research focuses on the development technologies that enable a user to see the implications of his or her choices and negotiations with others and their impact on a collaborative design task. The Constructed Narratives block game is the first exploratory design of a critical creative technology. The game is designed to aggregate and analyze user profile data and collective design decisions made by a collaborating group of people. This data is used to generate a lexical overlay that appears on a real-time three-dimensional rendition of the physical block construction. Participants collaborate in constructing a world where they provide the dynamic narrative structures that form that designed world. This research, anchored in digital media and design, social networking, and perceptual user interface systems design, provides a foundation for future critical creative technologies. <br\/><br\/>The intellectual merits of this exploratory research include the development of generative design methods based on the theory of shape grammars for the tangible interface design; the integration of rules structures from visual semiotics into the game software; and the exploratory use of evaluation methods typically used in creative practices to augment traditional empirical evaluation methods of IT applications that focus on hard to quantify attributes of human communication (e.g. emotion and intention). <br\/><br\/>The broader impact of this exploratory research is the facilitation of discourse in public spaces with a game environment that integrates advances in creative practices, computer science and human computer interaction.","title":"SGER: Designing Critical Creative Technologies to Support Collaboration in Public Spaces","awardID":"0715304","effectiveDate":"2007-03-15","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["424970"],"PO":["424970"]},"129653":{"abstract":"IIS-0722484<br\/>Katherine J. Stewart<br\/>University of Maryland, College Park<br\/>$20,325 - 12 mos<br\/> <br\/>WORKSHOP: Organizational Communication and Information Systems (OCIS) Doctoral Research Consortium<br\/><br\/>This is a 12-month standard award to support a Organizational Communication and Information Systems (OCIS) Doctoral Colloquium program at the Academy of Management Conference to be held in Philadelphia, PA (August 3-8, 2007). This will bring together approximately 25 dissertation-stage doctoral students in the field of information systems for one and a half days of talks and interaction with 6 distinguished senior faculty mentors.<br\/><br\/>Participants will come from the USA and from abroad. In the past, the doctoral consortium has been a successful venue for socialization of young OCIS researchers. Many of today's leading OCIS scholars have participated in past OCIS consortia. This project provides support for the travel and lodging of students as well as other expenses of putting on the doctoral consortium.<br\/><br\/>Intellectual Merit<br\/>A major focus of the doctoral consortium is discussion of the students' dissertation projects. These represent cutting edge research in the field of organizational communication and information systems. The consortium provides both an opportunity for these projects to be shaped through intellectual exchange as well as communicating the work to a key group of young professionals.<br\/><br\/>Broader Impact<br\/>The OCIS doctoral consortium brings together highly talented students and several senior researchers, facilitating the development of a social network that will play a major role in the career success of new researchers. Since both faculty and students are diverse on several dimensions (research topics, methodological approaches, national and cultural background), the students' horizons are broadened at a critical stage in their professional development.","title":"Workshop: Organizational Communication and Information Systems (OCIS) Doctoral Research Consortium; August 3-8, 2007; Philadelphia, PA","awardID":"0722484","effectiveDate":"2007-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[343661],"PO":["565227"]},"129686":{"abstract":"What does the desktop metaphor mean for communities that do not use or value desks? How does the QWERTY keyboard perform in communities whose language has no \"Q\", \"W\", \"E\", \"R\", \"T\", nor \"Y\"? What is the point of a personal computer in a context where technologies are not held for a person but are shared by a whole community? Computer applications and PC appliances have traditionally been designed by and for Western high-income populations. But today the Internet and internet-enabled computers have become a truly global phenomenon reaching out to many of the most remote and marginalized communities. The User Centered Design and International Development workshop that the PI is organizing will be held on Saturday, April 28, in cooperation with the ACM 2007 Conference on Human Factors in Computing Systems (CHI 07) in San Jose. This is an official workshop of the CHI 07 conference. The workshop will explore interaction design in the context of international development, and in particular will address interaction design for parts of the world that are often marginalized by current systems and applications designers. The PI believes that to extend the boundaries of existing practice in designing information and communication technologies, their design should be with, for, and of the marginalized communities he plans to set centre stage in the workshop discussions. The workshop will provide a forum to exchange experiences, explore differences between developed and developing world contexts, develop new partnerships, and learn from each other's experiences. NSF funding will enable approximately ten international participants to attend from low-income countries, from which participation would otherwise be impossible.<br\/><br\/>The annual CHI conference, sponsored by the Association for Computing Machinery's Special Interest Group on Computer-Human Interaction (ACM SIGCHI), is a leading international forum for the presentation and discussion of human-computer interaction (HCI) research and practice. It is attended by approximately 2,400 HCI professionals from around the world. Research papers presented at the conference are heavily-refereed and widely cited; they constitute some of the most scientifically respected research publications in the field of HCI.<br\/><br\/>Broader Impacts: A review of the HCI literature exposes the broad intellectual gap that exists between problems of computer interaction and studies of the development impact of computer technologies in low-income countries. By assembling together many of the world leaders in these two disciplines for the first time, the PI expects that this workshop will be instrumental in creating an epistemic community and developing intellectual momentum around these topic areas (the PI reports that he has already have been overwhelmed with over 60 submissions from around the world). Outcomes from the workshop will be reported in the journal Information Technology and International Development; additionally, the PI expects to publish a workshop summary in a leading HCI journal such as Interactions, and possibly also to hold a follow-on workshop at the CHI 08 conference.","title":"User Centered Design and International Development: Participant Support held on April 28, 2007 in San Jose, CA","awardID":"0722589","effectiveDate":"2007-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["538769"],"PO":["565227"]},"122371":{"abstract":"This proposal outlines a challenging goal of combining the ease of voice with the visual feedback of graphics to create a new communication medium. The project will create a graphical language for visualizing communication. Different versions of the graphical language will be used to mediate remote and co-located conversation, to create learning tools for acquiring new language skills and conducting speech therapy, to create new visualization techniques combining time and phase analysis, and to produce novel methods of archiving audio, speech, and voice.<br\/><br\/>Intellectual Merit. The intellectual merit of this project is the consideration audio, speech, and voice processing from a perspective and goal different from that of traditional audio engineers. The project begins with simple yet effective techniques that have not yet been studied and progresses to developing new analysis and visualization techniques. The graphical languages will be evaluated through applications catered to their use. This research studies the use of social cues and signals that are more readily apparent in mediated interaction than in face-to-face interaction; the parameters in voice that are most effective and easy to interpret; the use of color, shape, and motion mapped onto these voice parameters. The research will help us understand how visualizing conversation publicly affects our vocal interaction when in co-located spaces and in remote spaces; and how much value is added by combining voice data with graphical data.<br\/><br\/>Broader Impact. This research will alter vocal communication interaction in online environments and in physical co-located spaces. The act of archiving in real-time will have new consequences for voice communication and collaboration. The research will provide novel tools for helping users learn the subtleties of vocalization. These tools will be used for learning new languages and for speech therapy. The research extends the vocalization tools to tangible toy objects to encourage vocalization in children who have social impairments. The research will provide an alternate graphical method for archiving large bodies of audio that can be searched at a glance rather than with a search engine. The research results will be disseminated in new courses and in research publications.","title":"CAREER: Enhancing Vocal Communication using Graphical Social Cues","awardID":"0643502","effectiveDate":"2007-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["457205"],"PO":["565227"]},"122492":{"abstract":"Linguists investigate the structure of natural languages by building models called grammars which associate strings of words with their semantic representations. As natural languages are quite complex in their structure, there are great benefits to building these models as computer software, both in managing the complex interactions of subparts of the model and in automating the testing of the model against large collections of natural language text. However, such computerized models are expensive and difficult to build, so most linguistic hypothesis testing takes place off-line. At the same time, there are great similarities among languages, suggesting that existing work on computerized models for a few well-studied languages can be leveraged to jump start the creation of models for other languages.<br\/><br\/>With this CAREER award, Dr. Emily Bender aims to develop a grammar customization system that combines a cross-linguistic core grammar with a series of 'libraries' specifying alternate ways of realizing different linguistic subsystems that vary across languages (e.g., the expression of tense and aspect, coordination, or negation). This system will allow linguists to easily customize a small working grammar for a particular language, which they can then use as a test-bed for further linguistic investigation. The process of building the system itself will involve an unprecedented exploration of computational linguistic typology, exploring precise analyses of diverse linguistic phenomena across a sample of languages which show the boundaries of variation. The broader impacts of this project include the potential for quicker, more precise documentation of endangered languages and cheaper development of natural language technology (including machine translation, grammar checkers and computer-assisted language learning programs) in under-resourced languages. This project is cofunded by the Linguistics Program in the Behavioral & Cognitive Sciences Division of the Social, Behavioral & Economic Sciences Directorate and the Robust Intelligence Cluster in the Information & Intelligent Systems Division of the Computer & Information Science & Engineering Directorate.","title":"CAREER: The Grammar Matrix: Computational Linguistic Typology","awardID":"0644097","effectiveDate":"2007-03-15","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["507285"],"PO":["564343"]},"123141":{"abstract":"Title: REU Site: Collaborative Research: Advances of Machine Learning in Theory and Applications (AMALTHEA)<br\/><br\/>PI: Georgios C Anagnostopoulos <br\/>Institution: Florida Institute of Technology<br\/><br\/>PI: Michael Georgiopoulos<br\/>Institution: University of Central Florida<br\/><br\/>AMALTHEA is a collaborative effort between two closely-located universities, Florida Institute of Technology in Melbourne and University of Central Florida in Orlando, Florida. The project seeks to provide top quality educational experiences to a diverse community of learners through research participation in the area of Machine Learning (ML). Machine Learning is nowadays a high-importance, ever- expanding discipline that draws concepts from a variety of fields, including artificial intelligence, cognitive sciences, information theory, statistics, mathematics, physics, philosophy and biology among others. On the other hand, automatic target recognition, earthquake prediction, gene expression discovery, intelligent credit fraud protection and affectionate computing, to mention just a few, are examples of cutting-edge applications of ML in various technological and scientific domains. The project's thrust area is the theory of ML and how it can be integrated and applied to important real-life problems, thus exposing participants to both theory and applications.<br\/><br\/>AMALTHEA involves ten undergraduate students annually in ML research over ten weeks in the summer. Overall, the project will impact a diverse group of 30 students, as well as 12 graduate students, which will participate in undergraduate teaching and mentoring activities. <br\/>The undergraduate students perform supervised research on ML topics that have the potential to impact the field of ML itself, as well as how ML is applied to other scientific disciplines. REU research results are expected to be published in interdisciplinary conferences, and, potentially, technical journals. Additionally, these REU research advances are fed back and integrated into the teaching of ML-related courses at the partnering institutions.<br\/><br\/>The project involves four faculty who have significant overall experience in ML research and education; they have mentored over 50 undergraduates in research and co-authored over 20 conference and journal papers with them. The project is also supported in its endeavors by an actively participating Advisory Board consisting of industry and government professionals with interest and expertise in ML.<br\/><br\/>URL: http:\/\/my.fit.edu\/amalthea","title":"REU Sites: Collaborative Research: Advances of Machine Learning in Theory & Applications (AMALTHEA)","awardID":"0647120","effectiveDate":"2007-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["511959","426749"],"PO":["562760"]},"123120":{"abstract":"Title: REU Site: Collaborative Research: Advances of Machine Learning in Theory and Applications (AMALTHEA)<br\/><br\/>PI: Georgios C Anagnostopoulos <br\/>Institution: Florida Institute of Technology<br\/><br\/>PI: Michael Georgiopoulos<br\/>Institution: University of Central Florida<br\/><br\/>AMALTHEA is a collaborative effort between two closely-located universities, Florida Institute of Technology in Melbourne and University of Central Florida in Orlando, Florida. The project seeks to provide top quality educational experiences to a diverse community of learners through research participation in the area of Machine Learning (ML). Machine Learning is nowadays a high-importance, ever- expanding discipline that draws concepts from a variety of fields, including artificial intelligence, cognitive sciences, information theory, statistics, mathematics, physics, philosophy and biology among others. On the other hand, automatic target recognition, earthquake prediction, gene expression discovery, intelligent credit fraud protection and affectionate computing, to mention just a few, are examples of cutting-edge applications of ML in various technological and scientific domains. The project's thrust area is the theory of ML and how it can be integrated and applied to important real-life problems, thus exposing participants to both theory and applications.<br\/><br\/>AMALTHEA involves ten undergraduate students annually in ML research over ten weeks in the summer. Overall, the project will impact a diverse group of 30 students, as well as 12 graduate students, which will participate in undergraduate teaching and mentoring activities. <br\/>The undergraduate students perform supervised research on ML topics that have the potential to impact the field of ML itself, as well as how ML is applied to other scientific disciplines. REU research results are expected to be published in interdisciplinary conferences, and, potentially, technical journals. Additionally, these REU research advances are fed back and integrated into the teaching of ML-related courses at the partnering institutions.<br\/><br\/>The project involves four faculty who have significant overall experience in ML research and education; they have mentored over 50 undergraduates in research and co-authored over 20 conference and journal papers with them. The project is also supported in its endeavors by an actively participating Advisory Board consisting of industry and government professionals with interest and expertise in ML.<br\/><br\/>URL: http:\/\/my.fit.edu\/amalthea","title":"REU Sites: Collaborative Research: Advances of Machine Learning in Theory & Applications (AMALTHEA)","awardID":"0647018","effectiveDate":"2007-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["547328","538958"],"PO":["563751"]},"130480":{"abstract":"Interconnect has always been the dominant component consuming area, delay, and energy in Field-Programmable Gate Arrays and related spatial computing devices. With interconnect requirements scaling faster than linearly in device gate capacity and fundamental interconnect delays in VLSI scaling slower than gate speeds, this problem is only exacerbated as we go forward. Further, with the size of silicon systems we can build today, all kinds of single-chip architectures (e.g. multiprocessor, system-on-a-chip, VLIW, Vector, PIM) will be moving toward greater on-chip parallelism and hence greater use of on-chip, programmable interconnect.<br\/><br\/>Nonetheless, interconnect is probably the least understood component in programmable devices. The fundamental goal of this research is to close gaps in our understanding of interconnect structures and in our quantification of interconnect requirements and synthesize this understanding into an engineering-grade approach to programmable interconnect design. This effort will build upon results in VLSI and Parallel theory, but goes beyond them to close asymptotic gaps, understand how to optimize the constant factors, and characterize the properties and behavior of typical designs. <br\/><br\/>The pedagogical goal is to make the design space, issues, tradeoffs, and impact of spatial interconnect design accessible to students and practitioners with an undergraduate computer science background.","title":"CAREER: Interconnect Design for Programmable Computation","awardID":"0726201","effectiveDate":"2007-03-15","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["497005"],"PO":["550859"]},"122373":{"abstract":"In the past decade, wireless networks have undergone a remarkable evolution from primitive circuit-switched links to multiuser packet-switched networks with increasing levels of cooperation and sophistication. In the coming decade, a primary impediment to their further evolution is the lack of a descriptive theory for networks with interdependent links, most notably ad hoc and mesh networks. This problem has proven to be a daunting task due to (i) the dimensionality of the capacity region due to the node interactions, and (ii) the competing constraints of throughput, delay, energy efficiency, and connectivity. Without discounting the significant progress that has been made, the lack of crisp results has handicapped the system design of ad hoc, mesh, and sensor networks, and therefore impeded their development and commercialization. <br\/><br\/>This research involves the development of a descriptive capacity theory for ad hoc networks that should be capable of the following: (1) Accurate characterization of the effects from physical parameters and advanced radio technologies, (2) accurately accounting of the spatial interactions between the transmitters and receivers in the network, and (3) providing a useful abstraction of the lower \"layers\". This is accomplished using a novel approach based on stochastic geometry (motivated by information theory) that we term the transmission capacity. The key theoretical milestones for this research are (i) substantial contributions in the application of stochastic geometry, random matrix theory, and information theory to ad hoc and hierarchical wireless networks, (ii) a useful theory that can be used to characterize the effect of any conceivable technology or scheme on ad hoc network capacity, and (iii) the derivation of specific results that will impact design principles of future wireless networking standards.","title":"CAREER: The Transmission Capacity of Hierarchical Wireless Networks","awardID":"0643508","effectiveDate":"2007-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["522873"],"PO":["564924"]},"127588":{"abstract":"0713983<br\/>Lok, Benjamin <br\/>University of Florida<br\/><br\/>Student Panel at IEEE Virtual Reality 2007 Conference<br\/><br\/>This conference brings together researchers academia and industry focused on research topics related to the Graphics and Visualization subarea of the CPA cluster. A five-member student panel will be supported that allows students to take a more active and integral role in voicing new research directions of interest to the research community. Among the topics to be discussed on the student panel are defining the future of virtual reality research and building a career in this research area. This outreach activity helps to broaden the participation of students in research.","title":"CPA (Gr&Vis): Student Panel at IEEE Virtual Reality 2007 Conference","awardID":"0713983","effectiveDate":"2007-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["553729"],"PO":["532791"]}}