{"47092":{"abstract":"One of the largest and fastest-growing problems in scientific computing is the analysis and processing of very large data sets. These scientific data sets can come from long-running simulations (e.g. simulations of water pollution that create \"snapshots\" of the expected water conditions at later times), archives of remote sensing data (e.g. high-resolution satellite imagery), and archives of medical images (e.g. MRI scans for a patient or group of patients). These data sets are usually multi-dimensional, including spatial coordinates, time stamps, and several physical properties at each point. Several systems now support storage, retrieval, and visualization of such data sets, but few can efficiently process the data. This project will develop methods to produce efficient programs to carry out multi-dimensional data processing and analysis using a high-level parallel language.<br\/><br\/>The project will attack this problem by developing runtime routines for optimizing resource usage, appropriate language extensions, and aggressive compiler optimizations for large data processing. The runtime methods will implement policies that optimize computational efficiency on a broad range of large data set analyses, taking into account the spatial structure and partitioning of the data and the computation to be performed. Incorporating these routines into the investigator's Active Data Repository will substantially generalize and improve that system. The language extensions and compiler optimizations will then make use of the runtime system to enable applications that analyze multi-dimensional data sets to be expressed at an abstract level, yet achieve high utilization of computational, storage, and communication resources.","title":"Compiler and Runtime Support for Data Intensive Computing on Multi-dimensional Data","awardID":"9982087","effectiveDate":"2000-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["410444","559445"],"PO":["551992"]},"48040":{"abstract":"EIA-9986043<br\/>Guang R. Gao<br\/>University of Delaware<br\/><br\/>CISE Research Instrumentation: CONFIGURABLE OFF-THE SHELF MULTITHREADED EXPERIMENTAL TESTBED (COMET)<br\/><br\/>The Department of Electrical and Computer Engineering at the University of Delaware will purchase FPGA (Field-Programmable Gate Array) design boards, a Beowulf cluster of commercial off-the-shelf (COTS) PC's and necessary accessories such as an oscilloscope. The FPGA units will form the Multithreaded Operator for Of-the shelf Nodes (MOON), which will be used for prototyping multithreading enhancements to COTS-based machines. The PC cluster will provide a baseline for comparing the performance of enhanced and non-enhanced clusters. The combination of the MOON cards and the cluster will form COMET. The test equipment will permit the development of a custom interconnect between the MOON board, and will be used for observing and debugging high-speed signals.<br\/><br\/>This equipment will be used to test the thesis, supported by previous simulations, that a fine-grain multithreading model supporting both regular and irregular applications can be implemented on COTS systems if a small amount of custom hardware is used to support the operations specific to the multithreading model. The Moon would provide a flexible and multi-faceted prototyping system for verifying these results in real system, and for supporting other, more advanced multithreading models, which are specific to ongoing research projects.","title":"CISE Research Instrumentation: Configurable off-the-shelf Multithreaded Experimental Testbed (COMET)","awardID":"9986043","effectiveDate":"2000-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["475422","156449"],"PO":["301532"]},"47083":{"abstract":"EIA-9982054<br\/>Rezmierski, Virginia<br\/>University of Michigan<br\/><br\/>Digital Government: Identifying Where Technology Logging and Monitoring for Increased Security Ends and Where Violations of Personal Privacy and Student Records Begins<br\/><br\/>This award will examine issues related to the tension between 1) the progressively complex stages of computer access logging\/monitoring resulting from the need for more aggressive security, and 2) conditions under which that logging, storage and possible release of information would constitute a violation of student record privacy. The resulting study and identification of best practices will be provided to law enforcement agencies, data managers, policy experts, and developers of future privacy and security technologies.<br\/><br\/>The domain of interest is university student records, though the findings should extrapolate to other domains. Collaborators will include the US Department of Education, Educause and the American Association of Collegiate Registrants and Admissions Officers.","title":"Digital Government: Identifying Where Technology Logging and Monitoring for Increased Security Ends and Where Violations of Personal Privacy and Student Records Begins","awardID":"9982054","effectiveDate":"2000-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["228004"],"PO":["371077"]},"48030":{"abstract":"EIA-9986020<br\/>Rudolf Eigenmann<br\/>Purdue University<br\/><br\/>CISE Research Instrumentation: Infrastructure for Cluster and Parallel Systems Research<br\/><br\/>The School of Electrical and Computer Engineering at Purdue University will acquire four Sun Ultra Enterprise 450 quad-processor servers plus Myrinet interconnections for research in computer and information science and engineering. The equipment will be used for several research projects, including in particular:<br\/> <br\/> Speculative Distributed Shared Memory<br\/><br\/> Latency-Reducing Compiler Techniques for Distributed Shared Memory,<br\/><br\/> Studies of large-scale Applications for Symmetric Multiprocessor Clusters<br\/><br\/> Multiplex: Future Billion-Transistor Microarchitectures<br\/><br\/>The new equipment will provide a testbed platform for fine-grain software distributed shared memory (DSM) to implement and evaluate speculative coherent DSM architectures and serve as a target for a compiler. In addition, the cluster and individual servers will also be used in single-user mode to perform unperturbed measurements of our large-scale applications and will allow single-user access to individual SMPs without inhibiting long-running multi-user applications.<br\/><br\/>The servers will provide the required memory and processing power as well as memory bandwidth to perform the memory-and computer-intensive simulations of the Multiplex architecture. The new equipment will deliver high simulation throughput rates by running many simulations concurrently. <br\/><br\/>The cluster and individual servers will provide the high memory bandwidth, large aggregate memory and processing power required to run detailed, large-scale parallel simulations for the speculative DSM research .","title":"CISE Research Instrumentation: Infrastructure for Cluster and Parallel Systems Research","awardID":"9986020","effectiveDate":"2000-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["558595","342332","550778"],"PO":["565090"]},"48041":{"abstract":"EIA-9986046<br\/>Thu D. Nguyen<br\/>Rutgers University<br\/><br\/>CISE Research Instrumentation: System Support for Scalable, Fault-Tolerant Computing and Service on PC Clusters<br\/><br\/>A high-end PC cluster is the crucial computing infrastructure for research in the recently established Distributed Computing Laboratory (DISCO Lab) in the Department of Computer Science at Rutgers University. The requested cluster consists of 8 quad-processor PCs, a 16-port Alteon Gb\/s Ethernet LAN with layer 4 switching capabilities and a 16 NICs, and a 16-port Myrinet Gb\/s LAN with 8 NICs. This cluster will support research in several projects that jointly, are intended to improve the state-of-the-art in cluster computing, moving towards the realization of a robust and efficient distributed computing environment for clusters of PCs. In particular, this proposal describes four projects: (i) developing a robust software distributed shared-memory environment to support emerging cluster applications, (ii) building system support for efficient global utilization of cluster resources (iii) exploring the construction of highly available operating systems, and (iv) implementing distributed applications such as data mining, scalable servers, and interactive continuous media applications and system mechanisms and policies to support them efficiently on clusters.","title":"CISE Research Instrumentation: System Support for Scalable, Fault-Tolerant Computing and Services on PC Clusters","awardID":"9986046","effectiveDate":"2000-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["486425","486839","559843","556616"],"PO":["301532"]},"48043":{"abstract":"EIA-9986051<br\/>Jannick P. Rolland<br\/>University of Central Florida<br\/><br\/>CISE Research Instrumentation: Augmented Reality and Interactive Distributed Physical Modeling<br\/><br\/>The schools of Optics and Computer Science at the University of Central Florida will purchase Silicon Graphics computers that will be dedicated to support research in computer and information science and engineering. The equipment will be used for several projects, including in particular:<br\/><br\/>1. Augmented Reality<br\/>Build a framework for augmented reality visualization. The framework includes the development of 3D displays, including head-mounted devices; quantitative assessment methods for accuracy and precision of 3D rendered depth; physically based models of motion of virtual objects; registration methods for real and virtual objects; and statistical texture synthesis.<br\/><br\/>2. A Framework for Distributed Physical Modeling at Interactive Speed<br\/>Extend the framework developed previously for distributed physical modeling to study the effective utilization of non-homogeneous machine clusters and to provide data at interactive-speed to augmented and virtual reality systems.<br\/><br\/>3. Dynamic Environmental Features in Virtual Worlds <br\/>Develop algorithms for the dynamic generation of vegetation in virtual worlds. This will require the design of new level of detail management algorithms and lightweight communication protocols to maintain functionally.","title":"CISE Research Instrumentation: Augmented Reality and Interactive Distributed Physical Modeling","awardID":"9986051","effectiveDate":"2000-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["513513",122795,"561621"],"PO":["557609"]},"47110":{"abstract":"Advances in computer and network technologies will soon make it possible to harness the collective computing power of distributed supercomputer systems as a Computational Power Grid (or Grid for short). Grid computing will entail coping with unusually high latencies and low bandwidths. To use such a Grid effectively as a platform for scientific computing will require new algorithms and programming methodologies along with compiler and run-time support to simplify the program development process.<br\/><br\/>The scope of this problem is so broad that we believe that effective technologies can best be developed through focusing on concrete application domains. This proposal will perform an exploratory study to explore the development of compiler and runtime technology as well as algorithmic techniques for supporting largescale, parallel, structured adaptive mesh refinement (AMR) calculations in Computational Fluid Dynamics (CID) on the Grid. The project will be an interdisciplinary study consisting of applications scientists from NCSA and computer scientists from Rice and University of Houston.<br\/><br\/>This proposal, therefore, will carry out a study to see whether such highly complex AMR applications can be efficiently run on the Grid. The course of this work will be exploring several different algorithmic strategies for supporting AMR on Grids. This will also entail developing innovative compiler technology and language extensions to the OpenMP standard that allow it to provide Grid-based support for such AMR applications. Lastly, resources (nodes, network connections) in the Grid computational environment are often contended. Therefore a Grid-enabled application has to be able to speculatively adapt to changing Grid resources. The proposal will build up tools that monitor the application's performance on the Grid as well as the available Grid resources. Information from these tools will be made available to the AMR application through standard interfaces in our OpenMP API so that the AMR application can speculatively adapt to changing Grid resources.","title":"Exploring the Role of Grid-Enabled OpenMP in Adaptive Mesh Calculations","awardID":"9982160","effectiveDate":"2000-03-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["191820","551076"],"PO":["551992"]},"47352":{"abstract":"EIA-9983238<br\/>Dawes, Sharon<br\/>SUNY Albany<br\/><br\/>Digital Government: A Multinational Investigation of New Models of Collaboration for Government Services to Citizens and Businesses<br\/><br\/>This award will provide planning support to test a conceptual framework and associated research methodologies of a multinational research program to study organizational partnerships engaged in the delivery of services to citizens and businesses. The defining characteristic of these partnerships is the voluntary combination of separate organizations into a coherent service delivery system supported by advanced information technologies. The extremely rapid evolution of these technologies has created important new opportunities for governments to redesign services through partnerships with other organizations elsewhere in government, in business, or in the non-profit sector. This research seeks to analyze and document how these new partnerships develop and perform.","title":"Digital Government: A Multinational Investigation of New Models of Collaboration for Government Services to Citizens and Businesses","awardID":"9983238","effectiveDate":"2000-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["433032"],"PO":["371077"]},"47783":{"abstract":"This is the first year of funding of a 4-year continuing award. This project adopts a decision theoretic approach to problems of intelligent planning and control, especially problems that are characterized by uncertainty and imperfect information. One focus of this research is the development of improved algorithms for problems that are formalized as Markov decision processes and\/or influence diagrams. An innovative approach is adopted in which plans (or policies) are represented as finite automata, and classic AI search and planning techniques for finding sequential plans are generalized to find more complex conditional plans that take the form of automata. This should lead to more efficient planning algorithms by exploiting problem structure in the form of factored representations, as well as hierarchical and distributed problem decomposition. A complementary focus of this project is the application of decision-theoretic techniques to, practical problems, including planning the process of knowledge discovery in a large oceanographic image database, and dynamic load balancing of scientific computations in a parallel, distributed memory environment. This research will result in more efficient algorithms for decision-theoretic planning and control that can solve larger and more complex problems. It will also result in an improved understanding of how to apply these algorithms and models to practical applications.","title":"CAREER: A Decision-Theoretic Approach to Intelligent Planning and Control","awardID":"9984952","effectiveDate":"2000-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["39192"],"PO":["491702"]},"48036":{"abstract":"EIA-9986032<br\/>David K. Lowenthal<br\/>University of Georgia<br\/><br\/>Instrumentation Grant for Research in Parallel and Distributed Computing<br\/><br\/>The Parallel and Distributed Computing Laboratory at the University of Georgia, established in 1998 is dedicated to making parallel computing simple, portable, and efficient. The activities of the laboratory include designing and implementing efficient parallel algorithms, developing highly configurable environments for the monitoring, visualization, and interactive steering of distributed programs, and developing lower-level systems that transparently and dynamically determine how to distribute data across processors. Currently research in the laboratory is primarily done on networks of commodity uniprocessor workstations. The attractive price\/performance ration of small, bus-based multiprocessors relative to uniprocessors makes it likely that two-and four-way multiprocessors will be commonplace within a few years. Still, to create large parallel machines, these multiprocessors will be networked together to create a hybrid (both shared-and distributed-memory) machine. This poses interesting problems, including (1) should the machine be treated as distributed or both shared and distributed. (2) How do we make full use of such machines and (3) how can a user monitor and control program on such machines? The Department of computer Science at the University of Georgia seeks funds to purchase eight Pentium-based multiprocessors with four processors each. A 100Mb\/s Ethernet and an SGI fronted to serve as a console for visualization and interactive control. This equipment will be used by three projects.<br\/><br\/>Parallel and Distributed algorithms for computational biology<br\/><br\/>Monitoring, visualization, and interactive steering, and<br\/><br\/>An integrated compiler\/run-time system for global data distribution","title":"Instrumentation Grant for Research in Parallel and Distributed Computing","awardID":"9986032","effectiveDate":"2000-03-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[122768,"214934","517411"],"PO":["565090"]},"48015":{"abstract":"EIA-9985986<br\/>Ronald R. Sass<br\/>Clemson University<br\/><br\/>CISE Research Instrumentation: Adaptive Computing Cluster<br\/><br\/>The Department of Electrical and Computer Engineering at Clemson University will purchase a cluster of workstations with reconfigurable computing to support research in cluster computing, reconfigurable computing, bioinformatics, and robotics, science and engineering. The equipment will be used for several research projects including in particular \"Adaptive Computing Cluster\", Fast Sequence Searching on an Adaptable Computing Cluster', \"Reconfigurable Hardware Support for a Parallel File System, and \"Performance Validation of Nonlinear Controllers for Magnetic Bearings via Dynamic Simulation'. Each of these projects require the unique combination of configurable hardware and cluster computing resources requested to obtain experimental results. The use of the equipment will be restricted to use by the faculty and students involved in these projects.","title":"CISE Research Instrumentation: Adaptive Computing Cluster","awardID":"9985986","effectiveDate":"2000-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["329570","521239","530256","267292"],"PO":["301532"]},"48026":{"abstract":"EIA-9986012<br\/>Dana S. Nau<br\/>University of Maryland-College Park<br\/><br\/>CISE Research Instrumentation: A Specialized Computing Environment for Distributed and Virtual Design and Manufacturing.<br\/><br\/>The University of Maryland will create a specialized computing environment for distributed and virtual design and manufacturing. This facility will support research in computer and information science sand engineering. The University of Maryland will purchase two graphics workstations, two NT-based servers, and the necessary software for developing the facility. The computing environment will be dedicated to several on-going projects on distributed and virtual design and manufacturing. These projects will yield specific contributions in areas related to computing and information systems. With this facility, the investigators can install and integrate our approaches, share data across various projects effectively, and test our results more thoroughly. Thus we can study and solve the computational challenges that will occur as manufacturers develop advanced, information-based product realization processes","title":"CISE Research Instrumentation: A Specialized Computing Environment for Distributed and Virtual Design and Manufacturing","awardID":"9986012","effectiveDate":"2000-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["508604","448964","564069"],"PO":["301532"]},"47598":{"abstract":"This is the first year of funding of a 4-year continuing award. This research investigates learning scenarios in which multiple learners co-exist and may learn different functions on the same input, but there are mutual compatibility constraints on their outcomes. The PI will develop a learning theory for these situations, and will study algorithmic ways to exploit them in natural language inference. The theoretical study will concentrate, on developing a semantics for the coherency conditions and study it from a learning theory point of view with a goal of understanding in what ways learning becomes easier and more robust in these situations. The algorithmic study will concentrate on developing ways to exploit coherency and will have a significant experimental component, using the problem of shallow parsing as a testbed for investigating chaining of coherent classifiers and inferences that rely on the outcomes of several classifiers This research will have a significant impact on theoretical research in learning and on our ability to perform higher level inference in natural language. It will help to resolve the contrast between the predicted hardness of learning and the apparent ease at which cognitive systems learn. Moreover, it will provide an understanding of how to exploit coherency in order to develop better learning and inference methods for these situations, and will result in an integrated learning approach to a variety of shallow parsing tasks, implemented and demonstrated in a large scale manner using the SNoW learning architecture. Incorporating the understanding of interacting classifiers, as well as methods to perform inferences that rely on several classifiers, into SNoW will be directly applicable to a variety of other tasks in this domain.<br\/><br\/> http:\/\/L2R.cs.uiuc.edu\/~danr\/Grants\/eareerOO.html","title":"CAREER: Learning Coherent Concepts: Theory and Applications to Natural Language","awardID":"9984168","effectiveDate":"2000-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["318715"],"PO":["491702"]},"48016":{"abstract":"EIA-9985991<br\/>Doug Burger<br\/>University of Texas-Austin<br\/><br\/>CISE Research Instrumentation<br\/><br\/>The Department of Computer Science at the University of Texas will purchase a cluster of high performance, multigranular workstations, dedicated to support research in computer and information science and engineering. The equipment will initially be used to support four research projects in the department. <br\/><br\/>The first project will use the cluster for detailed evaluations of future high-performance microprocessor designs. The second project will use the cluster to improve algorithms for reconstructing large evolutionary trees, with applications in evolutionary biology, pharmaceutical design, and linguistics. The third project will use the cluster to improve I\/O -intensive data mining simulations using numerical techniques. The fourth project will develop software support for scientific cluster-based computing, including support for effective heterogeneous job scheduling, low-overhead application fault-tolerance, and run-time dynamic load balancing. <br\/><br\/>The cluster will consist of heterogeneous machines, with varied quantities of memory, disk, and processors per machine. We will support several types of jobs submitted through a common interface: uniprocessor jobs, shared-memory parallel jobs, PVM message-passing jobs, and distributed-shared memory jobs. Our long-term goal is to build a centralized but scalable resource that can meet the needs of numerous scientific workloads concurrently.","title":"CISE Research Instrumentation","awardID":"9985991","effectiveDate":"2000-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["473862","261975","217452","424003","550986"],"PO":["301532"]},"48027":{"abstract":"EIA-9986015<br\/>Spiros Mancoridis<br\/>Drexel University<br\/><br\/>CISE Research Instrumentation: A Multidisciplinary Design Testbed of Research and Education<br\/><br\/>The design problems of the next century will require mixing diverse disciplines and computational tools in order to deliver new information services and physical products. The Department of Mathematics and Computer Science at Drexel University will address these challenges by building a design testbed that connects facilities and researchers engaged in diverse but complementary research projects; most importantly: (1) collaborative engineering design (2) intelligent mobile robot design (3) software design recovery (4) design of symbolic and scientific Problem Solving Environments. This testbed for education and research on multi-disciplinary design problems will consist of a gigabit network backbone (1 gigabit switch, gigabit Ethernet cards), shared computing resources (1 Sun compute server, 1 Sun disk server, 1 Sag Electronics RAID, 5 SGI workstations, 2 Dell workstations) and mobile robot experimentation materials (8 Lego kits, 1 Nomad Super Scout II).","title":"CISE Research Instrumentation: A Multidisciplinary Design Testbed for Research and Education","awardID":"9986015","effectiveDate":"2000-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["317120","521625","560676",122742],"PO":["301532"]},"47566":{"abstract":"Proposal 9984047<br\/>Seaman, Carolyn B.<br\/>University of Maryland Baltimore County<br\/>CAREER: Information Sources for Software Maintenance<br\/><br\/>This project consists of a series of empirical studies to understand how software maintainers gain information about the systems being maintained, with the goal of improving the quality and productivity of maintenance processes in general. It begins with an exploratory investigation of what factors need to be considered, including appropriate measures of effectiveness, an operational definition of information source, and identification of other relevant variables. Then current maintenance practices are studied to determine what sources are efficient, effective, and available in different situations. Finally, based on the results of the exploratory work, improvements to maintenance practice are proposed and empirically validated. The study designs incorporate a wide variety of research methods in order to triangulate findings and trade off different threats to validity. Industrial participation is crucial, not only to obtain valid and useful results, but also to ensure that the significant long-term potential of this work is realized. This work also includes an educational component consisting of two major activities: development of a software engineering course concentrating on the latter stages of the lifecycle (emphasizing maintenance), and extensive involvement of graduate and undergraduate students in software engineering research.","title":"CAREER: Information Sources for Software Maintenance","awardID":"9984047","effectiveDate":"2000-03-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["559100"],"PO":["564388"]},"47577":{"abstract":"This research focuses on understanding, modeling, and supporting human decision making in complex<br\/>situations such as manufacturing, aviation, process control, military and non-military command and<br\/>control and transportation. These situations are challenging, and can lead to potential problems and<br\/>human errors, because they are often rapidly changing, have uncertain and risky elements, and require<br\/>quick responses. To study these,issues, the project includes the development of interactive computer<br\/>simulations to allow experiments in which participants will make decisions in complex environments<br\/>such as process control or transportation. Planned experiments include investigating how people cope<br\/>with uncertain information when making decisions, identifying appropriate types of performance<br\/>information which may help people learn to make better decisions, and developing display formats and<br\/>visualizations to help people better understand uncertainty and how it may affect their decisions.<br\/>Research results will be relevant for the development of computer displays, decision-aids, and<br\/>training recommendations which can lead to improved decision-making performance. The project includes<br\/>educational components which are integrated with the research plan through the utilization of the<br\/>experimental simulations in course exercises and projects, through undergraduate and graduate student<br\/>involvement in the ongoing research, and through the incorporation of research results into course<br\/>materials.","title":"CAREER:Studies of Decision Making in Complex, Dynamic Environments","awardID":"9984079","effectiveDate":"2000-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["319517"],"PO":["495796"]},"47643":{"abstract":"CAREER - Development of a Unified Data-Management and Interaction Substrate: An Integrated research and Education Program for Enabling Distributed Computational Collaboratories<br\/><br\/>Simulating complex physical systems is the fundamental goal of scientific computing. These simulations have become so advanced that they are now seen as a new mode of doing science (joining theory and experiment). However, creating, running, and sharing them is still not an easy task because of the complexities in the work. This project will study ways to improve that situation.<br\/><br\/>The project will design, develop and evaluate a unified computational and interaction engine that can drive distributed computational collaboratories, and enable a new generation of realistic, interactive and immersive simulations. The fundamental innovation is the formulation of unifying multifaceted objects that can simultaneously support adaptive computations, interaction and control, analysis, and archival storage\/retrieval. The engine provides a distributed data-management and interaction substrate for these objects to enable a \"seamless\" integration of scalable parallel and distributed computing, interactive computational steering, collaborative visualization and analysis, and scientific databases and data archives. In the educational arena, the project will establish a comprehensive program in applied parallel and distributed computation. This will include development of a set of graduate and undergraduate courses integrating software engineering and application-oriented parallel computing and an instructional program at the high-school and college freshman level built on the technologies developed by the research component.","title":"CAREER: Development of a Unified Data-Management and Interaction Substrate: An Integrated Research and Education Program for Enabling Distributed Computational Collaboratories","awardID":"9984357","effectiveDate":"2000-03-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["558205"],"PO":["565272"]},"42881":{"abstract":"EIA-9911123<br\/>Herman Hughes<br\/>Michigan State University<br\/><br\/>CISE Research Instrumentation: Multimedia Data over Wireless Networks with Virtual Reality Applications<br\/><br\/>The Computer Science and Engineering and Telecommunication Department at Michigan State University (MSU) will purchase equipment for upgrading three existing research laboratories: High Speed Networking & Performance Lab (HSNP), Media and Entertainment Technologies Lab (MET), and Media Interface and Network Design Lab (MIND). HSPN supports a testbed that consists of an assortment of ATM equipment and the research focus has been on ATM technology issues, including wireless ATM networks. MET has workstations equipped with video capture and presentation facilities and the research emphasis has been on ubiquitous access to multimedia databases. The MIND Lab has an array of virtual reality facilities and the current research examines communication and human-computer interaction in virtual environments. These three labs will conduct collaborative interdisciplinary research, with the primary emphasis on the support of multimedia data streams over both wireless and hybrid networks, with the multimedia data being generated\/displayed by the research activities to take place in the MET and MIND Labs. <br\/><br\/>These three labs will conduct collaborative interdisciplinary research, with the primary emphasis on the support of multimedia data streams over both wireless and hybrid networks, with the multimedia data being generated\/displayed by the research activities to take place in the MET and MIND Labs. To carry out the proposed research MSU will purchase the following equipment: (1) t multimedia lap-tops, (2) 10Mbps WaveLan products, 2 video-on-demand servers, 2 head centered: 2 head's up status displays: info hemisphere, body centered data sphere, virtual tool belt, sensor array, lipstick camera, and microphones.","title":"CISE Research Instrumentation: Multimedia Data Over Wireless Networks with Virtual Reality Applications","awardID":"9911123","effectiveDate":"2000-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["196076","345982",108530,"140260"],"PO":["557609"]},"46951":{"abstract":"9981552<br\/>Cohen<br\/><br\/>This work will develop mathematical models of selection and interaction among populations. Projects will address: (1) conditions conducive to cooperation or mutualism, using the theory of finite games with random payoffs; (2) mathematical and statistical methods to measure the diversity of probability distributions in population biology, and applications of these methods to data in demography, ecology and population genetics; (3) the combination of data and models on food webs, body sizes and species abundances to give insight into the dynamics and stability of ecological communities; (4) patterns in the spatial distribution of populations, human and non-human, and the connection of these patterns with environmental factors. In each area, models will suggest data analyses while the results of the data analyses will help to shape further models.<br\/><br\/>This work aims to provide new useful concepts, mathematical models, and statistical tools in population biology, as well as new empirical generalizations and insights from the application of the tools developed here. These insights may assist society in coping with problems of human and non-human population change, biological and social cooperation, and conservation. To give a single example, from topic (3), a better fundamental understanding of the dynamics and stability of ecological communities would assist societies in preventing undesirable extinctions or invasions by unwanted biological species.","title":"Mathematical Models of Selection and Interaction Among Populations","awardID":"9981552","effectiveDate":"2000-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1127","name":"EVOLUTIONARY PROCESSES CLUSTER"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1174","name":"POPULATION DYNAMICS"}}],"PIcoPI":["519936"],"PO":["564220"]},"47128":{"abstract":"This project will extend the state of the art in high performance multilingual information access, both in terms of underlying science and its technological realization via a functional prototype for English and German in the biomedical domain. Heretofore, Cross-Lingual Information Retrieval (CLIR) was founded upon dictionary-based query translation methods or corpus-based statistical learning of vocabulary mappings, combined with various IR methods. The existence of large, well accepted ontological resources in biomedicine (e.g., MeSH and UMLS) enables a new interlingual approach wherein both queries and documents are mapped into multiple taxonomic categories automatically, permitting direct conceptual matching. This research will compare existing techniques (dictionarybased and corpus-based) with the new interlingual methods on various evaluative dimensions, such as I I-point average precision, computational tractability, and end-to-end user acceptability. To judge the latter, a full prototype system will be developed; that is the main focus of the European side of the project. In addition to developing and evaluating these new CLIR methods, and producing and evaluating a usable prototype application, this project will provide other benefits beyond CLIR proper improving IR precision via automated corpus-based word sense disambiguation; developing statistical methods for the creation of multilingual lexical and phrasal resources; providing automated on-demand summarization of retrieved documents using the Maximal Marginal Relevance method; and improving multilingual information access and management systems forthe biomedical domain.","title":"MLIAM: MUCHMORE: Multilingual Concept Hierarchies for Medical Information Organization and Retrieval","awardID":"9982226","effectiveDate":"2000-03-15","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V283","name":"CIA-HUMAN LANGUAGE & COMM PROG"}}],"PIcoPI":["388677","562858","562859","338010"],"PO":["565215"]},"42871":{"abstract":"EIA-9911095<br\/>Yunxin Zhao<br\/>University of Missouri<br\/><br\/>CISE Research Instrumentation: Advanced Human Computer Interfaces for Biomedicine<br\/><br\/>The Department of Computer Engineering and Computer Science at the University of Missouri-Columbia will purchase audio, video, and virtual reality (VR) equipment which will be dedicated to support research in computer and information science and engineering. The equipment will be used for several research projects.<br\/><br\/>1. Spoken Language Processing for Telemedicine and Collaborative VR Environments<br\/> Voice-driven automatic captioning in telemedicine for people with hearing disabilities<br\/> Speech separation and recognition for collaborative VR environments<br\/><br\/>2. Video Communications over Telemedicine Networks and Geometric Coding of Anatomical Data<br\/> Lips and hands focused real-time video coding for lipreading and hand-signing in telemedicine<br\/> Three-dimensional geometric coding for collaborative VR-based endoscopic simulator<br\/><br\/>3. Collaborative Virtual Endoscopy and Digital Human Atlas with Speech Interface<br\/> Prototype Intelligent Endoscopic Simulator (IES) for examining internal tissues and organs <br\/> Virtual operating table interface for teaching and examining complex multisource anatomical data","title":"CISE Research Instrumentation: Advanced Human Computer Interfaces for Biomedicine","awardID":"9911095","effectiveDate":"2000-03-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["201891","518498",108497],"PO":["557609"]},"47755":{"abstract":"It is well known that storage systems are becoming one of the biggest obstacles for many high-performance applications, due to the ever-widening speed gap between CPU and disks. The goal of this research is to overcome the performance limitation of traditional storage systems by developing and studying novel high performance, scalable, distributed storage systems. The research in this project will develop architectures of high-performance distributed storage systems that are scalable with a number of disks, with easy-to-use Application Programming Interfaces and high resource utilization. Moreover, data placing algorithms, which can perform dynamical load balancing and performance optimization, will be studied. To further improve the I\/O performance, the project will design distributed I\/O cache architectures that can significantly reduce I\/O read and write cost and benefit a wide range of workloads. Educational activities will include: developing new graduate-level courses that emphasize specially on the close interaction between computer architectures and operating systems; teaching paper reading, critical analysis and presentation skills for students; and integrating research and education.","title":"CAREER: Study of Scalable, High-Performance Distributed Shared Storage Systems","awardID":"9984852","effectiveDate":"2000-03-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["292906"],"PO":["180163"]},"49713":{"abstract":"0000713<br\/>Ammar<br\/>Description: This award is for support of a US-Egypt Workshop on Information Technology to<br\/>be held in Cairo, Egypt, March 12-14, 2000. The Egyptian co-organizer is Dr. Ayman El-Dessouki, President of the Electronics Research Institute in Cairo. The purpose of the workshop is to address some of the main topics that affect the changes taking place in the area of information technology (IT), which in turn are affecting life in most countries, including the United States and Egypt. The focus in this workshop will be on five areas: 1. Software development. 2. Evolution and trends in e-business. 3. Tele-computing for education and medicine. 4. Internet and information networking. and 5. Mobile\/satellite communications. The workshop participants will contribute to the proceedings, which will highlight areas of research where collaboration would be mutually beneficial.<br\/><br\/>Scope: This award will support a US-Egypt workshop in an area that is taking on increasing importance in most developing countries. It has assumed a central place in the developmental efforts in Egypt. The area is also in the middle of phenomenal expansion in the United States. There are associated issues such as: the global market for the information sector, the pervasive impact on the society in all sectors of activity, the effect on balance of trade for mature economies and for developing countries, and the effect on employment patterns. The US organizer is a well-known computer scientist with impressive credentials who is also quite familiar with the working scientific community in this field in Egypt. The Egyptian organizer is the president of the main governmental research organization dealing with this area. Participants are selected on the US side and on the Egyptian side to represent academia, governmental laboratories and private sector researchers. This proposal meets the INT objective of supporting US-foreign scientific collaboration in areas of mutual benefit. Funding for this project is provided by the Division of International Programs through the US-Egypt Joint Fund program, and by the Division of Electrical and Communications Systems, the Division of Computer-Communication Research, the Division of Experimental and Integrative Activities, and the Division of Information and Intelligent Systems.","title":"US-Egypt Workshop: Information Technology Research Trends in Network Based Environment, Cairo, Egypt","awardID":"0000713","effectiveDate":"2000-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"X376","name":"STATE-SCIENTIFIC AFFAIRS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["505744"],"PO":["540599"]},"47129":{"abstract":"This project, which will be carried out by a consortium of six partners in the US and Europe, aims to remove language barriers and enable the broad general public to do business on the internet via an effective cross lingual human to human communication facility. Two major obstacles toward this goal will be attacked: the domain limitation of speech translation systems, and the use of advanced multi-modal interfaces and their integration with language assistance functions. The PI's team will exploit a mixture of strengths in a multi engine approach, while also expanding the basic capabilities of the engines to enhance their robustness and portability. Prototype systems involving actual service providers will be configured and studied in the context of extensive e-commerce use. Four of the partners (CMU, University of Karlsruhe, IRST, CLIPS) are scientific institutions who have worked together for many years within the Consortium for Speech Translation Advanced Research (C-STAR) and have an elaborate and solid base of state-of-the art speech translation technology at their disposal. The two commercial partners (APT and AETHRA) will provide Web-based and video-conferencing infrastructure along with a user\/customer business community for extensive and realistic user studies. The prototype system (or set of systems) constructed in the course of the project will be tested and demonstrated via two showcase applications- one in the more limited travel domain, the other in a very broad help-desk scenario in which real users will conduct multi-modal and translingual e-commerce transactions. The technology resulting from this project will have immediate relevancy to numerous and diverse other applications that require natural language understanding in multi-modal settings.<br\/><br\/>I","title":"MLIAM: NESPOLE! - Negotiating through Spoken Language in E-commerce","awardID":"9982227","effectiveDate":"2000-03-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["496511","502549","338010","226262"],"PO":["246649"]},"42861":{"abstract":"EIA-9911074<br\/>Matt W. Mutka<br\/>Michigan State University<br\/><br\/>CISE Research Instrumentation: Emulate the Performance of Wide Area Networks<br\/><br\/>The Department of Computer Science and Engineering at Michigan State University will purchase computing and network equipment. This equipment includes two 24-port rackmount switches, an 8-port router, PCs for network emulation, four web servers, one RAID server, six mobile computing devices with wireless networking components, a wireless access point, and racks, monitors, and other devices to support the rackmounted system. This equipment will be used to implement the EMPOWER (EMulate the PerfOmance of WidE aRea networks) environment that will be dedicated to support research in computer science and engineering. EMPOWER enables the emulation of arbitrary network topologies, including interconnected host machines and routers contains both WAN ports and LAN ports. Beyond emulation of network bandwidth, drop rates and patterns, delay distributions, and background traffic, EMPOWER provides an excellent environment to implement and evaluate different QoS schemes (such as differentiated services) and label swapping schemes (such as MPLS). Current research includes emulation kernel design, routing table configuration, network statistics visualization, and GUI to configure the network easily.","title":"CISE Research Instrumentation: Emulate the Performance of Wide Area Networks","awardID":"9911074","effectiveDate":"2000-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[108468,"425148"],"PO":["301532"]},"46700":{"abstract":"Abstract<br\/><br\/>Broadband wireless communications has been identified as a national<br\/>imperative; it is deemed essential for maintaining the country's<br\/>premier position in information technology and accelerating the<br\/>advance of the information age. This research is aimed at enhancing<br\/>the performance of wideband wireless multiaccess systems by optimizing<br\/>tradeoffs between coding and spreading, capitalizing on advantages<br\/>afforded by spatial diversity, and developing techniques for<br\/>accommodating multirate users.<br\/><br\/>A goal of this research is to establish, through a careful modeling of<br\/>time dispersion and angular dispersion effects in wideband channels,<br\/>that signals spread continuously over the available time interval and<br\/>frequency band can send data with high reliability. When spatial<br\/>macrodiversity also is available, the investigators contend that<br\/>signals should be coded over spatial and spectral dimensions and their<br\/>energy spread \"continuously\" over time, frequency and space.<br\/><br\/>Linear signal space separation schemes have received considerable<br\/>attention as approaches for providing good tradeoffs<br\/>between throughput and system complexity in single-cell multiuser<br\/>environments. The efficacy of linear signal space separation schemes<br\/>diminishes substantially, however, when one generalizes to<br\/>multiple-cell environments. The goal in such realistic multicell<br\/>interference channels is to maximize a certain extension of classical<br\/>spectral efficiency herein called area-spectral efficiency. This research<br\/>investigates the validity of the contention that signals widely<br\/>dispersed in time, frequency and space (TFS-wide signals) are nearly<br\/>optimum in such environments and do not require the use of linear<br\/>signal separation at the receiver.<br\/><br\/>The investigators study various techniques for creating <br\/>TFS-wide signals in the wideband wireless environment, with an<br\/>emphasis on multicarrier signaling approaches. Provided the<br\/>forward channel does not fade quickly relative to the capacity of the<br\/>channel available for feeding back information from the receiver(s) to<br\/>the transmitter(s), DMT (discrete multitone) with dynamic bit loading<br\/>should prove to be a viable data transmission technique. Combined<br\/>with spreading that enables multiple access, DMT can be made to<br\/>provide both user separation and Shannon-optimal power distribution<br\/>relative to the short-term spectrum of the wideband channel with<br\/>fading and interference seen by each user. For cases where dynamic bit<br\/>loading proves infeasible, OFDM (i.e., DMT with an equal number of<br\/>bits in each subchannel) is being explored as a candidate modulation<br\/>scheme for broadband wireless signaling.","title":"Design Principles for Wideband Wireless Communications","awardID":"9980616","effectiveDate":"2000-03-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["508479","223414"],"PO":["188393"]},"47548":{"abstract":"This is the first year of funding of a 4 year continuing award. The goal of this project is to help machine learning make the leap from today's one shot, standalone applications to the ubiquitous, continuously functioning, seamlessly integrated web of learning systems of the future. The work will focus on four thrusts that are necessary to bring this about: (a) Scaling up machine learning algorithms so they can be applied to very large databases, and developing intrinsically scalable new algorithms; (b) Increasing the autonomy of learning systems through the use of automated data integration and improved overfitting avoidance; (c)Enabling learning systems to handle, data from heterogeneous sources and with different types of structure, such as the World Wide Web; (d) Educating a new generation of scientists to take advantage of the methodologies and tools provided by machine learning. If successful, the proposed work will lead to an order of magnitude or more increase in the size of databases to which machine learning algorithms can be usefully applied, to a significant reduction in the level of expertise required to develop and deploy a learning system, to learning systems that are able to function in environments of a greater variety and complexity than is currently the case, and to a new crop of scientists who are able to perform analyses that are currently beyond their reach with corresponding increase in the potential fornew discoveries and innovations.","title":"CAREER: Ubiquitous, Large-Scale Machine Learning","awardID":"9983932","effectiveDate":"2000-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["365926"],"PO":["491702"]},"42873":{"abstract":"EIA-9911099<br\/>Kanad Ghose<br\/>SUNY @ Binghamton<br\/><br\/>CISE Research Instrumentation: Research Infrastructure for Distributed and Data-Intensive Computing<br\/><br\/>The Department of Computer Science at Binghamton University will purchase components for a 32-node-dual-Pentium cluster and a closely coupled set of high-end workstations and servers, which will be dedicated to support research in computer and information science and engineering. The equipment will be used for several research projects, including in particular: (i) large-scale data visualization; (ii) distributed digital library; (iii) parallel discrete event simulation and (iv) object-based distributed computing infrastructure. All four projects require a distributed high-performance platform (as provided by the cluster). Moreover, the visualization and metasearch engine projects require large disk space and memory sizes to handle the immense data sets required by these applications (as provided by the high-end workstations and cluster node4s). The simulation and visualization projects need the high-bandwidth low-latency communication provided by the Myrinet SAN network. The choice of the cluster for the distributed platform is clear; the cost-effectiveness provided by tapping into the commodity component market makes them a superior value to custom parallel machines (shared Memory, NUMAs or MPPs). There is no equivalent (or comparable) infrastructure available in the department; this equipment will be critical to the success of all four projects.","title":"CISE Research Instrumentation: Research Infrastructure for Distributed and Data-Intensive Computing","awardID":"9911099","effectiveDate":"2000-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["494776","434747","451774","553586"],"PO":["557609"]},"53323":{"abstract":"0075691<br\/>Bekey<br\/><br\/>This workshop will attempt to identify fundamental and applied research issues associated with very large construction and manufacturing systems in space and\/or on the moon. Such issues will arise in connection with the assembly of solar power satellite systems (which may require the use of hundreds of autonomous, free-flying robots) and with the manufacture of photo-voltaic systems on the moon. The proposed workshop will concentrate on the system issues, including control, intelligence, cooperation, and self-replication. Partial support for the workshop has been obtained from NASA Headquarters.<br\/>***","title":"Workshop on Research Topics in Space Macrosystems: Autonomous Construction and Manufacturing for Space Electrical Power Systems to be held on April 5-7, 2000 in Washington, DC","awardID":"0075691","effectiveDate":"2000-03-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["362108",135899],"PO":["563109"]},"46635":{"abstract":"Abstract:<br\/><br\/>High speed, high volume cryptographic systems will<br\/>form the basis for the security of video, wireless,<br\/>and computer communications of the next decade. This<br\/>research involves the design and development of such<br\/>systems, especially that of hardware-based stream<br\/>ciphers. High speed hardware-based stream ciphers can<br\/>be easily manufactured, programmed, and implemented.<br\/>They can be used to encrypt data (such as voice or<br\/>video) in real time and are used as embedded<br\/>components in cellular telephones, GPS satellites,<br\/>radar, and radio systems. Most stream ciphers,<br\/>however, have been found to be vulnerable to various<br\/>cryptoanalytic attacks. This research involves the<br\/>development and analysis of new architectures for<br\/>sequence generators which have all the above<br\/>advantages but which are much more secure than<br\/>traditional architectures. They are also potentially<br\/>useful for a variety of other applications such as<br\/>sonar systems and Monte Carlo integration.<br\/><br\/>Linear feedback shift registers have proven especially<br\/>useful for the generation of pseudorandom sequences<br\/>for high speed communications. They have been<br\/>intensively studied for over forty years and their<br\/>usefulness does not appear to have any end in sight.<br\/>Recently a fundamentally new architecture for feedback<br\/>shift registers was discovered, the so-called<br\/>feedback-with-carry shift register or FCSR. This<br\/>architecture shares all the advantages of the linear<br\/>feedback architecture such as high speed and ease of<br\/>implementation and significantly expands the class of<br\/>easily generated and useful sequences. This research<br\/>involves a number of implementation issues for the new<br\/>architecture including (1) the development of parallel<br\/>circuitry for high speed generation of pseudorandom<br\/>sequences, (2) the design of combiners and feedforward<br\/>functions to increase the security of FCSR sequences, <br\/>(3) the design of clock-controlled FCSR circuits, and <br\/>(4) the analysis of the cryptographic security of the <br\/>FCSR sequences which are generated in this way.","title":"Collaborative Research: Fast Hardware Encryption","awardID":"9980429","effectiveDate":"2000-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["408476"],"PO":["188393"]},"47856":{"abstract":"Both researchers in high performance parallel computing and vendors of scalable server systems are actively studying the performance of hierarchical computer systems. There is now a consensus that the structure of the various software and hardware layers of a system (e.g. machine architecture, operating system, compilers, and user programs) has a great impact on the overall performance. Traditionally, systems have supported resource management at low levels of the hierarchy to allow better use of machinespecific features. More recently, higher-level libraries and application-specific operating systems have taken more of this responsibility so that they can use program behavior to determine resource use. Both approaches have disadvantages - the former is too application-independent, while the latter requires too many application-specific modules. This project avoids these problems by using compile-time information, program transformations, and smart runtime systems to efficiently use system resources. To do this, the compiler will rely on developments in Java mobile code, which will avoid pitfalls that have trapped previous research projects in this area.<br\/><br\/>The compiler that this project produces will analyze program-level behavior, generate program-specific system management code, and choose appropriate management policies automatically. It will make three important contributions: new compiler algorithms to analyze and optimize a program's utilization of system resources, precise models of network and storage devices to aid in resource management, and \"wide\" interfaces to system layers to enable management policies to be chosen by the compiler or runtime system. The project will integrate this research understanding with education by incorporating a wide variety of state-of-the-art tools into coursework. These tools will enable the students to better understand the tradeoffs between static and dynamic approaches to computing.","title":"CAREER: Compiler Aided Resource Management for Clusters","awardID":"9985304","effectiveDate":"2000-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["549890"],"PO":["551992"]},"43039":{"abstract":"EIA-9911626<br\/>Berque, David<br\/>DePauw University<br\/><br\/>Research Experiences for Undergraduates: Research Experiences In Computer Science for Students at Undergraduate Institutions<br\/><br\/>Berque, DePauw University, CISE\/REU sites The primary objective of this project is to encourage talented students enrolled at undergraduate institutions to pursue graduate study and research careers in Computer Science. The program directly impacts twenty-four students (eight per summer) by giving them first-hand experience with several of the most rewarding activities that characterize graduate study and research careers. research project topics are selected from the faculty mentors' current areas of interest. Students have full access to DePauw University's library and computing facilities including specialized equipment such as a 72\" diagonal touchsensitive interactive whiteboard which supports some of the projects. Each student has several opportunities to present his\/hers work more formally to other participants in the REU program, as well as to external audiences. Finally, the students have the chance to attend talks given by the faculty mentors and visitors, and to learn about the graduate school application process in part by visiting a major research university.","title":"REU: Research Experiences In Computer Science for Students at Undergraduate Institutions","awardID":"9911626","effectiveDate":"2000-03-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["298277","206846"],"PO":["329035"]},"46627":{"abstract":"The fundamental limits of performance for a general model of information retrieval from databases are studied. In the scenarios to be considered a large quantity of information is to be stored on some physical storage device. Requests for information are modeled as randomly generated sequences with a known distributions. The requests are assumed to be \"context-dependent\", i.e., to vary according to the sequence of previous request. The state of the physical storage device is also assumed to depend on the history of previous requests.<br\/><br\/>In general the logical structure of the information to be stored does not match the physical structure of the storage device, and consequently there are nontrivial limits on the minimum achievable average access times, where the average is over the possible sequences of user request. The propose research will apply information-theoretic methods to establish these limits. Preliminary results demonstrate the potential of such methods for this problem, giving very accurate results for some (relatively general) first cases.<br\/><br\/>Allowing redundancy in general can greatly lower the achievable access times, even when the amount added is an arbitrarily small fraction of the total amount of information in the dababase. Preliminary results establish the achievable limits both with and without redundancy for some simplified cases; very many interesting problems arise in general.","title":"Fundamental Limits for Information Retrieval","awardID":"9980416","effectiveDate":"2000-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["517335",119210],"PO":["348215"]},"49938":{"abstract":"This is funding to subsidize travel and housing expenses of students selected to participate in the Student Research Workshop to be held April 29-May 3, 2000 in Seattle, Washington during the ANLP\/NAACL 2000 joint conference (Applied Natural Language Processing and North American Chapter of the Association for Computational Linguistics). The intimate workshop format will encourage student participants to begin building a rapport with established researchers. Students will have sufficient time to present their research (25 minutes) and then receive feedback from a panel of established researchers in the field (15 minutes). The workshop will provide students with invaluable exposure to outside perspectives on their work at a critical time in their research, and will also allow them to put their work into perspective based on feedback from the panel and from fellow participants. This nurturing effort should pay dividends by more effectively guiding students in this rapidly changing research field, and seems to be an inexpensive yet effective means of encouraging young and upcoming computational linguists.","title":"Workshop: ANLP\/NAACL STUDENT RESEARCH WORKSHOP","awardID":"0001350","effectiveDate":"2000-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["246649"],"PO":["565227"]},"58529":{"abstract":"","title":"SGER: Exploratory Human-Centered Computing","awardID":"0096202","effectiveDate":"2000-03-01","expirationDate":"2002-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["202606"],"PO":["564456"]},"52722":{"abstract":"EIA-0073578<br\/>Baru, Chaitanya<br\/>University of California, San Diego<br\/><br\/>Digital Government: SGER: Evaluating Information Integration Architectures for a National Statistical Data Infrastructure<br\/><br\/>This grant will evaluate alternative information integration architectures, using as a testbed the Federal Electronic Research and Review Tool (FERRET). FERRET has been developed by the US Bureau of the Census, Bureau of Labor Statistics, and Centers for Disease Control to support dataset extraction and cross-tabulation of data collected by the Census' Current Population Survey. An additional partner will be the San Diego Association of Governments. The goals are to evaluate the scalability of the FERRET architecture and consider how emerging technologies such XML may be applied within that architecture.","title":"Digital Government: SGER: Evaluating Information Integration Architectures for a National Statistical Data Infrastructure","awardID":"0073578","effectiveDate":"2000-03-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["559496","560510"],"PO":["371077"]},"50005":{"abstract":"This funding is in support of an HCI research consortium (workshop) of promising doctoral students and distinguished research faculty. The consortium will be held in conjunction with the ACM 2000 Conference on Human Factors in Computing Systems (CHI 2000), sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI). The goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will also present their work during the technical program of the CHI 2000 conference. Extended abstracts of the students' work will be disseminated via publication in the CHI 2000 Extended Abstracts, which has wide print and electronic distribution. Evaluation of the consortium will be conducted by ACM SIGCHI's conference management committee, and results of the evaluation will be available to the organizers of future consortia.","title":"Workshop: Human-Computer Interaction Research Consortium (2000)","awardID":"0001543","effectiveDate":"2000-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["154611"],"PO":["565227"]},"47816":{"abstract":"This is the first year of funding of a 4 year continuing award. Multimodal user interfaces are likely to be the predominant interface of the future. These interfaces can take advantage of a wide variety of human perceptual and motor abilities, such as speech and gesture, to achieve a more natural human computer communication. This project addresses the current difficulty in building such interfaces. The P1 will create new interactive tools for designing multimodal user interfaces targeted at a range of devices, from the palmtop to the desktop to wall sized displays. These tools will support an iterative design methodology which supports the informal techniques designers currently use in the early stages of design, such as sketching, storyboarding, and \"Wizard of Oz\". Programming by demonstration will allow specification of events that are not screen based, such as speech I\/O or body gesture input. The goal is to allow designers to rapidly create \"rough cuts\" of their ideas, which can be quickly tested and modified. When ready, the designer can use these tools to generate user interface code for a variety of devices. This code can then be extended with the final interface details and application code. As an example application, the PI will apply the new tools to develop a set of informal presentation tools for classroom lectures. He will carry out both informal and controlled experiments to evaluate the effectiveness of the design tools and to inforin iterative refinement of both the tools and the example application. This research will result in new techniques for specifying visual and nonvisual input, which will be applicable to both multimodal and unimodal interface design tools, so that people can more easily create interfaces than is currently the case. The findings will also impact systems for people with disabilities (especially the vision impaired), as well as for mainstream users working in non traditional settings such as mobile and wearable computing.","title":"CAREER: Informal Tools for Multimodal User Interface Design","awardID":"9985111","effectiveDate":"2000-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["483342"],"PO":["565227"]},"42669":{"abstract":"This is the first year of funding of a 2 year continuing award. The increased interest in multilingual information processing, which requires detailed mappings between languages, has highlighted the need for international standards, and agreed upon evaluation\/validation procedures. We can no longer afford to (re)develop language resources for each new application; a shared broad scale platform of basic components is an absolute necessity as a common infrastructure to ensure the interoperability of systems through compatible interfaces and components that can be readily integrated and reused (plug and play). This project provides a framework for achieving international consensus on essential standards that would enable the sharing of resources and components on a global scale. The PI's approach builds on an already existing methodology for achieving consensus that has been developedvithin the EAGLES standardization initiative in Europe (http:\/\/www.ilc.pi.cnr.it\/EAGLES96\/rep2.html). The PI will spearhead the formation of an equivalent American group, AIGLES, the American Interest Group on Language Engineering Standards (also French for eagles), that will join forces with the Europeans in the development of International Standardization for Language Engineering (ISLE). The underlying philosophy of the effort will be not to prove the truth or correctness of a particular theoretical approach, but rather to agree on a common format that can allow the merger of multiple sources of information. In order to move forward rapidly, coarse distinctions will be made initially and the results laterrefiner. (an approach that was anathema some years ago). The work will focus on three distinct areas the P1 considers the most critical for continued progress in multilingual information processing: standardization of multilingual lexicons, with lexical semantics; standardization of paradigms fornatural interaction inmultimodal systems; evaluation of machine translation systems and spoken language systems.","title":"MLIAM: ISLE-International Standards for Language Engineering","awardID":"9910603","effectiveDate":"2000-03-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["511542","507484"],"PO":["246649"]},"50448":{"abstract":"High speed, high volume cryptographic systems will form the basis for the security of video, wireless,<br\/>and computer communications of the next decade. This research involves the design and development of such<br\/>systems, especially that of hardware-based stream ciphers. High speed hardware-based stream ciphers can<br\/>be easily manufactured, programmed, and implemented. They can be used to encrypt data (such as voice or<br\/>video) in real time and are used as embedded components in cellular telephones, GPS satellites,<br\/>radar, and radio systems. Most stream ciphers, however, have been found to be vulnerable to various<br\/>cryptoanalytic attacks. This research involves the development and analysis of new architectures for<br\/>stream cipher generators which have all the above advantages but which are much more secure than<br\/>traditional architectures.<br\/><br\/>Linear feedback shift registers have proven especially useful for the generation of pseudorandom sequences<br\/>for high speed communications. They have been intensively studied for over forty years and their<br\/>usefulness does not appear to have any end in sight. Recently a fundamentally new architecture for feedback<br\/>shift registers was discovered, the so-called feedback-with-carry shift register or FCSR. This<br\/>architecture shares all the advantages of the linear feedback architecture such as high speed and ease of<br\/>implementation, but the resulting pseudorandom sequences are also more secure. This research<br\/>involves a number of implementation issues for the new architecture including (1) the development of parallel circuitry for high speed generation of pseudorandom sequences, (2) the design of combiners and feedforward functions to further increase the security of FCSR sequences, (3) the design of clock-controlled FCSR circuits, and (4) the analysis of the cryptographic security of the FCSR sequences which are generated in this way.","title":"Collaborative Research: Fast Hardware Encryption","awardID":"0002693","effectiveDate":"2000-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["178655"],"PO":["188393"]},"47709":{"abstract":"This project presents a vision for satisfying the world's demand for software: increase programmer productivity by building programs out of large software components that can provide powerful abstractions, that can be seamlessly integrated with other components, and that can easily conform to different execution environments. Thousands of software libraries already exist to provide such components, but most fall far short of the goal of seamless efficiency on all platforms. This project will define and experimentally evaluate a new approach for tuning libraries using both domain-specific and machine-specific compiler optimizations. The key to the approach is an annotation language that conveys three types of information: library semantics, machine characteristics, and information about how library components will be composed. This advances other library techniques by encapsulating and exploiting domain-specific information to reap benefits of programming abstractions without incurring their usual efficiency costs.<br\/><br\/>The project will focus on three important opportunities for improving performance and portability: the extension of conventional scalar optimizations to library optimizations, the optimization of sequences of library calls, and methods for customizing libraries on different machines. The methods and results will be validated in experiments using the PLAPACK dense linear algebra library, MPICH message-passing library, and object-oriented languages such as Java. Research results expected from this project include a deeper understanding of the use of domain- and machine-specific information in the compilation process, new optimizations based on that information, and a compiler and language that can be used in testing the ideas. Just as this research seeks to improve the flow of information across interfaces, the project's educational component will attempt to bridge interfaces across disciplines and communities of the student population by creating a \"Fundamentals of Computer Science\" course for the institution's interdisciplinary Computational and Applied Mathematics program.","title":"CAREER: Compilation Techniques for Customizing Software Libraries","awardID":"9984660","effectiveDate":"2000-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["496821"],"PO":["551992"]}}