{"70526":{"abstract":"0203224<br\/>Ileana Streinu<br\/>Smith College<br\/><br\/>Workshops on Topics in Computational Geometry<br\/>This proposal is to support a series of annual problem-posing and problem-solving<br\/>workshops on emerging new topics in Computational Geometry, with applications in Graphics, Robotics, CAD, BioComputing, etc. The requested funds will support students, post-docs and some invited participants. The workshop is aiming at fostering collaborations between disciplines (mathematics, computer science, engineering), identifying new directions and problems to work on, and engaging representatives from under-represented groups in collaborative research opportunities (we anticipate about half of the participants to be female researchers or students). A new topic will be chosen each year by the organizer. A web page will be prepared for each workshop, which will include links to resulting publications. There will be no registration fee. The chosen location (Bellairs Research Institute of McGill University in Barbados, West Indies) already has a long tradition within our community (McGill researchers have very successfully organized such workshops on various topics for over 15 years, and the institute's facilities have been used by other academic institutions in the US and Canada). It allows for informal and very productive interaction, it has inexpensive lodging and is accessible via major US carriers at<br\/>reasonably priced airfare.","title":"Workshops on Topics in Computational Geometry","awardID":"0203224","effectiveDate":"2002-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550373"],"PO":["321058"]},"68081":{"abstract":"EIA-0136555<br\/>William B. Smith<br\/>American Statistical Association<br\/><br\/>Digital Government: Improving Statistical Literacy Through FedStats<br\/><br\/>This grant will support a planning process to develop concepts for research in user interfaces and forms of on-line learning and analysis to improve statistical literacy for the citizen. The proposer will work with an existing group of collaborating Federal statistical agencies, know as FedStats. FedStats has an award-winning web site, and collaborates with several Digital Government grantees; they are the appropriate agencies to engage in this work.","title":"Digital Government: Improving Statistical Literacy Through FedStats","awardID":"0136555","effectiveDate":"2002-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["131577"],"PO":["371077"]},"67490":{"abstract":"0133736<br\/>Yezzi, Anthony<br\/>GA Tech Res Corp<br\/><br\/>This research is centered around problems of segmentation in image processing. Segmentation, which may be described as the problem of locating meaningful regions within an image, is a crucial problem in medical imaging, military imaging, and a variety of other image based applications. The two goals of this research are to (1) advance the state of the art in image segmentation and (2) develop frameworks to solve segmentation jointly with other image processing problems. A key an example of (2) will focus around the problem of image registration (aligning common objects seen within two or more images). Tradiditionally, the problems of segmentation (locating the objects in each image) and registration (lining them up) are solved separately.<br\/>This research explores methods for solving such problems simultaneously, with the important benefit that one of the problems need not be fully solved before starting the solution of the other problem. The Principal Investigator's approach to problems (1) and (2) will draw strongly from the mathematical theories of differential geometry, curve and surface evolution, the calculus of variations, and partial differential equations (PDE's). PDE's comprise very natural and powerful mathematical tools due to their flexibility, ease of implementation, and mathematical rigor. Their current and previous applications to problems in image processing (including segmentation) have demonstrated their strong potential in this field.<br\/><br\/>Under the recommended level of support, the PI will make every attempt to meet the original scope and level of effort of this project.","title":"CAREER: Unifying Segmentation and Other Image Processing Problems via Variational PDE's","awardID":"0133736","effectiveDate":"2002-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["561949"],"PO":["564898"]},"67370":{"abstract":"This faculty early career development award supports integrated research and educational activities in the interdisciplinary area of computational cell biology at the College of William and Mary. Professor Smith is developing a computational model of the dynamics of Ca2+ regulation at IP3-sensitive Ca2+ release sites that includes both 1) stochastic activation and inactivation of IP3Rs consistent with current knowledge of IP3 diversity and 2) a realistic account of the buffered diffusion of intracellular Ca2+ leading to cooperative IP3R activity. This model will be used to test four specific hypotheses. First, an optimal density of type 1 IP3Rs leads to maximum release site activation (but not so for type 2 IP3Rs). Second, Ca2+ buffers influence release site activation in a manner dependent on density and subtype of IP3Rs. Third, release sites exhibit distinct kinetics of activation and inactivation depending on IP3R subtype. Fourth, the dynamics of Ca2+ regulation at release sites with tightly clustered IP3Rs are well-approximated by reduced models utilizing steady-state Ca2+ microdomain theory. In addition, Prof. Smith is directing several interdisciplinary graduate\/undergraduate research projects related to the statistical properties of IP3-sensitive Ca2+ release sites and the effect of IP3R clustering on global Ca2+ responses. Educational activities include curriculum development intended to increase the exposure of graduate and undergraduate students at William and Mary to quantitative approaches in cell and molecular biology. A new course entitled \"Cellular Biophysics and Modeling\" emphasizes diffusion, membrane transport, mass action kinetics, single channel recording of voltage- and ligand-gated ion channels, whole cell currents, compartmental modeling, plasma membrane electrical excitability, and dynamics in cell signal transduction. A second new course, \"Introductory Bioinformatics,\" exposes biology majors (with minimal background in computer programming) to the basic algorithms of computational molecular biology including sequence comparison, fragment assembly, phylogenetic tree construction, and secondary structure prediction. Both courses include an integrated computer laboratory. <br\/><br\/>This faculty early career development award supports computational cell biology research and education at the College of William and Mary. In most cell types an organelle called the endoplasmic reticulum (ER) has integrative and regenerative properties analogous to the excitable membranes of neurons. While insight into ER \"Ca2+ excitability\" has been obtained through the development of whole cell models of Ca2+ handling that are based on molecular mechanisms, a limitation of whole cell models to date is the assumption that IP3 receptors (IP3Rs) are globally coupled by the bulk (or average) cytosolic Ca2+ concentration. In order to overcome these limitations, Prof. Smith is developing computational models of the dynamics of Ca2+ regulation at IP3-sensitive Ca2+ release sites that focus on local coupling of IP3Rs mediated by the diffusion of intracellular Ca2+, a fundamental and significant aspect of cell signaling. Prof. Smith is also directing several interdisciplinary graduate\/undergraduate research projects related to the statistical properties of IP3-sensitive Ca2+ release sites and the effect of IP3R clustering on global Ca2+ responses. Educational activities include curriculum development intended to increase the exposure of graduate and undergraduate students at William and Mary to quantitative approaches in cell and molecular biology. Two new courses are being developed: \"Cellular Biophysics and Modeling\" and \"Introductory Bioinformatics,\" both of which involve an integrated computer laboratory.","title":"CAREER: The Dynamics of IP3-Sensitive Calcium Release Sites","awardID":"0133132","effectiveDate":"2002-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1108","name":"INSTRUMENTAT & INSTRUMENT DEVP"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1136","name":"SIGNAL TRANSDCTN\/CELL REGULATN"}}],"PIcoPI":["535576"],"PO":["362595"]},"67470":{"abstract":"Scaglione, Anna<br\/>Cornell U<br\/>0133635<br\/><br\/>\"Linear precoding methods for high bit rate wireless<br\/>transmission<br\/> over time-varying broadband channels\"<br\/><br\/>It is predictable that in the near future computing and multimedia applications will be supported by unique mobile devices that will be capable of transmitting and receiving various type of information (images, audio, data). These devices will use a unique interface based on the Internet, a common transfer protocol based<br\/>on IP and will be supported by ubiquitous wireless coverage. However, the communication technology used today is inadequate to support this progress without generating a spiraling demand for bandwidth. As bandwidth becomes a low-margin commodity, certain technological barriers need to be surpassed starting from the physical layer. Using the modulation paradigm that we refer to as \"linear precoding\" this project researches designs that allow high bit rate packet transmission over broadband frequency selective<br\/>time-varying channels. The block transmission model in the linear precoding framework provides a very general setting to determine the optimal or most cost-effective multiple access technique for packet transmission. The outreach of this project is the development of physical layer solutions for packet transmission that: 1) minimize the overhead bandwidth dedicated to training, error correction coding and precoding jointly; 2) adapt to time-varying channels ; 3) can incorporate an arbitrary number of<br\/>transmit and receive antennas; 4) can support multiple access packet transmission, allowing different quality of service requirements in terms of rate, decoding delay and complexity. The mathematical framework of linear precoding is not only an useful tool for research but also for teaching, since it allows a unified description of the principles of wideband and high bit rate transmission, including schemes such as antenna diversity, spread spectrum and multicarrier transmissions as special cases.","title":"CAREER: Linear Precoding Methods for High Bit Rate Wireless Transmission","awardID":"0133635","effectiveDate":"2002-06-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["550699"],"PO":["564898"]},"72091":{"abstract":"0208883<br\/>Kannan Ramchandran<br\/>University of California - Berkeley<br\/><br\/>Communicating by message-hiding or steganography (derived from the Greek words steganos meaning \\covered\" and graphein meaning \\to write\") goes back over two thousand years ago to the ancient Greeks as a way of communicating secretly to send important espionage infor- mation during war 1 . The theoretical foundations for this powerful communications paradigm are derived from the elegant information-theoretical framework of channel coding with side information (CCSI). CCSI refers to the problem of communicating over a noisy channel with some partial knowledge about the transmission channel (in the form of side information) avail- able at the encoder but not at the decoder. For example, in the multimedia data-hiding or watermarking problem, the side information might refer to a multimedia \\host\" signal such as an image or audio or video clip that is present only at the encoder, in which the message may be desired to be embedded. The rules of data-embedding are usually that (i) the host medium is minimally perturbed, implying that the embedded message be minimally intrusive; (ii) the embedded message can be reliably and robustly recovered by theintended decoder even in the presence of an intermediate \\attacker\" who, within the bounds of not rendering the embedded host signal unusable, might attempt to corrupt or erase the message or watermark.<br\/>While the field of information-hiding has its origins in covert communications, the scope of applicability ofthis paradigm is far more general, and extends to non-covert communication systems as well. Specifically, it turns out, rather surprisingly, that in general, the most e Ecient way to do digital broadcast is to follow the principles of data-hiding with users' messages being embedded in one another's. Indeed, the theoretically best-known achievable broadcast rates from information-theory to this day date back to the (unreadable) work of Marton [1], whose codebook construction is intimately connected to the methodology for data-hiding. Related to this are the works of Gelfand and Pinsker [2] on CCSI, and by Costa [3] on the so-called problem of \\writing on dirty paper\" where the punchline is to embed data by adapting to the host medium rather than by trying to \\overpower\" it. These ideas lay the theoretical foundations for the problem of information-embedding and form the core of this proposal.","title":"Communicating by Information-embedding: Theory, Algorithms and Applications","awardID":"0208883","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["521731"],"PO":["564898"]},"68582":{"abstract":"The investigator is studying the statistical properties of zeros and values of<br\/>L-functions in the context of random matrix theory. Random matrix models are <br\/>being used to conjecture the full asymptotic expansion and analytic continuation<br\/>for the moments of L-functions, and to make predictions for the statistical behavior <br\/>of ranks of elliptic curves. A C++ L-function class library along with a front end <br\/>application is also being developed for computing zeros and values of L-functions. <br\/>This software is being used by the investigator to numerically confirm the predictions <br\/>being made, and will be released freely to the public as a much needed tool for studying L-functions.<br\/> Many problems in number theory can be described in terms of the properties of <br\/>so-called L-functions. These functions, which encode profound information about various <br\/>number theoretic problems, have remained largely unyielding to mathematical analysis. <br\/>Many deep problems in number theory would be solved if one could understand these <br\/>functions in detail. Surprisingly, a seemingly unrelated field known as random matrix theory, a subject that originally arose in connection to experimental physics, has recently been found by number theorists and physicists alike to provide a framework in which to model the behavior of L-functions. This mysterious connection has been used successfully to make hitherto unimaginable predictions for the behavior of L-functions. The work in this proposal is concerned with exploring the connections between these two fields, number theory and random matrix theory. To assist in this project, the investigator is also preparing a software package, to be made freely available to the public, for numerically studying L-functions.<br\/> This award is being cofunded by the Algebra, Number Theory, and Combinatorics Program, the Numeric, Symbolic, and Geometric Computation Program, and the Computational Mathematics Program.","title":"L-functions: Zeros and Values","awardID":"0138597","effectiveDate":"2002-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["545808"],"PO":["565280"]},"67087":{"abstract":"CCR-0131862<br\/><br\/>Lunjin Lu<br\/><br\/>Semantic-based program analysis provides useful information to<br\/>compilers, debuggers and other program manipulation tools. Existing<br\/>frameworks for logic program analysis do not provide support for<br\/>backward or parametric analyses that are emerging as useful tools in<br\/>logic program development. Nor do they provide sufficient support for<br\/>context-sensitive analyses. The project seeks to create a new<br\/>framework that will support these new classes of analyses as well as<br\/>those supported by existing frameworks. The research focuses on (i)<br\/>developing systematic methods for designing parametric, backward and<br\/>context-sensitive analyses and methods for efficient computation of<br\/>these analyses; (ii) integrating research findings in logic program<br\/>analysis; (iii) implementing a software environment that facilitates<br\/>design, implementation and evaluation of program analyses; and (iv)<br\/>identifying, implementing and evaluating new program analyses. A<br\/>better understanding of parametric analysis, backward analysis and<br\/>context-sensitive analysis may be obtained out of the research and<br\/>that would provide a breakthrough in the field of logic program<br\/>analysis. This project plans to incorporate research results into the<br\/>classroom by developing and enhancing several courses in computer<br\/>science and software engineering. It also offers educational<br\/>opportunities for graduate and undergraduate students to work on<br\/>leading edge research projects.","title":"CAREER: An Integrated Framework for Semantic-Based Analysis of Logic Programs","awardID":"0131862","effectiveDate":"2002-06-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["227447"],"PO":["564388"]},"67461":{"abstract":"0133597<br\/>Saugata Basu<br\/>Georgia Tech<br\/><br\/>CAREER: Algorithmic Semi-algebraic Geometry and its Applications<br\/><br\/>Algorithmic semi-algebraic geometry lies at the heart of of many problems in several different areas of computer science and mathematics including discrete and computational geometry, robot motion planning, geometric modeling, computer-aided design, geometric theorem proving, mathematical investigations of real algebraic varieties, molecular chemistry, constraint databases etc. A closely related subject area is <br\/>quantitative real algebraic geometry. Results from quantitative real algebraic geometry are the basic <br\/>ingredients of better algorithms in semi-algebraic geometry and play an increasingly important role in several other areas of computer science: for instance, in bounding the geometric complexity of arrangements in computational geometry, computational learning theory, proving lower bounds in computational complexity theory, convex optimization problems etc.<br\/><br\/>The first goal of this project is to design optimal algorithms for several important problems of semi-algebraic geometry including the problems of computing the homology groups and stratifications of semi-algebraic sets.<br\/>Secondly, the methods and techniques of algorithmic real algebraic geometry will be applied to investigate <br\/>several open problems in discrete and computational geometry and to explore new connections, especially <br\/>in the area of computational topology. At the same time, several emerging applications of algorithmic semi-algebraic geometry will be investigated, especially in the area of constraint databases.<br\/>Additionally, practical implementations will be undertaken, in order to build a system able to compute topological invariants (such as the number of connected components, the Euler characteristic, the Betti numbers, the full homology groups) of given semi-algebraic sets. This will aim at bridging the current gap between the theoretically best algorithms, and the best practical implementations available.<br\/><br\/>The educational component of the project consists of developing an integrated cross-disciplinary <br\/>curriculum suitable for advanced under-graduate and beginning graduate students in mathematics and computer science. This would require no pre-requisite beyond college-level calculus and linear algebra, so that that the students can quickly absorb the mathematical background necessary for this line of research, and at the same time be in a position to make efficient implementations, which would make them<br\/>attractive to both industry and academia.","title":"CAREER: Algorithmic Semi-Algebraic Geometry and Its Applications","awardID":"0133597","effectiveDate":"2002-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550244"],"PO":["321058"]},"67362":{"abstract":"CAREER: A Unified Theory of Pseudorandomness<br\/>Salil P. Vadhan<br\/><br\/>During the past few decades, randomization has become one of the most<br\/>pervasive paradigms in computer science. The best known solutions to<br\/>many problems in algorithms, cryptography, reliable communication,<br\/>network design, combinatorics, and distributed computing surprisingly<br\/>involve making random choices. Thus randomness appears to be very<br\/>useful, but it is still not known to what extent it is truly<br\/>necessary. Thus, this research asks: is it possible to reduce or even<br\/>eliminate the need for randomness in the above settings? The<br\/>investigators address this question via the paradigm of<br\/>Pseudorandomness, which is the theory of efficiently generating<br\/>objects that \"look random\" despite being constructed using little or<br\/>no randomness.<br\/><br\/>Specifically, this research builds upon deep connections recently<br\/>discovered between four pseudorandom objects, namely pseudorandom<br\/>generators, expander graphs, error-correcting codes, and extractors.<br\/>The investigators seek to strengthen these connections and use them to<br\/>attack some of the open problems in the area, such as the construction<br\/>of expander graphs with optimal expansion, the derandomization of<br\/>space-bounded computation, and a complete understanding of the<br\/>relationship between derandomization and circuit lower bounds.<br\/>Students at all levels are involved in the research, including<br\/>undergraduates who explore conjectures about expander graphs through<br\/>computer experiments. The research is tightly integrated into new<br\/>courses being developed by the investigators, including a graduate<br\/>course on Pseudorandomness, which focuses on the unified theory that<br\/>is emerging; and an undergraduate course on Cryptography, which<br\/>emphasizes the role of pseudorandomness in modern cryptography.","title":"CAREER: A Unified Theory of Pseudorandomness","awardID":"0133096","effectiveDate":"2002-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["525639"],"PO":["499399"]},"67462":{"abstract":"0133599<br\/>Bronnimann, Herve<br\/>Polytechnic Univ of NY<br\/><br\/>Geometric computing, as applied in computer graphics, robotics, architecture, geographic information system, spatial databases, solid modeling, has penetrated every domain of science and engineering, from astrophysics to molecular biology to physical simulations and fluid dynamics. Recent years have witnessed a growing demand for two- and mostly three-dimensional computations. For the past two decades, computational geometers have investigated the mathematical foundations of this nascent field and have solved the asympotic complexity of basic geomteric problems. But theoretical solutions, while bringing valubable insight into the problem, hardly answerthe whole prob lem, and some research is needed on how to engineer these solutions to bring the benefits of these insights into practical solutions. <br\/>Specifically, we propose to study the geometric primitives and underlying the field of computional geometry and its many applications, and to develop geometric concepts for basic geometric objects and predicates as well as for 3D general subdivisions in various geometric concepts. The methodology of separating the development of concepts from ther implementation is inspried by the generic programming paradigm. This is an approach that has met with success in other fields of algorithm engineering (most notably the C++ Standard Template Library -STL). We also propose to continue our investigaion of non-robustness problems in geometric algorithms. One approach to solving the problem, which is more efficient than exact computation, is the exact predicate paradigm in which only the primitives leading to critical decisions are guaranteed to make the correct decisions, even if quantities are not computed exactly. We propose to study the efficient implementation and implications of the exact predicate paradigm. The educational part of this proposal strengthens the research program by proposing to write a textbook devoted to implementation issues in geometric computing, designed to provide a foundation to and complement the existing classical computaitonal geometry textbooks.","title":"Generic Software Foundations for Geometric Computing","awardID":"0133599","effectiveDate":"2002-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["280545"],"PO":["565157"]},"67484":{"abstract":"The experience of providing or receiving medical care has a very<br\/>personal dimension. Quoted from the Hippocratic oath:<br\/>\"Whatsoever I shall see or hear in the course of my dealings with<br\/>men, if it be what should not be published abroad, I will never<br\/>divulge, holding such things to be holy secrets\". The 1996<br\/>Health Insurance Portability and Accountability Act (HIPAA)<br\/>required the Administration to issue regulations protecting the<br\/>privacy of health information. Such a regulation gives consumers<br\/>the right to see, copy, and correct their own health information<br\/>and the right of being notified as to how their health<br\/>information is going to be used and shared. It also imposes new<br\/>restrictions on those who hold health information.<br\/>However, legal protection alone is not enough as it can only be<br\/>applied after the problem has occurred, when the damage has<br\/>already been done. Moreover, law enforcement is usually<br\/>expensive, slow, and complex. The goal of this project is to<br\/>design a comprehensive technical infrastructure that guarantees<br\/>the enforcement of health information privacy protection. The<br\/>problem of data protection and privacy is addressed on a<br\/>technical level, thus preventing any violation of a privacy<br\/>policy in advance rather than correcting it after it has<br\/>occurred. The intend of the project is to demonstrate that<br\/>health information privacy solutions can be designed to achieve<br\/>meaningful benefits without penalizing society with undue<br\/>financial burdens or worse, with the compromise of public safety.","title":"CAREER: Health Information Privacy Protection: System and Social Aspects","awardID":"0133698","effectiveDate":"2002-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2802","name":"TRUSTED COMPUTING"}}],"PIcoPI":["339640"],"PO":["543507"]},"72150":{"abstract":"INTERDISCIPLINARY WORKSHOP ON REPUTATION MECHANISMS IN ONLINE COMMUNITIES<br\/><br\/>This is an interdisciplinary academic symposium on Reputation Systems. The production of trust is an important requirement for forming and growing open online communities. Online reputation reporting systems, such as eBay's well-known feedback mechanism, have emerged as an important trust building mechanism in such settings. The rising practical importance of online reputation systems invites rigorous research in this largely virgin territory. Do these systems truly promote efficient market outcomes? To what extent can they be manipulated by strategic buyers and sellers? What is the best way to design them? How should buyers (and sellers) use the information provided by such mechanisms in their decision-making process? This is just a small subset of unanswered questions, which invite exciting and valuable research. This workshop will bring together scholars and practitioners from a wide range of disciplines whose research informs the analysis and design of reputation systems. The workshop chairs will prepare a report summarizing the conclusions of the symposium. The report will provide a snapshot of the current state of the field and an agenda for future research.","title":"Interdisciplinary Workshop on Reputation Systems in Online Communities","awardID":"0209136","effectiveDate":"2002-06-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["539967","276877"],"PO":["565227"]},"67365":{"abstract":"0133115<br\/>Charles D. Creusere<br\/>New Mexico State University<br\/><br\/>Efficient Audio Compression with Perceptually Embedded Scalability<br\/><br\/>The focus of this project is to develop compression formats for audio data that are better suited to the integrated wireless\/landline communications networks currently being developed and fielded. The heterogeneous nature of such networks demands a compressed storage format from which fine layers of audio fidelity can be extracted; thus, each listener on the communications network receives as many layers of audio fidelity (i.e., the best quality audio reproduction) that his or her communications channel can support, all extracted from this single compressed representation. An obvious application of such technology is music-on-demand over forthcoming wireless services like 3G cellular and Bluetooth. A finely layered or 'scalable' bit stream can also be used to improve the streaming of real-time audio over the Internet or a broadcast wireless channel by simplifying rate buffer control and error protection.<br\/><br\/>The research here concentrates on developing a high-performance compression algorithm whose scalability is optimized for perceptual performance over the entire range of output fidelities. Most of the audio compression algorithms in wide use today-- MP3 (MPEG audio layer 3), MPEG AAC, Dolby Digital, etc.-- do not support bitstream scalability. Within the frameworks of MPEG 2 and MPEG 4, fine-grained scalability is supported using a technique called bit slice arithmetic coding (BSAC). Unfortunately, subjective testing has shown that BSAC's scalability is not optimized for perceived sound quality at lower bitrates. To more closely tie the bit allocation process to the perceived quality, a non-uniform multirate filter bank is used here whose frequency resolution approximates that of the critical bands of human hearing. Quantization within each critical band is then performed in an optimal, multistage manner using both vector and scalar techniques.","title":"CAREER: Efficient Audio Compression with Perceptually Embedded Scalability","awardID":"0133115","effectiveDate":"2002-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["475507"],"PO":["564898"]},"76198":{"abstract":"Anna Scaglione<br\/>Cornell University<br\/><br\/>As the size,the cost and the power consumption of communication devices and integrated circuits de-<br\/>creases designing a system of autonomous sensors,that can monitor the environment and are capable<br\/>of transporting and processing the information in any point of the controlled area,becomes a concrete<br\/>goal.While the fabrication technology is mature to make intelligent sensors with wireless communication<br\/>interfaces which are small and inexpensive,the main challenge in the design of these networks is at the<br\/>system level. The scenario analyzed in [4 ]is radically di .erent from large networks such as the<br\/>telephone network that have highly hierarchical architectures:in [4 ]all the nodes have identical function-<br\/>alities,equal transmission bandwidth and are uniformly distributed over a circular region of .xed radius.<br\/><br\/>However,[4 ]is neglecting one fundamental aspect of the problem:the nodes samples will be increas-<br\/>ingly dependent as the density of the nodes increases [7 ].This observation was used in [8 ]where it was<br\/>proven that distributed codes,that compress separately the correlated samples in each node,can reduce<br\/>the amount of bits per node per square meter to an O (N .1 ),i.e.much faster than the transport capacity.<br\/>The limitation of the approach in [8 ]is the high complexity required to have signi .cant compression gain<br\/>without sharing one single bit of data among the nodes Fortunately,there is no need to impose such<br\/>constraint.After all,the trademark of multi-hop networks is that power e .cient transmission is achieved<br\/>when the data travel through several intermediate close-by nodes before reaching their .nal destination.<br\/>If neighboring nodes were jointly compressing the data before forwarding them remotely,they could save<br\/>many bits per sample while transmitting with the same or even greater precision.A good engineering<br\/>design is compelled to exploit this fortunate coincidence by combining routing and and classical (not dis-<br\/>tributed)source coding.This is the truly novel aspect of our project and,to the best of our knowledge,<br\/>this connection has not been studied before.","title":"SGER: Routing and Data Compression in Multi-Hop Sensor Networks","awardID":"0227676","effectiveDate":"2002-06-15","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["550699","228373"],"PO":["564898"]},"72030":{"abstract":"The research in this proposal aims to advance fundamental<br\/>knowledge of routing methods that trade off optimality in return for<br\/>space, time, locality, fault-tolerance, and adaptability to changing<br\/>network topology. The study of multi-criteria routing problems is also<br\/>commenced, where for even the most natural and simply-stated multi-criteria<br\/>routing problems, there are typically only heuristics known. The goal<br\/>is to produce methods that trade off some optimality of the solution<br\/>in returned for lowered computational resurces, in a quantifiable way. <br\/><br\/>Approximate shortest-paths, compact routing, and distance labeling<br\/>problems will be studied, along with their extensions to directed<br\/>networks, dynamic networks, and multi-criteria formulations <br\/>incorporating different tradeoffs of time and space with measures of<br\/>risk and reliability.","title":"Algorithms for Approximate Routing Problems","awardID":"0208629","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["389398"],"PO":["499399"]},"66695":{"abstract":"Internet Data Centers are built by clustered high performance servers, workstations, and PCs, where the size of the cluster ranges from LAN (local area networks) to WAN (wide area networks for metasystems and for grid computing). The data centers not only provide data searching\/storage services, but also provide large scale computing services. Effective resource management presents important and challenging research and development issues to be addressed in the areas of scalability and reliability. Cluster-based data centers provide us with tremendous opportunities for aggregating huge amounts of information and computing resources in a cost-effective way, but it is harder to build distributed data centers that are efficient. <br\/><br\/>This exploratory award will investigate several areas of research in resource management in distributed systems based on the core technology of being able to monitor and predict the usage of resources in a distributed system: (1) development of a unified network and system information extraction tool for performance prediction, and data center resource utilization; (2) modeling of and profiling network behavior and activities; and (3) development of dynamic scheduling schemes and their implementations for optimal utilizations and management of global resources in Internet data centers including networks, memory, and I\/O systems. The result will be the identification of the most promising line of research for future investigations.","title":"SOFTWARE: Building High Performance and Reliable System Infrastructure for Clustered Scientific Data Centers","awardID":"0129883","effectiveDate":"2002-06-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["418746","551992"],"PO":["543507"]},"73087":{"abstract":"The proposal is to establish a US-EU\/DELOS working group on \"Digital Imagery for Significant Cultural and Historical Materials\". The working group will meet over the next year to discuss and evaluate fruitful joint activities and research paths for collaborative activities in this general topical area. The EU component of the effort is funded and managed by the DELOS Forum, a major organizer of digital libraries research and planning activities in Europe. DELOS receives support from the Information Societies Technologies (IST) 5th Framework Programme of the European Commission.<br\/><br\/>This effort continues the planning and assessment activities begun by an earlier NSF-EU working groups' process. In their final report \"An International Research Agenda for Digital Libraries\", delivered in Brussels in October 1998, increased levels of collaboration and interaction was seen as critical to building multi-lingual, multi-national digital libraries. The objective of the new working groups, of which this is one, is to define a research agenda on a specific topic and identify areas and activities for cooperation between EU and US researchers. The efforts of this particular group take the next step in the planning process by assessing fruitful research activities and resource development related to digital imagery collections.","title":"Travel Support for Activities of DELOS-NSF Working Group on \"Digital Imagery for Significant Cultural and Historical Materials\"","awardID":"0213423","effectiveDate":"2002-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["230874"],"PO":["433760"]},"67455":{"abstract":"This is a Faculty Early Career Development (CAREER) award. This project will improve our ability to solve problems in constraint satisfaction, which is a central paradigm for modeling and solving various problems in computer science, engineering, and management. It will do so by designing and evaluating algorithms that discover and exploit the structure embedded in the model of a decision problem formulated as a Constraint Satisfaction Problem (CSP). In particular, the work will investigate how symmetry relations, specified as interchangeability, can be used to build compact and faithful abstractions of CSPs. The goal of these investigations is not only to enhance the performance of solving CSPs, but also to support interactions with human users by allowing them to build and navigate over landscapes of solution spaces. Such techniques will institute a new paradigm in problem solving by making a computer perform as an active, informed assistant rather than as a passive black box. The project's education plan combines curriculum development, course teaching, and individual mentoring of students.<br\/><br\/>This CAREER award recognizes and supports the early career-development activities of a teacher-scholar who is likely to become an academic leader of the twenty-first century. Constraint satisfaction is most commonly used in scheduling and resource allocation applications, as well as in artificial intelligence planning and collaborative problem-solving. Therefore, this research will improve the techniques available to solve very difficult practical problems in a variety of fields.","title":"CAREER: Detecting Interchangeability Relations in Constraint Satisfaction Problems and Exploiting them in Problem Solving and Interactions with Users","awardID":"0133568","effectiveDate":"2002-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["486544"],"PO":["387198"]},"67367":{"abstract":"This is a Faculty Early Career Development (CAREER) award. The project is designed to develop fundamental principles for natural language interfaces for the next generation of intelligent tutoring systems. Natural language interfaces to instructional and educational applications need both knowledge about how to act in a domain and communication knowledge about how to talk about acting in the domain. This project seeks to overcome the domain dependence of natural language interfaces that prevents them from being portable to other domains. It will accomplish this in two ways. First, the research will elucidate the difference between domain dependent and domain independent communication strategies. Second, it will develop a methodology, algorithms and tools to semi-automatically derive domain and communication knowledge from text and dialogues. An innovative aspect of this work is the role played by the lexical semantics of action verbs to acquire domain knowledge represented as action schemas. Among the instructional domains addressed by this research is computer science. The fact that the work concerns tutoring systems integrates the research and education components of the work, through class evaluation and undergraduate participation in research.<br\/><br\/>This CAREER award recognizes and supports the early career-development activities of a teacher-scholar who is likely to become an academic leader of the twenty-first century. Success in this research will enable the construction of improved computerized tutors, as well as advancing the general field of natural language processing. A specific educational focus is mentoring women at the undergraduate and graduate level, and supporting girls in choosing science and engineering as a career.","title":"CAREER: Automatic Knowledge Acquisition for Natural Language Interfaces to Educational Applications","awardID":"0133123","effectiveDate":"2002-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["402663"],"PO":["565215"]},"70470":{"abstract":"This funding provides support for the Principal Investigator to sponsor a visit for five researchers from Latin America to the Center for Indigenous Languages of Latin America at the University of Texas. The guests will participate in activities and a conference focusing on preserving oral indigenous languages. Activities in this area are regarded by many as essential to prevent the disappearance of these languages and the knowledge and cultural assets they embody from the human record. It has been documented that indigenous languages around the world are disappearing at an alarming rate. The Digital Libraries Initiative is funding several projects focusing on the capture and retrieval of audio content and transcripts. Having indigenous linguists present and involved in centers which are focusing on preservation of indigenous languages using digital technologies is essential to the overall success of the endeavor.","title":"Linguistics in the Service of Indigenous Languages","awardID":"0203052","effectiveDate":"2002-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["475248","413136"],"PO":["564456"]},"75860":{"abstract":"This award will support approximately 16 graduate students to attend the ACM SIGMOBILE International Conference on Mobile Computing and Networking (MobiCom 2002) to be held in Atlanta, Georgia in September 23-26, 2002. This is a premier networking conference on mobility and data management and services in wireless environments.","title":"2002 ACM MobiCom Student Travel Support; Atlanta, GA; September 23-26, 2002","awardID":"0225521","effectiveDate":"2002-06-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["521384"],"PO":["234222"]},"72263":{"abstract":"THIS IS A SGER","title":"SGER: Vision-Realistic Rendering","awardID":"0209574","effectiveDate":"2002-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["518667"],"PO":["532791"]},"66653":{"abstract":"Pervasive Information Communities Organization (PICO) is a framework to<br\/>create mission-oriented dynamic communities of software agents that perform tasks<br\/>on behalf of users and devices. PICO provides automated continual services to<br\/>improve quality of life, and to utilize resources efficiently by enhancing<br\/>existing Internet services. PICO enabled Internet will be used effectively<br\/>in many dynamically changing time-critical applications that demand<br\/>proactive real-time collaborations among physical devices, software agents,<br\/>and personnel in heterogeneous environments.<br\/><br\/>The main components of PICO are software entities, called delegents<br\/>(intelligent delegates) and hardware entities, called camileuns (connected,<br\/>adaptive, mobile, intelligent, learned, efficient, ubiquitous nodes).<br\/><br\/>The novel features of PICO include: i) creation of mission-oriented dynamic<br\/>communities of software agents, ii) QoS management for just-in-time<br\/>communication and proactive collaboration among communities, and iii)<br\/>adaptability to dynamic environments through context- and<br\/>location-awareness.<br\/><br\/>As a pervasive computing paradigm, PICO has applications in many domains<br\/>such as telemedicine, the military, crisis management, and many day-to-day<br\/>activities. In this project the researchers focus on the design and development of PICO,<br\/>and investigate its applicability as a platform for distributed<br\/>collaborations. Through telemedicine applications, the researchers demonstrate the full<br\/>potential of PICO as an Internet enhancement framework that is not only<br\/>unique, simple, and versatile, but can also work with current and future<br\/>hardware\/software tools. Specifically, the proposed tasks include: formal<br\/>specifications, design, and development of PICO architecture; requirements<br\/>analysis for telemedicine scenario; QoS and resource management; PICO<br\/>prototype development; and validation, performance evaluation and<br\/>benchmarking. PICO-enabled pervasive environments will revolutionize the way<br\/>the Internet is being used, enhance quality of life and promote user-centric<br\/>applications. The PICO project will result in the training of students in<br\/>pervasive computing, high quality masters and doctoral theses, and transfer<br\/>of technology to health care providers, professionals and other researchers.","title":"Pervasive Information Community Organization (PICO): A Framework for Internet Services of the Future","awardID":"0129682","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["564777","559679",172780,"516651","486502"],"PO":["7594"]},"77697":{"abstract":"EIA-0091534<br\/>Francis J. Harvey<br\/>University of Kentucky<br\/><br\/>Digital Government: Bringing Government and Citizens Together: A Metadata Extension Test-bed for the Kentucky Spatial Data Infrastructure (KYSDI) Clearinghouse.<br\/><br\/>The planning grant will enable us to undertake research on developing a Metadata extension for spatial data integration involving citizens and government. We propose to focus on establishing the parameters for improving citizen involvement in the project and developing a prototype application to assess technical issues. These activities will be the basis for emphasizing four key themes: semantic interoperability, human-computer interaction, inter-agency collaboration, and citizen access in a revised submission to the digital government program.","title":"Digital Goverment: Bringing Government and Citizens Together: A Metadata Extension Test-bed for the Kentucky Spatial Data Infrastructure (KYSDI) Clearinghouse","awardID":"0234190","effectiveDate":"2002-06-20","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["351165"],"PO":["371077"]},"67313":{"abstract":"This is a Faculty Early Career Development (CAREER) award. The research will develop techniques for computer systems to communicate technical arguments to people without technical training, using integrated text and data graphics. It will integrate empirical methods from computational linguistics and human-computer interaction. Empirical methods will be used to determine appropriate techniques for conveying technical arguments to people with non-technical backgrounds. Initially, the project will develop analytical methods based on a corpus of human-authored multimedia presentations. For example, corpus studies can determine which features of arguments suggest where supporting graphics should be placed. Next, human-computer interaction experiments will be used to determine the effectiveness of techniques based on the analytical models, and to investigate alternatives to the techniques that are shown not to be sufficient. The resulting empirically-based techniques will be incorporated into computational models that will extend current approaches in natural language generation, automated graphic design, and intelligent multimedia presentation systems. The computational models will be demonstrated with a prototype system for genetic counseling. The educational component of this project will include new course curriculum, provide undergraduate and graduate computer science students with the opportunity to participate in research, and develop a laboratory for human-computer interaction studies that will be a resource for students and other faculty members.<br\/><br\/>This CAREER award recognizes and supports the early career-development activities of a teacher-scholar who is likely to become an academic leader of the twenty-first century. Her research seeks solutions for the problem that people who lack appropriate technical training are faced with increasing responsibility for making vital decisions based on technical arguments, often involving quantitative and statistical data. If successful in the area of genetic counseling, the approach could be applied to many other areas where decision makers need help in using technical information and analyses.","title":"CAREER: Intelligent Argument Generation in Text and Information Graphics","awardID":"0132821","effectiveDate":"2002-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[174528],"PO":["564316"]},"77125":{"abstract":"This research is being done in conjunction with IIS-9731990, which is being<br\/>performed by Michael Pazzani in the Information and Computer Science<br\/>Department at the University of California, Irvine. The research is<br\/>concerned with intelligent decision aids that can be developed by data<br\/>mining techniques. Experience has determined that such systems can learn<br\/>accurate models, but that experts in areas where those models are used in<br\/>decision aids are often reluctant to trust them because they do not, for<br\/>instance, use the same tests intermediate conclusions or abstractions that<br\/>the experts have grown to trust. Or they do not use certain factors at all<br\/>that experts feel to be relevant. Experts also want models that are stable<br\/>under small changes in the data being analyzed. Psychologists have<br\/>discovered factors that simplify the learning, understanding, and<br\/>communication of category and process information by humans. This research<br\/>seeks to explore these psychological principles in light of the output of<br\/>existing KDD algorithms and then go on to develop and evaluate new KDD<br\/>algorithms that will provide output that is easy for people to learn , use,<br\/>and communicate to others. With the results of this research, it should be<br\/>possible to make such decision aids more \"human centered\", so that they<br\/>will be used more often and more effectively in practice.<br\/><br\/>http:\/\/www.gatech.edu\/psychology\/faculty.htm","title":"From Computer Data to Human Knowledge: A Cognitive Approach to Knowledge Discovery","awardID":"0231639","effectiveDate":"2002-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[201220],"PO":["564456"]},"70493":{"abstract":"ABSTRACT<br\/>0203113<br\/>Monteiro, Renato <br\/>GA Tech Res Corp -GIT<br\/><br\/>In a semidefinite programming (SDP) problem, a linear function of a symmetric matrix variable X is minimized subject to linear equality constraints on X and the essential constraint that X be positive semidefinite. Many mathematical optimization problems can be cast as SDP problems including linear programs, convex quadratic problems with convex quadratic inequality constraints, matrix norm minimization problems, and a variety of maximum and minimum eigenvalue problems. In addition, SDP has many applications in combinatorial optimization, engineering, statistics, and robust optimization.<br\/><br\/>Today, there are numerous algorithms and codes available for solving SDPs, and these methods can be loosely grouped into two classes: second-order interior-point (IP) methods and first-order nonlinear programming (NLP) methods. The choice of which class to use for a particular application is determined primarily by<br\/>problem size --- second-order IP methods are more efficient on small- to medium-scale problems while first-order NLP methods are better for large-scale problems.","title":"Collaborative Research: Theory and Implementation of Semidefinite Programming and its Applications to Combinatorial Optimization","awardID":"0203113","effectiveDate":"2002-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["540935"],"PO":["321058"]},"75531":{"abstract":"EIA-0223737<br\/>Soffa, Mary L.<br\/>Univ of Pittsburgh<br\/><br\/>Group Travel Grant For Faculty at Minority Institutions to Attend FSE-10<br\/><br\/>This proposal, supporting travel by faculty from institutions with a large minority or female enrollment, represents an effort to improve the representation of women and minorities in CS. Organized by the ACM SIGSOFT, the Conference on the Foundations of Software Engineering (FSE-10), will be held in Charleston, South Carolina, November 20-22, 2002. Its organizing committee for 2002 developed a plan to help increase the participation of faculty from institutions with a large minority and\/or female student enrollment. Faculty actively involved with the education of women and minorities will be invited to attend FSE-10 tutorials and conference. Institutions that include Historically Black Colleges, current and former women's colleges, and other colleges with large minority enrollments will be targeted. As part of the tutorial series, tutorials will be provided for the selected faculty that contribute in teaching and stimulating interests in software engineering. The effort is expected to transitively develop the student's interest.","title":"Special Projects: Group Travel Grant: Faculty at Minority Institutions to attend Conference on the Foundations of Software Engineering (FSE-10), Nov 20-22, 2002, Charleston, SC","awardID":"0223737","effectiveDate":"2002-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["438734"],"PO":["557609"]},"68502":{"abstract":"ABSTRACT<br\/>0138308<br\/>Olvi Mangssarian<br\/>U of Wisconsin-Madison<br\/><br\/>Support vector machines (SVMs) have played a key role in broad classes of problems arising in various fields. Much more recently, SVMs have become the tool of choice for problems arising in data mining. This proposal de-scribes some aspects of support vector machines that the proposer would like to study and contribute further to. These include: generalized SVMs (a gen-eral mathematical programming framework for SVMs), unconstrained SVMs (a strongly convex minimization reformulation of SVMs solvable by a fast<br\/>finite method), Lagrangian classification (an unconstrained Lagrangian rep-resentation of SVMs leading to an extremely simple iterative scheme capable of solving classification problems with millions of data points) and reduced data classification (a rectangular kernel classifier that is characterized by as little as 1% of the data).","title":"Mathematical Programming in Data Mining","awardID":"0138308","effectiveDate":"2002-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["277902"],"PO":["399214"]},"69954":{"abstract":"This U.S.-Czech materials research project involving Ctirad Uher of the University of Michigan and his Czech partner, Petr Lostak at the University of Pardubice, will build upon their recently reported observation of long-range ferromagnetism in a class of ansiotropic semiconductors based on antimony telluride [Sb2Te3], doped with a minute amount of vanadium. They now plan to study the effect of transition metal ions incorporated in the crystal lattice of Sb2Te3 single crystals with the goal of identifying dopants that enhance the Curie temperature beyond the vanadium-doped value (~25K). Specifically, the researchers will examine the role of chromium, manganese, iron, nickel and cobalt. The collaborative effort benefits from the Michigan group's expertise in transport and magnetic properties of tetradymite-type structure semiconductors and the Czech partners' strengths in growth of single crystals and characterization of these materials. Results in this area of diluted magnetic semiconductors may lead to applications in information technology given the promising dual features of charge carrier transport and spin manipulation in thin films. <br\/><br\/>This collaborative project in condensed matter physics fulfills the program objective of advancing scientific knowledge by enabling experts in the United States and Central Europe to combine complementary talents and share research resources in areas of strong mutual interest and competence.","title":"U.S.-Czech Republic Materials Research on Novel Magnetic Semiconductors Based on Antimony Telluride [Sb2Te3]","awardID":"0201114","effectiveDate":"2002-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["303456"],"PO":["561352"]},"67413":{"abstract":"The objective of this project is to advance theory and practice in the design, modeling and control of high performance communication networks. The scope of the project encompasses system-level issues in high-speed wireline networks, and interconnecting of wireline\/wireless networks. The research component of the project will be directed in three focus areas: (1) switch architectures and control algorithms for high speed networks; (2) mobility, connectivity and control of wireless networks; and (3) network modeling and simulation methodologies. Our proposed program of research in these areas is expected to make significant contributions to the design, modeling and control of large-scale, high-speed, heterogeneous communication networks. Research and education will be integrated through the following activities: (1) supervision of graduate and undergraduate research projects; (2) co-authoring of a graduate level two-volume textbook on modeling and analysis of high performance networks; (3) teaching of undergraduate and graduate level courses in the area of communication networks; and (4) development and maintenance of an up-to-date data networking laboratory that will provide students with hands-on experience in the operation and configuration of modern networks.","title":"CAREER: Design, Modeling, and Control of High Performance Communication Networks","awardID":"0133390","effectiveDate":"2002-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["511513"],"PO":["325495"]},"68997":{"abstract":"This award will provide support for approximately 20 participants (graduate, post-docs, and junior faculty) to attend the IEEE INFOCOM 2002 Conference being held in New York, NJ on June 23-27, 2002. INFOCOM is a major conference in networking, which focuses on state-of-the-art research in all areas of computer networking and data communications.","title":"Travel Support for IEEE INFOCOM 2002 Conference; New York, NY; June 23-27, 2002","awardID":"0140082","effectiveDate":"2002-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[178708],"PO":["234222"]},"67787":{"abstract":"EIA - 0135257<br\/>Grosch, Herbert<br\/><br\/>TITLE: Completion of Computing History Memoir<br\/><br\/><br\/>The investigator has published two editions of an autobiography\/history intended to cover the early years of the computer revolution. The first edition, in hardcover, called COMPUTER [see B. in Biographical Sketch], ran through mid-1959 and ended with his first departure from IBM. The second edition, on CD\/ROM, was produced under NSF auspices (Grant No. CDA-9622944) and also covered the subsequent years through mid-1967, when the investigator was drafted to re-launch the Center for Computer Sciences and Technology at the National Bureau of Standards now NIST. The material added to the second edition was primarily concerned with the international computer scene, and included a visit to Japan in 1960 and two long tours of European user installations and European manufacturers on behalf of the young Control Data Corporation, in 1962. On the domestic side, the second edition ended with the investigator's direction of an Air Force-funded research project in computational linguistics for GE Santa Barbara.<br\/>It is proposed to carry the memoir through six years at NBS, three as director of CCST and three as Senior Research Fellow after IBM requested his removal from the earlier post for halting all Federal procurement of the new System\/3 (which was withdrawn some years later). The investigator emerged to become the first editorial director of the burgeoning newspaper COMPUTERWORLD, which was to be the foundation of the McGovern IDG empire.","title":"Completion of Computing History Memoir (II)","awardID":"0135257","effectiveDate":"2002-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":[175531],"PO":["564181"]},"67435":{"abstract":"Internet data traffic is doubling each year. If this rate continues,<br\/>data traffic will surpass voice traffic around the year 2002. However,<br\/>not included in the Internet traffic growth rate estimates are the<br\/>potential data generated by web phones and mobile web-enabled PDAs,<br\/>nor are the effects of future, unforeseen ``killer apps'' that may<br\/>great increase the current demand for bandwidth. Thus, the data growth<br\/>rate could be significantly higher in the aggregate and at the very<br\/>least, some ``hot sites'' may experience a quadrupling of traffic each<br\/>year. Unfortunately, due to technological barriers, bandwidth growth<br\/>rates per fiber will be limited to only doubling per<br\/>year. Consequently, short falls in available bandwidth may result,<br\/>thus placing the burden to effectively manage bandwidth on overworked,<br\/>network management teams. Network managers will require techniques and<br\/>tools that enable them to \"nowcast\" not only their local network, but<br\/>surrounding networks as well in order to ensure, stable, effective<br\/>bandwidth allocation in the face of dynamic, high-bandwidth, next<br\/>generation ``killer web apps''.<br\/><br\/>To address this \"nowcasting\" problem, we propose the use of a new<br\/>parallel simulation modeling technique called \"reverse<br\/>computation\". Here, network models designed for parallel execution are<br\/>able to execute both forwards and backwards in simulated time. For<br\/>simplistic network models, reverse computation has been shown to<br\/>reduce the state memory requirements of parallel optimistic<br\/>simulations by a factor of 100 and increase the overall speedup by a<br\/>factor of 6 when compared to classic state-saving techniques used to<br\/>support rollback processing in optimistic simulations. We also believe<br\/>reverse computation will allow large-scale network models to scale to<br\/>much larger processor configurations as well as enable a more<br\/>efficient design of simulation experiments.<br\/><br\/>The overall goal of this project is to understand the fundamental<br\/>functional and performance limits of reverse computation when applied<br\/>to the modeling of large-scale systems. Because of its importance and<br\/>impact, we have selected network models as our driving application.<br\/>To achieve this goal, we propose to investigate reverse computation in<br\/>the following five major research thrust areas:<br\/><br\/>1. the design and implementation of perfectly reversible computation<br\/>algorithms for event-list management, and time management to enable<br\/>scalable, efficient optimistic event processing,<br\/><br\/>2. the development of processes and techniques to effectively model a<br\/>large-scale, multi-protocol network scenario in a parallel simulation,<br\/>reverse computation framework,<br\/><br\/>3. the comparison and contrast of reverse computation performance to<br\/>state-of-the-art conservative synchronization techniques,<br\/><br\/>4. the creation of new methods and techniques for the design of<br\/>simulation experiments that take advantage of reverse computation,<br\/>and<br\/><br\/>5. the exploration of the linkages between reverse computation,<br\/>quantum computing and classic parallel\/distributed computing that<br\/>could lead to a more unified view of these disparate classes of<br\/>computation.","title":"CAREER: Scalable, High Performance Network Simulations Using Reverse Computation","awardID":"0133488","effectiveDate":"2002-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["541895"],"PO":["561889"]},"67457":{"abstract":"CAREER: Model-Based Design and Verification of Embedded Systems<br\/>Radu Grosu<br\/>State University of New York at Stony Brook<br\/><br\/>Computer aided verification (CAV) and embedded software design automation (ESDA) emerge from<br\/>academia and industry respectively as two promising approaches to developing the high-confidence<br\/>software demanded by embedded-system applications, including those found in the telecommunications,<br\/>aerospace\/military, medical-device, and automotive industries. CAV and ESDA advocate the same<br\/>methodology for system design: (1) define the requirements, (2) construct a model and (3) analyze<br\/>the model with respect to the requirements. The difference is essentially that: (1) CAV uses more<br\/>sophisticated requirements, (2) ESDA uses more sophisticated models and (3) CAV performs a more<br\/>sophisticated analysis. While ESDA analysis reduces to manual, pointwise simulation of the model,<br\/>CAV analysis is automatic and exhaustive. This is made possible by a mathematical formulation of<br\/>the requirements, models and analysis problem that is far beyond the precision currently supported<br\/>by ESDA. The goal of this research is to: (1) push the limits of CAV to capture and analyze<br\/>ESDA models; (2) increase the confidence in ESDA by applying CAV techniques. This goal is pursued<br\/>with following research and education objectives:<br\/><br\/>1. Support the design methodology for discrete, time-triggered and event-triggered embedded<br\/>systems with:<br\/><br\/> - Hierarchic reactive modules (HRM), a state-based modeling language that supports<br\/> architectural and behavioral hierarchy together with powerful time and space abstraction.<br\/> <br\/> - Concurrent class machines (CCM), an action-based modeling language that directly<br\/> incorporates object-oriented features like classes and inheritance, objects and object creation,<br\/> methods, method invocation and exceptions, threads and thread creation.<br\/> <br\/> - Shared variables interaction diagrams, a scenario-based language that adequately<br\/> captures requirements of embedded systems communicating via shared variables.<br\/> <br\/> - Hermes}, a modeling, simulation and model checking tool for HRM that efficiently<br\/> exploits the hierarchical structure to prune the state space. We also consider a variety of<br\/> other CAV techniques and support for CCM.<br\/> <br\/>2. Support the design methodology for embedded systems with tightly coupled discrete and analog<br\/> behavior with:<br\/><br\/> - Hierarchic hybrid machines (HHM)}, a hierarchic, state-based modeling language that<br\/> allows to capture both discrete and analog behavior.<br\/> <br\/> - Charon, a modeling and simulation tool for HHM that exploits hierarchic structure for<br\/> efficient multi-rate integration.<br\/> <br\/> - Different approaches to simulation, reachability analysis and modular reasoning.<br\/> Application of hybrid systems to modeling cell behavior.<br\/> <br\/>3. Publish a textbook providing a comprehensive, formal treatment of the unified modeling<br\/> language UML for Real Time to reduce the gap between ESDA and CAV.<br\/> <br\/>4. Integrate formal concepts in the undergraduate education at Stony-Brook by proposing changes<br\/> for the courses in software engineering, theory of computation and operating systems.","title":"CAREER: Model-Based Design and Verification of Embedded Systems","awardID":"0133583","effectiveDate":"2002-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["417606"],"PO":["561889"]},"72078":{"abstract":"This research will develop advanced digital signal processing algorithms for specific<br\/>coherent imaging systems where complex signals are spatially and temporally sampled,<br\/>and subsequently processed by computers.Modeling of the physics of data acquisition<br\/>will play a crucial role throughout the signal processing chain,from preprocessing at the<br\/>sensor level to adaptive processing\/beamforming and final image formation.The focal<br\/>research areas will involve ultra wide band medical ultrasound imaging,and<br\/>electromagnetic wave imaging in millimeter spectral bands.Millimeter electromagnetic<br\/>wave imaging could have important anti-terrorism applications such as detection of<br\/>plastic guns and knives in human body scanning at airports,and surveillance of suspected<br\/>safe houses,storage areas,and cargos by imaging through walls or crates.<br\/>In the medical ultrasound area,the research will involve the following specific topics:(1)<br\/>optimal transmit\/receive beam forming for near field dynamic focusing;(2)multiple foci<br\/>B scan imaging for increasing scan rates;(3).theoretical performance bounds associated<br\/>with combined random processes of random scatterers and noise.and (4),phase<br\/>aberration correction algorithms for 3-D systems including new methods for dealing with<br\/>dispersed aberrators such as fat lobules,membranes,etc.,that can diffract and refract the<br\/>ultrasound beams.The research in electromagnetic coherent imaging will involve:<br\/>synergistic adaptation of the statistical ultrasound autofocusing\/phase aberration<br\/>correction concepts to the electromagnetic spectrum;development of millimeter wa e<br\/>imaging algorithms for surveillance functions such as rapid body scanning and imaging<br\/>through thin dry medium such as wood,plaster board or stone.The research in all the<br\/>coherent modalities will involve:development of practical fast converging computer<br\/>implementations of reconstruction algorithms;extensive simulations,and performance<br\/>analyses of the new models and algorithms.","title":"Adaptive Digital Signal Processing for Spatial and Temporal Sampled Coherent Imaging Systems","awardID":"0208830","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[186645,"321030"],"PO":["564898"]},"71771":{"abstract":"This project aims at developing efficient algorithms for multicast communication within the optical networks based on Wavelength Division Multiplexing (WDM). The following research activities will be particularly pursued. First, the research team will work on the WDM simulators particularly suitable for multicast applications based on WDM. Effi-cient specific multicast tree construction problems will be formulated and their computa-tional complexity will be analyzed. Second, this project will include more general multi-cast problems and seek the appropriate solutions, such as when the set of senders and re-ceivers in the multicast group vary. Finally, a part of the research will be devoted to the problem of constructing multicast trees in heterogeneous networks with different optical node architectures as well as the fault-tolerance and Quality-of-Service (QoS) problems related to optical multicast built in existing Internet environment and with application-level requirements. This project will include undergraduate students in research and will thus have substantial impact on their preparation for graduate education as well as it will be conducted as means of creating awareness and interest among undergraduate students on the issues surrounding optical networks.","title":"RUI: Virtual Topologies for Multicast Communication in WDM Networks","awardID":"0207754","effectiveDate":"2002-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["561152"],"PO":["565090"]},"72420":{"abstract":"NER Proposal0210225<br\/>Exploring the Computational Limits Imposed by Nanotechnologies<br\/>John E. Savage<br\/><br\/><br\/>This project has four goals: a) to develop realistic models for chips with<br\/>nanometer-size dimensions, b) to explore the computational limits that apply<br\/>under the physical constraints imposed by nanotechnologies, c) to develop<br\/>architectures and algorithms reflecting these constraints, and d) to<br\/>incorporate the knowledge acquired in advanced and early graduate instruction.<br\/><br\/>While computational nanotechnologies exist only in the most primitive forms<br\/>today, we have an opportunity to influence their use akin to that which arose<br\/>when the VLSI model was developed in the late 1970s. In this model gates are<br\/>so small that the area of wires is significant. Efficient use of this<br\/>technology required new algorithms whose efficacy was demonstrated through the<br\/>development of new complexity-theoretic lower bounds involving chip area and<br\/>computation time.<br\/><br\/>Our approach will be a) to model technologies such as orthogonal arrays<br\/>(crossbars) of nanowires and nanotubes and masses of nearly uniform<br\/>self-assembled elements, b) to extend existing VLSI theory by incorporating<br\/>the new constraints that emerge, c) to explore new architectures that cope<br\/>with the complexity-theoretic constraints exhibited by the proposed highly<br\/>regular architectures and ways of programming them, and d) to devise lectures<br\/>and\/or courses to bring nanocomputation to the attention of students.","title":"NER: Exploring the Computational Limits Imposed by Nanotechnologies","awardID":"0210225","effectiveDate":"2002-06-15","expirationDate":"2003-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["346661"],"PO":["187585"]},"72101":{"abstract":"In concept learning, the learner is typically given a sample of instances<br\/>labeled according to some unknown target concept. The learner?s task is to<br\/>construct a hypothesis that is a good approximation of the target in a<br\/>reasonable amount of time. Building concept learning systems has become an<br\/>important research area due to the ever-increasing need for analyzing huge<br\/>amounts of stored data. Although many efficient algorithms were constructed for<br\/>learning various classes of concepts, these concept classes are extremely<br\/>simple. Further, numerous hardness results seem to suggest that learning more<br\/>expressive concept classes is extremely difficult.<br\/><br\/>Two research directions have evolved in an effort to address the difficulty of<br\/>learning more expressive concepts. One is to construct multiple classifier<br\/>systems (MCS) and the other is to consider the possibility of actively<br\/>interacting with the environment (a.k.a. active learning). Currently, due to<br\/>the success of the Adaboost algorithm, theoretical research on MCS (and in fact<br\/>machine learning in general) tends to focus rather narrowly on ensemble<br\/>methods. Similarly, active learning research has been concentrated on the use<br\/>of membership queries, and to some extent the teaching model. Other types of<br\/>MCS and active learning that may lead to more intelligent learning systems have<br\/>not been well studied. A good understanding of how to build more sophisticated<br\/>MCS and exploit other possibilities of extracting information from the<br\/>environment will move us one step closer to achieving the original intent of<br\/>machine learning, which is to automate the knowledge acquisition process. This<br\/>proposed research will investigate complex multiple classifier and active<br\/>learning systems so that the learning of difficult concept classes becomes more<br\/>tractable.","title":"Foundation of Multiple Classifier Systems and Active Learning","awardID":"0208935","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[186707],"PO":["499399"]},"72123":{"abstract":"The rapid accumulation of large collections of digital images has created the need for efficient and intelligent schemes for image retrieval. Since humans are the ultimate users of most retrieval systems, it is important to organize the contents semantically, according to meaningful categories. This requires an understandingof the important semantic categories that humans use for image classification, and the extraction of meaningful image features that can discriminate between these categories. Recent research efforts have addressed the first problem, but the second remains quite elusive. This research effort is aimed at addressing this second problem, that is, the extraction of low-level image features that can be correlated with high-level semantics and used to capture the semantic meaning of an image.<br\/><br\/>The key to this research is the development of a new methodology for segmenting images, based on perceptual models and principles about the processing of texture and color information. This involves the identification of semantically important, spatially adaptive, low-level color and texture features that can be combined algorithmically to obtain image segmentations that convey semantic information. The same perceptual models and principles can be used to relate the features of the segmented regions (color and texture features, as well as segment location, size, and boundary shape) to semantic concepts that can be used for content-based image retrieval.<br\/>An integral part of this research is the design and execution of subjective experiments in order to obtain some key parameters for the color and texture features, as well as for linking low-level image features to image semantics.","title":"Deriving Perceptually-Based Texture and Color Features for Image Segmentation, Categorization, and Retrieval","awardID":"0209006","effectiveDate":"2002-06-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["467427"],"PO":["564898"]},"77689":{"abstract":"Institution: University of Arizona<br\/>Proposal Number: EIA 0089879<br\/>PI: Barbara A. Gutek<br\/>Title: Ties That Blind? The Role of Social Networks in the Underrepresentation of Women in IT<br\/><br\/>This CISE Information Technology Workforce (ITW) proposal requests funds for a large-scale study of the role of social networks in the underrepresentation of women in the IT workforce. Multiple cohorts of undergraduate and master's degree students in a leading MIS program will be surveyed at five points in time to identify their patterns of communication, trust, advice, friendship, and voluntary association in organizations. Their work roles on project teams, in student organizations, and in first jobs after graduation will be tracked. Background information will also be collected. The differential positions of women students in the networks, roles, and job placements will be analyzed using the techniques of network analysis as well as standard techniques of statistical inference. The influence of background characteristics, such as work experience and prior organizational affiliations will also be investigated. This project has the potential to provide significant insights about the degree to which personal networks contribute to the success of women in IT education and employment.","title":"ITW: Ties That Blind? The Role of Social Networks in the Underrepresentation of Women in IT","awardID":"0234168","effectiveDate":"2002-06-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[202634],"PO":["289456"]},"72465":{"abstract":"CCR-0210421<br\/>Wolfgang Porod and Gary H. Bernstein<br\/>\"NER: Computing Architectures for Coupled Nanomagnets\"<br\/><br\/><br\/>We explore the feasibility of developing computing architectures<br\/>implemented in magnetically-coupled arrays of nanometer-sized dots and<br\/>pillars. Similar to the electronic Quantum-Dot Cellular Automata (QCA)<br\/>scheme, which was previously developed by the Notre Dame group,<br\/>information is encoded in the magnetization of single-domain<br\/>permanent-magnet structures, and the physical interaction between<br\/>neighboring magnets provides the local connectivity. The main goal of<br\/>this project is to investigate how logic functions can be realized in<br\/>structured arrays of coupled nanomagnets. We propose a joint theoretical<br\/>and experimental approach to explore the feasibility of such magnetic<br\/>QCA-like architectures for computing and signal processing. Once<br\/>feasibility of elementary logic functions is established, one may<br\/>envision special-purpose cellular processor cells composed of coupled<br\/>nanoscale magnetic sensors and memories. The robustness of such magnetic<br\/>systems opens the potential for applications where nanometer-sized, yet<br\/>rugged, systems are required with a wide range of operating<br\/>temperatures.","title":"NER: Computing Architectures for Coupled Nanomagnets","awardID":"0210421","effectiveDate":"2002-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["560914","557409"],"PO":["562984"]},"71178":{"abstract":"A highly dependable information infrastructure requires systems that are massively replicated, slow to fail, and resistant to attack. The LOCKSS system uses novel techniques for increasing dependability that show promise of wider applicability and increasing importance in this area, including:<br\/><br\/>Building a fault-tolerant system from a large number of replicas that take part in \"opinion polls\" rather than a small number of replicas that take part in elections.<br\/><br\/>Limiting the speed at which the system operates in order to limit the speed at which it can fail.<br\/><br\/>Building a system that resists the activities of the \"bad guy\" without requiring that secrets be kept, in part by using public communication and a reputation system.<br\/><br\/>Experience with this and other peer-to-peer systems shows that the real challenges of making systems work only become apparent at a realistic operational scale and running on real networks. The LOCKSS system is now running on the Internet with 60 peers worldwide. The project will exploit this LOCKSS test-bed to investigate areas in which further work is needed.","title":"Itr\/cise: Lockss","awardID":"0205667","effectiveDate":"2002-06-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["563142"],"PO":["564456"]},"67405":{"abstract":"This research focuses on devising novel techniques based on data-flow analysis in the memory management of real-time multidimensional signal processing. Data-flow analysis is the steering exploration mechanism along this project, allowing more exploration freedom than the traditional scheduling -based investigation, since the memory management tasks usually need only relative (rather than exact) lifetime information. Moreover, data-flow analysis enables the study of memory management tasks at the desired level of granularity -- between whole array and the scalar level -- trading-off computational effort and solution optimality.<br\/><br\/>Part of this project investigates non-scalar methods for computing the memory size in real-time multimedia algorithms. This research addresses novel memory computation topics: dealing with a large class of parametric specifications, and dealing with parallelism in high-throughput applications. This project addresses also the problem of deriving a multilevel memory architecture optimized for area and\/or power, subject to performance constraints. Another research direction is the optimized mapping of data from an embedded application code into the on-chip SRAM or the off-chip DRAM for maximizing the overall memory access performance of the application.<br\/><br\/>The educational component of this research includes (1) the development of a graduate course covering algorithmic aspects of high-level synthesis and system design methodologies; (2) the development of a web tool for memory size computation.","title":"CAREER: Data-flow Analysis in the Memory Management of Real-Time Multimedia Processing Systems","awardID":"0133318","effectiveDate":"2002-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[174736],"PO":["562984"]},"68857":{"abstract":"EIA-0139580<br\/>Sethi, Ishwar<br\/>Oakland University<br\/><br\/>TITLE: Undergraduate Computer Research for Women at Oakland University<br\/><br\/>The primary objective of the proposed REU Site is to promote graduate studies in Computer Science and<br\/>Engineering to bright, talented undergraduate women students. The objective will be achieved by creating a<br\/>nurturing environment and a first hand experience in the activities most directly related to graduate study and research careers, and by targeting the pool of recruitment to women from undergraduate institutions and women from majors related to Computer Science and Engineering. We are planning on enrolling eight students in each of the three summers covered by this program. The activities planned include conducting research as part of a team, communicating research results orally through presentations and in writing through research reports, and disseminating project information and results through the web. In addition, each participant will attend a national conference to gain an up-close experience about research as a profession, and be enrolled in ACM and SWE (Society of Women<br\/>Engineers).<br\/><br\/>The national and local statistics [2] confirm the existence of a large pool of women students who have the<br\/>Intellectual potential and the academic preparation for graduate studies in Computer Science and Engineering, but who never receive the exposure and motivation that led them to such career choices. The proposed REU Site will actively seek and recruit such students from Oakland University as well as from neighboring undergraduate institutions. There are many 2 and 4-year colleges in the geographical vicinity of Oakland University with limited or non-existent research programs. Examples of near-by four-year institutions that will be targeted include Central Michigan University, Eastern Michigan University, Lawrence Technological University, University of Detroit-Mercy, Madonna University and University of Michigan at Flint. The two-year colleges that will be targeted for participants include Macomb Community College, Oakland Community College, Henry Ford Community College, Marygrove College and Rochester College.<br\/>The intellectual focus of the proposed REU Site will be intelligent information processing and management. This focus was selected both because it represents a unifying theme to the research activities of the investigators and other faculty participants, and because it is an area at the edge of research with a wealth of applications. The match between the faculty's research and the selected focus provides a natural setting for students to get involved in on-going research projects, and an opportunity to follow up on this research and continue to contribute after completion of their REU participation. The wealth of potential and existing applications of the selected area of focus will serve as a great motivator for the undergraduate students targeted.","title":"REU Sites: Undergraduate Computer Research (UnCoRe) for Women at Oakland University","awardID":"0139580","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":[178350,"481137"],"PO":["281760"]},"71663":{"abstract":"Descriptive Complexity measures the richness of a language or sentence<br\/>needed to describe a given property. The languages are variants of<br\/>first-order logic and their targets are finite, ordered structures. There<br\/>is a profound relationship between the traditional computational complexity<br\/>of a problem and the descriptive complexity of the problem; indeed, all<br\/>major complexity classes have been shown to have natural descriptive<br\/>characterizations. This means that complexity can be understood entirely<br\/>from a logical point of view. As a consequence, important new<br\/>understandings about complexity have arisen from the descriptive point of<br\/>view.<br\/><br\/>The current research involves three major topics: (a) The theory of dynamic<br\/>complexity, which is especially appropriate for database complexity, is<br\/>being studied. Complete problems for dynamic complexity classes are being<br\/>developed and the complexity of important dynamic problems such as graph<br\/>reachability are being investigated; (b) Promising new methods for proving<br\/>lower bounds techniques on the descriptive complexity of problems have been<br\/>developed and are now being extended; and finally, (c) A Descriptive<br\/>Programming environment is being developed in which the computational<br\/>complexity of checking whether an input satisfies the properties being<br\/>described can be read from the face of the description.","title":"Development and Application of Descriptive Complexity","awardID":"0207373","effectiveDate":"2002-06-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["485266"],"PO":["499399"]},"72103":{"abstract":"This project will create a sharable scientific infrastructure for experimental research on large-scale, large-grain multi-agent software systems (MAS). The research will extend the capabilities of an existing lightweight, flexible, integrative, and scalable experimental platform called MACE3J. Building on the current prototype, additional functionality will be designed into MACE3J, and several modeling\/analysis component libraries will be added. The resulting infrastructure will be tested for robustness and scalability on small-to-large-scale multicomputer platforms using a suite of example MAS problems. The tools and documentation produced by the research will be widely distributed as a community research base. Outcomes will include: 1) a facility for collaboration and model\/data integration within the MAS research community; 2) a technology that will begin unifying MAS community efforts with ongoing high-performance computing research in areas such as single-system-image clustering, very large, distributed computational grids, highly heterogeneous high-performance codes, and the use of Java for high-performance computing; 3) tools for education and demonstration of multi-agent systems research and results; and 4) foundations for common benchmark problems, to provide comparability of results and to help measure general progress in the field of MAS.","title":"A High-Performance Open Testbed for Multi-Agent Systems","awardID":"0208937","effectiveDate":"2002-06-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["503214"],"PO":["564456"]},"74798":{"abstract":"This grant will provide support to fund approximately 20 graduate students to attend ACM SIGOMM 2002 being held in Pittsburgh, PA on August 19-23, 2002. The purpose of the conference is to provide a forum for researchers to present new ideas and research directions in the field of computer and data communication.","title":"Student Travel Grants for SIGCOMM 2002; Pittsburgh, PA; August 19-23, 2002","awardID":"0220456","effectiveDate":"2002-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["463128"],"PO":[194325]},"67615":{"abstract":"The PI is proposing to develop a new CFD code that will predict the coupled ventilation behavior of indoor and outdoor airspaces, including species (pollutants, chemical agents) transport. She will then couple this with large scale building energy simulation programs (already in existence) that do not contain sophisticated ventilation capabilities except on an energy balance basis. Validation, testing, and optimization of this computation \"system\" as a design tool is a major part of the proposed effort. Potential impacts include reliable design tools and guidelines for healthy and energy efficient buildings. In addition, the theory can be used to design mitigation strategies for chemical or biological agent attacks, such as determining the best sensing positions for quick responses to agent releases, activation of suitable ventilation systems to create a safe zone for occupants, and provision of suitable means to clean the buildings after an attack. It will also serve to bring architects and engineers more constructively together at the design phase. The education contribution of the research will include two new courses directed at architecture and engineering students in the areas of integrated building systems design and in the use of computational fluid dynamics in building systems design.","title":"CAREER: Designing Healthy and Energy-Efficient Buildings Using Computational Fluid Dynamics","awardID":"0134326","effectiveDate":"2002-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1406","name":"THERMAL TRANSPORT PROCESSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1635","name":"STRUCTURAL MATERIALS AND MECH"}}],"PIcoPI":["461723"],"PO":["417583"]},"67428":{"abstract":"To achieve the best performance on modern computers, one must<br\/>understand and exploit the interactions between program behavior,<br\/>run-time systems, and hardware. This research explores compiler and<br\/>run-time system support for improving load-value prediction and for<br\/>reducing the energy consumption of programs. Load-value prediction<br\/>exposes instruction-level parallelism in programs by allowing loads to<br\/>execute in parallel with the instructions that depend on it. Energy<br\/>reduction techniques reduce the energy requirements of programs<br\/>without significantly degrading performance.<br\/><br\/>Broadly speaking this research considers two kinds of techniques: (i)<br\/>Compiler techniques that use easily-available information in programs<br\/>(such as type information) to transform or annotate code to make<br\/>better use of hardware; (ii) Run-time system techniques that<br\/>reorganize and annotate data to make better use of hardware. This<br\/>research will also consider new hardware mechanisms for load-value<br\/>prediction and energy consumption that can be exploited in software.","title":"CAREER: Compiler and Run-time System Support for Modern Hardware","awardID":"0133457","effectiveDate":"2002-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["461768"],"PO":["565272"]},"70860":{"abstract":"Managing the energy consumption of computers requires cooperation<br\/>between energy aware applications and operating systems. This<br\/>research seeks to fully explore the energy management space<br\/>surrounding the interaction of applications and the operating system.<br\/>Applications should adjust their energy consumption when appropriate,<br\/>but must be provided accurate information on their individual energy<br\/>consumption. The operating system must implement the mechanisms and<br\/>policies to determine energy consumption and allocate it fairly as a<br\/>global system resource.<br\/><br\/>This research will first re-examine operating system structure with an<br\/>emphasis on managing energy as a first class resource. Energy<br\/>management cuts across all traditional system resources, with the CPU,<br\/>disk, network, and memory all exhibiting unique energy consumption<br\/>characteristics. Next, the work will explore policies for allocating<br\/>energy to competing tasks. The goal is to maintain fairness while<br\/>observing user-specified priorities and soft real-time deadlines.<br\/><br\/>The end product of this research will be a comprehensive framework for<br\/>globally managing energy in a diverse set of scenarios, ranging from a<br\/>single mobile computer, to wireless sensor networks that may have<br\/>aggregate goals across a large number of sensors, to hosting centers<br\/>that wish to provide maximum performance with minimum energy<br\/>consumption.","title":"Managing Energy as a First Class Operating System Resource","awardID":"0204367","effectiveDate":"2002-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["353750","555929","485593"],"PO":["309350"]},"70554":{"abstract":"ABSTRACT <br\/>0203315<br\/>Ronald Goldman<br\/>William Marsh Rice U<br\/><br\/>Resultants have many applications in Computational Science and Engineering. They are a powerful tool for determining whether or not a system of polynomial equations have a common root for solving for the common roots when they exist. Resultants are currently employed to compute intersections of rational curves and surfaces, to solve inverse kinematics problems, and to analyze dynamic systems. Robotics, Computer vision, Comptuer Graphics, Solid Modeling, and Computer Aided Geometric Design all utilize resultants.","title":"Systematic Construction of Single Determinants Representing Sparse Resultants","awardID":"0203315","effectiveDate":"2002-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["254152"],"PO":["399214"]},"75922":{"abstract":"This workshop will bring together key experts from academia and industry to explore new ideas and research directions for network research and infrastructure in wired and wireless networks. The new ideas and research directions proposed are at least a generation beyond what is currently pursued in the research arena today.","title":"Network Research and Test-bed Workshop; June-2002; Washington, DC area","awardID":"0225811","effectiveDate":"2002-06-15","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["483597"],"PO":["234222"]},"71841":{"abstract":"Several computationally di .cult optimization problems have a natural underlying discrete struc-<br\/>ture:e.g.,design\/routing problems in networking have appropriate graph-theoretic formulations.<br\/>Discrete\/combinatorial optimization is the study of how such combinatorial underpinnings can help<br\/>us understand better and solve optimization problems.<br\/>This project aims to develop improved algorithms for speci .c important problems in this .eld,<br\/>and to develop general algorithmic paradigms for combinatorial optimization;one of the main gen-<br\/>eral approaches will be probabilistic The powerful role played by randomness in the computational<br\/>context has been among the major discoveries in the foundations of computer science.This project<br\/>proposes to develop improved randomized algorithms for a family of hard combinatorial optimiza-<br\/>tion problems,and to develop new probabilistic tools of independent nterest in the process.It also<br\/>aims to conduct re .ned probabilistic (i.e.,average-case instead of worst-case)analyses of some of<br\/>these problems where relevant.Two sub-themes of the proposed research are to study hard opti-<br\/>mization problems that arise in the .eld of networking,and to approach di .cult problems through<br\/>approximation algorithms where appropriate.<br\/>The goal of this project is to study improved algorithmic approaches for fundamental problems<br\/>(such as various design,routing,and scheduling problems in networks)as well as to develop improved<br\/>probabilistic\/algorithmic paradigms in general.This endeavor will help develop new principles for<br\/>the design,analysis,and engineering of randomized\/approximation algorithms in networking and<br\/>combinatorial optimization.","title":"Probabilistic Approaches in Combinatorial Optimization","awardID":"0208005","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["447923"],"PO":["499399"]},"70785":{"abstract":"Pankaj Argarwal<br\/>Duke University<br\/>Collaborative<br\/>0204118\/0204486<br\/><br\/>Motion, like shape, is one of the fundamental modalities to be modeled in order to represent and manipulate the phys-ical world in a computer. As such, motion representations and the algorithms that operate on them are central to all computational disciplines dealing with physical objects: computer graphics, computer vision, robotics, etc. Mod-eling motion is also crucial for other disciplines dealing with temporally varying data, including mobile networks, temporal databases, etc. Motion algorithms require com-putational<br\/>resources, and frequently sensing and commu-nication resources as well, in order to accomplish their<br\/>task. Despite the prominent position that motion plays in so many computer disciplines, little has been done to date to provide a clean conceptual framework for representing motion, describing algorithms on moving objects, and an-alyzing their behavior and performance. It is the goal of this proposal to push the frontiers of the computer sci-ence representations and algorithms that deal with motion in its various manifestations. The aim is to create a firm algorithmic theory for the processes of acquiring, model-ing, reasoning about, planning, manipulating, or executing motion and their relevant complexity measures.","title":"Collaborative Proposal: Motion -- Models, Algorithms, and Complexity","awardID":"0204118","effectiveDate":"2002-06-15","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["554177"],"PO":["321058"]},"70588":{"abstract":"ABSTRACT<br\/>0203113\/0203426<br\/>Burer, Samuel<br\/>Iowa State<br\/><br\/>In a semidefinite programming (SDP) problem, a linear function of a symmetric matrix variable X is minimized subject to linear equality constraints on X and the essential constraint that X be positive semidefinite. Many mathematical optimization problems can be cast as SDP problems including linear programs, convex quadratic problems with convex quadratic inequality constraints, matrix norm minimization problems, and a variety of maximum and minimum eigenvalue problems. In addition, SDP has many applications in combinatorial optimization, engineering, statistics, and robust optimization.<br\/><br\/>Today, there are numerous algorithms and codes available for solving SDPs, and these methods can be loosely grouped into two classes: second-order interior-point (IP) methods and first-order nonlinear programming (NLP) methods. The choice of which class to use for a particular application is determined primarily by<br\/>problem size --- second-order IP methods are more efficient on small- to medium-scale problems while first-order NLP methods are better for large-scale problems.","title":"Collaborative Research: Theory and Implementation of Semidefinite Programming and Its Application to Combinatorial Optimization","awardID":"0203426","effectiveDate":"2002-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["294786"],"PO":["381214"]},"75648":{"abstract":"In June of 2002, a workshop will be held on Fundamentals of Distributed<br\/>Computing at Bertinoro, Italy. From a set of 43 outstanding<br\/>submissions, a total of 30 white papers were selected for publication,<br\/>and 46 researchers (including a number of students) invited to attend<br\/>the workshop. NSF provides travel funding to support attendance<br\/>by these students, many of whom are on very tight budgets. The workshop<br\/>will help set the agenda for a new generation of research in distributed<br\/>computing while also knitting together the European and American<br\/>research communities in the area. <br\/><br\/>Quality of the white papers was very high, and we have approached<br\/>Springer-Verlag about the possibility of revising and extending them<br\/>into a book-length treatment. Our hope is that we might use the<br\/>workshop to develop a unified vision and to elucidate the research<br\/>agenda in various areas of the discipline, then use this as a structure<br\/>for the white papers. The resulting book will be both a snapshot of the<br\/>state of the art and also a coherent articulation of research<br\/>opportunities in the coming decade.","title":"Travel Support for Bertinoro Workshop on Future Directions in Distributed Computing","awardID":"0224499","effectiveDate":"2002-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["495285"],"PO":["241298"]},"70831":{"abstract":"EIA-0204253<br\/>Wardell, Mark L., Rogers, Jacqueline K., Sawyer, Steven B.<br\/>Pennsylvania State University<br\/><br\/>Title: Women in the IT Workforce: How Level is the Playing Field?<br\/><br\/>This ITWF award provides support to study institutional contexts and their related factors that are theorized to affect the work-related outcomes of women after they enter the information technology (IT) workforce. By work-related outcomes is meant job tenure, job satisfaction, job mobility, and job status, earnings and workforce retention. The project will focus on the IT specialties of software and information systems (as opposed to hardware or telecommunications) because they represent one of the fastest growing segments of the computer and IT industry. <br\/> <br\/>The expanding employment opportunities in IT work have encouraged a popular view that possession of IT skills should level the playing field for all workers. In effect, this perspective implies that job opportunities, or alternately the lack of opportunities, are correlates of levels and types of skill workers possess. Collectively, the bundle of skills and experiences individuals bring to employers is known as human capital. The human capital view says little about the institutional contexts that circumscribe IT work, or about IT workers and their gender. This project theorizes that the job-related outcomes for women entering the IT workforce will be influenced by various institutional factors and that the outcomes of women will be different from those of men.","title":"ITWF: Women in the IT Workforce: How Level is the Playing Field?","awardID":"0204253","effectiveDate":"2002-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["561666","446789","361213"],"PO":["564181"]},"70853":{"abstract":"Multiprocessor systems use synchronization primitives to coordinate the<br\/>activities of multiple threads of control. Spin locks in particular are<br\/>widely used in multiprocessor operating systems and in scientific<br\/>appliactions. With the proliferation of multiprocessor servers, these<br\/>locks have come to be widely used in commercial applications as well.<br\/>The multiprogrammed nature of server workloads, however, requires that<br\/>threads be able to \"time out\" and abandon an attempt to acquire a lock.<br\/>Timeout is easy on small machines, which can use traditional<br\/>\"test-and-set\" spin locks, but these locks do not scale to large<br\/>machines. The principal alternative--scheduler-based locks such as<br\/>those provided by Java--has also proven to be prohibitively expensive.<br\/><br\/>The proposed research aims to address the cost of user-level<br\/>synchronization in multiprocessor servers by means of two principal<br\/>techniques: (1) the incorporation of timeout in scalable queue-based<br\/>locks, and (2) the development of practical mechanisms for the<br\/>construction of lock-free data structures. These techniques will be<br\/>evaluated with respect to each other and to existing techniques, and<br\/>will be incorporated into threaded run-time systems such as the Java<br\/>Virtual Machine.","title":"High-Performance Synchronization for User-Level Applications","awardID":"0204344","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["564815"],"PO":["309350"]},"71547":{"abstract":"This research is focused on demonstrating novel ROOM TEMPERATURE<br\/>infrared photodetectors based on electrochemically self assembled nanowire<br\/>arrays. Photodetection is based on photoexcitation of electrons from<br\/>subband states in the nanowire to trap states in the surrounding<br\/>insulator. This leads to an \"inverse\" photodetection effect whereby the <br\/>conductivity of the photodetector drops when irradiated with infrared radiation.<br\/><br\/>Preliminary experiments [Appl. Phys. Lett., Vol. 79, 4423 (2001)] have<br\/>shown that these photodetectors can operate at room temperature with a<br\/>signal to noise ratio of 45 dB. The purpose of the NER project will<br\/>be to extend this result to create (1) multi-colored detectors using<br\/>different sized nanowires self assembled on the same wafer, and (2) a<br\/>complementary photodetector where a normal photodetector is synthesized<br\/>in series with an inverse photodetector. The complementary photodetector<br\/>will be able to detect a very narrow band.<br\/><br\/>This research will involve significant work by undergraduate students.<br\/>The samples that exhibited the novel photodetection effect were<br\/>prepared by an undergraduate student in the PI's lab.","title":"NER: Novel Electrochemically Self Assembled Nanowire Infrared Photodetectors","awardID":"0206950","effectiveDate":"2002-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["541220"],"PO":["562984"]},"70469":{"abstract":"ABSTRACT<br\/>0203051<br\/>Dr. Deepak Kapur<br\/>U of New Mexico<br\/><br\/>The problems of (i)determining whether a given polynomial equation system has a common solution, (ii)deriving conditions on parameters appearing n polynomial equations,such that they have a common solution,as well as (iii)developing an e .cient representation of common solutions are of fundamental significance. These problems arise in numerous applications:engineering and design, robotics, universe kinematics, manufacturing, design and analysis of nano devices in nanotechnology, image understanding, graphics,solid modeling,implicitization,CAD-CAM design,geometric construction,design,and control theory. Multivariate resultants and related elimination methods have been found useful for addressing these problems. The resultant of a polynomial equation system gives the necessary and su .cient condition on its<br\/>parameters for a common solution to exist. When there are parameters in a polynomial system,numerical techniques often do not apply. Investigations of efficient elimination methods are also of considerable importance in algebraic geometry,polynomial ideal theory and other related aspects of computational algebra and symbolic computation.<br\/>Experimental and theoretical analysis indicates that the generalized Dixon formulation developed by Kapur,Saxena and Yang,based on Bezout-Cayley-Dixon methods and efficient elimination\/resultant method. A particularly attractive feature of the generalized Dixon formulation is that t s problem-adaptive since timplicitly exploits the sparse structure of the associated polynomial system as well as its non-genericity.","title":"Polynomial Manipulation using Dixon Resultant Formulation","awardID":"0203051","effectiveDate":"2002-06-15","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["531861"],"PO":["321058"]},"70448":{"abstract":"Large sparse unstructured matrices arising from various computer simulation and modeling are commonly solved by preconditioned iterative methods. This research project will study and design robust high performance preconditioners for parallel solution of large sparse linear systems, based on a class of multistep successive sparse approximate inverse preconditioning techniques.<br\/><br\/>We will develop new concept and parallel algorithms of multistep successive preconditioning for enhancing the robustness of standard sparse approximate inverse preconditioning techniques, and generalize this concept to the context of other preconditioning techniques. Study will be conducted to show the advantages of such approach to enhance both preconditioning accuracy and factorization stability. We will build portable software packages to implement new preconditioning strategies for solving unstructured general sparse linear systems on high performance parallel computers.<br\/><br\/>The general purpose high performance preconditioned iterative solvers from this research project are expected to make significant impact in the field of applied scientific computing. Our experience and existing strength will ensure that the<br\/>project be carried out fully as proposed. As U.S. industry is more and more relying on computer aided design and manufacturing, large scale computer simulation and modeling will be a vital component in new products research and development. The outcome of this research will benefit U.S. industry as well as scientific research community by providing more efficient kernel software for<br\/>large scale computer simulations.","title":"ALGORITHMS: New Concept and Parallel Algorithms for Robust Preconditioning in Large Scale Parallel Matrix Computation","awardID":"0202934","effectiveDate":"2002-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["94260"],"PO":["565272"]},"70877":{"abstract":"EIA-0204430<br\/>Major, Debra A., Davis, Donald D., Mann, Joan, Sanchez-Hucles, Janis V.<br\/>Old Dominion University<br\/><br\/>Title: Climate for Opportunity and Inclusion: Improving the Recruitment, Retention and Advancement of Women and Minorities in IT<br\/><br\/>This ITWF award provides support to investigate how characteristics of the information technology (IT) workplace can foster increased retention and advancement of women and minorities. In the first year, several work organizations with IT departments of varying sizes and demographic compositions will be recruited to participate in the study. Survey and interview data will be collected from human resource directors, IT supervisors and IT employees in order to assess the climate for opportunity and inclusion of each department. The goal is to identify barriers and enablers to the career success of women and minorities in IT departments. In the second year, a survey feedback intervention will be conducted in each participating organization to encourage IT departments to capitalize on their strengths and improve their weaknesses with regard to opportunity and inclusion for all employees. In the third year, survey and interview data will again be collected to assess the effectiveness of the interventions implemented during the second year. The objective is not only to assist the participating organizations in establishing an inclusive workplace environment, but also to develop \"best practices\" that can be shared, through publications and presentations, with others in the IT field and researchers interested in workplace diversity issues.","title":"ITWF: Climate for Opportunity and Inclusion: Improving the Recruitment, Retention and Advancement of Women and Minorities in Information Technology (IT)","awardID":"0204430","effectiveDate":"2002-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["553186",183461,"252524","523782"],"PO":["564181"]},"71746":{"abstract":"The problem of computing patterns in sequences or strings of characters<br\/>from a finite alphabet has important applications in numerous areas of<br\/>computer science, notably in data compression, information theory, and<br\/>pattern matching. This problem has also important applications in biology.<br\/>The stimulus for such recent works is the study of biological sequences<br\/>such as DNA and protein that play a central role in molecular biology. DNA<br\/>sequences can be viewed as quite long but finite strings of nucleotides of<br\/>4 different types, while protein sequences can be viewed as finite strings<br\/>of amino acids of 20 possible types. Patterns such as periodicities and<br\/>repetitions make up a significant fraction of both DNA and protein<br\/>sequences. Although the functions of these patterns are not well<br\/>understood, they appear important for understanding the expression,<br\/>regulation and evolution of a biological sequence. These patterns can be<br\/>used to identify the sequence among other sequences, an application that<br\/>plays a role in genetic fingerprinting. Repetitions in biological<br\/>sequences have been associated with human genetic diseases. They also<br\/>complicate multiple sequence alignment because matches may be present in<br\/>numerous places.<br\/><br\/>The literature has generally considered problems in which a period u of a<br\/>repetition is invariant. It has been required that occurrences of u match<br\/>each other exactly. Due to the action of evolutionary mutation, patterns<br\/>in biological strings are seldom exact but rather approximate. It<br\/>therefore becomes necessary to recognize u' as an occurrence of u if the<br\/>distance between u' and u is bounded by a certain threshold. Several<br\/>definitions of distance have been proposed like the Hamming distance which<br\/>counts the minimum number of character substitutions required to transform<br\/>u' into u, and the edit distance which counts the minimum number of<br\/>substitutions, insertions, and deletions of characters required to<br\/>transform u' into u. Although there is an enormous literature dealing with<br\/>approximate pattern matching according to these and other definitions of<br\/>distance, very little is known on approximate repetitions, a version of<br\/>repetitions where errors are allowed, and much remains to be done. Given<br\/>the importance of patterns in biological strings and the exponential<br\/>growth in the DNA database, it is important to develop efficient<br\/>algorithms for detecting these patterns. The investigators study patterns<br\/>such as periodicities, repetitions, covers, and seeds and their<br\/>approximate versions built upon various commonly used distance measures.<br\/>Techniques include recent combinatorial techniques related to partial<br\/>strings which are strings where a number of gap characters are allowed.<br\/>They also include the cover array, the highest scoring paths in weighted<br\/>grid graphs, the probabilistic models that have been proposed for<br\/>repetitions, and the subtree max gap problem which is a poweful tool in<br\/>parallel algorithm design.","title":"RUI: Computing Patterns in Strings","awardID":"0207673","effectiveDate":"2002-06-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["472982"],"PO":["499399"]},"70899":{"abstract":"Pankaj Argarwal<br\/>Duke University<br\/>Collaborative<br\/>0204118\/0204486<br\/><br\/>Motion, like shape, is one of the fundamental modalities to be modeled in order to represent and manipulate the phys-ical world in a computer. As such, motion representations and the algorithms that operate on them are central to all computational disciplines dealing with physical objects: computer graphics, computer vision, robotics, etc. Mod-eling motion is also crucial for other disciplines dealing with temporally varying data, including mobile networks, temporal databases, etc. Motion algorithms require com-putational<br\/>resources, and frequently sensing and commu-nication resources as well, in order to accomplish their<br\/>task. Despite the prominent position that motion plays in so many computer disciplines, little has been done to date to provide a clean conceptual framework for representing motion, describing algorithms on moving objects, and an-alyzing their behavior and performance. It is the goal of this proposal to push the frontiers of the computer sci-ence representations and algorithms that deal with motion in its various manifestations. The aim is to create a firm algorithmic theory for the processes of acquiring, model-ing, reasoning about, planning, manipulating, or executing motion and their relevant complexity measures.","title":"Collaborative Research: Motion -- Models, Algorithms, and Complexity","awardID":"0204486","effectiveDate":"2002-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["521232"],"PO":["532791"]}}