{"196251":{"abstract":"The penetration of parallel and distributed computing (PDC) technology into the daily lives of users has made it imperative that computer scientists and engineers provide rapidly changing, but yet effective, efficient and reliable technology to consumers. This points to the urgent need for imparting a broad-based skill set in PDC technology at various levels in the educational fabric. However, the rapid change in computing technology and research advances challenge educators in knowing what to teach in any given semester. Employers face similar challenges regarding what constitutes basic expertise. In this context, a working group has taken up the challenge of developing PDC curricular guidelines for Computer Science and Computer Engineering undergraduates, with particular emphasis on identifying a core curriculum that represents what every graduate should know about PDC. Throughout 2010, the working group has deliberated upon various topics and subtopics, specifying both the expected minimum level of coverage and the desired learning outcomes; it employed Bloom's classification as the medium for expressing the desired level of expertise on a topic. A preliminary version of the core curriculum was released in Dec, 2010 (http:\/\/www.cs.gsu.edu\/~tcpp\/curriculum\/index.php). A major mechanism for evaluating a snapshot of our guidelines is the Early Adopter competition, with grants from NSF and Intel. About four dozen early-adopter institutions are trying out this curriculum. We organized a workshop in Anchorage, May 2011, to bring together the early adopters and others interested in PDC education, primarily to receive the feedback from the Adopters, but also to stimulate discussion of curricular and other educational issues. This inaugural EduPar workshop - the first of its kind at IPDPS, being focused on educational matters - was a great success. This has led to a follow up EduPar-12 workshop that is being organized at IPDPS-12 in Shanghai with the support of this grant. The proposed curriculum is being revised currently for a formal released.","title":"Early Adopters of Curriculum Initiative in Parallel and Distributed Computing at EduPar-12","awardID":"1238003","effectiveDate":"2012-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[526127],"PO":["565255"]},"187110":{"abstract":"ABSTRACT:<br\/><br\/>A significant byproduct of the modern Information Age has been an explosion in the sheer quantity of data demanded from sensing systems. This project focuses on developing effective new frameworks for data acquisition, processing, and understanding that will help meet the technological challenges posed by this ever growing demand for information. Possible areas of impact include, but are not limited to: social choice theory, recommendation engines, sensor networks, computer vision, LIDAR, machine learning, medical imaging, drug discovery, and neuroscience. Integrated with the research in this project are the educational goals to inspire and educate students by creating and disseminating new curricular and K-12 outreach materials that focus both on the challenges of high-dimensional data processing and on the principles behind the dimensionality reduction techniques for alleviating them.<br\/><br\/>The research in this project draws from the concepts of sparsity and geometry in pursuing theoretically sound, integrated models and representations for broad classes of natural data. Of particular interest are (i) pairwise comparison matrices, which arise in a number of applications including recommendation engines, economic exchanges, elections, and psychology but are inadequately captured by low-rank models, and (ii) point clouds, which arise in signal and image databases and sensor networks but for which current models fail to properly capture intra- and inter-signal structures. In order to help mitigate the challenges in collecting and storing high-dimensional data sets (including those above), this project is developing principled techniques for recovering matrix-structured data sets from partial information that exploit far richer models than conventional low-rank recovery techniques.","title":"CAREER: New Models, Representations, and Dimensionality Reduction Techniques for Structured Data Sets","awardID":"1149225","effectiveDate":"2012-05-01","expirationDate":"2017-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[501968],"PO":["564898"]},"188496":{"abstract":"This award provides funding to renew the existing successful CISE Research Experiences for Undergraduates Site at Virginia Tech University. The REU Site will provide undergraduate students with immersive, high-quality learning and interdisciplinary research experience in cognitive communications, an emerging wireless communications technology. The students will implement their projects on the Virginia Tech Cognitive Radio Network testbed (VT-CORNET). The students will participate in professional development activities that make them more aware of graduate school and professional aspects of a computing career. <br\/><br\/>The students will join a variety of funded research projects ongoing at the Wireless@VT center and work with a faculty team with outstanding experience and expertise to direct the intellectual component of each project. Cognitive communications is an emerging and exciting field that promises to transform the wireless communications industry. The focus will be on topics such as spectrum management for wireless networks, public safety interoperable radios, rural broadband access, usability and human factors principles for cognitive engines and interface design that are important and timely. Thus the project has the potential to contribute to the advancement of research and discovery in an important and timely area of computing.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups and from institutions with limited research environments. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Cognitive Communications","awardID":"1156503","effectiveDate":"2012-05-15","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["540506","505416",505416,"296385","565206","565206"],"PO":["564181"]},"196230":{"abstract":"High-level managed languages, such as Java, provide strong semantic guarantees, but these guarantees are only as good as the underlying software stack. The research funded by this EAGER award will address the problem of verifying the compiler and runtime systems of managed languages and address the interplay between the formal verification of the underlying software stack and the memory models used by these languages<br\/><br\/>The correctness of safety-critical code is very important, but also very difficult to guarantee. Existing practice relies on manual code reviews and testing to ensure correctness, which are methods that do not provide strong guarantees. This research has the potential to improve the safety and robustness of managed-language implementations. These implementations, in turn, will improve the reliability of safety-critical software that runs on them.","title":"EAGER: Verified Compilation and High-Level Memory Models","awardID":"1237923","effectiveDate":"2012-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["549798","558390"],"PO":["564588"]},"197264":{"abstract":"This collaborative research project is concerned with the development of accurate and efficient computational uncertainty propagation techniques for nonlinear stochastic Hamiltonian systems that evolve on Lie group configuration spaces. Uncertainties in a dynamic system arise from multiple sources such as unmodeled dynamics, parametric uncertainty, and uncertainty in initial conditions. As they cannot be completely eliminated from any computational experiment or physical measurement, a careful characterization of the evolution of uncertainties is essential in scientific and engineering problems. This project involves the application of computational geometric mechanics, geometric numerical integration, noncommutative harmonic analysis, and generalized polynomial chaos techniques, and will yield mesh-free, coordinate-free methods for the numerically stable long-time propagation of uncertainty in a Hamiltonian system, while explicitly addressing the underlying stochastic and geometric properties of the system.<br\/><br\/>Most mathematical models have sources of uncertainty that may arise from physical processes that are poorly understood, a lack of precise knowledge of the parameters, or incomplete information about the current state of the system, and it is important to understand how these model uncertainties affect the predictions that arise from the mathematical model. In particular, a computer prediction without some indication of the reliability and confidence in the prediction can be disastrously misleading. This project aims to address the essential task of developing accurate mathematical and numerical methods for characterizing the effects of uncertainty in complex systems, which is a particularly timely and pressing need, since mathematical models of complex systems are increasingly relied upon to inform public policy decisions with long lasting and far reaching consequences. A graduate textbook will be prepared that discusses in parallel the continuous and discrete time approach to geometric mechanics on Lie groups that aims to be accessible to professional programs in computational science, and which will be field tested in the CSME graduate program at UCSD. This textbook includes accompanying code that will facilitate the reuse of the computational infrastructure funded by this project in other applications involving uncertainty propagation on nonlinear spaces.","title":"Collaborative Research: Computational Geometric Uncertainty Propagation for Hamiltonian Systems on a Lie Group","awardID":"1243000","effectiveDate":"2012-05-07","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"6892","name":"CI REUSE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["557147"],"PO":["564266"]},"196572":{"abstract":"This is funding to support the Student Design Competition (SDC), which will be part of the 2012 annual RESNA conference to be held June 28-July 3 in Baltimore. Today, between 40 and 56 million people in the United States report some type of disability, and this number will likely grow in the coming years as the baby boom generation enters late life. RESNA, the Rehabilitation Engineering and assistive technology Society of North America, is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. RESNA's membership consists of individuals and institutions covering a range of disciplines (including researchers, clinicians, suppliers, manufacturers, consumers and educators who work in non-profit and for-profit settings), all of whom are dedicated to promoting the exchange of ideas and information for the advancement of assistive technology. In addition to its annual conference, RESNA conducts a credentialing program for assistive technology practitioners, rehabilitation engineering technologists and suppliers, as well as sponsored projects. RESNA's Technical Standards Board is the U.S. Technical Advisory Group to ANSI, the official United States representative to the International Organization for Standardization (ISO), for the development of ISO standards pertaining to assistive technology and other products for persons with disabilities. More information about RESNA and its annual conference is available online at http:\/\/www.resna.org. <br\/><br\/>The RESNA Student Design Competition fosters innovation and creativity with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. The first SDC was held in 1980 as part of the inaugural RESNA conference; since then over 225 designs have been identified as winning entries from among over 730 submitted by students from over 117 different universities and institutes of higher learning. SDC entries are required to represent the work of students ONLY, including the design documentation; both undergraduates and graduates are eligible to take part. Many past participants in the event are now leaders in service, research, and educational areas related to technology for people with disabilities. Some past student designs have been patented and are now available commercially. NSF has been a supporter since 2005. This year's funding will enable the SDC to be further expanded and enhanced, so as to include more entries and support for more design teams, especially from minorities, women, and individuals with disabilities. A call for participation has been posted on the conference website, and also distributed electronically to a large number of colleges and universities with engineering and design schools. A team of 5 judges will pre-select entries from up to 10 teams, from which two members each will be invited to attend the conference supported with travel and hotel funds as well as complimentary registration. During a half-day session in which the teams will make presentations before the judges and public audience at the conference, 5 teams will ultimately be selected as the final winners. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. A platform session will be held in which the 5 finalists will make presentations to the general conference attendees. All SDC teams invited to the conference will have an opportunity to present their projects in a poster session during the general conference time. More information about the SDC is available online at http:\/\/aac-rerc.psu.edu\/wordpressmu\/RESNA-SDC. <br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. Unique in its primary focus on undergraduates, the event provides participants with experience and skills that help them succeed in their engineering and design careers. It further encourages and mentors students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields, and also provides an opportunity for the students to network with their peers and rehabilitation engineers, many of whom participated in previous SDC competitions. To further increase the diversity of submissions to the SDC in future years, participants will build web pages to illustrate their design and design process. The content of all submissions, not just the finalists, will be captured and accessible through the RESNA website, and the information will be searchable through the National Public Internet Site on assistivetech.net and the ATWiki. Not only will young scientists benefit from this medium of dissemination, but professors and those who teach will also be able to share this information with their students as examples of projects that other","title":"2012 RESNA Student Design Competition","awardID":"1239690","effectiveDate":"2012-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559082"],"PO":["565227"]},"188773":{"abstract":"Texas A&M proposes to run career mentoring workshops and assess their impact. Mentoring activities are critical for successful promotions in the professoriate, and they are particularly needed for underrepresented faculty in the field of computing. The number of minority faculty or faculty with disabilities at most institutions is very small, making it difficult to find role models and mentors with similar experiences and backgrounds. To address this problem, the PI has developed a series of Academic Career Mentoring Workshops for Underrepresented Participants. The series started in 2005 and has been funded by an NSF BPC grant from 2007 through 2011. The Academic Career Mentoring Workshop series targets junior faculty and senior graduate students from the following underrepresented groups: African American, Hispanic, Native American, and people with disabilities. The Workshops will include senior faculty from these groups that can serve as role models and present proven strategies for academic careers in computing. With this proposal, the PI requests funding to continue and to assess these workshops.<br\/><br\/>The Workshops will cover cultural issues and their influence on topics such as starting a research program, networking, and navigating the tenure process. Panelists will be asked to address issues such as \"Maintaining One's Identity\" and \"Overcoming Misconceptions,\" that address frustrations unique to underrepresented faculty and potential faculty (or senior graduate students). For example, ethnic minority faculty often struggle with the dilemma of maintaining one's culture given the significant time necessary to launch a research program. Further, underrepresented faculty must make a concerted effort, well beyond the norm, to find outlets and support communities of similar ethnicity. These problems can result in disillusionment that may result in young faculty choosing other career opportunities outside of academia. The proposed workshop complement the existing CRA-W Workshops, which focus on gender, and CRA Workshops, which do not target issues faced by women or ethnic minorities.","title":"2012 Academic Careers Workshop for Underrepresented Participants","awardID":"1157559","effectiveDate":"2012-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["541641"],"PO":["561855"]},"189532":{"abstract":"This research investigates a new approach to protecting the reliability of digital communication and digital storage systems. This approach takes advantage of recent work (by the research team and others) that formulates the \"encoding\" and \"decoding\" of data in terms of a novel graphical representation; this formulation has several advantages over existing techniques for insuring data integrity, including better performance at very low power and the absence of an 'error floor', i.e., the ability to consistently (and significantly) lower the decoded error probability with incremental expenditures of power. The ultimate goal of the research is more reliable delivery of digital data, text, computer files, speech and audio signals, video, etc. - using devices that require less power (and thus have longer battery life) and shorter processing delay.<br\/><br\/>More specifically, the research investigates the use of spatially coupled sparse codes - channel (error control) codes with a sparse parity check representation formed by coupling together a chain of small \"protographs\". This approach, which was pioneered by the research team in the context of terminated low-density parity check convolutional codes, has recently been shown to possess a unique combination of properties - iterative decoding performance that approaches channel capacity and minimum distance that grows linearly with block length - as the code size gets large. The research follows four tracks: (1) the design and analysis of low latency\/memory decoding strategies; (2) decoded error probability performance guarantees; (3) the development and analysis of spatially coupled sparse codes with algebraic structure; and (4) the application of spatial coupling outside the immediate domain of channel coding, including cooperative diversity, compressed sensing, and multi-terminal source\/channel coding.","title":"CIF: Medium: Collaborative Research: Spatially Coupled Sparse Codes on Graphs - Theory, Practice, and Extensions","awardID":"1161774","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["551001"],"PO":["564924"]},"187112":{"abstract":"New and emerging solid-state non-volatile (NV) technologies such as NAND Flash and Phase Change Memory create a new class of high-speed storage devices, both as traditional I\/O systems and as extensions of system main memory. To make best use of these technologies in tomorrow's computers we need to be able to model and understand their behavior in such systems, and create algorithms and architectures which leverage their strengths while compensating for their weaknesses.<br\/><br\/>This work (a) investigates models and algorithms for system behavior of solid-state persistent memory technologies, to achieve performance, reliability, and functionality not possible with today's techniques, (b) examines alternate models for OS-to-storage interfaces to make best use of NV technology characteristics, and (c) researches new operating system algorithms for managing the novel memory model presented by mixing NV and DRAM technologies at the main-memory level within a system.<br\/><br\/>The coming transition from disk to low-latency solid-state storage as the primary persistent media in computer systems presents an opportunity for transformative changes in the way applications make use of storage; the goal of this research is to achieve such changes, rather than the incremental improvements possible via the disk emulation strategy used with these technologies to date. Research results will include open-source software and hardware; the project also involves development of curricula for undergraduate operating systems education and student involvement at the secondary, undergraduate, and graduate level.","title":"CAREER: Algorithms and Implementations For New Storage Technologies","awardID":"1149232","effectiveDate":"2012-05-01","expirationDate":"2017-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[501972],"PO":["565255"]},"189356":{"abstract":"Almost all software today is developed in two stages. First, a human writes a program and subsequently various automated tools process that program to produce the actual computer code that is the software application. Over time, researchers have found ways to shift more of the burden of developing software from the programmer to the automated tools, which has gradually made software development more and more productive. One area of software development that has not changed for a couple of decades is the way in which the structure of data is programmed. The organization of data is still described in relatively low-level terms as links between individual objects in memory, which is too low-level for the tools to reason successfully about. As a result, programmers must spend significant time hand-coding and tuning their data structures, and there are significant missed opportunities for improvements to program performance, correctness, and security.<br\/><br\/>We propose to try a new approach to this problem, consisting of two parts: we will synthesize data structures from high-level relational specifications. We will also use inference techniques to automatically analyze the program?s use of the relations. In a relational style of programming explicit pointers are eliminated, removing one of the biggest impediments to automatic reasoning. We believe recent advances in the analysis of control flow, destructive updates, and low-level indexing operations make it feasible to capture most other aspects of programs.<br\/><br\/>If successful, programs, including concurrent programs, will be written at a higher level and be more easily retargeted to new situations because the data representations are not fixed in advance, and tools will be able to do a more reliable, efficient, and scalable job of optimizing resources and verifying properties of programs. As part of the project, we will seek to demonstrate these benefits by conducting studies of our techniques applied to realistic challenge applications.","title":"Synthesis and Analysis of Heap Data Structures","awardID":"1160904","effectiveDate":"2012-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[507674],"PO":["564588"]},"189598":{"abstract":"Online Service Providers (OSPs) host a wide range of application services, including email, Web search, video streaming, and multiplayer games, on servers in data centers all over the world. Each service has specific performance requirements. For example, Web search and multiplayer games need low latency, whereas video streaming and bulk file transfers need high throughput. Clients access these services from a wide variety of geographic locations over access networks with wildly different performance. Offering good performance to these diverse clients at a reasonable cost is the life blood of any OSP. <br\/><br\/>OSPs affect client performance by controlling content routing (selecting which data center should serve a client request) and network routing (selecting interdomain paths to clients, or paths within the OSP's own backbone), and by longer-term planning of future data centers and relationships with upstream ISPs. Unfortunately, OSPs have relatively poor visibility into end-to-end performance and do not adapt both content and network routing to maximize performance; in addition, OSP operators lack good models for deciding where to place the next server or data center, or which ISPs to select as neighbors. <br\/><br\/>To address the wide-area networking needs of online services, this project is designing, implementing, deploying, and evaluating practical techniques that allow OSPs to perform content and network routing (and make longer-term placement decisions), based on timely and accurate information about end-to-end performance and transit costs. The project is developing techniques to help OSP operators measure, control, and plan the wide-area connectivity between distributed services and their clients, and between the servers themselves. The project tasks include: (1) designing performance-measurement techniques and conduct measurement-driven studies of OSP traffic management; (2) designing, modeling, and prototyping protocols for joint optimization of content and network routing, and traffic management within an OSP backbone; and (3) driving long-term planning of server placement and ISP peer selection based on models of transit costs. <br\/><br\/>To evaluate our algorithms together, and \"in the wild\", the project will use experimental platforms for network monitoring (BISmark, M-Lab, and, where available, measurement servers in ISP backbone networks), content and network routing (DONAR and Transit Portal), cloud computing (VICCI), and programmable networking (OpenFlow). <br\/><br\/>Broader Impact: <br\/>The PIs are working with industry to evaluate and deploy the solutions on operational networks. They will also continue their close collaboration on graduate networking curriculum development to include the research topics and experimental platforms in this project. As part of the project outreach, the PIs are organizing \"summer camps\" (drawing on their earlier experiences with summer camps for the VINI and BISmark projects) to bring under-represented students to their institutions for summer internships. The PIs will also work with under-represented regions and institutions to deploy their infrastructure and engage faculty and students in research projects using the platforms.","title":"NeTS: Medium: Collaborative Research: Optimizing Network Support for Cloud Services: From Short-Term Measurements to Long-Term Planning","awardID":"1162112","effectiveDate":"2012-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["531675"],"PO":["564993"]},"189488":{"abstract":"Conventional microprocessors are designed primarily for sustained<br\/>performance; they can operate at near-peak performance essentially<br\/>indefinitely until their energy source is exhausted. In battery and<br\/>cooling constrained environments such as mobile devices, sustained power<br\/>(and, consequently, peak performance) must be limited to at most a few<br\/>watts so that the device can dissipate heat using only passive<br\/>convection. However, many interactive mobile applications (such as<br\/>handwriting\/speech recognition or image-based search) instead call for<br\/>bursts of intense computation in response to user input, creating the<br\/>need for a new ultra-responsive operating regime: rather than limit peak<br\/>power assuming sustained operation, systems should instead exploit heat<br\/>storage to enable brief computation bursts that greatly exceed<br\/>sustainable thermal limits without overheating. This project<br\/>investigates an approach called \"computational sprinting\", the central<br\/>essence of which is to compute at unsustainable rates but only briefly<br\/>so that temperatures do not reach unsafe levels.<br\/><br\/>The goal of this project is to address the architectural, thermal,<br\/>electrical, and software barriers to ultra-responsiveness via<br\/>computational sprinting. In particular, the project explores: (1)<br\/>architectures and memory systems that sprint via parallelism (activating<br\/>tens of reserve functional units\/cores) and voltage boosting<br\/>(overdriving cores for single-thread performance) while facilitating<br\/>fast burst onsets; (2) thermal designs that improve thermal response<br\/>behavior to enable longer and more intense sprints; (3) mobile-optimized <br\/>electrical designs that provide stable supply voltages<br\/>despite current surges of an order-of-magnitude or more; and <br\/>(4) software mechanisms that explicitly manage limited thermal budgets <br\/>and anticipate and stage data needed during the sprint. The project<br\/>includes the fabrication of an experimental testbed to approximate the<br\/>computational, thermal and electrical capabilities of a future many-core<br\/>mobile device and to provide practical experience with sprinting.<br\/>Project impacts include (1) developing and advancing techniques for<br\/>improving the responsiveness of mobile devices and (2) integrating the<br\/>discoveries into a new cross-departmental course on computer system<br\/>design.","title":"SHF: Medium: Collaborative Research: Ultra-Responsive Architectures for Mobile Plattorm","awardID":"1161505","effectiveDate":"2012-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["550681",508096,508097],"PO":["366560"]},"195351":{"abstract":"Proposal #: CNS 12-32197 PI(s): Fortes, Jose A. Institution: University of Florida<br\/>Title: Second Workshop on Instrumentation Needs of Computer and Information Science and Engineering <br\/> (INCISE2) Research <br\/>Project Proposed:<br\/>This proposal, planning a second workshop to examine more deeply the nature, needs, importance, challenges, current changes, and funding mechanisms of instrumentation development, acquisition, utilization, and sharing, for purposes of ongoing and\/or anticipated research in different CISE areas, brings together recognized CISE research leaders to conduct such an assessment and produce a report that can be shared with the CISE community, colleagues, academic administrators, government funding agencies, and industry. CISE research is increasingly concerned with extremely large and complex objects whose behavior cannot be entirely distilled from first principles or investigated using reduction models. Among other factors, scale is a consequence of Moore?s law and pervasive networking. Complexity arises from the embedding of computing into artifacts, interconnection of many components and\/or multiple layers of functionality. Research needed to design and\/or model such objects often requires special instruments to either peer into individual components at very small space\/time granularity or to observe\/emulate\/simulate many objects at large enough scale and during long enough times. <br\/>The findings of the first INCISE workshop held in 2008 confirmed that research instrumentation - broadly construed to include hardware, software, datasets and services - is essential for the advancement of CISE disciplines. Since then we have witnessed the emergence and rapid maturation of cloud computing, global IT systems, community-oriented instruments, increasingly IT-rich (a.k.a. ?smarter?) systems and cyberinfrastructures for scientific research. These profound changes in both the nature of IT systems and how IT systems can be provisioned call for a follow-up meeting to revisit the scope and need of CISE instrumentation and to discuss strategies for enabling researchers to create and access the instruments needed by their projects on a sustainable basis. This proposal requests funds for organizing such a follow-up meeting ? INCISE 2 ? with diverse participants drawn from several areas of CISE research. INCISE 2 will take place on two days preceding the 2012 CRA Snowbird conference whose dates are July 22-24, 2012.<br\/>Intellectual merit: Among others, the workshop aims to address the following questions:<br\/>1. Is instrumentation-as-a-service, as provided by clouds or other means, appropriate for CISE research? When the answer is yes, the workshop will further investigate and characterize applicable cases and what can be done. When the answer is no, the workshop will investigate the limitations of instrumentation-as-a-service and suggest steps to address them.<br\/>2. As the needs and offerings of instrumentation start having a global or regional nature, how are such needs best met and how are existing global and regional cyberinfrastructures best used for instrumentation purposes? Can we improve the community awareness of the existence and uses of these cyberinfrastructures? What are the relationships between cyberinfrastructure and instrumentation?<br\/>3. What are the main challenges currently faced by CISE instrumentation? For example, when is reproducibility of experiments needed, possible and\/or affordable? Are there standards emerging for CISE instrumentation? What needs to be done to ensure sustainability of instrumentation solutions for CISE communities?<br\/>Broader impact: <br\/>The workshop expects to provide a valuable assessment of the evolving instrumentation needs of CISE research and how they can be best provided. It will make recommendations to both the community and the funding agencies regarding the necessary funding mechanisms to meet the identified needs. The recommendations will be widely disseminated, including institutions with large enrolments of minority students and underrepresented groups. An expected impact of this activity is an increased ability on the part of the researchers of these institutions in competing for instrumentation funds and an understanding of the nature of CISE instrumentation by academic administrators and funding agencies. The participants will be diverse with respect to discipline, gender, ethnic group and geographical distribution in order to enable different representative perspectives to bear on the conclusions of the workshop. A verbal report will be made to CISE department chairs at the CRA workshop, and a written report will be made available to NSF and CISE departments in more than 200 universities.<br\/>IT is increasingly being embedded into artifacts which might include non-IT components whose natures include mechanical, electrical, communication, energy production, chemical, transportation, entertainment, medical, and defense. Thus, ","title":"Second Workshop on Instrumentation Needs of Computer and Information Science and Engineering (INCISE2) Research","awardID":"1232197","effectiveDate":"2012-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["540130"],"PO":["557609"]},"195253":{"abstract":"The US-China workshop on environmental monitoring for public health and disaster recovery will be held at Yellow Mountains, Anhui, China on August 7-8, 2012. The workshop will include one keynote speech session, one position papers session, one panel session, five technical sessions, and one summary session. There will be approximately 20 US participants and 20 Chinese participants. The objective of this workshop is to bring together experts in the field of environmental monitoring from the U.S. and China, and to promote and sustain mutually beneficial research and education collaboration between the U.S. and China in this field. Via wireless sensing and network technologies, large-scale environmental monitoring systems offer major promise to realize these goals. Workshop topics include foundational sensing, network calculus theory; novel sensor architectures and protocols; and supporting platforms and technologies for the above applications. The workshop can foster substantial opportunities for fundamental research breakthroughs in this field that can bring about international research and educational impacts. The workshop anticipates establishing a research agenda for environmental monitoring for public health and disaster recovery; identify new environmental monitoring research problems, challenges, potential solutions, and future directions; and form five to seven teams that will examine unique topics in environmental monitoring. These theories, architectures, and protocols will enable novel platforms for proactive, patient-centric healthcare and real-time disaster recovery. All workshop research topics, discussions, and outcomes will be presented online. Female and minority faculty are especially encouraged to present their research at the workshop.","title":"U.S.-China Workshop on Environmental Monitoring for Public Health","awardID":"1231478","effectiveDate":"2012-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[523431],"PO":["557315"]},"196133":{"abstract":"The cost of writing data from a computer's processor to its storage components remains a bottleneck for modern computing systems. The speed of the processor continues to improve, more processing units are packed into a computer chip, but these advances only cause more data to be written to storage per second. The speed of storage subsystems has not kept pace with the processor?s ability to produce data for storage, and this difference in performance is likely to continue. Moreover, the trend in building storage subsystems for computers is to utilize technologies such as flash memories whose contents can be changed a relatively small number of times before the memory wears out. These technologies are cheaper and pack more storage into a given area, but care must be taken to avoid writing to memories made from such technologies at rates usually seen from a processor to memory. <br\/><br\/>This EAGER project aims to discover mechanisms that reduce or eliminate traffic from a processor to the storage subsystem. Elimination of such traffic increases the speed of the overall system and saves wear on storage components. This research finds data that would otherwise be sent to storage from the processor and eliminates such writes to memory. This technique is based on finding that such data cannot subsequently be referenced by an application. This effort focuses on a preliminary study to validate the technical approach, namely investigating the consequences of eliminating stores of data that has been explicitly deallocated by an application.","title":"EAGER: Collaborative Research: Compiler and Architecture Support for Avoiding Writes to Memory-Preliminary Study","awardID":"1237417","effectiveDate":"2012-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["13545"],"PO":["565272"]},"189621":{"abstract":"Systematic Analysis of Protocol Implementations<br\/><br\/>Internet protocol development and standardization has long been driven by the philosophy of 'rough consensus and running code.' The downside to this approach is that protocol specifications are rarely rigorously verified, even for properties that fall within the capabilities of protocol verification techniques. Further, the 'rough' nature of the approach means that some important design decisions are inevitably omitted from the specification or are defined ambiguously. Therefore, in practice the correctness, performance, and resilience of network protocols are implicitly defined by vendor and open-source implementations of the protocol specification, and these implementations are based upon the developers' varying interpretations of the standards document. This leaves developers in a bind: they are unsure of the properties of the protocol specification, and do not have tools to reason about the properties of complex protocol implementations.<br\/><br\/>Intellectual Merit. This project will develop a general approach and an associated tool that will enable developers and expert users to systematically analyze a variety of properties on a range of protocol implementations. The approach builds upon recent advances in program analysis techniques in novel ways that are tailored towards the special properties and requirements of protocol implementations. Moreover, the project will instantiate the general approach with new analyses for important tasks that are largely manual and highly error-prone today, including interoperability testing and precise tracking of state changes over time (e.g., to identify anomalous state sequences or characterize protocol complexity).<br\/><br\/>The project is based on the observation that protocol implementations have an implicit internal structure, in the form of a state machine that embodies the key behavioral properties of the implementation. Due to the complexity of protocol implementations, this state machine will typically not be completely inferable by program analysis. To address this problem, the project will develop operators on a protocol implementation that allow developers to specify scalable and precise views of the underlying state machine. Developers can additionally use these views to perform a targeted concrete execution of the protocol on a real topology in order to investigate the particular property under consideration.<br\/><br\/>The outcome of the project will be a software system called Spa. Developers will provide protocol implementations and use their expertise about the protocol and its properties of interest to specify appropriate operators and guide targeted concrete execution. The project will evolve Spa operators using experiences gained from applying Spa to several protocol analyses that have not been previously considered, and will start with a set of operators that have been informed by the PIs' preliminary research.<br\/><br\/>Broader Impact. The protocols that underlie access to our networked world must be reliable, robust to attacks, and must perform well over a range of conditions and in dynamic environments. This project will equip developers and experts to systematically analyze the behavior of their protocols, and will result in an overall improvement in the reliability, robustness, and performance of deployed protocols. The project will accelerate the adoption of the research by making Spa available to researchers and developers, publishing its research results in top networking and programming language conferences, and educating students on the developed research methods by incorporating them in curricula. It will also engage underrepresented groups and undergraduates in research.","title":"NeTS: Medium: Collaborative Research: Systematic Analysis of Protocol Implementations","awardID":"1162240","effectiveDate":"2012-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["553707"],"PO":["564993"]},"189555":{"abstract":"In this project, the research team explores several research challenges to exploit the relationship between images, video, and the people viewing this visual imagery. Areas of exploration include: 1) behavioral experiments to better understand the relationship between human viewers and imagery, 2) development of human-computer collaborative systems for image and video understanding that utilize automatic computer vision algorithms in conjunction with active and passive cues from human viewers, and 3) implementing retrieval and collection organization applications using our collaborative models.<br\/><br\/>Billions of images and millions of videos are now available online via the infrastructure of amazingly successful companies from Google to Microsoft to Facebook. This wealth of visual data is creating considerable opportunities for communication and community, and tightening the social fabric of our world. In parallel to this explosion in online imagery, there is also an increasing proliferation of cameras viewing the user, from the ever present webcams peering out at us from our laptops, to cell phone cameras carried in our pockets wherever we go. This record of a user's viewing behavior, particularly of their eye, body movements, or descriptions, can provide enormous insight into how people interact with images or video, and can inform construction of more effective visual applications such as image or video retrieval. In addition, understanding what people recognize, attend to, or describe about an image or video is a necessary step toward high level goals of human centric image understanding that will have research benefits to many diverse fields, including computer vision and behavioral science.","title":"RI: Medium: Integrating Humans and Computers for Image and Video Understanding","awardID":"1161876","effectiveDate":"2012-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["511442",508251,508252],"PO":["564316"]},"200786":{"abstract":"Some have heralded multi-touch interaction as the technology to drive computing systems into the future. But as we move towards a world where interaction is based on human body movement that are not well documented or studied, we risk creating technology and systems that may lead to musculoskeletal disorders (MSDs). This is not a hypothetical but a real danger. In the past devices such as keyboards have led to MSDs, yet many new systems make no effort to avoid gestures that are known to lead to musculoskeletal disorders or to eliminate gestures that are symptomatic of a patient population. With multi-touch interfaces currently being considered for adoption by companies and academia, it is now more critical than ever that good design practices incorporating preventive approaches be implemented in the initial stages of product design and development. In this research, the PI and his interdisciplinary team that includes experts in human-computer interaction, kinesiology and ergonomics will evaluate the effect of multi-touch interaction on the musculoskeletal system and provide mechanisms for developing safe multi-touch systems that involve interactions designed to cause minimal musculoskeletal stress and risk. Project outcomes will include best practices and standards for interaction that are safe yet allow users to fully benefit from the new levels of immersion that multi-touch interaction affords. In particular, the PI will develop a toolkit that will allow multi-touch designers to input a gesture movement and evaluate its induced stress in a variety of situations and under different variables. In addition, the software will allow input of formal definitions of HCI tasks and some choices of gestures, and will suggest a set of suitable gestures for the task based on the given choices. To achieve these goals, the PI will explore new formal models of human-computer interaction that take multi-touch interaction into account at both the cognitive and psychomotor levels.<br\/><br\/>Broader Impacts: This research will provide multi-touch interaction researchers with valuable new models and tools that focus not on a particular application area but rather on the generic technique of multi-touch interaction and design. The new biomechanical models will also contribute to our fundamental understanding of the functioning of our hands. Project outcomes will be generalizable to other emerging types of input devices, such as the Nintendo Wii remote.","title":"HCC: Medium: A Toolkit to Evaluate the Effect of Multitouch Interaction on the Musculoskeletal System and Design Safe Multitouch Systems","awardID":"1262010","effectiveDate":"2012-05-16","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[538347],"PO":["565227"]},"197750":{"abstract":"This project is developing underwater acoustic tracking strategies for locating and tracking particular species of tagged sharks that have long distance migratory paths. A unique aspect of this project is that receivers will be onboard a team of Autonomous Underwater Vehicles (AUV), enabling them to cooperatively estimate the shark position, thereby allowing the AUVs to track and follow the shark for sustained periods of time. The AUV team's mobility and ability to modify its own path in response to shark movement allows it to obtain in-situ measurements that cannot be obtained from static receiver systems typically used for monitoring shark behavior.<br\/><br\/>Due to its interdisciplinary nature, this project will make contributions in both Engineering (AUV autonomy and control) and Biological Sciences (shark behavior characterization, life history, and habitat utilization). New approaches to state estimation are being developed. A key to creating a successful estimator for this application will be incorporating kinematic and dynamic models of shark locomotion. Novel control strategies are also necessary given the difficulty of tracking sharks that can travel at high speed. Tracking controllers don't typically consider the additional constraint of maintaining a separation distance to ensure the AUV doesn't affect shark behavior. The end goal of conducting shark tracking experiments will be the first of its kind. Additionally, much merit will be derived from the actual data the experiments yield. Specifically, the engineering within this project is driven by the goal of determining the relationships between local ocean environment variables (e.g. temperatures, current velocities) and shark behavior (e.g. migration path choices, habitat use). While there is considerable knowledge of shark physiology and behavior, there are no fine scale time studies of shark motion and its associated energy use within different behaviors.<br\/><br\/>This work includes developing new AUV sampling technologies that can be generalized and applied to studying various forms of marine life, and in addition to the ecological contributions, the research is applicable to other tasks associated with safe marine navigation, homeland security, and the military.","title":"RI: Small: RUI: Shark Tracking with Multiple Autonomous Underwater Vehicles","awardID":"1245813","effectiveDate":"2012-05-25","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["536000"],"PO":["564069"]},"192074":{"abstract":"This proposal requests funds to help support meeting costs and travel expenses of U.S. students, post docs and young scientists to the International Conference on Mathematical Geophysics to be held in the University of Edinburgh, from June 18-22, 2012. No tenured faculty will be supported with these funds, and priority will be given to underrepresented groups (women and minorities). The Conference on Mathematical Geophysics (CMG) is sponsored by the Committee on Mathematical Geophysics of the International Union of Geodesy and Geophysics (see organizing committees below). The conference website can be found at http:\/\/www.cmgedinburgh2012.org.uk. The 2012 conference is titled \"Confronting models with data\".<br\/><br\/>This conference brings together applied mathematicians, computational scientists and Earth scientists from geophysics, physical oceanography, and atmospheric and climate dynamics, to discuss advances in Earth sciences. This year's meeting emphasizes the need to confront complex mathematical Earth-system models with increasing quantities of observations of the Earth, oceans and atmosphere. The scope of the CMG meeting is significantly extended this year to include dedicated sessions in physical oceanography, atmospheric and climate dynamics, and applied math, connecting the latter to the \"Mathematics of Planet Earth\" international initiative. This meeting provides a unique multi-disciplinary forum for the exchange of ideas and techniques across the disciplinary boundaries in the Earth sciences. It allows interactions among Earth scientists from disciplines that do not normally communicate, such as physical oceanographers and geophysicists. Funds are requested to support travel and lodging costs for 22 U.S. students, post-docs, and early career scientists, approximately a half of the number attending past meetings.<br\/><br\/>The proposed funding provides an important opportunity for U.S. students and early career scientists to interact with each other and with senior scientists in an informal setting. The organizers will directly contact Earth science faculty members in universities and colleges with students from under-represented groups, to encourage their students and colleagues to apply for travel and lodging grants to attend the conference. Earth science issues to be discussed in this meeting are all highly relevant not only from a scientific point of view, but especially due to their societal and economic implications. This includes the study of earthquakes, climate change and more.","title":"Requesting support for young US scientists to attend the Conference on Mathematical Geophysics 2012","awardID":"1210870","effectiveDate":"2012-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1574","name":"GEOPHYSICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}}],"PIcoPI":["542582"],"PO":["563232"]},"200633":{"abstract":"Decentralized architectures for decision-making are coming to the fore as more and more distributed infrastructures are deployed to address current challenges and needs of society, including \"smart grids\" for energy distribution, sensor and actuator networks for ecological monitoring and control, sustainable mass transportation systems, etc. The objective is to ensure that local actions at the nodes result in coherent collective behavior of the network. Systems of this type operate in highly uncertain environments that are noisy, unpredictable and possibly subject to adversarial disturbances. The goal of this research project is to develop a comprehensive theoretical and algorithmic framework for real-time adaptive decision-making in such large-scale systems under resource and cost constraints.<br\/><br\/>Online decision-making is concerned with real-time sequential planning in the presence of model uncertainty, nonstationarity, and possibly adversarial disturbances. The investigators study a novel extension of this paradigm to decentralized settings, where the actions have to be taken at the nodes of a large network, and the nodes only have access to noisy local information. The research entails explicit consideration of a temporally varying environment with a priori unknown dynamics; analysis and application in settings with significant model uncertainty, potential unmodeled statistical dependencies in observations either across the network nodes or over time, and possible adversarial contamination of data; and accounting for the influence of the decisions and network actions on the surrounding environment. The theoretical component of the project captures the impact of decentralization on the quality of the decision-making; the algorithmic component is to develop, analyze, and implement algorithms that come as close as possible to the derived theoretical bounds.","title":"CIF: Small: Distributed Online Decision-Making in Large-Scale Networks","awardID":"1261120","effectiveDate":"2012-05-16","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["541985"],"PO":["564924"]},"187049":{"abstract":"Wide-scale deployment of wireless sensor networks has been hindered primarily by the inability to endure for long durations on small power sources. The focus of this project is on creating computationally efficient electronics to extend the lifetimes of wireless sensor nodes. Ultra-low-power analog circuitry is used to provide additional computational resources at each sensor node while simultaneously reducing the total power consumed. This project systematically addresses how to effectively use analog signal processing in a wide variety of wireless sensor network applications by investigating (1) the creation of modifiable, easy-to-use smart-sensor architectures for ultra-low-power computation, (2) continuous-time signal-processing approaches for event-detection systems (including biologically inspired processing), and (3) ultra-low-power memory storage and data conversion techniques. <br\/><br\/>The importance of this research is in providing the knowledge necessary to create drastically improved nodes for wireless sensor networks in terms of power consumption and computational ability. The same low-power design techniques can be used for a variety of other power-constrained applications such as consumer electronics and biomedical\/implantable devices. Integrating education and outreach with the research of this project will lead to (1) close mentoring of undergraduate and graduate students in a team-centric environment, (2) cross-disciplinary coursework, and (3) high-school outreach activities to expose many new students, including those from underrepresented groups, to engineering and electronic systems.","title":"CAREER: Energy-Efficient Sensor Networks Using Analog Signal Processing","awardID":"1148815","effectiveDate":"2012-05-01","expirationDate":"2017-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["537495"],"PO":["564778"]},"196784":{"abstract":"High-fidelity scientific simulations of natural phenomena, such as massive star explosion, hurricane movement, or fusion energy production increasingly become not only compute-intensive but also data-intensive. \"Big\" data produced by large-scale simulations calls for sustainable data management solutions that increase energy efficiency, enable predictive data analytics, and reduce time-to-discovery. In response to this critical need, Adaptive Mesh Refinement (AMR) has emerged as a promising technology to achieve considerable savings in memory, computation, and storage resources, while maintaining or even increasing simulation accuracy. With AMR, scientists can adaptively balance between high-resolution look into \"the unusual\" areas and low-precision glance at \"the usual\" areas of the simulated phenomena.<br\/><br\/>The strength of AMR selective fine-grain refinement of salient areas of the simulationis also becoming its weakness. The non-uniform structure of its underlying mesh leads to inefficient post-simulation access to the \"Big\" data along the path from data analytics to scientific discovery. The data generation process of space-time simulation proceeds from one time step to the next and requires the context of only two time steps, while storing data for only one time step on the disk. In contrast, visual data analytics often requires the full context of the available data, not just a single time step. In fact, simulations that are driven by local space-time relationships are largely performed with the purpose of discovering or explaining non-local and large-scale space-time relationships through interactive \"what-if\" data exploration. Thus, the fundamental differences in data context and heterogeneity of access patterns call for analytics-driven scientific data management solutions.<br\/><br\/>To close this gap, this project aims to significantly advance database management for \"Big\" AMR data by making data analytics and data reduction the first class citizens of the database design and query processing. To support analytics-driven efficient query processing, it offers a transformative shift from the traditional indexing of data to the proposed indexing of information about data compression and hierarchical data layout in storage. The former incurs substantial storage overhead, while the latter is anticipated to be storage-friendly with significantly faster data retrieval in response to user queries. <br\/><br\/>To realize this ambitious goal, innovations are proposed in three broad areas of data-intensive computer science: semantic modeling, scientific database management, and high performance storage. Specifically, the scientific database management is going to be cognizant of rich data access-and-query semantics specific to AMR data, capable of in situ data compression and indexing during data generation by the simulation, and optimized for heterogeneous access patterns through novel data layout methodologies. <br\/><br\/>This research is being conducted in a close partnership with the three national labs' research teams with pioneering technologies in high performance storage, AMR, and high-fidelity climate change simulations. The approaches and formalisms developed in this research are expected to be applicable to a broad range of scientific and engineering problems that utilize simulation models for predictive understanding of physical processes through \"Big\" data analytics. The techniques developed under this project are expected to accelerate the crucial process of data-driven exploration and knowledge discovery in the scientific workflow. This project also plans significant efforts in \"Big\" data education, diversity, community engagement, and the dissemination of results through academic publications and open-source software.","title":"Analytics-driven Efficient Indexing and Query Processing of Extreme Scale AMR Data","awardID":"1240682","effectiveDate":"2012-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[527891],"PO":["565272"]},"196334":{"abstract":"Software developers have difficulty, and therefore waste a significant amount of time, navigating around the code base as they perform software maintenance activities. Thus, a major challenge that confronts software engineering is to understand how developers seek relevant code and further invent tools that facilitate code navigation. Previous research has resulted in some ad hoc tools without any theoretical basis, along with some descriptive theories derived by observing developer behavior. These approaches have produced only modest improvements. A more comprehensive and effective solution can only be reached through a theoretical understanding of the code navigation task itself. This research seeks a unified theory for code navigation based on mathematically modeled foraging mechanisms that evolved to help our animal ancestors to find food. These same mechanisms appear to work as users seek useful information in the vastness of the Web. Developers, like organisms foraging for food, need to evolve the strategies to maximize the gains of useful information to their maintenance tasks per unit cost. The research will explore the usefulness of this analogy and adopt theories, models and tools that could eventually help lower the cost and effort of software development and maintenance. <br\/><br\/>This EAGER proposal focuses on an exploration of the extent to which the code foraging environment can be automatically enriched by software clustering. The hypothesis guiding this research is that the way programming artifacts are grouped (clustered) can affect the profitability of the information foraging environment, which in turn can shape the way developers navigate the code base. In order to test the hypothesis, the PI will (i) develop an experimental framework to assess topical locality in software, (ii) create a new set of metrics to guide the evaluation of code rearrangement and foraging tools, and (iii) compare well-established source code clustering algorithms to discover effective enrichment mechanisms. The research will be evaluated through experiments with large open-source projects that have recorded detailed developer interaction logs.","title":"SHF: EAGER: Clustering Programming Artifacts to Enrich Code Foraging Environment","awardID":"1238336","effectiveDate":"2012-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[526425],"PO":["564388"]},"188612":{"abstract":"SPIRE-EIT (Summer Program for Interdisciplinary Research and Education - Emerging InterfaceTechnologies) at Iowa State University is a 10-week summer program for undergraduates that integrates research and education in emerging interface technologies. Students gain hands-on research experience using cyberinfrastructure and take brief focused classes in computer programming and graphics, and human computer interaction. For the remaining time, students conduct interdisciplinary research projects in groups. The research projects are presented at an end-of-the summer campus-wide research symposium in the form of posters, demos, and a five-page research paper. Intellectual Merit: Two major trends are driving research in Emerging Interface Technologies: a dramatic increase in interface technologies themselves, and the ubiquitous permeation of technology into everyday lives. Correspondingly, research questions focus on four broad areas of EIT: information visualization, mobile\/ubiquitous interfaces, intelligent agents, and enabling infrastructure. Faculty in ISU's HCI graduate program compete to participate in the SPIRE and cite strong benefits from participation afterwards. Broader Impact: Both the HCI program and SPIRE-EIT recruit with an emphasis on underrepresented groups, preparing students for graduate education in the interdisciplinary area of HCI, an area of importance to the US economy. By including instruction on ethics and on research-based evaluation techniques, the SPIRE gives students skills that are useful lifelong, independent of discipline, and which students might not otherwise encounter in a traditional engineering or computer science curriculum. Each year, the SPIRE projects typically result in one-two professional academic conference presentations with SPIRE students as co-authors, disseminating its research results.","title":"REU Site: Summer Program for Interdisciplinary Research and Education - Emerging Interface Technologies (SPIRE-EIT)","awardID":"1156841","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505751,505752],"PO":["563751"]},"189624":{"abstract":"As CMOS technologies scale down to smaller geometries, integrated circuits become more sensitive to aging-driven variations. Such variations can cause a manufactured part to become unreliable in the field over a period of time due to aging-induced circuit failures. To guard against this problem, it is essential to build design-time and run-time techniques that can model and optimize CMOS circuits. The AgELESS project brings together expertise in circuit design, computer-aided design, and test techniques, which together are expected to provide a more complete set of solutions to the overcome the reliability hurdle. This work explores several major aging-related failures, and develops a toolbox of techniques that can be used to enhance circuit reliability, while ensuring that the circuit meets all specifications on power\/energy and performance. While AgELESS will not make a circuit ageless, it is expected to ensure that it will age less. <br\/><br\/>The techniques developed in this research will be applicable to a range of applications of interest to the semiconductor industry, including enterprise-class for high-end computing systems, mobile and wireless communication applications, and embedded electronics, and will be made available to industry through multiple avenues, including industrial collaborations and active dissemination of research results. The educational impact of this project will involve new course materials on reliability for the undergraduate and graduate curriculum, and will train future scientists\/engineers to learn creative problem-solving skills.","title":"SHF: Medium: Collaborative Research: AgELESS: Aging Estimation and Lifetime Enhancement in Silicon Systems","awardID":"1162267","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":[508418,"541006"],"PO":["562984"]},"189536":{"abstract":"This research investigates a new approach to protecting the reliability of digital communication and digital storage systems. This approach takes advantage of recent work (by the research team and others) that formulates the \"encoding\" and \"decoding\" of data in terms of a novel graphical representation; this formulation has several advantages over existing techniques for insuring data integrity, including better performance at very low power and the absence of an 'error floor', i.e., the ability to consistently (and significantly) lower the decoded error probability with incremental expenditures of power. The ultimate goal of the research is more reliable delivery of digital data, text, computer files, speech and audio signals, video, etc. - using devices that require less power (and thus have longer battery life) and shorter processing delay.<br\/><br\/>More specifically, the research investigates the use of spatially coupled sparse codes - channel (error control) codes with a sparse parity check representation formed by coupling together a chain of small \"protographs\". This approach, which was pioneered by the research team in the context of terminated low-density parity check convolutional codes, has recently been shown to possess a unique combination of properties - iterative decoding performance that approaches channel capacity and minimum distance that grows linearly with block length - as the code size gets large. The research follows four tracks: (1) the design and analysis of low latency\/memory decoding strategies; (2) decoded error probability performance guarantees; (3) the development and analysis of spatially coupled sparse codes with algebraic structure; and (4) the application of spatial coupling outside the immediate domain of channel coding, including cooperative diversity, compressed sensing, and multi-terminal source\/channel coding.","title":"CIF: Medium: Collaborative Research: Spatially Coupled Sparse Codes on Graphs - Theory, Practice, and Extensions","awardID":"1161798","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["508496"],"PO":["564924"]},"187237":{"abstract":"Connected data is a hallmark of the Internet age. We now have an unprecedented ability to collect information i) on social relationships from websites like Facebook; ii) on connections between ideas from hyperlinked repositories such as Wikipedia; iii) on links between scientific fields from online cross-referenced citation databases; iv) on interactions between proteins in biology; and v) even on the connections in the human brain. Network computations, such as finding the most important people, ideas, papers, or the most important connections, help refine these raw collections of information into meaningful summaries. Consequently, making these computations fast and efficient will help produce scientific insights from the growing plethora of data available.<br\/><br\/>A highly successful paradigm for stating network computations is as the solution of a matrix problem. For instance, such an approach was the heart of Google's celebrated PageRank algorithm for finding the most important pages on the web. Modern connected data, however, is so large that it has eclipsed the ability of even the best algorithms from the 20th century to cope. Interesting network computations have become more complicated as well. The investigator will study a new class of algorithms to compute nonlinear functions of matrices, such as the matrix exponential. The matrix exponential has many uses; for example, it underlies many new computations designed to identify the most important relationships in neural networks. Standard techniques for the matrix exponential involve examining all of the connections at each step (and there could be hundreds or thousands of steps), only to highlight a few pieces of information. A more recent paradigm, called local computations, only utilizes the connections from a few entities (in the matrix, they only look at a few rows or columns) at a time. The goal of this research is to design new algorithms for the matrix exponential and other functions of matrices in the local computations paradigm. These new algorithms will be able to operate on the world's largest networks quickly (ideally in seconds or minutes), and help application specialists study their data in new ways. Three driving applications will be ranking and voting, link prediction, and brain networks. The investigation will also include the study of higher-order connections in networks that give rise to three or four dimensional matrices -- commonly called tensors. <br\/><br\/>All of the software developed for this research will be made available in a software package for local computations of matrix functions. The investigator will present tutorials on this software package to ensure that researchers across many disciplines can utilize the outcome of this research. To ensure that this research reaches students across many disciplines, the investigator will develop a graduate course on the use of matrix methods for network computations. Finally, given the growing importance of network data, the investigator will develop a module for high school students to show how solving systems of equations, part of the core high school curriculum, can be used to analyze information networks.","title":"CAREER: Modern Numerical Matrix Methods for Network and Graph Computations","awardID":"1149756","effectiveDate":"2012-05-01","expirationDate":"2017-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":[502227],"PO":["565251"]},"180461":{"abstract":"The impending exhaustion of available IPv4 address space is finally motivating network operators to begin deploying to IPv6. There are two possible outcomes from this transition. IPv6 may be widely adopted and embraced, causing many existing methods that measure and monitor the Internet to be ineffective. In this transition scenario, the Internet will be even less well understood, and data even more scarce, than the existing, poorly instrumented IPv4-based network. A second possibility is that IPv6 languishes, transition mechanisms fail, or performance suffers. Either scenario demands new research on rigorous large-scale IPv6 measurement to inform technical, business, and policy decisions.<br\/><br\/>In this project, researchers from CAIDA and from the Naval Postgraduate School are engaged in measurements and data analysis exploring the evolution of IPv6 deployment. First, they are focusing on improving the fidelity, scope, and usability of IPv6 measurement technology as necessary for providing a comprehensive view of the IPv6 topology from core to edge. To attain this objective, the researchers are building new tools that will measure the characteristics of IPv6 adoption at the edge and developing new methodologies to compare characteristics of IPv4 and IPv6 connectivity. The resulting data sets will serve as input to the next task: correlating these observations with other available technical and socioeconomic data, such as address allocation, geographic and traffic data, ISP organizational structure, and political\/regulatory factors potentially influencing IPv6 deployment.<br\/><br\/>Finally, CAIDA and NPS researchers are going to conduct quantitative assessment of IPv6 performance, including the impact of transition technologies and traffic characteristics. This study will improve the state of quantitative modeling of the IPv6 transition by gathering rigorous empirical data on the extent and effectiveness of converter technologies, investigating prevailing concerns over IPv6 performance and path inflation, and analyzing actual IPv6 traffic workloads on a major U.S. backbone.<br\/><br\/>The intellectual merit of this project includes solid empirically grounded understanding of the most difficult architectural transition ever attempted on the Internet, while simultaneously advancing the state-of-the-art in network measurement science and technology. A rigorous approach to the study of IPv6 deployment represents a compelling case study for the current Internet, with applicability to technology transfer challenges in other domains. <br\/><br\/>To maximize their broader impact, the results will be widely disseminated to research, commercial, and government sectors, informing communications and technology policies. Data, tools, and methodologies will be available to researchers and used to create accessible educational materials for future generations, who will be even more dependent on a robust Internet than we are today.","title":"NeTS: Large: Collaborative Research: Exploring the Evolution of IPv6: Topology, Performance, and Traffic","awardID":"1111449","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["521741"],"PO":["565090"]},"195102":{"abstract":"This proposal requests travel funds from NSF to assist 20 US students to participate in PerMIS 2012, which will be held at the University of Maryland University College in Hyattsville, Maryland. The purpose of this Group Travel Grant Proposal is to make it possible for US students and postdocs to attend the conference, present their work, and forge connections with colleagues from around the world. <br\/><br\/>The Performance Metrics for Intelligent Systems workshop is the only one of its kind dedicated to defining measures and methodologies of evaluating performance of intelligent systems. This years theme revolves around Cyber Physical Systems, an important area of research highlighted in the recent PCAST report. As part of this award, students will also have the opportunity to participate in special events and learn more about the field of performance metrics and cyber physical systems. Travel funding will be in the form of partial airfare reimbursement and full reimbursement for student registration to approximately 20 U.S. students who plan to present at least one paper at the Conference.<br\/><br\/>Broader Impacts: The importance of performance metrics for engineered systems cannot be overstated. The benefit to student learning and mentorship by encouraging attendance of students by direct monetary means brings large dividends in student confidence, knowledge and expertise.","title":"Student Travel for PerMIS 2012","awardID":"1230469","effectiveDate":"2012-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["551322"],"PO":["543539"]},"196126":{"abstract":"This project will engage and inspire the next generation of computational scientists<br\/>through a series of training and engagement activities, including: a four-day Open<br\/>Science Grid User School for undergraduate and graduate students; participation by<br\/>students in the XSEDE12 conference; and supporting attendance by XSEDE Campus<br\/>Champions from minority serving institutions (MSIs) and smaller colleges and<br\/>universities at the XSEDE12 conference. These activities build on prior successes with<br\/>the TeraGrid student program and OSG Summer School and expand the breadth of the<br\/>impact that XSEDE and OSG will have with the participating students.","title":"XSEDE and OSG 2012 Engagement Program for Students and Campus Champions","awardID":"1237393","effectiveDate":"2012-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"7245","name":"PHYSICS GRID COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}}],"PIcoPI":[525724,525725,525726],"PO":[525727]},"189537":{"abstract":"The Internet is a global ``network of networks,'' connecting a broad range of edge networks together into a fabric that enriches the lives and businesses of millions of people every day. Study of the Internet---from routing behavior to traffic characteristics to inferring operator policies to security properties and beyond---has blossomed over the past two decades. A large literature now exists of studies undertaken by the research community, producing much empirically-based insight into the Internet's operation. However, the edge networks that the Internet weaves together---from cellular to enterprise to residential to data center networks---have received far less empirical study. The complexity of these networks grows ever-increasing, yet our understanding has failed to keep pace.<br\/><br\/>Despite their widespread use and major roles in facilitating modern economic productivity, networks at this scale have received at best fleeting examination in the research literature. Part of the issue with studying these types of networks is that general availability of analysis tools is nearly non-existent. While tools to analyze packet trace data from wide-area networks are plentiful, this is not the case for enterprise networks. For instance, there are many application layer protocols that manifest inside enterprise networks, but rarely transit the shared Internet, for which no packet trace analysis tools exist. In this project we will develop such tools in the context of the Bro intrusion detection system.<br\/>These tools will form a capability that enables deep analysis of enterprise networks by the research community at-large.<br\/><br\/>Intellectual merit: Enterprise networks are vastly complicated entities that have been significantly understudied by the community. This project will dramatically broaden and deepen our capability to soundly measure these critical networks.<br\/><br\/>Broader impact: By building enterprise network analysis techniques directly into the open-source Bro network monitoring system, we will enable broad access to these new capabilities, aiding both researchers conducting investigations of enterprise networks, and security operators who deploy Bro to protect their networks. As Bro has hundreds of users, providing this latter group with new analysis capabilities will have a significant real-world impact on network security.","title":"NeTS: Medium: Characterizing Enterprise Networks","awardID":"1161799","effectiveDate":"2012-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["562327","563433"],"PO":["564993"]},"193112":{"abstract":"This project is providing support for travel and registration for U.S. participants in a key global venue for research and training in the learning sciences via the Doctoral Consortium and Early Career Workshops at the International Conference of the Learning Sciences (ICLS) 2012 conference in Sydney, Australia. Earlier versions of these workshops have had an important impact on the careers and research of pre- and post-PhD scholars in the learning sciences from diverse domains such as computer science, information science, education, psychology, and cognitive science. The intellectual merit of this project rests in its selection of top-quality pre- and post-doctoral candidates whose research in the learning sciences holds promise to advance the overall theme of the conference, \"The Future of Learning.\" In particular participants are reflecting on principled understandings of learning to date and considering new and\/or iterated theoretical and empirical directions for the field. In addition, attendees are seeking to make advances in the scientific understanding of learning that can inform policy and formal and informal educational experiences of students. This goal is particularly vital given the ongoing and dramatic transformations of society affected by a variety of digital media and communications technologies, fast paced societal changes, and the scale of significant global challenges. Participation in these workshops is an important capacity-building effort that leverages the expertise of the entire international Learning Sciences community and the outcomes of previous workshops. The broader impacts of this project include multiplying opportunities to develop international collaborations in the field Learning Sciences, and supporting the career development of some of the best and brightest researchers in multiple disciplines who work in this area.","title":"ICLS 2012 Doctoral Consortium and Early Career Workshop","awardID":"1216699","effectiveDate":"2012-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8020","name":"Cyberlearning: Transforming Ed"}}],"PIcoPI":[517315],"PO":["560894"]},"187843":{"abstract":"Language comprehension, whether listening or reading, is a rapid skill that requires the coordination of perception (e.g., recognizing printed words on a page), action (e.g., controlling the movement of the eyes), memory (e.g. remembering what came in earlier parts of a sentence to relate them to later parts), and linguistic knowledge (e.g., using the order of words to constrain possible relations among them). Understanding how these processes are combined on a moment-to-moment basis has been a major challenge for cognitive science. This project will develop and test a new theory of language comprehension from an adaptive perspective. The hypothesis is that language processing may be understood as the coordinated, adaptive control of both internal (and limited) cognitive processes and external perceptual-motor actions so as to maximize specific task goals. To apply this idea to language, the investigators will formalize and implement optimal control models of limited Bayesian perception and memory for different reading tasks. These Bounded Optimal Control models will generate predictions that will be tested by monitoring the eye-movements and responses of humans.<br\/><br\/>Bounded Optimal Control is a new approach to language, thought, and action, with possibly major long-term implications for how we understand and address individual differences and deficits in reading ability. It represents a shift in scientific focus from seeking to describe the perceptual and cognitive strategies that the mind and brain employ during reading, to specifying clearly the problems for which these strategies are the solutions. There is no canonical strategy because there is no canonical problem. Thus, the best cognitive and perceptual strategies are determined by specific task goals and individual constraints. This has the potential to change our approach to reading deficits: rather than asking how an individual's reading strategies deviate from normal, it is possible to ask instead whether those strategies are the best possible strategies, taking into account both task goals and idiosyncratic cognitive constraints. Revealing the true nature of the gaps between actual behavior and \"bounded optimal\" behavior is an important step in understanding how to go about closing them.","title":"Language Processing as Boundedly Optimal Control of Memory, Perception, and Action","awardID":"1152819","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[503531,"550371"],"PO":["564506"]},"196468":{"abstract":"This proposal focuses on developing methods to automate the time-consuming process of selecting good overview and review articles from on-line new sources. The goal is to select articles understandable by persons outside the field and use them on the AITopics information portal maintained by the AAAI. The AITopics website is a widely used authoritative source about Artificial Intelligence that is used by a wide variety of people seeking information about AI: novices, students, the press, etc. AITopics is intended to provide explanatory, accessible material about multiple subtopics that make up the field of AI. This project will develop new methods for this finding\/filtering such articles and build on methods already used by AITopics. The resulting software will be open-source and is intended in the long run to be applicable to other scientific discipline beyond AI, particularly by their professional societies.<br\/><br\/>The project will pursue two thrusts to generalize the current NewsFinder program, which was developed as a part of AITopics and currently finds many types of news stories about AI. The first thrust of this project is to enable it to find overview and review articles automatically. The second thrust is to enable the program to learn from data collected from readers and administrators.","title":"EAGER: RI: Collecting and Filtering Online Information in Science","awardID":"1239062","effectiveDate":"2012-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550649"],"PO":["565035"]},"196237":{"abstract":"This grant provides travel support for doctoral students at the 2012 Model-Driven Engineering Languages and Systems Conference (MODELS). The students will attend a doctoral symposium, where they will get feedback from a panel of leaders in the field on their research. They will also participate as scribes in workshops related to their research area. The broader impacts of this grant is the education and training of the students as well as the building of the next generation of researchers in this area. In this important area of Software Engineering field, the US is seriously underrepresented, and this grant will help increase participation from US students.","title":"Model-Driven Engineering Languages and Systems Conference Participant Funding","awardID":"1237945","effectiveDate":"2012-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["557996","555863",526084],"PO":["564388"]},"189846":{"abstract":"This funding establishes a new CISE Research Experiences for Teachers (RET) site focused on emerging technologies in mobile computing at the University of Nebraska at Omaha. Each summer a cohort of teachers from Omaha Public Schools will conduct research with faculty at the university. They will also develop problem-based learning modules which they will integrate into their classes during the school year. Numerous academic year activities will expand the project to many other computing teachers thus impacting over 4,320 students in the participating schools. This site is co-funded by the Experimental Program to Stimulate Competitive Research (EPSCoR) Program. <br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The project team has significant related research and experience in educational applications and K-12 school outreach. The projects are in research areas that are current and of interest to teachers and their students. <br\/><br\/>The broader impacts of the project include providing a quality research experience to teachers and the infusion of sound instructional models into the K-12 schools. The project includes outreach to a large community of teachers in the metropolitan Omaha region and should impact a student population that has a significant minority population. The materials will be broadly disseminated for use by others. The project has the potential to create a sustainable partnership between the university and schools thus benefitting the Omaha area for years to come.","title":"RET in Engineering and Computer Science Site on Infusing Mobile Platform Applied Research into Teaching (IMPART)","awardID":"1201136","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[508985,508986],"PO":["564181"]},"189505":{"abstract":"Systematic Analysis of Protocol Implementations<br\/><br\/>Internet protocol development and standardization has long been driven by the philosophy of 'rough consensus and running code.' The downside to this approach is that protocol specifications are rarely rigorously verified, even for properties that fall within the capabilities of protocol verification techniques. Further, the 'rough' nature of the approach means that some important design decisions are inevitably omitted from the specification or are defined ambiguously. Therefore, in practice the correctness, performance, and resilience of network protocols are implicitly defined by vendor and open-source implementations of the protocol specification, and these implementations are based upon the developers' varying interpretations of the standards document. This leaves developers in a bind: they are unsure of the properties of the protocol specification, and do not have tools to reason about the properties of complex protocol implementations.<br\/><br\/>Intellectual Merit. This project will develop a general approach and an associated tool that will enable developers and expert users to systematically analyze a variety of properties on a range of protocol implementations. The approach builds upon recent advances in program analysis techniques in novel ways that are tailored towards the special properties and requirements of protocol implementations. Moreover, the project will instantiate the general approach with new analyses for important tasks that are largely manual and highly error-prone today, including interoperability testing and precise tracking of state changes over time (e.g., to identify anomalous state sequences or characterize protocol complexity).<br\/><br\/>The project is based on the observation that protocol implementations have an implicit internal structure, in the form of a state machine that embodies the key behavioral properties of the implementation. Due to the complexity of protocol implementations, this state machine will typically not be completely inferable by program analysis. To address this problem, the project will develop operators on a protocol implementation that allow developers to specify scalable and precise views of the underlying state machine. Developers can additionally use these views to perform a targeted concrete execution of the protocol on a real topology in order to investigate the particular property under consideration.<br\/><br\/>The outcome of the project will be a software system called Spa. Developers will provide protocol implementations and use their expertise about the protocol and its properties of interest to specify appropriate operators and guide targeted concrete execution. The project will evolve Spa operators using experiences gained from applying Spa to several protocol analyses that have not been previously considered, and will start with a set of operators that have been informed by the PIs' preliminary research.<br\/><br\/>Broader Impact. The protocols that underlie access to our networked world must be reliable, robust to attacks, and must perform well over a range of conditions and in dynamic environments. This project will equip developers and experts to systematically analyze the behavior of their protocols, and will result in an overall improvement in the reliability, robustness, and performance of deployed protocols. The project will accelerate the adoption of the research by making Spa available to researchers and developers, publishing its research results in top networking and programming language conferences, and educating students on the developed research methods by incorporating them in curricula. It will also engage underrepresented groups and undergraduates in research.","title":"NeTS: Medium: Collaborative Research: Systematic Analysis of Protocol Implementations","awardID":"1161595","effectiveDate":"2012-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["515836"],"PO":["564993"]},"188658":{"abstract":"This project represents a continuation of a Research Experience for Undergraduates site in Computer Vision which has operated successfully at the University of Central Florida for the past twenty four years. Approximately two hundred and forty undergraduate students from forty-five institutions all over the country have participated in this program over the years. The research focus area is Computer Vision. The current proposal is to have 10 participants per year, for three years. Each year, students will participate in a 12-week duration full-time Summer program. From lessons learned in prior years, the proposed model includes round-the-clock mentoring by a team that includes a professor, and a post-doctoral fellow or a graduate student; a streamlined short course that lets participants start their research projects sooner; daily meetings with mentors to plan activities throughout the day; training in MatLab for quick turnaround of research ideas. Participants take the short course, match themselves to a project topic that they most desire, and spend sufficient time in focused research. They then can opt for follow-through over the year by working with the professors to write a technical report on their project, to prepare for the GREs and to apply to graduate programs. In past years, a substantial fraction of our REU participants have been able to prepare a paper for submission to a refereed conference, have the paper accepted and then attend the conference to present the paper.","title":"REU Site: Research Experience for Undergraduates in Computer Vision","awardID":"1156990","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505885,505886],"PO":["563751"]},"189527":{"abstract":"This research investigates a new approach to protecting the reliability of digital communication and digital storage systems. This approach takes advantage of recent work (by the research team and others) that formulates the \"encoding\" and \"decoding\" of data in terms of a novel graphical representation; this formulation has several advantages over existing techniques for insuring data integrity, including better performance at very low power and the absence of an 'error floor', i.e., the ability to consistently (and significantly) lower the decoded error probability with incremental expenditures of power. The ultimate goal of the research is more reliable delivery of digital data, text, computer files, speech and audio signals, video, etc. - using devices that require less power (and thus have longer battery life) and shorter processing delay.<br\/><br\/>More specifically, the research investigates the use of spatially coupled sparse codes - channel (error control) codes with a sparse parity check representation formed by coupling together a chain of small \"protographs\". This approach, which was pioneered by the research team in the context of terminated low-density parity check convolutional codes, has recently been shown to possess a unique combination of properties - iterative decoding performance that approaches channel capacity and minimum distance that grows linearly with block length - as the code size gets large. The research follows four tracks: (1) the design and analysis of low latency\/memory decoding strategies; (2) decoded error probability performance guarantees; (3) the development and analysis of spatially coupled sparse codes with algebraic structure; and (4) the application of spatial coupling outside the immediate domain of channel coding, including cooperative diversity, compressed sensing, and multi-terminal source\/channel coding.","title":"CIF: Medium: Collaborative Research: Spatially Coupled Sparse Codes on Graphs - Theory, Practice, and Extensions","awardID":"1161754","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[508186,"40607"],"PO":["564924"]},"195203":{"abstract":"Williams College proposes to organize a workshop that focuses on developing and disseminating new tools and curricula for undergraduate courses in distributed systems and computer networks that leverage the resources available in publicly-accessible testbeds. Given the ubiquity of distributed systems, it is imperative that undergraduate computing education properly address their design and implementation. A key challenge today in teaching distributed systems at the college-level is providing students access to computing and networking resources distributed across the country and world. Educators have an opportunity to fill this gap using a variety of publicly-accessible testbed and cloud platforms now emerging in academia and industry. The 20-30 workshop attendees will come from a variety of institutions, including research universities, liberal arts colleges, and industry. The goal of the workshop is to identify a set of teaching materials that may be used at a broad cross-section of colleges and universities to provide undergraduates with the necessary background and motivation to become involved in systems research. The workshop will result in a report that details the participants' findings, as well as a website that aggregates the relevant educational material.","title":"NSF Workshop: Designing Tools and Curricula for Undergraduate Courses in Distributed Systems","awardID":"1231167","effectiveDate":"2012-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[523270],"PO":["560704"]},"197997":{"abstract":"Fourier analysis, where we decompose a complex function into a sum of simple oscillations, is used in virtually every form of digital technology, from JPEG compression to voice recognition. In computer science, Fourier analysis has led to new algorithms for \"pseudorandom numbers,\" i.e., numbers with no apparent pattern, which are useful both in cryptography and in algorithms for estimating functions and confirming computational claims. Fourier analysis also plays a key role in Shor's quantum algorithm for factoring, which breaks RSA public-key cryptography, and in proofs that some problems are hard to solve with certain kinds of parallel algorithms or circuits. <br\/><br\/>Profs. Moore and Russell will use the more powerful tool of nonabelian Fourier analysis to obtain new results in these areas. In particular, they propose new ways to \"derandomize\" algorithms, replacing random numbers with pseudorandom ones. They will study the extent to which rich, high-dimensional structures can be embedded in low-dimensional spaces with only a small amount of distortion, and prove that certain problems require a long time even for quantum computers to solve. Finally, they will study whether some alternatives to RSA, such as the McEliece cryptosystem based on error-correcting codes, will remain secure even if and when quantum computers are built. Thus their research has important impacts on algorithms, security, and cryptography. They teach courses that train students from Physics and Computer Science to work at the boundary between these disciplines, and their outreach activities include bringing this material to high school and middle-school teachers.","title":"AF: Small: Collaborative Research: Representation-theoretic techniques for pseudorandomness and lower bounds","awardID":"1247081","effectiveDate":"2012-05-12","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[531365],"PO":["565157"]},"196118":{"abstract":"The PI is using this award to organize a one-day workshop on writing successful NSF CAREER Proposals. The proposed workshop is to be conducted on May 18th, 2012 near Arizona State University, Tempe, AZ. <br\/><br\/>The objective of this workshop is to bring together experienced proposal writers, recent NSF CAREER awardees, program directors from the NSF, and young faculty who are interested in gaining knowledge on how to turn their visionary ideas into successful CAREER proposals and jumpstart their successful careers.","title":"NSF Career Writing Workshop","awardID":"1237329","effectiveDate":"2012-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[525702],"PO":["565255"]},"189518":{"abstract":"Conventional microprocessors are designed primarily for sustained<br\/>performance; they can operate at near-peak performance essentially<br\/>indefinitely until their energy source is exhausted. In battery and<br\/>cooling constrained environments such as mobile devices, sustained power<br\/>(and, consequently, peak performance) must be limited to at most a few<br\/>watts so that the device can dissipate heat using only passive<br\/>convection. However, many interactive mobile applications (such as<br\/>handwriting\/speech recognition or image-based search) instead call for<br\/>bursts of intense computation in response to user input, creating the<br\/>need for a new ultra-responsive operating regime: rather than limit peak<br\/>power assuming sustained operation, systems should instead exploit heat<br\/>storage to enable brief computation bursts that greatly exceed<br\/>sustainable thermal limits without overheating. This project<br\/>investigates an approach called \"computational sprinting\", the central<br\/>essence of which is to compute at unsustainable rates but only briefly<br\/>so that temperatures do not reach unsafe levels.<br\/><br\/>The goal of this project is to address the architectural, thermal,<br\/>electrical, and software barriers to ultra-responsiveness via<br\/>computational sprinting. In particular, the project explores: (1)<br\/>architectures and memory systems that sprint via parallelism (activating<br\/>tens of reserve functional units\/cores) and voltage boosting<br\/>(overdriving cores for single-thread performance) while facilitating<br\/>fast burst onsets; (2) thermal designs that improve thermal response<br\/>behavior to enable longer and more intense sprints; (3) mobile-optimized <br\/>electrical designs that provide stable supply voltages<br\/>despite current surges of an order-of-magnitude or more; and <br\/>(4) software mechanisms that explicitly manage limited thermal budgets <br\/>and anticipate and stage data needed during the sprint. The project<br\/>includes the fabrication of an experimental testbed to approximate the<br\/>computational, thermal and electrical capabilities of a future many-core<br\/>mobile device and to provide practical experience with sprinting.<br\/>Project impacts include (1) developing and advancing techniques for<br\/>improving the responsiveness of mobile devices and (2) integrating the<br\/>discoveries into a new cross-departmental course on computer system<br\/>design.","title":"SHF: Medium:Collaborative Research: Ultra-Responsive Architectures for Mobile Platforms","awardID":"1161681","effectiveDate":"2012-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556655"],"PO":["366560"]},"192379":{"abstract":"Recent years have seen the growth of a new field at the intersection of computer science and economics: algorithmic economics. So far there were few opportunities for students to receive a concentrated exposure to this field. This first-ever summer school on algorithmic economics, to be held at Carnegie Mellon University in Summer 2012, will bring together roughly fifty Ph.D. and advanced undergraduate students from computer science and the social sciences; and top researchers in algorithmic economics, who will give concentrated classes on their areas of expertise. The summer school will cover areas such as mechanism design, equilibrium computation, social choice, social networks, market design, and fair division. The proposed summer school will promote understanding within algorithmic economics, as well as foster collaboration between computer scientists and social scientists. It will emphasize emerging areas in algorithmic economics and help increase interest in these areas, thereby leading to conceptual and technical advances. The summer school will also serve as a basis for future summer schools on algorithmic economics.","title":"Summer School on Algorithmic Economics","awardID":"1212499","effectiveDate":"2012-05-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":["562905"],"PO":["562760"]},"193747":{"abstract":"This research is intended to build on, complement, and enhance the NSF future Internet architecture programs through cross-cutting and integrative comparative analysis of architectural proposals. Over the last 6 years, the National Science Foundation has created a series of programs focused on new Internet architecture and the embedding of networking into the larger social context: these include the Future Internet Design (FIND) program, the Network Science and Engineering (NetSE) program, and Future Internet Architecture (FIA) solicitation. This sequence of programs address a bold objective?to look into the future and challenge the research community to design the global network that the world will need fifteen years from now. In the current stage of the overall program, a number of teams have been funded to develop integrated proposals for the design of a future Internet. Each of these projects can be expected to produce a coherent justification for one or another approach to the architecture of a future network, but the overall outcome of the project should be much more than that: it should also result in overarching insights into design preferences and alternative approaches, general lessons about network system design, and a more systematic rationale for designing networks and concluding that one response to requirements is preferable to another. The FIA project should push the frontiers of principled network design, and this phase of the programs has laid the foundation for this exciting step.<br\/><br\/>This award addresses these larger project goals through a program of research that is complementary to the current awards, by looking across the projects (and other relevant architectural work) to seek more integrative and overarching conclusions. The challenge is difficult, given the diversity of goals and requirements that might be posed for a system as complex as the Internet, as well as the diversity of design approaches. In contrast to much of computer science research, this agenda is focused on comparative analysis, not engineering design. As appropriate, the research will be done in collaboration with the individual projects through cross-project studies on specific topics related to network design. The investigator will seek to involve others in the broader community who have given thought to high-level issues in network architecture, and will carry out his own research into principals and methods for network design. The investigator will also participate in the FIA PI meetings, since those meetings will explore specific topics in a cross-project way. <br\/><br\/>Intellectual merit: This NSF program should contribute to the long-rang goal of making network architecture design more methodical and systematic, and less an art; this research sets that goal as its highest-level objective. This research has the goal of discovering and articulating fundamental insights and conclusions with respect to issues in network design, results that arise from looking across the various different projects with their different approaches. Topics will include core network functions such as addressing and forwarding, dealing with important requirements such as security and availability, new areas of architectural study such as information-centric networks, and the relation between architectural design choices and larger social, economic and contextual requirements. <br\/><br\/>Broader impact: This research will provide a structure and direction for future research in network design, and provide a new and more principled way of teaching about networks. Most courses in networking today deal with the subject by teaching large numbers of facts: the formats of headers, operation of protocols, and so on, with less emphasis on the ?why? of design. Prior working papers of the investigator have been used in at least one advanced course on network architecture, and one ambition of this research is to develop materials suitable to the teaching of network architecture. The outcomes of this research can also help with the transfer of results from the FIA program into the commercial world. The investigator will also continue to provide support to the community toward the program goals.","title":"Integrated Future Internet Architecture","awardID":"1219557","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["565000"],"PO":["565090"]},"180459":{"abstract":"","title":"NeTS: Large: Collaborative Research: Exploring the Evolution of IPv6: Topology, Performance, and Traffic","awardID":"1111445","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["515844"],"PO":["565090"]},"190745":{"abstract":"This award provides funding for a new Computing Research Infrastructure (CRI) project focused on acquisition of a LiDAR scanner, a GPS unit, and an omnidirectional video camera to collect indoor and outdoor 3D positional data and imagery at George Mason University (GMU). Several research and educational opportunities will be enabled by the requested infrastructure. The intellectual merit of this project revolves around enabling research on several CISE research fields at GMU, including three-dimensional (3D) mapping for robotic navigation and manipulation, semantic parsing, motion planning and visibility-based tracking under significant environmental uncertainties. The equipment also provides data sources for studying and evaluating important geometric algorithms under significant sensor uncertainties including data compression, scene segmentation, and object recognition. <br\/><br\/>The broader impacts of this project, beyond enabling research in robotic navigation and manipulation, include support for research in other disciplines, and education. The new infrastructure will also enable multidisciplinary research teams at GMU to conduct research on important problems in homeland security, home and factory automation, disaster recovery, and environmental and infrastructure monitoring; and lead to enhanced research collaboration with other institutions. Research results, collected and processed geometric data, and software developed using this instrumentation will be made available to the wider research community. With strong institution support from GMU, the acquisition has sustainable management and maintenance plans to support STEM programs for underserved communities at GMU, activities in undergraduate and graduate courses and independent studies in robotics, computer vision, geometric computing, computer game design and GIS, and will help spawn student learning and interest in these cutting-edge technology areas.","title":"II-New: Acquisition of a Light Detection and Ranging (LiDAR) Scanner System","awardID":"1205260","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[511367,511368,"553609",511370,511371],"PO":["564778"]},"192805":{"abstract":"In response to the request by the Congress in the America COMPETES Act, the National Academies' National Research Council (NRC) is investigating some of the many pathways through which research contributes to our economy and well-being and serves other national goals. A diverse committee of experts is appointed to explore various methodological approaches to measurement of research quality, productivity, and impact; examine the explanatory power, predictive ability, and incentive effects of various measures of the potential impact of research on society; and identify the research and data needed to develop measures or other means to assess the impact of research. The committee's work includes examining prior efforts to assess research output and impact in industry, as well as in government, and relevant experiences of other countries.<br\/><br\/>The purview of the study is all federally supported research and spans basic research that contributes to fundamental understanding to use-inspired basic research. The committee, therefore, must be selective in identifying research areas for some in-depth investigations.<br\/><br\/>The committee's charge includes recommending how research could be better organized and supported to further contribute to advancing national goals. In particular, the committee is asked to address how the U.S. research enterprise can further adapt to a competitive and highly linked world with a globalized economy. <br\/><br\/>Broader impacts. The resulting assessments of research are critical to those who make decisions on the allocation of research funds. The study is expected to influence the pursuit of scientific research by many institutions and funded by many government agencies and other organizations.","title":"Assessing the Value of Research in Advancing National Goals","awardID":"1215040","effectiveDate":"2012-05-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0401","name":"Division of SBE Off of Multidisciplinary A","abbr":"SMA"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"7699","name":"ICER"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7261","name":"PROGRAM EVALUATION"}}],"PIcoPI":["544813"],"PO":["565013"]},"189780":{"abstract":"This funding establishes a new CISE Research Experiences for Teachers (RET) site focused on cyber security at the Dakota State University. The site will provide a diverse pool of in-service high school computer teachers in South Dakota with a quality experience conducting cutting-edge research in cyber security. The teachers will develop research based materials and activities which they will incorporate into their classes during the academic year. State secondary computing curricula will be updated to include cyber security and outreach will be conducted to reach a wide audience of teachers and students within the state. This site is co-funded by the Experimental Program to Stimulate Competitive Research (EPSCoR) Program. <br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The project team has significant related research and experience in educational applications and K-12 school outreach. The projects are in research areas that are in an area of national priority and of interest to teachers and their students. The project also has the potential to make a significant contribution to the discipline of computer science education through the development, implementation, and testing of materials and methods for infusing cyber security into the secondary computing curriculum.<br\/><br\/>The broader impacts of the project include providing a quality research experience to teachers and the incorporation of sound instructional models into the K-12 schools. The project includes many activities and outreach efforts that should impact an area that is somewhat geographically isolated and that is surrounded by a diverse population. The project has the potential to create a sustainable partnership between the university and schools that can provide long-lasting benefits to the community.","title":"RET Site in Cyber Security","awardID":"1200648","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["564245","548797",508813],"PO":["564181"]},"189452":{"abstract":"As CMOS technologies scale down to smaller geometries, integrated circuits become more sensitive to aging-driven variations. Such variations can cause a manufactured part to become unreliable in the field over a period of time due to aging-induced circuit failures. To guard against this problem, it is essential to build design-time and run-time techniques that can model and optimize CMOS circuits. The AgELESS project brings together expertise in circuit design, computer-aided design, and test techniques, which together are expected to provide a more complete set of solutions to the overcome the reliability hurdle. This work explores several major aging-related failures, and develops a toolbox of techniques that can be used to enhance circuit reliability, while ensuring that the circuit meets all specifications on power\/energy and performance. While AgELESS will not make a circuit ageless, it is expected to ensure that it will age less. <br\/><br\/>The techniques developed in this research will be applicable to a range of applications of interest to the semiconductor industry, including enterprise-class for high-end computing systems, mobile and wireless communication applications, and embedded electronics, and will be made available to industry through multiple avenues, including industrial collaborations and active dissemination of research results. The educational impact of this project will involve new course materials on reliability for the undergraduate and graduate curriculum, and will train future scientists\/engineers to learn creative problem-solving skills.","title":"SHF:Medium:Collaborative Research: AgeELESS: Aging Estimation and Lifetime Enhancement in Silicon Systems","awardID":"1161332","effectiveDate":"2012-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["559405"],"PO":["562984"]}}