{"1111":{"abstract":"9503747 Neumann College This proposal requests funds for Neumann College to establish a connection to the Internet using a developmental model which includes four stages: * Institutional cabling and wiring * Library and multicampus network * Integrating technology with teaching-learning * Outreach with underserved urban school (Chester, PA) for teacher development and student learning. These connections will rovide operations management and information services and it will give the college a 56 thousand bits per second connection to the NSFNET, a high speed (1.5 - 45 million bits per second) National Backbone network. The benefits of this NSFNET connection include e-mail between local and remote researchers and educators, file transfer capability and the ability to use remote computer resources. Also the college will have the ability to investigate innovation in educational resources and incorporate them into their curricula.","title":"Connections to NSFNET","awardID":"9503747","effectiveDate":"1995-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2549],"PO":["57343"]},"1243":{"abstract":"Two major goals in multiprogramming research are: (1) to design and understand the modules (e.g., processes or data objects) of a program in isolation, without considerations of interference by the other modules, and (2) to implement the modules on separate processors with a fine grain of interleaving so that no processor is ever locked out of accessing common data for long periods of time. Further, it is essential to devise a model in which the distinction between computation and communication is removed; in particular, the methods for designing and reasoning about the interfaces should be no different from those employed for the computations at the nodes of the network. The project is based on the hypothesis that many of the programming concepts developed for databases, object-oriented programming and designs of reactive systems can be unified into a compact model of distributed programs that meets the desired goals. In the past, much effort has gone into limiting interference among the modules by employing a variety of synchronization mechanisms: locks or semaphores, critical regions, monitors and communication. In this project, no specific communication or synchronization mechanism, except procedure call, is built into the model. Yet, the traditional schemes for communication using bounded or unbounded channels, semaphores, and accesses to shared memory can be encoded as modules. This project uses two distinct kinds of procedures, to model sequential and concurrent aspects of programming. The programming model allows for disciplined interactions between these two types of procedures. The research seeks to: (1) develop the model, in particular for dynamic creations of modules (2) implement the model on top of an existing language, and (3) develop the appropriate formalism to specify and verify the properties of programs.","title":"Modular Multiprogramming","awardID":"9504190","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["370809"],"PO":["250083"]},"5632":{"abstract":"9526114 Paulraj Traditional barriers across disciplines such as Communications, Computing, Control, and Signal Processing are fast disappearing. New technological challenges require concepts and techniques from several disciplines. Moreover, interdisciplinary approaches are being increasingly developed to tackle challenging problems in seemingly disparate areas. Driven by fundamentally new applications and approaches, the coming century will need even further convergence and cross- fertilization of ideas. The general objective of the conference is to highlight some of the recent advances made toward developing and integrated approach to problem solving at various levels, and to communicate some of the exciting questions and challenges that remain unsolved. The conference will stimulate discussions at various levels: mathematical foundations; algorithms: statistical and computational efficiency, numerical issues, new paradigms; architectures (parallel systems, hardwired, reconfigurable and programmable). ***","title":"Conference: International Conference on Communication, Computing, Control and Signal Processing. To be Held in Stanford, CA June 22-26, l995","awardID":"9526114","effectiveDate":"1995-06-15","expirationDate":"1995-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["535565"],"PO":["564728"]},"5358":{"abstract":"9523561<br\/><br\/>The Consortium for International Earth Science Information Network, in <br\/>cooperation with Peking Universtiy, is sponsoring a symposium entitled <br\/>\"Global Information Infrastructure: Implications for Science and <br\/>Sustainable Development\" which will take place at the XVIII Pacific Science <br\/>Congress in Beijing, China, 5-12 June 1995. This award will enable an <br\/>expert from the U.S. to present in this challenging venue in China an <br\/>historical perspective on the development of the Internet in the U.S. The <br\/>presentation will be the first in a special session discussing the Internet.","title":"Pacific Science Congress, Global Information Infrastructure Symposium","awardID":"9523561","effectiveDate":"1995-06-01","expirationDate":"1996-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["236241"],"PO":["43608"]},"1278":{"abstract":"9504291 Schauser The object of this proposal is to study parallel algorithms that run efficiently on modern multiprocessors and, in particular, on networks of workstations (NOWs). This research will use a simple but realistic model of communication, the LogP model. The goal is to use the model and its parameters to predict and improve the performance of algorithms on various architectures. In particular, it will provide a methodology for porting efficient code from one machine(e.g., a low-end NOW) to another (e.g., a high-end NOW\/MPP), such that both versions are efficient on their respective architectures. This work will be mostly of an experimental nature, and will be carried out on the Meiko CS-2. Some benefits to this research are : accurately predicting the performance of parallel code on other architectures, efficiently optimizing the ported algorithms, and making the use of low-end NOWs as test platforms much more viable.","title":"Postdoc: Efficient Algorithms for Networks of Workstations","awardID":"9504291","effectiveDate":"1995-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["194103"],"PO":["224490"]},"5404":{"abstract":"The goal of the Interactive Systems Workshop is to bring together the principal investigators of the projects within the Interactive Systems program to increase their awareness of related work from other disciplines within the program, to foster interchange between the investigators across disciplines. The areas covered by the Interactive Systems program seek solutions for the key bottleneck in expanding the usefulness of computer technology today. Whereas hardware or software resources were once the critical issues, improved communication with the user has become the most pressing need. While this problem arises in many areas of computer application and appears in various roles in different NSF programs, the Interactive Systems Program has the ability to provide a single locus for research on the core scientific issues that underlie communication between humans and machines that apply across many application domains. This workshop takes a step toward pulling together the basic science in the Interactive Systems area into a single cohesive approach that can address core issues that apply across many areas of the application of computer technology.","title":"Interactive Systems Workshop","awardID":"9523686","effectiveDate":"1995-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["519872"],"PO":["183208"]},"1631":{"abstract":"9505456 Klein This project connects Stark Technical College to the Internet over a 56 kbps line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"Connection to NSFNET","awardID":"9505456","effectiveDate":"1995-06-15","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[3784],"PO":["43608"]},"1301":{"abstract":"9504361 Hyatt This proposal requests funds for Maryland Institute College of Art to establish its own Internet node under the NSFNET program. These connections will provide operations management and information services and it will give the college a 56 thousand bits per second connection to the NSFNET, a high speed (1.5 - 45 million bits per second) National Backbone network. The benefits of this NSFNET connection include e-mail between local and remote researchers and educators, file transfer capability and the ability to use remote computer resources. Also the college will have the ability to investigate innovation in educational resources and incorporate them into their curricula.","title":"Connection to NSFNET","awardID":"9504361","effectiveDate":"1995-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2998],"PO":["43608"]},"4800":{"abstract":"IMACS Applied Computer Algebra Meeting, Albuquerque, NM, May 16-19, l995. This meeting focused on the applications of computer algebra systems (CAS) in engineering, applied mathematics, pure mathematics, and education. It was the first international meeting of this type. This meeting was particularly timely because of the great strides made in using deep computer algebra results like the Grobner Basis and quantifier- elimination algorithms and their generalizations to produce significant results in equations, in the analysis and implementation of discrete methods for differential equations, to control theory, and to many other areas. The use of computer-algebra techniques is growing rapidly in most if not all engineering and science areas and thus the dissemination of the latest techniques is important and are not covered by disciplinary meetings.","title":"IMACS Applied Computer Algebra Meeting, Albuquerque, NM","awardID":"9521541","effectiveDate":"1995-06-01","expirationDate":"1995-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485507"],"PO":["187585"]},"4845":{"abstract":"9521669 Lumia This award is to conduct the annual NSF Design and Manufacturing Grantees Conference. The conference will involve researchers from the Division of Design, Manufacture, and Industrial Innovation, the Division of Engineering Education and Centers and the Mechanics and Materials Program in the Division of Civil and Mechanical Structures, located within the Directorate for Engineering, the Division of Information, Robotics and Intelligent Systems, located within the Directorate for Computer and Information Science and Engineering and manufacturing related projects in the Division of Materials Research, located within the Directorate for Mathematical and Physical Sciences. The conference ensures that the individual researchers are informed about the ongoing activities of their colleagues. An elimination of duplication of their efforts may be achieved and a degree of cooperation may result from this activity. An overall improvement of efficiency of the research activity could be expected. In addition, the conference program organization allows for ample time to discuss manufacturing research in detail with the collective research community at the meeting, with feedback to and input from the National Science Foundation. Finally personal contacts between the grantees and program directors in the Divisions should contribute to clarifying many current issues in their work. The aims of the conference are to enhance communication between researchers, encourage joint research, promote synergism, and develop networks for technical interchange. Attendees to the conference gain an early access to the information disseminated. ***","title":"1996 NSF Design and Manufacturing Grantees Conference, January 3-5, 1996, Albuquerque, New Mexico","awardID":"9521669","effectiveDate":"1995-06-15","expirationDate":"1996-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1441","name":"MECHANICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1480","name":"ENGINEERING RESEARCH CENTERS"}}],"PIcoPI":["449805","307147",11822],"PO":["63357"]},"5736":{"abstract":"9526366 Weingarten As part of its new architecture for NSFNET, NSF is funding the creation of a very High Speed Backbone Network Service (vBNS). A major role envisioned for the vBNS is to serve as a platform for research on very high speed networking and networking applications. Now that the vBNS project is underway, it is time for the research community and those responsible for the vBNS to begin a closer dialog on what research can and will be done on the vBNS and how the researchers will gain access to the infrastructure. The Computing Research Association will sponsor a workshop to start that dialog. Approximately thirty researchers in networking and applications, from academia and industry, will meet in Washington DC on June 22 and 23, 1995. together with government agency officials and vBNS designers and operators, they will discuss the current and likely future research agendas in high speed networking and the implications of those agendas for the vBNS as an experimental environment.","title":"Workshop on the vBNS and the Research Agendafor Networking and Applications; June 22-23, 1995; Washington, D. C.","awardID":"9526366","effectiveDate":"1995-06-15","expirationDate":"1995-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["217930"],"PO":["43608"]},"1644":{"abstract":"The goal of this project is the development of a general approach to explanation generation for advice-giving systems that use mathematical or other quantitative problem-solving methods. Specific objectives are: (1) Development of a generalized methodology for this type of explanation; (2) Implementation of this methodology in a prototype system that can be used in different applications; and (3) Creation of systems for real-life environments. In this approach to explanation generation, the first task is determining the substance of the explanation, that is, discovering which quantitative values contribute to the decision process. The second task is translating the quantitative values into concepts that are understood by the non-technical user. The significance of this research lies in the development of rigorous methods for performing these tasks: how to represent the different conceptual ``worlds'' of the quantitative system and the lay user; how to determine significant factors for explanation; and how to translate between the two worlds. Practical implications include the possibility of d eveloping explanation generators for `off-the-shelf' decision support systems used by individuals who are not familiar with the formal models. As a result, these systems would be better accepted and more generally used.","title":"Explanation of Quantitative Systems: A General Approach to Providing Justifications to Non-Technical Users","awardID":"9505486","effectiveDate":"1995-06-01","expirationDate":"1996-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["34332"],"PO":["183208"]},"1776":{"abstract":"9505881 Urbashi Mitra In order for future wireless communications networks to accommodate a variety of potentially disparate sources (voice, data and video signals), multi-rate communication schemes must be developed. Possible sources such as voice, video, and data communications have inherently different quality of service (QoS) requirements. A constant bit-rate paradigm as exists in the current wireless network will not serve such multi-rated services of the future. The principal aim of this research is to begin the analysis and development of communication receivers for multi-user spread-spectrum communications with different information rates. Several multi-rate multi-user access schemes will be considered for Direct-Sequence Spread Spectrum Code-Division Multiple-Access communications. Three activities are planned for the preliminary study. First, existing single bit rate receivers will be investigated to determine whether they are easily extensible to multi-rate communications. Second, multi-user receivers will be created to explicitly exploit the redundancy in the mixture of narrowband and wideband user signals. Third, a cost function will be developed to compare the various receivers created. Due to the nature of the signals being considered, the probability of bit detection error does not fully capture the performance of a given receiver. The ultimate goal of the proposed preliminary research is to position the applicant to perform research on the design and analysis of true variable bit rate communications (e.g. video transmissions); communications where the bit rate is changing for each individual user. In multi-rate communications each user transmits at a constant rate which may differ from user to user. It is believed that such receivers must be adaptive in nature to properly support the variable rated traffic.","title":"Development & Analysis of Multi-user Receivers for Multi-rate Wireless Communication","awardID":"9505881","effectiveDate":"1995-06-15","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["515828"],"PO":["40607"]},"1303":{"abstract":"The goal of this research is to develop a system which automatically generates and animates conversations between multiple cooperative agents with appropriate and synchronized speech, intonation, facial expressions, and hand gestures. The research is based on theory which addresses relations and coordinations between these channels. The significance of this research is to provide a three-dimensional computer animation testbed for cooperative conversation theories. Human-machine interaction and training systems need more interactive and cooperative synthetic agents. Conversations are created by a dialogue planner that produces the text as well as the intonation of the utterances. The speaker\/listener relationship, the content of text, the intonation and the undertaken actions all determine facial expressions, lip motions, eye gaze, head motion, and arm gesture generators. This project will focus on domains in which agents must propose and agree on abstract plans, and may have to motivate and carry out physical actions and refer to objects in their physical environment during conversation.","title":"Synthesizing Conversation Between Human-Like Cooperative Agents","awardID":"9504372","effectiveDate":"1995-06-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["250637","397034"],"PO":["183208"]},"1229":{"abstract":"Distributed computer networks control, scheduling and management are well-studied topics in scientific and engineering applications, yet the problem of finding optimal approaches that are not too complex to solve or implement on practical systems remain unsolved. Many computer networks are naturally clustered, and imbalance of load usually occurs among the clusters rather than inside the clusters. This project will develop clustered computer networks' control, scheduling and management policies for allocating computational resources across network clusters and for managing network operations based on simple network management protocol(SNMP). This project will first develop clustering model based on the data collected from monitoring Bradley network loads from real applications. Then the project will investigate and develop adaptive computer algorithms and heuristic schemes for developing the control policies. Finally, the project will develop network load monitoring tools based on X- window and Tcl\/Tk for network manager interface. The control schemes developed are expected to be applicable to network load balancing and management in many other clustered distributed systems. The project is funded under the RUI program.","title":"RUI: Clustered Computer Network Control, Scheduling, and Management","awardID":"9504137","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["169582"],"PO":["250083"]},"1208":{"abstract":"9504075 Oden The almost simultaneous development, over the last decade, of hp adaptive finite elements and multi-processor computing as means of dramatically improving fluid flow simulations makes the possibility of combining them very intriguing. The potential payoffs are very high but there are many challenges before such a combination can be achieved. Promising new developments in data structures, adaptive strategies, problem decomposition and robust parallel equation solvers, albeit in the context of model elliptic problems, make this problem tractable. In this project an attempt will be made to extend most of these developments onto solving complex three dimensional viscous incompressible flows. In particular this project will develop a new hp adaptive finite element code built on top of an extendable hash table based data structure and equipped with sophisticated a posteriori error estimators, adaptive strategies for generating optimal meshes, and customized preconditioned conjugate gradient type parallel equation solvers.","title":"Postdoc: Parallel hp Adaptive Finite Elements for Viscous Incompressible 3D Flows","awardID":"9504075","effectiveDate":"1995-06-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["510448","485474"],"PO":["179296"]},"1407":{"abstract":"9504747 Moots This project connects Lima Technical College to the Internet over a T1 (1.544 thousand bit per second) line. Faculty and students will benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they will be able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Lima Technical College: A Link to the Global","awardID":"9504747","effectiveDate":"1995-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[3242,3243],"PO":["43608"]},"1718":{"abstract":"IRI-9505715 Kiang, Melody Arizona State University $17,999 - 12 mos Preliminary Research on Result Synthesis in a Distributed Artificial Intelligence Environment The goal of this study is to propose a systematic approach to synthesize solutions from a set of heterogeneous intelligent agents with overlapping expertise. A dichotomous classification problem will be examined to demonstrate how multiple inductive agents can work cooperatively to solve a problem. First, a comparative analysis of various inductive methods, including statistical and artificial intelligence (AI) techniques will be conducted. This is followed by an in-depth investigation of how the differences in sample characteristics (i.e., normality, linearity, etc.) affect the performance of each inductive method to establish a foundation for result integration. The concepts and procedures developed in meta-analysis statistics will be used to combine results. The research will facilitate true cooperation in a DAI environment by introducing computational models that promote negotiation through cooperation rather than competition. The incorporation of the models is expected to improve the overall performance and enhance the consistency and validity of a DAI system.","title":"Preliminary Research on Result Synthesis in a Distributed Artificial Intelligence Environment","awardID":"9505715","effectiveDate":"1995-06-15","expirationDate":"1996-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[3992],"PO":["503214"]},"350":{"abstract":"This research is on optimization algorithms for synthesis of multi- level loops, which occur in time and memory critical parts of scientific computing applications. The nested loops are modeled as multi-dimensional data-flow Graphs (MDFG); and algorithms taking advantage of the multi-dimensionality are being designed. By considering the multi-dimensional iteration space and the iteration body simultaneously, the transformation and optimization techniques are able to optimize throughput and memory requirement at the behavior level. Research topics include: graph transformation and optimization; data scheduling; and co-design. Polynomial-time algorithms for various graph models are being developed. This avoids exponential integer linear programming approaches.","title":"High-Level Design Methodologies for Time-Optimal and Memory-Optimal Systems","awardID":"9501006","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["456490"],"PO":["321058"]},"494":{"abstract":"NCR-9501452 Goldsmith, Andrea The broad goal of this research is to address fundamental issues in the design, analysis, and implementation of wireless networks. Issues treated will cross traditional boundaries between signal processing, communications, and networking. The work will first develop a networking, architecture and protocol suite to support the internetworking of wireless subnetworks. A hierarchical network infrastructure will be considered that exploits the broadcast capability and power control of radio channels. Optimum location of multimode gateways and hierarchical databases to aid in mobility management and routing within this infrastructure will be determined. Optimization techniques for efficient allocation of spectrum will be studied using techniques from dynamic programming. Formal methods for obtaining and analyzing channel policies will be developed and applied to analysis and design issues. Joint source\/channel coding techniques to minimize end to end distortion will be examined. Emerging wireless applications will be considered and a global networking infrastructure to support these applications will be sought. The education component will develop innovative and dynamic course programs at the undergraduate and graduate level in wireless communications, networks, and dynamic programming. These activities will encourage industrial collaborations.","title":"CAREER: Networking and Communication Techniques for Wireless Applications","awardID":"9501452","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["553691"],"PO":["150411"]},"792":{"abstract":"This proposal aims to answer a set of critical questions dealing with communication systems by way of the development and use of a simulation and implementation modeling environment for virtual circuit switches. The first question concerns systematic, standardized performance comparisons. Using relevant traffic models and trace data from actual applications, this study is standardizing performance measurements, eliminating the apples-to- oranges comparisons that result when considering performance results from different research groups. The second question concerns cost and implementation modeling. This work is integrating the design of system architecture and implementation. The particular focus is on electronic implementation and multichip module packaging technology. The third question concerns the role of architecture in providing quality of service guarantees. The usual abstraction of the switch as a queue hides too much detail about internal architecture that is relevant to traffic behavior when traversing a switch. This work is characterizing the effect on traffic of different switch architectures, and developing switch mechalisms to work in concert with other mechanisms in providing quality of service guarantees. The educational part of the project is using the simulation and implementation modeling environment as a key component of a graduate course in High Speed Switching Networks. In addition, portions of the research amp appear in two undergraduate courses, one on VLSI Design and the other on Modeling. Other education efforts include significant mentoring activity and ongoing improvement in teaching.","title":"A Systematic Approach to the Design of Cost-Effective, High Performance Switching Architectures","awardID":"9502669","effectiveDate":"1995-06-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550429"],"PO":[1783]},"694":{"abstract":"The area of digital image and video compression and communications has seen growing activity in recent years, including standardization efforts such as JPEG and MPEG, and an increased number of current or proposed applications from Cable or Satellite TV to videoconferencing and future multimedia services. This trend will continue to create an incentive for new compression techniques that are more efficient as well as better adapted to the particular transmission environments. The main thrust of this research is to provide adaptive compression techniques for video communications. Adaptive techniques are those where encoders are capable of matching their encoding procedure to the local characteristics of the source or the channel. Rate-distortion optimal solutions and fast heuristic approximations are being obtained for some of the problems of interest in video communications, such as bit allocation and rate control. A novel scalar adaptive quantizer, close in spirit to arithmetic coding, is being investigated. This new technique, combined with such popular quantization techniques as trellis coded quantization, will be used in real encoding situations. Convergence and asymptotic properties of this scheme are also being studied. For variable channel situations where transmission resources are shared, as in ATM networks for instance, rate constraints for each video connection are being designed to enable good individual video quality as well as efficient overall network utilization. This research is being carried out in the Digital Video Communications research laboratory that is currently being set up within the Signal and Image Processing Institute. Our main education goal is to provide teaching in the area of signal, image and video processing. We will introduce a digital video communications course, designed to cover material that is specific of video compression including the relevant communications aspects, and to provide hands-on experience for the students .","title":"Adaptive Compression Techniques for Digital Video Communications","awardID":"9502227","effectiveDate":"1995-06-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["451991"],"PO":["564898"]},"254":{"abstract":"This award supports the study of Cohen-Macaulay structures, in algebra, combinatorics, and geometry and is driven by their wide presence and the opportunities offered in issues of computational complexity. The principal investigator will investigate invariants of blowup algebras for their role in deciding the property of Cohen-Macaulay; will contribute to the ongoing process of algebraization of tangent and secant algebras; will study the role of various measures of complexity in the processing of basic operations of computational algebra; and will develop methods and algorithms that facilitate the efficient processing in large scale computations in cDaljit Ahlu geometry. This project is in the general area of computational algebra and the computer-aided computational aspects of this field. There is a growing interest in using computers to answer theoretical questions in algebra and conversely, algebra is quite useful for the development of algorithms. This research will not only aid in the development of computer programs in commutative algebra but will influence the development of computer programs in other areas. One aspect of this project concerns the development of a computer program which will solve systems of polynomial equations. This is significant in manufacturing both for modeling and for the development of robots.","title":"Mathematical Sciences: Studies in Commutative Algebra and Its Applications to Computational Algebra","awardID":"9500786","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["397526"],"PO":["150090"]},"840":{"abstract":"The research component of this faculty early career development proposal is aimed at developing a large, important, and fundamentally new class of multirate filter banks, systems and wavelets. Traditional developments of this topic within the signal processing community have been strongly motivated by applications involving signal analysis. In strong contrast, the research in this proposal is motivated by some important contemporary applications involving signal synthesis. In particular, multirate filterbank theory, wavelet theory have a potentially important and largely unexplored role to play in the synthesis of waveforms for a wide variety of broadband communications and remove sensing applications. In these applications, fundamentally different types of design criteria and constraints come into play in developing suitable multirate structures. Foremost among the important differences is that while for most applications involving signal analysis strong localization in time and frequency is emphasized, the kinds of applications that will be the focus of this work will require filterbanks and wavelets whose energy is widely dispersed in both time and frequency. We propose to explore several classes of orthogonal and biorthogonal dispersive, \"pseudorandom\" filterbanks and wavelet bases. Several specific application areas are to be pursued under the proposed research. One that will be emphasized will be digital wireless communications. Here dispersive filterbanks and wavelets are expected to lead to new code-division multiplexing systems that more efficiently combat fading, jamming, and other forms of multiple-access interference. Furthermore, we plan to implement the new wireless modems we develop in a DSP-based, real-time 900 Mz indoor wireless system testbed recently developed by the principal investigator as part of his wireless communications laboratory. The educational component of the proposal encompasses significant curriculum development at b oth the undergraduate and graduate levels, and a strong investment in the mentoring of graduate students. One teaching initiative involves the development of a recently introduced unified new undergraduate subject. This subject introduces undergraduate students, for the first time, to the fundamentals of communications, control and signal processing from a common perspective and which builds on a foundation of basic signals, systems, and probability. The second major teaching initiative involves the re-engineering of the fundamental graduate subject on stochastic processes, detection and estimation at MIT. In this subject, the object is to redevelop a syllabus, course notes, Matlab computer exercises, and homework problems that emphasize modern, unified perspective to random and deterministic signals and the associated signal processing algorithms. These curricular changes will also allow a number of advanced topics, including multiscale and nonlinear signal processing, to be incorporated. A final component of the education plan involves continued active mentoring of a diverse group of graduate students and nurturing their intellectual, professional, and personal growth. Ultimately, of course, this interaction is one of the most gratifying and important aspects of a academic career.","title":"Theory and Application of Dispersive Multirate Filterbacks and Wavelets","awardID":"9502885","effectiveDate":"1995-06-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["550597"],"PO":["564898"]},"730":{"abstract":"This research is on the development of methods for synthesis and verification of asynchronous circuits. The approach is to extend approximation techniques for state exploration, that have been successfully applied to speed-independent circuits, to semi-custom timed circuits. Tools and techniques being developed include: 1. estimators of circuit area, performance, and power at architectural, gate, and circuit levels; 2. a synthesis tool that accepts behavioral specifications and derives gate-level circuits; and 3. a hierarchical verification tool for timed circuits. The verification and synthesis tools are integrated so as to support advanced logic optimizations.","title":"Computer-Aided Design Tools for Asynchronous Circuits","awardID":"9502386","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["485748"],"PO":["321058"]},"642":{"abstract":"This project will develop a set of tools that will automatically map data and computation for HPF programs, thereby reducing the programming time and effort required for producing efficient and portable parallel programs. The system of tools will use the alignment-distribution graph as the internal representation of Fortran 90 (and HPF) programs and use graph-theoretic, linear- algebraic and discrete optimization techniques to determine alignment and distribution of arrays that minimize program completion time. The system will not be limited to the `owner- computes` rule often employed by HPF compilers, but will choose the computation rules that minimize running time of the program. The system will also provide a back-end for generating code for message passing systems, and a graphical user interface for debugging and visual feedback. The project will develop algorithms for inter-procedural layout analysis, and heuristics for reducing the complexity of analysis algorithms. The educational component of this project will develop undergraduate courses with laboratory emphasizing experiment design, measurement and use of statistical analysis.","title":"CAREER: Automatic Data and Computation Partitioning for Array-Parallel Languages","awardID":"9501979","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["64474"],"PO":["150697"]},"411":{"abstract":"9501172 Kaeli, David This research is investigating the inherent performance problems associated with object-oriented code execution. Traces are being captured from a number of object-oriented programming environments. A workload characterization is being performed to identify the underlying problems presented by this new programming model. Architectural changes are then proposed to improve the execution performance of object-oriented code. This research is investigating architectural changes to the hardware that will improve performance across all programming environments. As more and more software is developed using object- oriented languages, this research will have a direct impact on acceleration the performance of future applications. The educational part of this project is concerned with making improvements in the Computer Engineering curriculum, student advising tools, classroom computer aids, and undergraduate research courses.","title":"CAREER: Architectural Support for Object-oriented Code Execution","awardID":"9501172","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["557272"],"PO":[955]},"653":{"abstract":"The broad objective of this CAREER project is to help cement the status of software engineering as a discipline that uses models, methods, and mechanisms based on generalizable scientific knowledge. The research component of this project addresses three important problems in software design. The mediator method is an approach to design in which the behavioral relationships needed to integrate independent behaviors are separately identified and represented as objects external to the objects representing those behaviors. Externalizing relationships as mediators depends in turn on a careful application of both explicit and implicit invocation mechanisms. The first research focus is an attempt to improve scientific foundations for software design, scientifically testing the claim that common methods for designing integrated systems are poorer than the mediator method with respect to ease of evolution of integration requirements. Second is the exploration, through pilot projects, of using the mediator method to aid the design of distributed systems. Third is the investigation of a new approach to helping designers balance multiple objectives as software designs evolve. An environment that reflects how well a design meets each of several objectives by depicting divergences of the design from each of several a models, where each model is defined by the designer as good with respect to one particular objective. The teaching focus is intended to develop engineers who understand software design to be a multi-objective, risky activity, done with incomplete information and thus demanding creativity and reflective, rigorous, risk-reducing methods. To help students understand how to manage the complexity and risk of real software systems, courses focus on realistic development projects, such as a mobile robot system.","title":"CAREER: Toward a Scientific Basis for the design of Integrated Systems","awardID":"9502029","effectiveDate":"1995-06-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["469318"],"PO":["150697"]},"698":{"abstract":"This research is an investigation of techniques for efficient and effective testing of large sequential VLSI circuits. Two avenues are being pursued. First is the development of self-initializing memory elements and test time reduction techniques for circuits employing scan design. Second is development of new functional test techniques for large sequential circuits. The approach is to model large circuits as a network of finite state machines. From this model, algorithms for test generation are being developed. The algorithms are being optimized to provide good coverage for defects not modeled by stuck-at faults. Software instantiations of the test algorithms are being built.","title":"Low-Cost Test Techniques","awardID":"9502240","effectiveDate":"1995-06-15","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["100136"],"PO":["321058"]},"897":{"abstract":"Quantitative models of the human speech production system are needed for a better understanding of our cognitive abilities and for the development of high-quality speech synthesizers and automatic speech recognition systems. In the proposed research, production models for fricative consonants are developed. Modeling fricative consonants has always been a challenging problem because of the complex production mechanisms and the lack of sufficient articulatory and aerodynamic data for these sounds. In this study, articulatory data are obtained from Magnetic Resonance Images (MRI) and Dynamic Electropalatography (EPG), and aerodynamic data, from flow and pressure measurements. MRI reveals the 3D geometry of the vocal tract while EPG is important for studying articulatory dynamics. Aerodynamic data are crucial for studying turbulence generation during fricative production. The modeling approach is based on estimation theory, acoustics, and signal-processing techniques and uses the data obtained from the unified set of measurements described above. Although the study focuses on fricatives, the proposed novel approach can be used to study all speech sounds. In addition, the study fosters cross-disciplinary activities in Electrical Engineering, Radiology, and Linguistics. By developing parametric speech production models and by inferring articulatory dynamics from the acoustic waveform, better performance of speech synthesizers and speech recognition systems can be achieved.","title":"CAREER: From Imaging and Acoustic Data to Articulatory Synthesis","awardID":"9503089","effectiveDate":"1995-06-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["558131"],"PO":["565227"]},"612":{"abstract":"This research is an integrated approach to design of VLSI circuits, with an emphasis on developing tests for thermal and electrical stress, and power management. The first goal is to use stress testing as a low-cost alternative to burn-in. Methods to synthesize tests for electrical and thermal stress based on accurate measure of signal activity are being explored. In low power design, the following are being pursued: 1. develop Monte Carlo based approaches estimation of signal and glitching activity in sequential and DSP circuits; 2. find architectural and system-level power minimization techniques; 3. investigate current switching techniques for power management; and 4. design layout algorithms for circuits with low power consumption. Sample sequential and digital signal processing circuits are being synthesized.","title":"Integrated Framework for Test Synthesis, Power Optimization, and Reliable Design of VLSI Circuits","awardID":"9501869","effectiveDate":"1995-06-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["551012"],"PO":["321058"]},"579":{"abstract":"The goal of this project is two-fold. First, it seeks to study the communication characteristics of applications that can benefit from the computing power, very large memory, and high-speed communication of parallel computing systems. Within this context measurements are being takel of the traffic generated by both regular and irregular scientific applications, applications written in a variety of programming paradigms, data-mining applications and applications with real-time traffic demands. Second the project seeks to use the information gathered from applications to guide the designs for interconnect devices and programmable communication coprocessors that efficiently support multiple classes of applications and multiple programming paradigms. The education plan addresses two important issues in experimental computer science: First it addresses the issue to teaching a subject area, such as high performance computing, that is technology-driven and where the relevance of knowledge and information can have a very short life span. Second, it addresses the issue of teaching the methodology of experimentation and in particular the process of designing experiments.","title":"Application-Driven, High-Performance Communication in Parallel Computing Systems","awardID":"9501768","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[1329],"PO":[1330]},"833":{"abstract":"This project will develop compilation and implementation techniques for declarative programming languages on distributed memory architectures. The project consists of three parts. First, it will develop compile- time techniques for cost analysis of mess\\-age- passing implementations of declarative languages. Second, it will develop and implement algorithms for granularity control and task partitioning of languages with fine- grained implicit concurrency on distributed memory systems. Finally, the project will develop compile- time and runtime techniques for efficient execution of declarative languages in the context of multi-level memory hierarchies.","title":"Scalable Parallel Implementations of Declarative Programming Languages","awardID":"9502826","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550173"],"PO":["150697"]},"767":{"abstract":"IRI-9502548 Veloso, Manuela Carnegie-Mellon University $45,000 - 12mos CAREER: Planning, Execution, and Learning in Autonomous Robotic Agents Autonomous robotic agents need the ability to plan for and achieve high-level tasks. Current agents can achieve low-level execution goals such as object avoidance, but lack the ability to reason about and to carry out multiple interacting tasks. Integrating planning and execution by a robot is a complex task, requiring learning from prior experience to improve significantly the overall capabilities of the intelligent agent. We will explore the integration of planning, execution, and learning, where the robot's successes and failures are incorporated into a knowledge base to improve future goal-achievement performance. This project entails the investigation of a variety of system and knowledge engineering issues, including: communication between the planner and the executor; interaction between the robotic agent, the planning system, and the human user who may, at any time, request that certain tasks be performed; and gathering and interpretation of information to learn from experience. The scientific goal underlying this research is to understand the use of past experience to solve problems in complex situations affected by multiple factors with different degrees of controllability and interdependency. Even partial achievement of this goal could be of great significance to both the robotics and cognitive science or artificial intelligence research communities, bridging the representation and reasoning gap between high level planner-learner and autonomous agent executing tasks in the real world","title":"CAREER: Planning, Execution, and Learning in Autonomous Agents","awardID":"9502548","effectiveDate":"1995-06-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["518535"],"PO":["565227"]},"459":{"abstract":"NCR-9501345 Alexander Vardy The first focus of this research is on decoding of trellis codes. The work will attempt to establish new lower bounds on the trellis complexity of linear codes, to investigate the asymptotic trellis complexity of linear codes, to find the optimal sectionalization of a given trellis, to tabulate bounds on the trellis complexity for all of the best-known linear codes, and to extrapolate the results to lattices and sphere packings. The second activity is the development of novel data transmission techniques suited to specific channels of practical importance and extending beyond the classical error control approach. Guided by the general principle that the channel structure should be taken into account in a well-designed communication system, the following channels will be considered: bursty intersymbol interference channels, such as present day digital voice transmission, both twisted pair and wireless, and emerging digital subscriber loops; maximum a posteriori likelihood channels characterized by a nonuniform a priori distribution on the set of possible messages, arising in fixed rate quantization without entropy coding; channels characterized by an arbitrary specified set of most likely error patterns, such as those arising in concatenated coding, logic networks, and man-made noise environments; and channels characterized by subjective distortion criteria, rather than the overall system BER, such as those arising in speech and image coding. NCR-9502582 Konstantopoulos, Takis This is a proposal about the development of a rigorous approach toward network management and performance analysis for high-speed networks considering local and global aspects of a network management system. Local aspects include the design of flow controllers at the edges of the network that take into account the provision of quality of service and the interaction between users in a network switch. The investigator will extend recently develop ed techniques that are based on the so-called reflection mapping, develop testing techniques and simulations, and compare these to existing schemes. The investigator will also study traffic modeling. He will develop rigorous methods for validating self-similar traffic processes arising from the operation of an integrated services high-speed networks and use such models in establishing performance analysis methods. Studying the global aspects of a management system involves using a macroscopic picture of the network currently being developed by the investigator. The picture strips out the minutiae of the operation of the network, while retaining its dynamic character (it is not static). The investigator proposes the use of such a picture by a network management system in order to predict, prevent, and correct undesirable behavior that might lead to degradation of services across the network.","title":"CAREER: Data Transmission Techniques: Trellis-Decoding and Beyond","awardID":"9501345","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["485936"],"PO":["150411"]},"834":{"abstract":"Research Component: Closing the loop in AE systems. The project addresses augmented environment (AE) and virtual environment (VE) tracking system inadequacies through a new `unified-system` approach to AE system design. Even with the best head-mounted displays (HMDs) and graphic systems available, the shortcomings of tracking systems hinder or preclude the usefulness of many AE\/VE applications. Such applications, including on-line surgical visualization, assembly or maintenance assistance, and interactive training simulations, require robust solutions to the following problems. 1) Achieving millimeter (position) and 0.1 degree (orientation) accuracy. 2) Readily achieving precise calibration of tracking systems to the real world. 3) Eliminating (or minimizing) latency in tracking (and graphics) systems to prevent gross misalignment during head motion. This project aims to develop new technology and improved methods for making video-based AE systems usable and productive for commercial and scientific applications. The long term research goal is the accurate alignment of real and virtual objects in an augmented environment under all conditions of user activity including rapid head motion. Achieving such performance required the integration of new image and tracking function components into an AE system. A 2D alignment error metric forms a basis for the compensation of a variety of 3D tracking and calibration errors. Corrections are computed and applied at every frame creating a closed loop system which compensated for both static and dynamic (latency-induced) misalignment. The project will produce increased understanding of closed loop AR systems by 1) implementing a software simulator to facilitate rapid exploration of closed loop AE system design options for feature detection error measurement, and error compensation, 2) designing a new AE system architecture with components which have simple, well-defined interfaces to other co mpenents in the system, and 3) developing a prototype of a complete closed-loop AE system and quantifying its performance characteristics. Education Component: Richer understanding through experience. Teaching responsibilities include at least one course during each Fall and Spring semester. A two-course Computer Graphics sequence for graduate students is under development. These courses build on the introductory undergraduate course and emphasize project creation. Hands on system-building learning opportunities, at the appropriate levels for students, are a major focus of the educational activities. In addition to syllabus design and class teaching, directed-research and advising promotes student-faculty interactions. A CD-ROM with computer graphics simulations of graphics concepts will be developed for both introductory and advanced levels.","title":"CAREER: Closed-Loop Augmented Environment Systems","awardID":"9502830","effectiveDate":"1995-06-15","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["233683"],"PO":["187585"]},"1192":{"abstract":"9504002 Gottlieb New spectral multi-domain methods for unsteady hyperbolic problems in complex geometries will be developed further and implemented on scalable parallel computer architectures. These schemes are based on the use of a penalty term for enforcing the boundary\/patching conditions and the schemes may proven asymptotically stable. A new approach to spectral methods will allow for unstructured grids in the individual subdomains. Combining these two novel approaches will result in an algorithm with full geometric flexibility.","title":"Postdoc: Spectral Methods for Complex Geometries","awardID":"9504002","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["387213"],"PO":["224490"]},"658":{"abstract":"This project is applying parallel I\/O technology to reduce I\/O delay in volume visualization. Volume images that arise from such applications as computer tomography and 3D ultrasound are too large to fit within random access frame buffers. As a result, disk I\/O is in the critical path for volume rendering. This project is exploring the use of a new parallel volume rendering technique that traverses 3D data sets in an order that eliminates I\/O conflicts in a parallel disk array. Consequently, the entire bandwidth of the disk array is available to the rendering application. In this project, a high performance volume visualization server using this idea is being designed, implemented with off-the-shelf components, and evaluated. A supplement supporting Research Experiences for Undergraduates will permit advanced undergraduate students to contribute to the project by implementing and measuring I\/O intensive applications. JUSTIFICATION","title":"Parallel I\/O for 3D Volume Visualization","awardID":"9502067","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["202714"],"PO":["549626"]},"548":{"abstract":"Compile-time type information is believed to be very valuable in efficient compilation of functional languages such as Standard ML. But little is known on how to support type-directed compilation in real compilers and how much performance gain one can get from various type-based optimizations. The goal of this research is to design and identify important type-directed compilation techniques that can significantly improve the performance of ML programs. These new compilation techniques are expected to lead to the following nice results: (1) data objects (including recursive data structures) in ML programs will be able to use unboxed data representations that are as efficient as those in C programs; (2) polymorphic functions and parametrized modules will be implemented efficiently through cross-module type specialization and inlining expansion; (3) type information propagated into the compiler back end will be used to assist program analysis such as closure analysis and instruction scheduling. The educational component of this CAREER award seeks two objectives: the construction of a new compiler lab kit (based on the above type-based ML compiler) and the incorporation of state-of-the-art compiler technology into the undergraduate and graduate curriculum.","title":"CAREER: Type-Directed Compilation","awardID":"9501624","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550517"],"PO":["150697"]},"559":{"abstract":"Active noise control is the suppression of unwanted noise via destructive interference using a digital signal processing system with sensors and actuators. The goal of this research is to achieve significant performance gains and computational complexity reductions in active noise control technology through fundamental research in multichannel algorithm design and analysis, to enable the wider use of this technology in industrial and consumer markets. These efforts include: 1. the development of computationally-efficient, gradient- based adaptive controllers employing simplified updating strategies; 2. the application of least-squares and orthogonalization methods for robust and statistically-efficient filter adaptation; 3. the design of multichannel subband implementations of active noise controllers using adaptive infinite impulse-response filters; and 4. analysis and development of multichannel system identification methods that require a minimum of processing capability and that provide robust performance in time-varying situations. The research effort includes both system simulation and hardware development to verify the underlying principles, performances, and constraints of real-world active noise control systems. To be most useful, an engineering education must forge a relationship between the capabilities of various technologies and the needs of the community at-large. The goal of this effort is to maintain the relevance of an engineering education by bringing the industrial, societal, and academic communities closer together through individual and group interaction. Activities to foster this interaction include: 1. promoting joint university\/industry technical projects through participation in the University of Utah Engineering Clinic Program; 2. incorporating research activities in active noise control within the undergraduate and graduate curriculum through individual clas s projects; 3. developing an integrated electrical engineering curriculum through departmental committee work; and 4. reaching out to the community through Engineering Career Days and the advising of prospective transfer students. The educational effort involves the design of new course projects, committee work at the Department level, and extensive interaction with students, other educators, and members of the local community.","title":"Advanced Architectures for Multichannel Active Noise Control","awardID":"9501680","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[1284],"PO":["564898"]},"5251":{"abstract":"This workshop addressed issues in building problem solving environments (PSEs) for partial differential equation (PDE) based applications and, more concretely, initiating a development of a set of common community standards for the components of scaleable PDE libraries. There is no natural forum for establishing such standards and yet they are essential to progress in building PSEs for PDE based applications. The size and complexity of these software systems require that builders be able to use components developed by other groups. The results of this workshop are of three types: (1) A proceedings which compiles the material presented at the workshop, (2) a workshop overview paper to be submitted to IEEE Computational Science and Engineering, and (3) A series of smaller follow-on meetings of a group of five to ten people who will specify, analyze, and propose community standards for components of scalable PDE libraries. These standards, will build on existing standards from sub-areas such as linear algebra (ScaLAPAK) and parallel computing (e.g., HPF, MPI).","title":"ARPA-NSF Workshop: Scalable Scientific Software Libraries and Problem Solving Environments, Purdue University, September 25-27, l995","awardID":"9523243","effectiveDate":"1995-06-01","expirationDate":"1996-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["493579"],"PO":["187585"]},"703":{"abstract":"The objective of this research is to develop a system that reliably resolves ellipsis in English. The system will accept syntactically annotated input, and it will produce output in which elliptical expressions are resolved, either by producing a non-elliptical paraphrase or by linking the elliptical expression to its antecedent. The system will be develmped using the Penn Treebank, a syntactically annotated corpus of several million words, containing a wide range of texts of varying styles. This research makes crucial use of newly available syntactic annotation and associated tools in the Penn Treebank. The system will be tested on examples from the Treebank to determine the percentage of cases in which ellipsis is correctly resolved. The primary goal of the system is to develop a practical solution to a major outstanding problem in computational linguistics: determining the antecedent for ellipsis occurrences. The project will also have an important secondary benefit: it will result in a massive amount of valuable data for theoreticians studying ellipsis and related phenomena.","title":"CAREER: Ellipis Resolution in English in Natural Language Processing Systems","awardID":"9502257","effectiveDate":"1995-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["138565"],"PO":["565227"]},"715":{"abstract":"This research is on path delay testing. Tools and techniques to enable the development and evaluation of practical at-speed delay tests are being investigated. Test generators, fault simulators, and techniques for the design of design-for-testability (DFT) and built-in self-test (BIST) circuitry are being developed. Special attention is being paid to robust delay testing of the most critical circuit paths. Software tools which provide a practical testing solution for large circuits are being developed.","title":"CAREER: Tool for At-Speed Robust Path Delay Testing","awardID":"9502300","effectiveDate":"1995-06-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["535238"],"PO":["321058"]},"1062":{"abstract":"This RUI research project is a companion project to CCR-9424154 (PI: Wang) of UNC at Greensboro. The research project centers about the relations among average- case complexity classes. Complexity theory began with the study of hierarchies among worst-case complexity classes, and these have been thoroughly investigated. Recently, a reasonable amount of work has been done investigating average-case completeness, however very little work has been done looking into separation and hierarchy results for average-case complexity classes. What little work has been done has either used an unsatisfactory definition of average-case complexity or has produced less than optimal results. The goal of this research project is to more thoroughly investigate average-case complexity classes and hierarchies among them.","title":"Average-case Hierarchies","awardID":"9503601","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[2431],"PO":["150516"]},"904":{"abstract":"Concerning reasoning and decision making in uncertain environments. The standard approaches to dealing with this uncertainty are quantitative, and typically make use of probability theory. The long-term goal of this project is provide more qualitative methods that can be used effectively by agents reasoning about uncertainty. The project focuses on the interplay between beliefs and actions, and how this can be dealt with in a qualitative framework. Of particular interest are two uses that will be crucial in attaining the long-term goal: belief dynamics and action selection. Belief dynamics involves understanding how an agent's beliefs should change after the agent makes an observation or performs an action. To capture belief dynamics, a formal model for belief is used that includes time explicitly. The ultimate goal of this research is to provide a basis for a general theory of qualitative belief dynamics. Action selection involves understanding how an agent should act, given his beliefs. The usual decision theoretic approach uses a utility function describing the agent's preferences and a probability distribution describing the agent's beliefs. But in many situations it is infeasible to completely quantify uncertainty. An alternative approach that dispenses with preferences describes the agent's choice of action by a program directly specifying the behavior of the agent in terms of his beliefs, allowing compilation of plans directly from the specification that we want it to satisfy.","title":"Belief Dynamics and Action Selection in Qualitative Approaches to Reasoning about Uncertainty","awardID":"9503109","effectiveDate":"1995-06-01","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["561961"],"PO":["54008"]},"806":{"abstract":"NCR-9502725 David B. Johnson The availability of powerful mobile computing devices and wireless networking products and services is increasing dramatically, making it natural for users to expect to be able to access network resources and to utilize the growing global internetwork at any time and from any where. However, existing internetworking protocols such as IP, ISO CLNP, NetWare IPX, and AppleTalk cannot currently support this type of host mobility. Network applications generally must be reconfigured and restarted when connecting to the network at a different point, making host movement difficult, time consuming, and error prone. The objective of this research is to develop scalable and robust protocols for providing seamless support of transparent internetworking for wireless and mobile hosts. This research addresses a number of areas in which new support is needed for this goal, including internetwork routing to mobile hosts; routing among mobile hosts in an ad hoc wireless network; internetwork multicasting to and from mobile hosts; and protocol support to allow higher-layer protocols and applications to adapt their behavior in response to mobility. The work in this project will consist of designing new protocols, implementing each protocol, and evaluating each protocol using performance measurement and simulation studies over a range of environments and alternative design choices.","title":"CAREER: Wireless and Mobile Internetworking","awardID":"9502725","effectiveDate":"1995-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["233000"],"PO":["150490"]},"1054":{"abstract":"This project will pursue a combination of basic and applied research on role-based control (RBAC), using a three-pronged approach, by developing 1) models, 2) mechanisms and 3) tools, to support the effective deployment of RBAC in future systems. The basic concept of RBAC is that users are not directly granted access permissions. Instead permissions are granted based on roles, and users are made members of appropriate roles. This simplifies management of authorizations. RBAC owes its origins to multi-user and multi-application on-line systems of the early 1970's. There has been a recent resurgence of interest in RBAC stemming from its use at application level. This project will provide a sound scientific and engineering foundation for providing general purpose facilities for using RBAC, both at the operating systems level and applications level.","title":"Role-Based Access Control - Models, Mechanisms and Tools","awardID":"9503560","effectiveDate":"1995-06-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["483863"],"PO":["250083"]},"905":{"abstract":"The Committe on Human Factors was established by the National Research Council in 1980 as a standing committee of the Commission on Behavkioral and Social Sciences and Education. The 1994-1995 program includes the completion of a study on human error and error management. The committee is also finalizing its report on emerging needs and opportunities in human factors research. The Committee on Human Factors is a multidisciplinary group of experts from the fields of psychology, sociology, engineering, computer science and the specialties that have dveloped in the areas of human factors. The committee provides a unique forum for the exchange of information between its sponsors and the scientific and technical communities. It is responsive to sponsor inquiries and its major efforts are of interest to all sponsors. Most of the studies of the committee result in reports made available to a regularly updated distribution list","title":"Committee on Human Factors","awardID":"9503111","effectiveDate":"1995-06-01","expirationDate":"1996-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[2047,2048,2049],"PO":["183208"]},"928":{"abstract":"This project covers the following four activities in the area of restructuring compilers and the application of the technology to applications. (1) The previous work of the PI on data alignment will be extended to include data distribution. This will permit data and computations to be mapped to physical processors of a MIMD machine in such a way that parallelism is exploited while minimizing communication overhead. (2) Loop transformation technology for imperfectly nested loops will be developed. Current technology can handle only `perfectly nested loops` where assignments occur only in the innermost loops. However, many practical applications have imperfectly nested loops. In this project techniques for performing linear loop transformations and tiling imperfectly nested loops will be developed. (3) The project will develop methods for producing parallel code for applications involving sparse matrices. (4) Above techniques will be applied to logic simulation applications.","title":"Principles and Applications of Restructuring Compiler Technology","awardID":"9503199","effectiveDate":"1995-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["556730"],"PO":["150697"]}}