{"111320":{"abstract":"For almost all the applications of wireless networks, the central optimization goal is to maximize network lifetime. Since each node in wireless networks is battery powered, energy conservation at each node is the primary concern that will greatly affect network lifetime. For the optimization goal of maximizing network lifetime in wireless networks, this project will integrate research and education to investigate some novel approaches for the coverage problems and the dominating set problems in wireless networks. Furthermore, the relationships between the solutions to the coverage problems and the solutions to the dominating set problems will be studied. The research work will focus on: designing new distributed and localized approximations for the coverage problems, developing new methods of constructing stable backbones in mobile or static wireless networks with the consideration of maintenance, integrating the proposed approaches for the coverage problems and the dominating set problems into coherent schemes so that new models can be derived to solve both the coverage problems and the dominating set problems. The research will be conducted from both theoretical and simulation aspects. The research component of this project will have a strong impact on both theoretical and practical aspects of optimization theory as well as wireless networks. It will accelerate the realization of the optimization goal in wireless networks. The education component of this project is a starting point to integrate research and education for the purpose of attracting both undergraduate and graduate students to the areas of optimization theory and wireless networks. The approaches proposed in this project and the findings as a result will be used as additional teaching materials to excite the students and to attract more potential students to conduct research in these areas.","title":"CAREER: Algorithms for Optimization Problems in Wireless Networks","awardID":"0545667","effectiveDate":"2006-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["469265"],"PO":["432103"]},"112651":{"abstract":"A workshop on networked embedded sensing and control was held<br\/>at the University of Notre Dame on October 17-18, 2005. This workshop aims to bring together researchers from different scientific domains including sensing and estimation, control, coding\/communications, ad hoc networking, real-time scheduling and distributed computation, among others, to establish shared foundations and to identify the main scientific challenges of the emerging area of networked embedded sensing and control. The workshop highlights a unique mix of research areas not currently well represented in established research conference venues. A key goal is to foster greater cross-domain interaction within these venues. NSF support enables participation in the workshop by graduate students who may pursue research in this area and augments interaction among students, academicians and industry.","title":"Workshop on Networked Embedded Sensing and Control: October 17-18, 2005-University of Notre Dame","awardID":"0552190","effectiveDate":"2006-01-15","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["526859"],"PO":["561889"]},"110363":{"abstract":"This project will address research challenges concerning the effective realization of dynamic data driven application simulations (DDDAS) used for the management of surface transportation systems. Middleware research will address challenges associated with dynamically adapting the computing and communication infrastructure to disseminate and propagate data and computations to meet quality of service requirements. Research in data cleaning and imputation will use statistical techniques to address issues such as gaps and errors that will arise in real-time data feeds. Modeling research will focus on agent-based, dynamic data driven simulation models of transportation networks that adapt to real-time data feeds to predict future states of the system, and modeling of plume cloud dispersions that when integrated with transportation simulations, allow evaluation of the DDDAS approach in important<br\/>emergency scenarios. Finally, a paradigm termed ad hoc distributed simulations will be explored that features dynamic collections of autonomous simulations interacting with each other and real-time data in a continuously running real-time distributed simulation environment. Experimental research will be conducted by deploying a prototype system on instrumented vehicles, wireless enabled roadside computers, and high performance compute servers.","title":"DDDAS-TMRP: Dynamic, Simulation-Based Management of Surface Transportation Systems","awardID":"0540160","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["523077","536648","549887","351671","351672"],"PO":["535244"]},"110374":{"abstract":"Modern society depends upon many interacting large-scale dynamic systems (systems of systems), most of which are too complex for mathematical analysis. The behavior of such system networks depends on their linkages and the environment, i.e. scientific reductionism is incapable of fully defining behavior. These applications are typically characterized by hierarchical control and horizontally, interdependent components (federates), and in a dynamic environment require the whole or sub system(s) to respond adaptively to changes in an accurate and timely manner for improved performance.<br\/><br\/>This project focuses on hierarchical production and logistics planning and control in highly capitalized discrete manufacturing system networks. The overall scheme envisioned is a multi-scale federation of interwoven simulation and decision models that support planning and control with dynamic updating through sensed and streamed data. Planning and control models are updated both directly from real-world sensed data and from simulations. While the real world may yield parameters such as current costs or inventory status, the simulation model, in synchronization with other federates representing the other entities in the supply network, will be used to compute more complex model parameters such as lead times and effective resource availabilities. In addition, the simulation model will be used off-line to test the performance of various proposed decision rules\/models and guide the selection of model construction and selection at each re-planning instance. Re-planning will occur when a defined threshold of discordance between actual observation and model form used to construct the active plan is reached.<br\/><br\/>To accomplish these goals the project will investigate methods for the development of an integrated architecture for distributed computing in networked sensor-driven, hierarchical decision and control systems of the distributed enterprise. This architecture, which is based on ubiquitous web service technology, will allow an integrated collection of multi-scale models that support the simulation, decision and control functions to interact with transducers. The proposed architecture will facilitate integration in several ways: developing a continuous sensor-driven approach to planning and control coordination; interoperability of different genres of models for distributed systems; integration of sensor\/actuator interactions with a variety of models; integration of different genres of sensors\/actuators that conform to different standards; integration of sensor measurements in the model validation process.","title":"DDDAS-SEP: Dynamically-Integrated Production Planning and Operational Control for the Distributed Enterprise","awardID":"0540212","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["387259","536867"],"PO":["551712"]},"110385":{"abstract":"The research project is aimed to create a Dynamic Data Driven Application aimed at improving the understanding of a complex biophysical system - the flight of bats. The system is comprised of a multi-level hierarchical simulation of bat flight based on parameterized features of bat morphology and behavior. The simulation operates at multiple levels of physical approximation and computational speed, and is capable of very rapid solutions but requires input from measurements to ensure fidelity and optimality. This input will be provided in an integrated fashion, drawing from a parallel series of experiments in which several discrete data streams will be generated, including kinematic wing data, wake velocity data over a series of two dimensional cutting planes, as well as other data such as bone deformation, experimentally-determined material properties, etc. This data will direct the simulation ensuring accurate solutions, but still with high responsiveness. The data streams will be monitored, synthesized, combined and processed using an advanced immersive visualization environment which will be used to guide the interactions between the measurement and simulation and to organize the disparate streams of data. The simulation environment to be developed is the first such system capable of generating timely solutions of complex flows over highly unsteady and deformable structures. This has multiple scientific and engineering benefits ranging from the ability to address fundamental questions in evolutionary biology to the design of bio-mimetic structures that draw from the abilities of bats on the wing. The direction provided by the experiment will guide scientists to the key sensitivities of these complex flying systems and provide insight to the complexities of animal flight mechanics. Lastly, the visualization systems will provide a unique tool for the synthesis and management of dynamic data drawn from a wide and disparate variety of data sources each having different qualities.","title":"DDDAS-TMRP: Interactive Data-driven Flow-Simulation Parameter Refinement for Understanding the Evolution of Bat Flight","awardID":"0540266","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["500355","556413","550484"],"PO":["551712"]},"113894":{"abstract":"This workshop covers aspects of languages, compiler techniques, run-time environments, and architectures for parallel and high-performance computing. Since 1988, the annual LCPC workshops have provided a forum for leading researchers and practitioners to present their latest work and to exchange ideas about future directions. The papers published in the proceedings of the workshop have been widely cited over the years and many of them have represented the first public presentation of innovative ideas. The participation is truly international with speakers from the US, Japan and Europe. While the workshop covers many topics, the emphasis has always been software, e.g., compilers, languages, run-time systems, performance evaluation for parallel systems. The proceesdings of this 18th LCPC Workshop are published by Springer-Verlag, thus making the discussions of this forum available to the broader community.","title":"18th Workshop on Languages and Compilers for Parallel Computing","awardID":"0601411","effectiveDate":"2006-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["532951","557461","472178"],"PO":[301532]},"111485":{"abstract":"New discoveries in biology have required an extensive knowledge of cell dynamics. Knowledge of subcellular particles\/structures such as organelles, vesicles, and mRNAs is critical to understand how cells regulate delivery of specific proteins from the site of synthesis to the site of action for a better understanding of diseases and viral infections. Quantitative spatial-temporal protein mobility study plays an essential role in experimentally comprehending and validating protein signaling mechanisms and protein-protein interactions. The goal of this proposal is to develop a unique and the first web-based open access Cell Dynamics Analysis System (CellDAS) for automating subcellular particle motion estimation, tracking and mobility analysis. First, a divergence filter is developed, analogous to physics concepts, to detect the directed motion that is of biological importance. Then a Markov Chain Monte Carlo (MCMC) sampling framework is presented for multi-object tracking that overcomes the exponential complexity problem. Finally, distinctive features are optimally selected during the tracking process. <br\/><br\/>This project will provide rich resources for training and education in cell biology and computer science. By accessing the proposed open-access web-based CellDAS interface, undergraduates and graduates will have training in basic computer vision algorithms, biological data visualization, and formation understanding to specific interested biology problem. Moreover, the PI will promote and motivate women in science and engineering, and inspire high school students to pursue careers in these fields through the mentoring activities of the Society of Women Engineers (SWE) and the annual high school Robot Programming Contest.","title":"CAREER: Four-Dimensional Subcellular Structure Tracking and Modeling for Cell Dynamics Study","awardID":"0546605","effectiveDate":"2006-01-01","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["307782"],"PO":["565136"]},"110396":{"abstract":"This research project will study the business processes related to receiving, accepting, processing and fulfilling customer orders in global make-to-order supply chains. It will investigate the databases and data flows underlying these processes, the business decision processes and the manner in which these interact. Simulation and optimization models will be developed that monitor real-time streams of input data. Algorithms that monitor these streams must determine when predictions should change and should calculate such changes if appropriate. Research will also be carried out into the development Markov Decision Processes (MDPs) that dynamically adapt to sensor data streams. In addition to building on MDP research, this topic will consider the use of Mixed Integer Programming models for setting MDP parameters. <br\/><br\/>The results of this research will provide the basis for improved operational control of make-to-order supply chains. It will provide the theory underlying the development of \"always on\" controllers that continuously monitor supply chain data sources and project the future status of key business processes. This research will support improved decision making under both normal operations and incident response. The normal operations decisions supported could include product positioning decisions, order timing and acceptance decisions and production scheduling decisions. The incident response mode will be used to develop a strategy for reacting to major disruptive events. Such events might include the failure or delay of a major supply shipment, a major breakdown in a factory or acceptance of a large order that preempts existing order commitments. These capabilities should substantially increase the level of customer service and the profitability for supply chains that employ them.","title":"DDDAS-SMRP: Dynamic Real-Time Order Promising and Fulfillment for Global Make-to-Order Supply Chains","awardID":"0540312","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1786","name":"MANFG ENTERPRISE SYSTEMS"}}],"PIcoPI":["502772",292412],"PO":["523516"]},"115610":{"abstract":"This workshop is intended to refocus the field of artificial intelligence (AI) on its traditional goal: to understand the nature of cognition and its embodiment in human and artificial systems. The success of the field of AI can be seen in major accomplishments throughout the past decade including the beating of the best human chess player by a computer, the autonomous operation of robots on Mars and the autonomous control of the Deep Space One asteroid and comet mission, the use of rule-based systems by tens of thousands of Americans in the preparation of their yearly income taxes and the use of natural language technology in numerous applications including web search engines and the world's most successful word processing software. Despite these successes, the intellectual mission of understanding the nature of cognition remains one of the great challenges in modern science. <br\/><br\/>The overall goal of this work is to develop scientific guidelines that will steer research in AI over the next several decades. The symposium will also help raise awareness by students and others both of the achievements to date of the AI field, and the exciting scientific challenges that still remain. Artificial intelligence technologies have been applied in a wide range of disciplines and are often at the core of interdisciplinary efforts in bioinformatics and ecoinformatics, efforts in genomics and elsewhere using robotic technologies, the advancement of database integration and semantic web activities in the homeland defense arena and elsewhere, and in a number of other fields where the need to manage or coordinate knowledge is crucial to success. Helping other scientists to understand the contributions of AI to date, and the potential for the future, can be expected to lead to further indisciplinary work and the greater application of AI techniques in the other sciences, as well as in priority areas such as e-commerce and homeland security.","title":"Steering a young science: Workshop proposal for 50th anniversary of American AI","awardID":"0609678","effectiveDate":"2006-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["533288","499228"],"PO":["335186"]},"112145":{"abstract":"0549998<br\/><br\/>SGER: Defending Against Passive Logging Attacks in Anonymous<br\/>Communications<br\/><br\/>Matthew Wright<br\/><br\/>Communicating over the Internet, even with encryption, exposes valuable information about with whom and how often one communicates. For organizations such as the military, government, and multinational corporations, this can be an enormous risk. Anonymous communications is a technology that can stop this kind of information leakage by mixing different traffic together as it goes through the Internet. Current systems, however, are vulnerable to long-term passive attacks, in which eavesdroppers or malicious operators can uncover the traffic patterns.<br\/><br\/>This exploratory research will examine potential solutions to these attacks. It will use in-depth simulations to explore defenses against timing analysis, by which the attacker uses the timings of messages to trace a user's traffic through the network. Attacks on longer-term traffic patterns will be combatted in two ways, both of which will be evaluated with analysis and simulation. First, ideas from peer-to-peer file-sharing systems will be used to secure the process of selecting nodes. Second, artificially-generated traffic based on other users' patterns will make it more difficult to single users out. Additionally, a testbed for exploring these ideas through experimentation will be constructed. The work will be at the forefront of creating a new, more secure generation of anonymous communications systems.","title":"SGER: Defending Against Passive Logging Attacks in Anonymous Communications","awardID":"0549998","effectiveDate":"2006-01-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["561003"],"PO":["521752"]},"109912":{"abstract":"With funding from the National Science Foundation, The Cornell project will create a research laboratory for social science research based on a largely untapped dataset: the Internet Archive's 40-billion page collection of Web pages. These snapshots of the Web have been captured and archived every two months for nearly ten years. The project will make very large portions of this massive collection widely accessible for social science research. The flood of available on-line information - from corporate web pages to news groups and blogs - has the potential to open up new frontiers in social science research. The Cornell team plans to build an intelligent front-end that will make the Internet Archive broadly accessible to social scientists, and to develop, test, and refine these tools through a specific research application - the diffusion of innovation. <br\/><br\/>The development of such tools requires the application of cutting edge research in natural language processing and machine learning algorithms. The project team also includes computer scientists with expertise in the privacy-preserving analysis of data -- a basic challenge in making on-line data more readily accessible for research and policy applications in the social sciences.<br\/><br\/>The importance of the Web Archive extends beyond pure research to practical applications for business and government. These tools can be used to identify market trends, the rise and fall of demand, and the spread of consumer opinion. Community watchdog groups will be able to track the spread of \"hate sites\" and government agencies will be able to trace past and current uses of the Web for organizing and coordinating terrorist attacks.","title":"Very Large Semi-Structured Datasets for Social Science Research","awardID":"0537606","effectiveDate":"2006-01-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7368","name":"SCI TESTBEDS"}}],"PIcoPI":["410331","420975","542523",291090,"450550"],"PO":["563783"]},"118999":{"abstract":"The increasing demands of modern computation require innovative solutions to data storage and processing. Conventional architectures are often limited not by processor speed, but by the ability to efficiently handle large amounts of data. Optical architectures for these applications promise potential gains in speed, data throughput, & storage density. In addition, an entirely new class of materials has emerged that is expected to provide practical solutions to these demanding applications; these materials include not only conventional optical & holographic materials, but also of those of biological origin. Bacteriorhodopsin (BR) was among the first proteins to attract attention as a viable component in molecular electronics & nanotechnology. In the native organism, Halobacterium salinarum, the protein acts as a photosynthetic sunlight to chemical energy transducer. Through billions of years of evolution, nature has produced a protein that is remarkably rugged and responds quickly and efficiently to light. The protein's unique properties make it an appealing candidate for a number of devices that use light to record or process information, including holography and optical computer memory storage.<br\/><br\/>Despite bacteriorhodopsin's unique properties, it still lacks the efficiency necessary for commercialization. Fortunately, advanced techniques in molecular biology can be used to optimize the protein for specific device architectures. Through techniques such as random mutagenesis, semi-random mutagenesis, and directed evolution, researchers can custom-tailor protein properties in ways never before possible. The use of directed evolution techniques to produce BR variants for optical recording materials will result in reusable holographic media that require no processing or fixing, and are capable of real-time operation. The goal of this research effort is to develop a new class of fully write-read-erasable dynamic holographic recording media based on genetically-engineered bacteriorhodopsin variants. Each new material will be evaluated to determine which is the most efficient, with respect to a number of standard holographic benchmarks.<br\/><br\/>The targeted application we hope to develop is a bacteriorhodopsin-based holographic associative memory, which simulates the way the human brain works. Associative memory architectures are not new, but their utility has been limited by the absence of materials that facilitate highly efficient implementation (i.e., the lack of truly reusable media). Associative memories allow computers to identify objects and concepts faster and more efficiently- applications include any technology that requires autonomous general-pattern recognition and\/or fast & efficient large-scale database search capabilities. Information processing techniques such as data mining, data reduction, and large-scale complex database searches will be enhanced through the successful development of these architectures. Furthermore, this technology has the potential to play a critical role in the development of artificial intelligence (AI)-successful implementation of AI architectures will require a fast & efficient large-scale database search capability. Incorporation of dynamic write-read-erase materials into pre-existing associative architectures will introduce a level of flexibility not previously possible.<br\/><br\/>To summarize, the proposed effort uses advanced molecular biological techniques to produce genetically-engineered bacteriorhodopsin (BR) proteins for holographic associative memories. The technical merit & broader impacts of this technology must therefore be considered at multiple levels, including (1) development of novel holographic materials & (2) the ramifications of viable associative memories. The former will impact any holographic technology that will benefit from a real-time reusable media (e.g., optical memory & non-destructive testing architectures), while the latter will facilitate any technology that will benefit from the ability to utilize fast & efficient large scale database capabilities (e.g., artificial intelligence, proteomics, and the human genome project). Perhaps the most basic impact of this technology will be the demonstration of random mutagenesis and directed evolution as viable techniques for the production of custom-tailored proteins to be used in a variety of applications.","title":"BIC: Genetically-Engineered Bacteriorhodopsin Proteins for Holographic Associative Memories","awardID":"0624695","effectiveDate":"2006-01-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":[315512],"PO":["565223"]},"109407":{"abstract":"In collaborative sessions, information presented or generated is usually unstructured so that, for example, a traditional tape recording of a meeting does not present a clear picture of who said what and when, thereby limiting the usability of such information in contexts other than a simple replay. Furthermore, in face-to-face interactions participants make full use of human sensory capabilities such as binaural hearing and binocular (stereo) vision to conduct information sharing and exchange. To enable intelligent reuse of collaborative session information at a future time, or to support real time collaborations involving parties located remotely, we need to be able to acquire, process, integrate and organize speech, audio and multimedia information so as to provide a sense of full-dimensional immersive interaction. Among other things, this implies that individual sources must be accessible for life-like playback free of interference from other information streams. In this project the PIs will develop technologies to these end, focusing in particular on achieving spatialized audio with little or no interference due to reverberation or noise, individual tracking of information sources, and rich and accurate annotation that supports efficient storage and retrieval of the information in a session. The PIs plan to meet these challenges through use of multi-channel acoustic signal processing, which involves multi-channel signal acquisition, processing, representation and synthesis. Their approach to multi-channel signal acquisition will exploit the ubiquity of individual access (and transduction) devices such as the cell phones and PDAs that most people carry nowadays. During a meeting, these devices can be fitted with necessary interfaces to form a distributed information acquisition network such that the signal generated in the meeting can be captured and transmitted to a wireless base stations for processing. The project will result in the following key technical innovations: a fundamental formulation of acoustic signal processing as a multi-input-multi-output (MIMO) problem; a practical solution to \"sound objectization\" that takes ubiquitous acoustic signals as input and produces as output an array of signals with known source identities; effective organization of the multi-channel acoustic signals in a collaborative session for efficient retrieval; and modeling and mitigation of non-linearity due to speech and audio coding in distributed acoustic signal processing.<br\/><br\/>Broader Impacts: This research will lead to a modern multi-channel signal processing theory for acoustic signal processing, along with a new generation of technology for remote collaboration and conferencing that allows participants to conduct full-dimensional information sharing, as well as a new generation of technology for collaborative session recording and playback that revolutionize the meeting room facility for efficient retrieval of precise information. Because collaborative applications of all kinds lie at the heart of the emerging information society, this work will ultimately lead to substantial enhancements in productivity.","title":"Multi-Channel Information Processing for Intelligent Collaboration","awardID":"0534221","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["73604",289637],"PO":["565227"]},"109528":{"abstract":"This project addresses a longstanding puzzle in artificial intelligence (AI): how can agents transform their temporal experience into multiscale task-independent representations that can effectively guide long-term task-specific behavior? The project will investigate a nonparametric framework combining task-independent learning with task-specific learning. Algorithmically, the framework comprises of four phases. Initially, agents learn a discrete manifold representation of a given environment, which can be viewed as a topological graph representing the states reachable through single or multi-step actions. Next, the graph is analyzed using spectral clustering techniques to reveal \"bottlenecks,\" symmetries, and other geometric invariants. In the third phase, an orthonormal set of task-independent basis functions called proto-value functions are extracted from the environment's topology: These basis functions capture large-scale geometric invariants that all value functions on the state space must adhere to. In the final phase, proto-value functions are combined with rewards to approximate task-specific value functions.<br\/><br\/>The proposed framework unifies two previously disparate lines of research in AI: learning of behavior using value functions, pioneered by Arthur Samuel, and the learning of representations based on global state space analysis, pioneered by Saul Amarel. The theoretical basis for the framework draws upon links between discrete and continuous mathematics: Riemannian manifolds and the spectral theory of graphs; elliptic differential equations and abstract harmonic analysis on graphs. Specifically, the Hilbert space of smooth functions on a Riemannian manifold has a discrete spectrum based on the eigenfunctions of the Laplace-Beltrami operator. The applications of this theory to Markov decision processes will be explored, in particular the ability of Laplacian eigenfunctions or proto-value functions to both capture large-scale geometric structure and as well as approximate task-specific value functions. A novel class of algorithms termed Representation Policy Iteration (RPI) will be investigated, which interleave representation learning and behavior learning. The research thus also addresses a longstanding question not resolved in much previous work on approximation methods for solving large Markov decision processes: how can basis functions be generated automatically? The research will investigate the scalability of the proposed framework to larger problems, including both discrete factored state spaces as well as continuous state spaces. The testbeds include simulated discrete and continuous benchmark problems, simulated and real robot testbeds, and an information extraction task of maintaining the Reinforcement Learning Repository (RLR), the world's largest collection of documents and data relating to reinforcement learning.<br\/><br\/>Broader impacts of this project include algorithmic and theoretical insights leading to a unified approach to learning behavior and representation, as well as applications to real-world problems such as humanoid robotics and web repository maintenance. Additionally, this project will give valuable research experience to women graduate students and to undergraduate students from local four year colleges.","title":"Proto-Value Functions: A Unified Framework for Learning Task-Specific Behaviors and Task-Independent Representations","awardID":"0534999","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["544475"],"PO":["387198"]},"109418":{"abstract":"Separating signals that have been mixed together is an archetypal engineering probelm. The past decade has seen the emergence of a several approaches applicable to separating sound mixtures -- for example, a restaurant scenario in which a desired target voice must be extracted from the background babble of other patrons. However, the most appropriate goal, and hence the way to measure performance, is not always clear. In this project, the goal is established as improving intelligibility i.e. processing sound mixtures so a human listener can better understand what can be said. This requires a collaboration between computer science\/electrical engineering -- to provide the separation algorithms -- and auditory scientists\/psychologists -- to guide the results towards perceptually-relevant improvements, and to evaluate the results in listener tests.<br\/><br\/>The particular techniques to be developed and combined include blind source separation (such as independent component analysis), computational auditory scene analysis (simulations of what is understood about human perceptual processing), and model-driven approaches derived from the machine-learning techniques of speech recognition. One specific area of interest is the synthesis of `minimally-informative noise', acoustic tokens that effectively communicate both what can be inferred and what remains unknown about the target signal, and which can leverage the powerful perceptual inference of human listeners.<br\/><br\/>This project will lead to implementations of acoustic signal separation that deliver the greatest benefit to human listeners, potentially including both normal-hearing and hearing-impaired individuals. This <br\/>has a broad range of applications from processing archival recordings through to improved real-time communications technologies, as well as the potential to help automatic speech recognition systems.","title":"Collaborative Research: Separating Speech from Speech Noise to Improve Intelligibility","awardID":"0534320","effectiveDate":"2006-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["554697"],"PO":["565215"]},"110551":{"abstract":"Project Description<br\/><br\/>The PI plans to develop a novel distributed programming framework, Ganga, which addresses the<br\/>increasing gap between the emerging application domains and the target platforms.<br\/>At the heart of the framework is a new abstraction capsule that embodies computation and state. The<br\/>application program is a dataflow graph of capsules connected by streams of data. The programming<br\/>model does not require the application programmer to provide explicit mapping and distribution of the<br\/>capsules to the nodes of the target platform (comprising of clusters and sensor networks).<br\/><br\/><br\/>Intellectual Merit<br\/><br\/> A semantically clean and simple model for programming complex distributed applications is one of the intellectual merits of the proposed research. The semantics of the capsule abstraction emulates many of the known paradigmsfor distributed computing such as RPC, active messages, continuations, and futures. The runtime automatically decides the appropriate semantics commensurate with the dynamic needs of the application and the dynamic resource availability of the target platform. Mechanisms in the runtime system include the ability to partition the capsule into finer capsules connected by streams, coalescing finer capsules into a coarser grain one internalizing the streams that connected them, migration of capsules among the computational nodes, restarting failed capsules, and garbage collection of memory resources.<br\/><br\/>The sense-process-actuate characterization of the application is also applied at the system level to orchestrate the resource management decisions. The system state is sensed and the decision-making entity<br\/>re-evaluates (and if need be, alters) the use of the resources. Developing such a characterization is another<br\/>intellectual merit of the proposed research.<br\/><br\/>Broader Impact<br\/><br\/>As the discipline matures, it is clear that computing has to interface with domain experts to increase the relevance and importance of computing in the societal landscape. In particular, it is important to develop simple and intuitive interfaces for the end user that hide the complexities of the emerging distributed hardware platforms. By targeting application domains that have the potential for societal benefits, the importance of the proposed research is enhanced. Th PIs plan to do technology transfer of the research artifacts from this project through their partnership with industry.<br\/><br\/>Ganga will be an interesting tool for teaching about parallelism. It cleanly incorporates known styles of<br\/>parallelism in a single clean model. It exposes all the big issues while hiding the uninteresting details. It is the PIs intent to put the system into use for educational purposes. There is an active educational program at Georgia Tech in pervasive computing. An appropriate usability test of these technologies is to make the system available for class projects by novice users of distributed systems in pervasive computing classes both at the undergraduate and graduate levels.","title":"DCS: Ganga: Removing the Semantic Gap between Stream-based Applications and Stream Accelerators","awardID":"0541079","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":[292885,"564690",292887,"550806"],"PO":["565272"]},"110364":{"abstract":"DDDAS-TMRP (COLLABORATIVE RESEARCH): AN ADAPTIVE CYBERINFRASTRUCTURE FOR THREAT MANAGEMENT IN URBAN WATER DISTRIBUTION SYSTEMS<br\/><br\/><br\/>Contamination threat management in drinking water distribution systems involves real-time characterization of the contaminant source and plume, identification of control strategies, and design of incremental data sampling schedules. This requires dynamic integration of time-varying measurements of flow, pressure and contaminant concentration with analytical modules including models to simulate the state of the system, statistical methods for adaptive sampling, and optimization methods to search for efficient control strategies. For realistic distribution systems, the analytical modules are highly compute-intensive, requiring multi-level parallel processing via computer clusters. While data often drive the analytical modules, data needs for improving the accuracy and certainty of the solutions generated by these modules dynamically change when a contamination event unfolds. Since such time-sensitive threat events require real-time responses, the computational needs must also be adaptively matched with available resources. Thus, a software system is needed to facilitate this integration via a high-performance computing architecture (e.g., the TeraGrid) such that the measurement system, the analytical modules and the computing resources can mutually adapt and steer each other. The goal of this multi-disciplinary research is to develop a cyberinfrastructure system that will both adapt to and control changing needs in data, models, computer resources and management choices facilitated by a dynamic workflow design. Using virtual simulation and a field study, this cyberinfrastructure will be tested on illustrative scenarios for adaptive management of contamination events in water distribution systems.<br\/><br\/>Urban water distribution systems are vulnerable to accidental and intentional contamination incidents that could result in adverse human health and safety impacts. The pipe network in a typical municipal distribution system includes redundant flow paths to ensure service when parts of the network are unavailable, and is designed with significant storage to deliver water during daily peak demand periods. Thus, a typical network is highly interconnected and experiences significant and frequent fluctuations in flows and transport paths. These design features unintentionally enable contamination at a single point in the system to spread rapidly via different pathways through the network, unbeknown to consumers and operators. When a contamination event is detected via the first line of defense, e.g., data from a water quality surveillance sensor network and reports from consumers, the municipal authorities are faced with several critical questions as the contamination event unfolds: Where is the source of contamination? When and for how long did this contamination occur? Where additional hydraulic or water quality measurements should be taken to pinpoint the source more accurately? What is the current and near future extent of contamination? What response action, such as shutting down portions of the network, implementing hydraulic control strategies, or introducing decontaminants, should be taken to minimize the impact of the contamination event? What would be the impact on consumers by these actions? Real-time answers to such complex questions will present significant computational challenges. This project will address these challenges by developing an adaptive cyberinfrastucture that will enable real-time processing and control through dynamic integration of computational components and real-time sensor data. This system will be evaluated using contamination scenarios based on field-scale data from a large metropolitan area.","title":"DDDAS-TMRP (Collaborative Research): An adaptive cyberinfrastructure for threat management in urban water distribution systems","awardID":"0540177","effectiveDate":"2006-01-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":["392669"],"PO":["565176"]},"110375":{"abstract":"The main objective of this research is to develop new algorithms and tools for the distributed collection, sharing, mining and harnessing of data for cooperative health monitoring and vulnerability assessment of power systems in real time. Fundamental concepts and technology for achieving this objective exist today in the areas of power systems, system theory and computer science, but harnessing them to achieve this vision will require the significant multidisciplinary concerted effort proposed here. The project aims at making fundamental contributions to the necessarily<br\/>multidisciplinary systems required for data utilization in monitoring and control of interconnected<br\/>engineering systems. The application that this proposal focuses on is the creation of new data-driven tools for electric power system operation and control. The applications systems include traditional SCADA systems as well as the emerging Phasor Measurement Unit (PMU) data concentrators. This effort will focus on five specific task areas: Distributed agent-based system monitoring; Pattern recognition and change detection; Dynamic analysis of signatures for early warning; Data-driven, low-order modeling for security assessment; Automated visualization for power system health monitoring. This work will provide a broader impact in several areas. First, the results in data manipulation, visualization, and processing will have application in other domains. Any complex system that relies heavily on measurements for monitoring and control shares the same need to extract key information from massive amounts of data received over wide areas and time scales. Second, several of the investigators work very closely with the electric power industry through the Power Systems Engineering Research Center (PSERC), an NSF Industry\/University Cooperative Research Center designed to stimulate collaboration among 13 universities and 35 companies. Results from this project will naturally influence that collaboration in the form of seminars, tutorials, and interaction with industry.","title":"DDDAS-TMRP: Data-Driven Power System Operations","awardID":"0540216","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["559435","379378","559445"],"PO":["493916"]},"110397":{"abstract":"DDDAS-TMRP (COLLABORATIVE RESEARCH): AN ADAPTIVE CYBERINFRASTRUCTURE FOR THREAT MANAGEMENT IN URBAN WATER DISTRIBUTION SYSTEMS<br\/><br\/><br\/>Contamination threat management in drinking water distribution systems involves real-time characterization of the contaminant source and plume, identification of control strategies, and design of incremental data sampling schedules. This requires dynamic integration of time-varying measurements of flow, pressure and contaminant concentration with analytical modules including models to simulate the state of the system, statistical methods for adaptive sampling, and optimization methods to search for efficient control strategies. For realistic distribution systems, the analytical modules are highly compute-intensive, requiring multi-level parallel processing via computer clusters. While data often drive the analytical modules, data needs for improving the accuracy and certainty of the solutions generated by these modules dynamically change when a contamination event unfolds. Since such time-sensitive threat events require real-time responses, the computational needs must also be adaptively matched with available resources. Thus, a software system is needed to facilitate this integration via a high-performance computing architecture (e.g., the TeraGrid) such that the measurement system, the analytical modules and the computing resources can mutually adapt and steer each other. The goal of this multi-disciplinary research is to develop a cyberinfrastructure system that will both adapt to and control changing needs in data, models, computer resources and management choices facilitated by a dynamic workflow design. Using virtual simulation and a field study, this cyberinfrastructure will be tested on illustrative scenarios for adaptive management of contamination events in water distribution systems.<br\/><br\/>Urban water distribution systems are vulnerable to accidental and intentional contamination incidents that could result in adverse human health and safety impacts. The pipe network in a typical municipal distribution system includes redundant flow paths to ensure service when parts of the network are unavailable, and is designed with significant storage to deliver water during daily peak demand periods. Thus, a typical network is highly interconnected and experiences significant and frequent fluctuations in flows and transport paths. These design features unintentionally enable contamination at a single point in the system to spread rapidly via different pathways through the network, unbeknown to consumers and operators. When a contamination event is detected via the first line of defense, e.g., data from a water quality surveillance sensor network and reports from consumers, the municipal authorities are faced with several critical questions as the contamination event unfolds: Where is the source of contamination? When and for how long did this contamination occur? Where additional hydraulic or water quality measurements should be taken to pinpoint the source more accurately? What is the current and near future extent of contamination? What response action, such as shutting down portions of the network, implementing hydraulic control strategies, or introducing decontaminants, should be taken to minimize the impact of the contamination event? What would be the impact on consumers by these actions? Real-time answers to such complex questions will present significant computational challenges. This project will address these challenges by developing an adaptive cyberinfrastucture that will enable real-time processing and control through dynamic integration of computational components and real-time sensor data. This system will be evaluated using contamination scenarios based on field-scale data from a large metropolitan area.","title":"DDDAS-TMRP (Collaborative Research): An adaptive cyberinfrastructure for threat management in urban water distribution systems","awardID":"0540316","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":["477502","554770","510854"],"PO":["411536"]},"114995":{"abstract":"0606718<br\/>Mann<br\/>The 2006 International Conference on Aging, Disability, and Independence (ICADI) is an activity of the Rehabilitation Engineering Research Center (RERC) on Technology and Aging of the University of Florida, Gainesville. The 2006 meeting extends and enhances the results of the pre-ICADI 2003 Planning Workshop (June 2003; Royal Academy of Engineering, UK) and the main 2003 ICADI meeting in Washington, DC (December 2003), supported by BES-0332819 (jointly funded by the ENG\/RAPD and CISE\/Universal Access Programs). The link to the 2003 conference report: http:\/\/icadi.phhp.ufl.edu\/2003\/proceedings.php?track=Transportation. Support is being provided for travel costs of the leaders of the 7 Program Tracks who will make keynote presentations about the state of science and technology in their respective fields. <br\/><br\/>The 2006 ICADI conference objectives cover the important issues of concern to our nations rapidly growing population of aging individuals:<br\/><br\/>1. Understanding the use of compensatory strategies such as assistive devices, smart technology, robotics, and home modifications, in promoting functional independence among frail elders.<br\/>2. Recognizing the importance of a functional independence perspective relative to older persons with impairments.<br\/>3. Gaining knowledge of the latest technology advances applied to the functional needs of frail elders.<br\/>4. Understanding new distance-based approaches to health care: telehealth.<br\/>5. Recognizing how technology can be applied to injury prevention, including falls, fire safety, poisons, pedestrian safety.<br\/>6. Contrasting approaches used in other countries relative to frail elder independence needs with US approaches<br\/>7. Understanding consumer perspectives on applications of technology for aging, disability and independence.<br\/><br\/>Printed and CD copies of The Proceedings of the 2006 International Conference on Aging, Disability and Independence, (ISBN Number. 0-9754784-0-3) will be distributed at the conference. And, IOS Press is to publish the full paper submissions in book form (Proceedings of the 2006 International Conference on Aging, Disability and Independence: Scientific Papers (ISBN Number 0-9754785-0-3)) that will be distributed at ICADI 2006, and also sold after the conference.","title":"International Conference on Aging, Disability and Independence, St. Petersburg, Florida, February 2-4, 2006","awardID":"0606718","effectiveDate":"2006-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5342","name":"Gen & Age Rel Disabilities Eng"}}],"PIcoPI":["531129"],"PO":["317420"]},"115424":{"abstract":"ABSTRACT<br\/><br\/>CISE Special Projects FY06<br\/><br\/>Id: CNS 0548906<br\/>PI: Eric Roberts (Stanford University)<br\/>Title: Northwest Workshop on Integrative Computing Education and Research<br\/><br\/> Stanford University has received a CISE Special Projects award to convene a workshop in the Northwest of the United States on the transforming of undergraduate computing education in response to rapid changes in technology and its applications. The purpose of this workshop is to begin a nationwide discussion to catalzye the transformation of undergraduate computing education. Such a transformation is critical to information technology (IT) workforce preparation and the continued preeminence of the U. S. in technology innovation. The workshop will identify areas of needed change and strategies for effecting the change.<br\/> <br\/>The intellectual merit of this project lies in the synergies that will follow from bringing together thoughtful individuals with wide-ranging expertise in the area of computing education. <br\/><br\/>The broader impact lies in the potential impact on computing education and thus a broad range of students across the United States. The number of students majoring in computing disciplines has declined in recent years even though employment demands for graduates in these disciplines continues to climb. Significantly, the number of women and minority students who consider the possibility of majoring in computing has fallen even more dramatically, further restricting the pool of available talent. Identifying innovative strategies to add and attach a broad range of students in computing disciplines will have enormous impact not only in terms of strengthening the nations economy but also in preserving equality of opportunity.","title":"Northwest Workshop on Integrative Computing Education and Research (ICER)","awardID":"0608701","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["491396","474015"],"PO":["564181"]},"109507":{"abstract":"This project aims at the generation of coherent and on-target summaries and answers through the use of text-to-text generation, an approach which generates new sentences from the input text, fusing relevant phrases and discarding irrelevant ones. A syntactic,<br\/>statistical framework for text-to-text generation is being developed that can be applied to informal genres, such as transcribed speech and email, where sentences are not guaranteed to be either complete or grammatical. It is exactly these genres that stand to benefit the most from this approach; for them, summarization using sentence extraction<br\/>alone is not an option.<br\/><br\/>The aim is a fully developed, syntactic statistical framework for text-to-text generation which features the use of a full syntactic grammar within a statistical framework for compression and combination, a model for incorporating constraints from pragmatics and<br\/>semantics into the generation system, the ability to produce fluent, grammatical sentences from fragmentary and ungrammatical input, and the ability to generate sentences that make high level abstractions from input document sentences.<br\/><br\/>The project features the integration of compression and language models into a lexicalized head-driven framework, enabling the generator to keep the sentence grammatical and avoid wording changes that dramatically alter meaning. Its framework can incorporate an arbitrary number of features beyond syntax that are important for<br\/>summarization. A new dynamic programming technique allows the automatic extraction of large amounts of training data from a summary\/document corpus. Information about who speaks to whom and paraphrasing rules will increase the range of revisions that can be addressed.","title":"Text-to-Text Generation for Summarizing Informal Genres","awardID":"0534871","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["423553"],"PO":["565215"]},"111520":{"abstract":"CAREER: Design and Evaluation of Methods for Robot Learning by Demonstration<br\/><br\/>Abstract<br\/>The goal of this career proposal is to create a research and educational program dedicated to developing and evaluating novel algorithms for robotic systems that learn from demonstration and interaction with human users. This program's research plan is to develop algorithms for automated generation of robot controllers from demonstration and interaction with human users. The main research questions of this project pertain to the investigation, design, and implementation of: (1) an autonomous robot control architecture that provides support for task knowledge acquisition from user provided demonstration, (2) algorithms for robot learning by demonstration that facilitate training of robot assistants by non-specialist users, (3) quantitative evaluation metrics that provide objective means for assessing the performance of human-robot interaction in the context of robot teaching by demonstration. The proposed robot control architecture will create the infrastructure for complex task learning and will provide a new representation for multiple action selection mechanisms. The learning by demonstration algorithms will use a novel approach for interpreting a user's demonstration, based on particle filtering that identifies superpositions of multiple concurrent activities. In addition, generalization algorithms will use inductive learning methods to capture and represent variations in task execution strategies. User feedback will allow for refinement of learned tasks, through verbal instructions or teleoperation interventions. The quantitative evaluation metrics will not only provide objective measures for the proposed interactive learning approach, but could also serve as more general tools for the broader field of HRI. This research will open new possibilities for the use of robots in everyday tasks, by allowing human users to customize robots to their own needs, without the necessity of being trained as computer scientists or robotics engineers. The educational plan of this project has three main components: (1) advancing and promoting teaching related activities, including the development of new robotics courses and establishing a new Robotics Laboratory at UNR, (2) outreach to local high-schools through seminars and internships and (3) dissemination of results in peer reviewed journals, conference proceedings, and on the Internet.","title":"CAREER: Design and Evaluation of Methods for Robot Learning by Demonstration","awardID":"0546876","effectiveDate":"2006-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[295274],"PO":["491702"]},"111366":{"abstract":"[IIS-0545912] <br\/>James B. D. Joshi <jjoshi@mail.sis.pitt.edu> <br\/>University of Pittsburgh, Pittsburgh <br\/><br\/>A Trust-based Access Control Management Framework for Secure Information Sharing and Multimedia Workflows in Heterogeneous Environments <br\/><br\/>The goal of this research is to address the complex security, privacy and digital rights management issues related to the emerging multidomain application (EMA) environments, which are characterized by the convergence of emerging grid, P2P and mobile environments with multimedia and workflow technologies. Such EMA environments show huge potential for efficiently automating workflow processes across heterogeneous administrative domains, and for facilitating unprecedented levels of system interactions and information and resource sharing. In particular, the project takes a holistic approach to synthesizing a solution that combines (i) a comprehensive trust-based, adaptive, content and context based access control and secure interoperation framework to facilitate the interaction of constituent domains in an EMA environment, and (ii) a comprehensive framework for addressing the privacy and digital rights management issues related to sharing of multimedia data and workflows. The research will produce required theory, efficient algorithms, specification languages, negotiation protocols, and analysis and administration tools founded on sound design principles and usability considerations which will be validated in a prototype EMA environment. The results are expected to have direct and long-term impact on developing secure data and resource intensive heterogeneous application environments, and will contribute significantly to current efforts related to the protection of complex systems and infrastructures such as the national and global information grid. The research results will be incorporated into the security curriculum of the University of Pittsburgh, which has been designated a national center of academic excellence in information assurance education, and disseminated through publication venues and the project website (http:\/\/www.sis.pitt.edu\/~jjoshi\/nsfcareer\/).","title":"CAREER: A Trust-based Access Control Management Framework for Secure Information Sharing and Multimedia Workflows in Heterogeneous Environments","awardID":"0545912","effectiveDate":"2006-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}}],"PIcoPI":["456313"],"PO":["565136"]},"109508":{"abstract":"In the post 9\/11 environment, a new form of organization has spawned in which public sector agencies and private organizations collaborate in designing complex IT-enabled infrastructures - systems that provide shared service delivery. This research will study and recommend design elements essential for architecture and governance structures that promote interorganizational success in using these systems. This project will draw on relevant knowledge from public administration, organizational theory, and information systems. It will focus on: (1) the design of collaborative systems that explicitly address the organizational needs of the technical infrastructure and (2) interactions among the system design elements and participating organizations that can best leverage such systems. Public safety collaborations currently use either packaged or open-standards systems to support interoperability among police, fire, rescue, homeland security and other public safety agencies. Examples of the packaged software systems include those from COPLINK and Motorola. Examples of open standards systems include Pennsylvania's Justice Network (JNET), the D.C. area's Capitol Wireless Integrated Network (CapWIN) and the San Diego area's Automated Regional Justice Information System (ARJIS). The current proposal will expand upon initial empirical and theoretical work conducted by its investigators based on CapWIN, ARJIS and JNET, and other interorganizational collaborative settings.<br\/><br\/>Expected contributions:<br\/>The researchers identify three key reasons to focus on infrastructures for interorganizational collaboration in the public safety domain. First, such systems are exemplars of how future networked organizations that exist because of IT, and effectively use it, might look. Second, they represent some of the most innovative thinking in digital government. Third, these systems, in their design and use, have direct benefits relative to public safety. These include improved homeland security, better delivery of governmental service and safer communities, while they impart substantial scientific value relative to design principles for both collaborative systems and the organizations using them. In furthering such research, the United States will provide leadership addressing current challenges that national and international public safety organizations face. The project will employ a design-centered approach in order to achieve improved and more robust IT infrastructures to support interorganizational information sharing. It will combine detailed empirical investigation using several field-based data collection methods, and will analyze extensive secondary data available on public safety in the United States. It will synthesize existing literature across a range of relevant disciplines to support theoretical and practical design recommendations for collaborative IT infrastructure and supportive organizational governance principles and structures.<br\/><br\/>The intellectual merit of the work derives from:<br\/>1. Interdisciplinary insights drawn from public administration and political science, organizational information systems, and information technology.<br\/>2. Empirical research design that leverages the best aspects of intensive case study and a large-sample survey.<br\/>3. Focus on technical design features and architectural principles that are essential to collaborative success.<br\/>4. Analysis of institutional governance structures and processes that are critical for support of successful<br\/>implementation and operation of collaborative systems.<br\/>5. Emphasis on building theory that can be generalized to many domains in which IT supports public-private collaborations.<br\/><br\/>The broader impact of the work is to improve:<br\/>1. Public safety and homeland security via better systems design to support information sharing.<br\/>2. IT-enabled public-private collaborations, regardless of context.","title":"Collaborative Research: Design Principles for Effective Interorganizational Public Safety Response Infrastructures","awardID":"0534877","effectiveDate":"2006-01-01","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[289911,"562605",289913],"PO":["565136"]},"110366":{"abstract":"Title:<br\/>DDDAS\/SEP: Optimal interlaced distributed control and distributed measurement with networked mobile actuators and sensors<br\/><br\/>Abstract:<br\/>This one-year exploratory project focuses on applying the dynamic data driven applications system (DDDAS) approach to achieve optimal interlaced distributed control and distributed measurement with networked mobile actuators and sensors. The application system is on chemical fog concentration reduction or elimination. A group of moving sensors make distributed measurements of the diffusion process to characterize the diffusion process (sniffing), meanwhile, the dynamic data sensed is fed to a group of mobile robots equipped with neutralizer dispensers (spraying) to contain the chemical fog. Fundamental research issues include sensing policy, actuation policy, formation regulation and tracking, and optimal path planning. In this one-year exploratory DDDAS project, the PI specifically attacks the optimal interlaced distributed control and distributed measurement with networked mobile actuators and sensors, which will lay a foundation for characterizing and neutralizing multiple, possibly evolving, chemical sources, on and underground, by a team of ground mobile robots equipped with networked sensors (detectors) and actuators (neutralizers). <br\/><br\/>The proposed research and educational efforts will have a significant impact on the development of mobile actuator and sensor networks for national security interests, water resources, precision agriculture, ecological and environmental monitoring; the creation of interdisciplinary research and environment; recruiting and retaining engineering students. As a motivating example, imagine that a hostile toxic diffusion source is being released and diffusing with no color and no smell. It is very desirable to send a team of mobile robots to sniff around and, meanwhile, dispatch another team of mobile robots to spray\/neutralize the diffusion process. Since these robots are networked via wireless links, thus the name \"mobile actuator and sensor networks.\" It is a hard problem to decide where to sniff and where to spray for each individual mobility node when various constraints exist such as limited battery life and obstacles. This project focuses on optimal interlaced distributed control and distributed measurement with networked mobile actuators and sensors. That is, move sensors for better measurements and in turn, move actuators for better control and neutralization. This project provides a new, unique exciting challenge to push the boundary of emerging distributed control system theories with a clear dynamic data driven flavor.","title":"DDDAS\/SEP: Optimal interlaced distributed control and distributed measurement with networked mobile actuators and sensors","awardID":"0540179","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["496882"],"PO":["532987"]},"111477":{"abstract":"The past few years have seen a revolution in machine<br\/>translation, with the widespread adoption of<br\/>statistical systems trained on large amounts of<br\/>parallel bilingual text. Recent evaluations have shown<br\/>that current statistically trained research technology<br\/>significantly outperforms commercially available MT<br\/>systems such as those available on the web. But even<br\/>state-of-the-art systems produce garbled translations<br\/>more often than not. Further improvements in machine<br\/>translation will require major changes in the<br\/>architecture of statistical systems. Our research aims<br\/>to improve the quality of machine translation output by<br\/>allowing statistical systems to handle deeper, semantic<br\/>representations.<br\/><br\/>Our approach focuses on improving statistical machine<br\/>translation by using a semantic representation at the<br\/>level of predicate-argument structure. This work<br\/>builds on the recent success in statistical approaches<br\/>to shallow language understanding, and tree-based<br\/>algorithms for machine translation using syntactic<br\/>parses of the source and target sentences. Over the<br\/>course of the project we aim to: first, develop robust<br\/>semantic parsing systems capable of generalizing to new<br\/>domains and apply them to large bilingual corpora,<br\/>second, develop probabilistic models of translation<br\/>that use the resulting level of representation and can<br\/>be practically trained, and third, integrate language<br\/>understanding and translation to allow efficient search<br\/>for the best overall translation of new sentences.","title":"CAREER: Semantics for Statistical Machine Translation","awardID":"0546554","effectiveDate":"2006-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["518197"],"PO":["565215"]},"110400":{"abstract":"The basic technological framework used to manage the national electric power grid is several generations old and is not prepared to meet the increased pressures of a growing economy, especially with the reduced<br\/>investment for transmission infrastructure in the past several decades. Experts recognize that<br\/>blackouts similar to the Northeast US - Canadian blackout of August 2003 remain a reality. The<br\/>Dynamic Data-Driven Applications (DDDAS) paradigm offers a unique framework for<br\/>methodological innovations that can revolutionize the nation's energy infrastructure, alleviate the<br\/>threat of blackouts, and assure the long term stability, reliability, and efficiency of the electric power<br\/>grid. New technology designed for the national energy infrastructure would increase the total energy utilized by<br\/>dynamically balancing power supply and demand, and by providing the ability to respond to<br\/>potentially debilitating situations before they develop into a crisis. The proposed research will<br\/>advance new methodologies for situation awareness, control flexibility, autonomic functionalities, and<br\/>self-healing that will revolutionize the state of the art in energy management. The centerpiece of the<br\/>research will be an integrated real time dynamic sensing and simulation capability for the electric<br\/>power grid. DDDAS provides the framework for the methodological innovations to achieve<br\/>seamless and robust integration of measurements and dynamic simulations across the multiple<br\/>boundaries of timescales and spatial characteristics encountered in the power grid.<br\/>To achieve its objectives the project will make advances along six integrated tasks (e.g. Simulation, Sensing, Integrative Methods, Visualization,<br\/>Computer Security, and Demonstration). The advances of this research include 1) real<br\/>time, high fidelity power grid simulation using integrated distributed heterogeneous simulation (DHS)<br\/>and neural network techniques on high end computational platforms, 2) the integration of real time<br\/>simulation and sensing using both high cost, high precision and low cost distributed sensor networks,<br\/>3) a new class of stable and robust mathematical algorithms for solving complex ill-posed problems<br\/>such as the real time power grid simulation\/sensing application, 4) new approaches to real time<br\/>visualization and computer security. To demonstrate the intellectual merit and to achieve the<br\/>broadest impact of this research, the team will take advantage of existing collaborations with the<br\/>Midwest Systems Independent Operators (MISO), the first regional transmission organization<br\/>approved in the United States, and technology transfer mechanisms are essentially already in place.","title":"DDDAS-TMRP: DDDAS for Autonomic Interconnected Systems: The National Energy Infrastructure","awardID":"0540342","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["385330","440994",292427,"425107",292429],"PO":["551712"]},"110554":{"abstract":"Background<br\/><br\/>The PI proposes an operating system and application architecture that removes the memory and CPU from the data path for applications that handle high-bandwidth data flows. The role of the operating system becomes that of data-flow management, while applications are concerned purely with signaling. This design parallels the evolution of modern network routers and has the potential to enable high-performance I\/O for end systems, as well as fully exploit recent trends toward programmable peripheral (I\/O) devices. An alternative view is that hardware devices are composed into virtual processing pipelines, completely removing the CPU and main memory from the data-intensive tasks for which they are increasingly unsuitable due to performance considerations. <br\/><br\/>The Pis hypothesis is that application-specific data-flow handling policies can be executed inside the operating system kernel, which composes and configures peripherals, manages flows, and handles exceptions. Such functionality can be retrofitted to existing operating systems and applications, instead of requiring a complete redesign. Several interesting research issues with respect to safety, flow scheduling, error handling, and resource management arise in the proposed architecture.<br\/><br\/>Intellectual Merit<br\/><br\/>The proposed architecture is a first step toward abandoning the concept of memorycentric<br\/>computing, a paradigm ingrained in computer scientists for several decades. This shift in architectural<br\/>thinking is both necessary for performance reasons and natural, given the increasing use of task-specific<br\/>and programmable hardware. The proof-of-concept prototype indicates that the proposed system can at least double I\/O throughput for large flows, and is orthogonal to other performance optimization approaches (e.g., faster interconnection buses). This research intends to bring together such diverse fields of<br\/>Computer Science as networking, operating systems, embedded system design, programming languages, and<br\/>security, and to change the way these are taught, from individual subjects to interdependent items that require (and promote) wide knowledge and creative thinking. <br\/><br\/>Broader Impact<br\/><br\/>-This architecture will enable high-performance applications and allow more efficient use of server resources<br\/>-It will also allow experimentation and deployment of new types of system architectures, allowing use of novel hardware designs, device interconnection strategies, and load-balancing and scheduling algorithms.<br\/>-This approach will also eliminate one commonly perceived problem with the wide-spread use of secure protocols and cryptography, that of performance.<br\/>-The PI hopes to enable a new class of systems that are able to support highperformance applications across a wide range of areas of computer science <br\/>-Finally, by fully taking advantage of computing systems capabilities, users can reap considerable savings in equipment spending.<br\/>-The PI plans to involve creating cross-subject projects and an undergraduate laboratory class that exposes students to interesting projects and research at the intersection of systems, networks, and security. Many of these projects will allow students to cross the hardware\/software boundary, which few current professionals can do despite increasing demand","title":"DCS: Retrofitting a Flow-oriented Paradigm in Commodity Operating Systems for High-Performance Computing","awardID":"0541093","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}}],"PIcoPI":["564223"],"PO":["565272"]},"113975":{"abstract":"The ACM Sigact Committee on Funding for Theoretical Computer Science proposes to develop a plan for a cross-cutting NSF initiative on theory of networked computation. This initiative would cover such topics as: the complexity theory of networked computation; security, privacy, usability and reliability; massive data sets; incentives;and network computation in the sciences. The initiative must be designed to attract the best researchers from both the theoretical computer science community and all the various software and systems disciplines that bear on networked computation. In preparing the proposal it is essential that we gain the advice and concurrence of the leading researchers in all these fields, as well as the representatives of these fields within CISE. For this purpose we wish to hold two two-day planning workshops, with thirty participants in each. About a third of the participants will be invited speakers, a third will be invited discussants, and a third will be selected from applicants in the computer science community. The Program Committee for the workshops will be drawn from our Sigact committee and will consist of Joan Feigenbaum (chair), Richard Karp and Christos Papadimitriou.","title":"Workshop:Planning for a Cross-Cutting Initiative on Theory of Networked Computation","awardID":"0601893","effectiveDate":"2006-01-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["561682"],"PO":["499399"]},"111445":{"abstract":"Data dissemination, i.e., transporting data or control messages from one to multiple end points, is an indispensable component in wireless network operations. Existing and emerging applications in multihop wireless networks, such as distributed industrial control, environmental monitoring, emergency response systems act on aggregates of wireless devices rather than communication between individual nodes. Although there exist a few studies that reveal the complex dynamics of simple data dissemination protocols, the fundamental properties of data dissemination process remain elusive. Little is known, for instance, how physical cooperative relay strategies, power control, MAC layer scheduling and routing affect the achievable transmission rate of the source, the speed of information diffusion, reliability of data delivery and energy to broadcast messages over a geographic area. Consequently, the design of data dissemination protocols is mostly done in an ad hoc fashion. This project focuses on the theory and system design of data dissemination protocols with emphasis on their applications in operational systems such as wireless sensor networks and wireless mesh networks. This research will develop a unified analytical framework to characterize the asymptotic properties and energy-performance trade-offs of data dissemination processes in random and regular networks under different physical layer models. The theoretical results serve as a foundation to the cross-layer design of efficient and robust algorithms for data dissemination. The investigator and students will develop one-to-many and many-to-one transport services and APIs for sensor network management (SNM) that facilitate the configuration and monitor of managed devices and states in sensor networks.","title":"CAREER: Data Dissemination in Multihop Wireless Networks: Theory and System Design","awardID":"0546391","effectiveDate":"2006-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["486325"],"PO":["557315"]},"110356":{"abstract":"To understand the performance of an advance digital wireless communication systems, it is crucial to have detail knowledge of the radio channel characteristics. The channel's dispersive nature and spatial fading patterns will determine the system's radio coverage, bit error rates, transmission efficiency, call capacity, power control, antenna diversity, and a host of other issues. The main drawback of deterministic propagation models is that they require a large number of site specific information to produce accurate results. The information include a detail map of the location of each scatterer and their physical dimensions. The electric characteristics of the material for each scatterer is also required, although this information is much more difficult to obtain and often impossible to quantify simply. The purpose of this small exploratory project is to study the integration of the measured propagation path characteristics into a deterministic propagation simulation model. The research planned will include the measurement of a wideband signal in a college campus environment, the separation of the measured signal into its dominant multipath components, and the detail analysis of each path to determine the number and the degree of signal attenuation at each interaction. Individual multipaths from the measurement will be uniquely identified according to their propagation delay and direction of arrival at the receiver. Simulations using the Vertical Plane Launch (VPL) method will be performed on a detailed virtual representation of the same physical environment. The simulated propagation paths will be used to steer the measurement to the direction of the expected arrivals of the signal. The simulations will incorporate the scattering coefficients derived from the analysis of the measurements and the enhanced results will be studied to assess its accuracy. Issues such as the level of detail required in the simulation, and the multipath resolution of the measurements will be examined to determine its impact on this closed loop system.","title":"DDDAS-SEP: Intergrating Multipath Measurements with Site Specific RF Propagation Simulations","awardID":"0540142","effectiveDate":"2006-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":[292282],"PO":["301532"]},"111456":{"abstract":"Genomic diversity analyses of large-scale case\/control and population studies promise to provide answers to fundamental problems ranging from determining the genetic basis of disease susceptibility to uncovering the pattern of historical population migrations. However, the feasibility of such studies critically depends on addressing a number of technological and computational challenges. On the technological front, despite the huge advances made in recent years, there is still a need for a flexible high-throughput platform capable of typing hundreds of thousands of SNPs at a very low-cost per experiment.Computationally, there is a need for integrating recently developed statistical models of the structure of genomic variability in human populations with efficient combinatorial methods delivering predictable solution quality.<br\/><br\/>The proposed research and education activities will address the above challenges at several levels, including modeling and formalizing the underlying biological and technological problems, finding efficient algorithms for the identified problems, engineering these algorithms into high-quality open-source bioinformatics tools, and collaborating closely with industry researchers and molecular geneticists in validating the proposed methods and applying them to population-scale genomic data. Major project outcomes will include (1) development of an innovative high-throughput SNP genotyping assay realizing a yet unrealized potential of k-mer arrays by combination with solution-phase single-base extension, (2) optimization of two proven technologies that are in common use in SNP genotyping - DNA tag arrays and multiplex-PCR, (3) novel likelihood maximization algorithms with predictable solution quality for challenging computational problems arising in two-stage sampling design association studies, including haplotype tagging SNP selection and haplotype reconstruction from genotype data, (4) robust open-source software implementations and principled methodologies for the empirical evaluation of proposed algorithms, and (5) innovative curriculum and educational materials, including the creation of a new textbook on computational genomics. The successful completion of the project will lead to decreased data collection costs in large-scale association studies, thus enabling more studies to be completed within the same budget. The proposed assay architecture based on k-mer arrays is expected to enable additional applications of genomic technologies, such as genomics-based point-of-care medical diagnosis and large-scale species identification. Broader impacts of proposed educational and outreach activities include increasing participation of under-represented groups in research and training of future researchers with unique interdisciplinary skills.","title":"CAREER: Combinatorial Algorithms for High-Throughput Collection and Analysis of Genomic Diversity Data","awardID":"0546457","effectiveDate":"2006-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["525689"],"PO":["565136"]},"110378":{"abstract":"The main objective of this research is to develop new algorithms and tools for the distributed collection, sharing, mining and harnessing of data for cooperative health monitoring and vulnerability assessment of power systems in real time. Fundamental concepts and technology for achieving this objective exist today in the areas of power systems, system theory and computer science, but harnessing them to achieve this vision will require the significant multidisciplinary concerted effort proposed here. The project aims at making fundamental contributions to the necessarily<br\/>multidisciplinary systems required for data utilization in monitoring and control of interconnected<br\/>engineering systems. The application that this proposal focuses on is the creation of new data-driven tools for electric power system operation and control. The applications systems include traditional SCADA systems as well as the emerging Phasor Measurement Unit (PMU) data concentrators. This effort will focus on five specific task areas: Distributed agent-based system monitoring; Pattern recognition and change detection; Dynamic analysis of signatures for early warning; Data-driven, low-order modeling for security assessment; Automated visualization for power system health monitoring. This work will provide a broader impact in several areas. First, the results in data manipulation, visualization, and processing will have application in other domains. Any complex system that relies heavily on measurements for monitoring and control shares the same need to extract key information from massive amounts of data received over wide areas and time scales. Second, several of the investigators work very closely with the electric power industry through the Power Systems Engineering Research Center (PSERC), an NSF Industry\/University Cooperative Research Center designed to stimulate collaboration among 13 universities and 35 companies. Results from this project will naturally influence that collaboration in the form of seminars, tutorials, and interaction with industry.","title":"DDDAS-TMRP: Data-Driven Power System Operations","awardID":"0540237","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["477965","457811","457810","492064"],"PO":["493916"]},"132169":{"abstract":"Proposal 0535126<br\/>\"Learning High-level Models of Human Behavior from Low-level Sensor Data\"<br\/>PI: Henry Kautz<br\/>University of Washington<br\/><br\/>ABSTRACT<br\/><br\/>The goal of this project is to create systems that can interpret and understand day to day human experience. Achieving this goal will support many practical applications with broad social impact, including developing assistive technology for the disabled, creating models of patterns of human interaction for use in the social sciences, and creating new kinds of just-in-time information systems for business and personal use. There are three main themes to this research. First is work in knowledge representation on the structure of goals, plans, and actions. This project is concerned not just with plan synthesis, but also with supporting reasoning about the intentional basis of human action. Second is work on probabilistic reasoning, because any method for interpreting human behavior is necessarily fraught with uncertainty. This work draws upon and extends recent approaches on using model-counting algorithms for probabilistic inference, and methods for combining probability theory with first-order logic. Third is work on ubiquitous sensing: the idea that data from large numbers of simple, inexpensive sensors that directly measure properties of the world can be used to replace or augment complex input modalities such as machine vision or natural language understanding.","title":"Learning High-level Models of Human Behavior from Low-level Sensor Data","awardID":"0734843","effectiveDate":"2006-01-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["550377"],"PO":["387198"]},"111489":{"abstract":"With increasing demand for real-time multimedia services such as TV channel broadcasting, and fast download requirements by applications such as P2P, video-on-demand, and software downloads, the access network design needs to treat point-to-multipoint and multipoint-to-point traffic as first class citizens for efficient operation. The high level objective of this project is to design networking protocols over realistic time-varying channels for supporting data dissemination in wireless mesh-networks. These networks are characterized by wireless backbones as opposed to the dominant wired backbones connecting today's wireless access-points. This research is based on the novel paradigm of on-the-fly computation, where recent data-driven channel measurements are used to exploit time-variance of channels for enhanced performance. This research will enable support for emerging media-rich applications that will result in the wide-scale deployment of mesh-networks to provide ubiquitous multi-media enriched services. It will make tangible impacts to several active research areas including mesh-networks, wireless local area networks, and ad-hoc networks. To promote education, training and learning, this effort will actively involve undergraduates, women and minority students.","title":"CAREER: On-the-fly Protocols for Data Dissemination in Wireless Mesh Networks","awardID":"0546630","effectiveDate":"2006-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["542039"],"PO":["557315"]},"119948":{"abstract":"ABSTRACT<br\/>0330342<br\/>Arye Nehorai<br\/>U of Illinois, Chicago<br\/><br\/>Title: Collaborative Research -- Sensors: Biochemical Sensors and Data Processing for Security<br\/><br\/>This research addresses current concerns about possible biochemical attacks threatening our national security. The investigators develop sensors and data processing for detecting sources of biological agents or<br\/>toxic chemicals, and managing data-bases. This technology has further applications to environmental monitoring, controlling pollution, detecting explosives, and other scenarios.<br\/>The investigators develop three categories of sensors for detecting bio-target molecules that bind to substrate-attached receptor molecules. The first exploits the frequency shift of an optical resonator from a<br\/>change in its dielectric environment brought on by target adsorption. The second exploits the sensitivity of optical resonators to detect Raman spectra associated with the adsorbed targets. The third involves<br\/>attaching fluorescent labels to secondary recognition molecules and detecting their light emissions when they bound to agents captured by substrate receptor molecules. Arrays of probes are created to screen for<br\/>multiple targets, interacting with the signal processing. Strategies for making continuous sensing are considered. The signal processing part analyzes data from chemical sensor array networks, subject to resource constraints. The researchers derive physical models for substance dispersion in subway tunnels, shopping malls, city streets, airport bag screening, etc. Flux density sensors are included. This project analyzes the algorithms performance for optimally designing the arrays. To increase the functionality, the investigators consider moving sensors (robots, autonomous vehicles) and develop motion techniques while addressing other requirements (coverage, energy minimization.) The study involves managing high data volumes and processing power requirements that may arise from a large network.","title":"SENSORS: Collaborative Research: Biochemical Sensors and Data Processing for Security Applications","awardID":"0630734","effectiveDate":"2006-01-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["449854"],"PO":["564898"]},"110401":{"abstract":"The next generation of wireless sensor networks will be dynamic systems with the potential to<br\/>revolutionize understanding of environmental change, provided they can assimilate large amounts of heterogeneous data in real time, rapidly assess (optimize) the relative value and costs of new data collection, and schedule subsequent measurements accordingly. Thus, they are Dynamic Data Driven Application Systems that integrate sensing with modeling in an adaptive framework. Keen interest in broad application of wireless sensing of the environment, as in NEON and CLEANER, awaits DDDAS technology that can estimate the value of future data in terms of its contribution to understanding against the costs of deployment, acquisition, transmission, and storage. This balance is especially important for environmental data, because networks will typically be deployed in remote locations without access to infrastructure (e.g., power), and sampling intervals will range from meters and seconds to landscapes and years, depending on the process, the current state of the system, the uncertainty about that state, and the perceived potential for rapid change. Network control must be dynamic and driven by models capable of<br\/>learning about both the environment and the network. The focus of this project is the dynamic sensor network application involving understanding how biodiversity and carbon storage are influenced by global change. Specifically, this project is designed to learn how the growth, survival, and reproduction of forest trees are influenced by changes in climate, CO2 and disturbance, in the context of these and other variables that can fluctuate rapidly. This goal involves models of how tree growth and resource allocation are influenced by variables that can be understood through adaptive sampling across diverse scales in both time and space. The project will enable a general framework for dynamic data-driven wireless network control that combines environmental modeling and sensor network modeling both in and out of the network. Out of the network, environmental modeling entails full assimilation of all information, with exploitation of computing resources available there. Environmental modeling in the network is based on simplified representations that provide real-time, approximate answers. The in-network control model provides rapid scheduling for new measurements, and it communicates network information to the server, for diagnostics, supervisory control, and data assimilation. Periodically, the in-network model is updated<br\/>based on this most complete understanding of the environmental variables, parameters, and battery life. Specific goals are (i) to construct a wireless sensing and networking infrastructure that supports a new paradigm of joint in-network and supervisory measurement, modeling, and prediction, (ii) to develop the modeling strategy needed to combine system understanding with costs for efficient wireless sensing of the environment, (iii) to make significant progress in understanding the maintenance of biodiversity and in measuring ecosystem properties, and (iv) to improve collaboration between computer sciences, engineering, statisticians and environmental scientists.","title":"Collaborative Research: DDDAS-TMRP: Dynamic Sensor Networks - Enabling the Measurement, Modeling, and Prediction of Biophysical Change in a Landscape","awardID":"0540347","effectiveDate":"2006-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"7350","name":"NAT ECOLOGICAL OBSERVATORY NET"}}],"PIcoPI":["353750","544491","554177","508314","562557"],"PO":["493916"]},"110643":{"abstract":"This is funding to support this year's HCI doctoral research consortium (workshop) of approximately 15 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2006 Conference on Human Factors in Computing Systems (CHI 2006), which will be held April 22-27 in Montreal, Quebec, and sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI). Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on April 22-23, with follow up activities planned during the technical program of the CHI 2006 conference. Extended abstracts of the students' work will be published in the CHI 2006 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The CHI doctoral consortia, which began in 1986, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today's leading HCI researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"WORKSHOP: Human-Computer Interaction Doctoral Research Consortium at ACM CHI 2006: Human Factors in Computing Systems","awardID":"0541504","effectiveDate":"2006-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["549541"],"PO":["565227"]},"111402":{"abstract":"IIS-0546136<br\/>Amol V Deshpande <amol@cs.umd.edu><br\/>University of Maryland College Park<br\/><br\/>CAREER: MauveDB: Model-based User Views over Sensor Data<br\/><br\/>Real-world data --- especially when generated by distributed measurement infrastructures such as sensor networks --- tends to be incomplete, imprecise, and erroneous, making it impossible to present it to the users or to feed it directly into applications. The goal of this project is to develop MauveDB, a data management system that offers a principled approach to dealing with this problem by supporting a new abstraction called \"model-based views.\" MauveDB is built by leveraging the Apache Derby Database Management System (DBMS) codebase. Analogous to traditional database views, model-based views provide independence from the details of the underlying data generating mechanism and hide the irregularities of the data by using statistical and probabilistic \"models\" to present a consistent view of the data to the users. MauveDB supports a declarative language for defining model-based views, and supports declarative querying over model-based views using an extended version of SQL that supports continuous and probabilistic queries. Being a full-fledged DBMS, MauveDB also enables easy storage and archival and querying of historical data. By relieving the users of the burden of dealing with the noisy real-world data, MauveDB enables a high-impact new class of real-world applications based on networks of monitoring and sensing devices, such as traffic monitoring, location-based services, environmental monitoring, health services, and military applications. This research will be used to develop code, datasets and sensor network deployments that will be used in the new course modules being developed at the University of Maryland; the code and the course material developed will also be made freely available at the project web site http:\/\/www.cs.umd.edu\/~amol\/MauveDB.","title":"CAREER: MauveDB: Model-Based User Views over Sensor Data","awardID":"0546136","effectiveDate":"2006-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["550401"],"PO":["469867"]},"110357":{"abstract":"This grant provides funding for the development and analysis of data-driven models of uncertainty in revenue management, which will incorporate the decision-maker's risk preferences and dynamically integrate experimental measurements into the computational approach. A first set of models will focus on quantity-based revenue management, where the demand distribution is independent of the decision-maker's actions. A second set of models will apply the data-driven paradigm to price-based revenue management, where the demand distribution, and hence the data, is affected by the decision variables. Specifically, this research project will investigate the following three questions: (i) How should additional data be incorporated into the algorithm to yield robust solutions, especially when part of the historical data might now be obsolete? (ii) How can the optimization module steer the data collection process, not only in terms of measurement frequency, but also with respect to the quantities monitored? (iii) How can the wealth of available data be manipulated in an efficient manner, so that the added clarity about the state of the system does not come at the expense of computational tractability? The analysis will involve techniques from the fields of financial risk management, control theory, robust regression and mathematical programming, as well as large-scale simulations to assess the robustness and performance of the approach. <br\/>If successful, this research will provide a comprehensive mathematical model of revenue management under uncertainty that will be more tightly connected to the available data without overly depending on any one assumption about demand. It will allow practitioners to take into account randomness in a more intuitive manner, and hence will promote the use of state-of-the-art optimization models and computational techniques in industry. Moreover, the models and algorithms developed in this work will offer a new approach to decision-making under uncertainty of interest to the whole operations research community and with applications to a wide array of domains.","title":"DDDAS-SMRP: Robustness and Performance in Data-Driven Revenue Management","awardID":"0540143","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1786","name":"MANFG ENTERPRISE SYSTEMS"}}],"PIcoPI":["363285"],"PO":["523516"]},"111369":{"abstract":"CAREER: Structure from Recognition, Building Visual Worlds <br\/>PI: David Nister<br\/><br\/>Abstract<br\/><br\/>The goal driving this project is a computer vision system that takes continuously streaming video from a moving camera as input and opportunistically builds a visual description of the world around it, starting from a very agnostic state where it reconstructs everything from scratch, and progressing towards a state where it is mostly recognizing new input as something it has seen before. The envisioned system will appear in a diverse set of applications, such as in wearable computing as an assistant for fully seeing as well as visually impaired users, general human computer interaction, monitoring television streams, surveillance, robotics,<br\/>navigation, smart cars, mapping and 3D reconstruction. <br\/><br\/>The project will explore a symbiosis between geometry and recognition, aiming at entirely automatic visual 3D reconstruction of an environment. The challenge is to develop a theory that allows constructing a system that can improve the visual description over time in a trustworthy and robust manner, incorporating large flexibility, while utilizing the constraints and previously gathered knowledge necessary to approach human performance.<br\/><br\/>To meet this challenge, an experimental system will be developed that combines affine-covariant image region extraction and description, context-aware queries, geometric validation, topological and metric mapping. Affine-covariant region extraction and description provides features that are robust to occlusion and changes in viewpoint or illumination. The ability to quickly bring forth relevant material from the past is provided by context-aware queries. Geometric consistency of a configuration of local features then serves as validation of match correctness.<br\/><br\/>The validation allows continuous learning of which features and descriptors are stable and which feature constellations work efficiently in pulling consistent matches out of the previously gathered database. A topological (or quasi-metric) map of scenes and objects is created based on the validated matches. The map consists of a number of world cliques that contain 3D positions and visual descriptor classes of feature points that give rise to stable affine-covariant regions. When sufficient information is gathered, the topologial map is fused into a global metric map using structure from motion techniques. The results will be evaluated through simulations and by using real video with ground truth positioning data.<br\/><br\/>The broader impacts of the project include applications to large-scale 3D modeling in commercial and military cartography, generation of virtual walkthroughs, and autonomous robotic navigation. In addition, the PI will develop a certificate program in computer vision and graphics, and will explore applications of the computer vision system to assisting visually impaired users.<br\/><br\/>URL: http:\/\/www.vis.uky.edu\/~dnister\/Projects\/CAREER\/career.html","title":"CAREER: Structure from Recognition, Building Visual Worlds","awardID":"0545920","effectiveDate":"2006-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[294953],"PO":["564316"]},"110402":{"abstract":"The proposed project will develop an integrated Wireless Phone Based Emergency Response System (WIPER) that is capable of real-time monitoring of normal social and geographical communication and activity patterns of millions of wireless phone users, recognizing unusual human agglomerations, potential emergencies and traffic jams. WIPER will select from these massive data streams high-resolution information in the physical vicinity of a communication or traffic anomaly, and dynamically inject it into an agent-based simulation system to classify and predict the unfolding of the emergency in real time. The agent-based simulation system will dynamically steer local data collection in the vicinity of the anomaly. Multiple distributed data collection, monitoring, analysis, simulation and decision support modules will be integrated using a Service Oriented Architecture (SOA) to generate traffic forecasts and emergency alerts for engineering, public safety and emergency response personnel.","title":"DDDAS-SMRP: Integrated Wireless Phone Based Emergency Response System (WIPER)","awardID":"0540348","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1320","name":"ECONOMICS"}}],"PIcoPI":["385731","426517","426517"],"PO":["535244"]},"110545":{"abstract":"Background<br\/><br\/>Analysis of large and\/or geographically distributed scientific datasets, is emerging as a key component of grid computing and holds great promise for scientific discoveries. However, such analysis tasks are complicated by low-level and specialized data storage formats, and lack of standard interfaces for accessing the data. Scientific datasets are typically stored in binary or character flat-files. These enable compact storage and efficient processing, but, make the specification of processing much harder.<br\/>The overall motivation for this project is \"future distributed and grid computing applications will need high-level abstractions and programming languages to access, retrieve, and process large-scale scientific datasets that are physically stored in compact low-level formats\".<br\/><br\/>Intellectual Merit<br\/><br\/>Develop a compiler to support a system of the nature described above involves a number of challenges.<br\/>These challenges arise primarily because of the following four reasons:<br\/>1) Supporting high-level abstractions, which implies that compiler not only needs to generate code that will correctly access data, but also needs to automatically achieve high-locality<br\/> 2) Large Disk-Resident Datasets, which makes it quite challenging to generate low-level code that will have<br\/>high data access locality<br\/>3) Characteristics of the Applications we are targeting scientific data analysis, data mining, and<br\/>image analysis applications that have not received much attention in the restructuring compilers community, <br\/>4)Features of XQuery since XQuery is derived from functional, declarative, as well as database programming languages, a number of issues arise because of the constructs and programming styles it supports.<br\/><br\/>Broader Impact<br\/><br\/>-The PI is working on creating a new two quarter sequence on application-driven grid computing. Here, one of the topics that will be emphasized is the analysis of large datasets arising from real biological and medical applications.<br\/>- The PI is currently working with three female Ph.D students, and expects to involve one of them in this project. <br\/><br\/>Together with many of his colleagues in the Computer Science and Engineering department at the Ohio State University, Agrawal is part of a collaboration plan with two HBCUs in the state of Ohio. <br\/>This collaboration plan includes:<br\/> 1) Guest lectures by OSU faculty<br\/>and <br\/>2) Research opportunities for HBCU undergraduates through independent study and summer projects jointly with OSU faculty (we hope to be able to use NSF REU supplements for funding this activity).","title":"ST-CRTS: Enabling Processing of Large-Scale Scientific Data Through Compiler Supported XML Abstractions","awardID":"0541058","effectiveDate":"2006-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["558505"],"PO":["565272"]},"111425":{"abstract":"Advancements in science and technology have led to increased complexity in computing systems. With a growing number of heterogeneous software and hardware components, computing systems are becoming more and more difficult to monitor, manage and maintain. The goal of this project is to develop an integrated framework on mining log data for automatic system management. The project is conducting research on: (1) developing new methods and tools for log data organization which create consistency and improve the ability to correlate across multiple log files; (2) developing new methods and tools for data-driven pattern discovery and problem determination; and (3) developing new methods and tools to bridge the gap between the system management applications and the intelligent techniques. The integrated framework resulting from this research will provide much better techniques for monitoring, analyzing, and adapting complex computing systems. Results from this research will be disseminated through publications and the software tools being made publicly available through a web portal. The educational component of this project includes developing a new curriculum that incorporates research into the classroom and provides women, minorities, and undergraduate students with opportunities to participate research. Florida International University (FIU) is among the top awarders of computer science degrees to Hispanic students in the USA and its history of involving the participation of underrepresented groups in the research efforts will be leveraged during the course of this project. This project will also strengthen industry research collaborations and have immediate applications to fields other than system management.","title":"CAREER: Mining Log Data for Computing System Management","awardID":"0546280","effectiveDate":"2006-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["550720"],"PO":["560586"]},"110347":{"abstract":"DDDAS-TMRP (COLLABORATIVE RESEARCH): AN ADAPTIVE CYBERINFRASTRUCTURE FOR THREAT MANAGEMENT IN URBAN WATER DISTRIBUTION SYSTEMS<br\/><br\/><br\/>Contamination threat management in drinking water distribution systems involves real-time characterization of the contaminant source and plume, identification of control strategies, and design of incremental data sampling schedules. This requires dynamic integration of time-varying measurements of flow, pressure and contaminant concentration with analytical modules including models to simulate the state of the system, statistical methods for adaptive sampling, and optimization methods to search for efficient control strategies. For realistic distribution systems, the analytical modules are highly compute-intensive, requiring multi-level parallel processing via computer clusters. While data often drive the analytical modules, data needs for improving the accuracy and certainty of the solutions generated by these modules dynamically change when a contamination event unfolds. Since such time-sensitive threat events require real-time responses, the computational needs must also be adaptively matched with available resources. Thus, a software system is needed to facilitate this integration via a high-performance computing architecture (e.g., the TeraGrid) such that the measurement system, the analytical modules and the computing resources can mutually adapt and steer each other. The goal of this multi-disciplinary research is to develop a cyberinfrastructure system that will both adapt to and control changing needs in data, models, computer resources and management choices facilitated by a dynamic workflow design. Using virtual simulation and a field study, this cyberinfrastructure will be tested on illustrative scenarios for adaptive management of contamination events in water distribution systems.<br\/><br\/>Urban water distribution systems are vulnerable to accidental and intentional contamination incidents that could result in adverse human health and safety impacts. The pipe network in a typical municipal distribution system includes redundant flow paths to ensure service when parts of the network are unavailable, and is designed with significant storage to deliver water during daily peak demand periods. Thus, a typical network is highly interconnected and experiences significant and frequent fluctuations in flows and transport paths. These design features unintentionally enable contamination at a single point in the system to spread rapidly via different pathways through the network, unbeknown to consumers and operators. When a contamination event is detected via the first line of defense, e.g., data from a water quality surveillance sensor network and reports from consumers, the municipal authorities are faced with several critical questions as the contamination event unfolds: Where is the source of contamination? When and for how long did this contamination occur? Where additional hydraulic or water quality measurements should be taken to pinpoint the source more accurately? What is the current and near future extent of contamination? What response action, such as shutting down portions of the network, implementing hydraulic control strategies, or introducing decontaminants, should be taken to minimize the impact of the contamination event? What would be the impact on consumers by these actions? Real-time answers to such complex questions will present significant computational challenges. This project will address these challenges by developing an adaptive cyberinfrastucture that will enable real-time processing and control through dynamic integration of computational components and real-time sensor data. This system will be evaluated using contamination scenarios based on field-scale data from a large metropolitan area.","title":"COLLABORATIVE RESEARCH: DDDAS-TMRP: An Adaptive Cyberinfrastructure for Threat Management in Urban Water Distribution Systems","awardID":"0540076","effectiveDate":"2006-01-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":["455144"],"PO":["411536"]},"110358":{"abstract":"This project will advance capabilities in two complex and previously unaddressed applications: (i) measuring, controlling and preventing the formation of turbulence in fluid flow to achieve drag reduction, and (ii) measuring size and shape distributions of populations of crystalline particles, and model-based feedback control of the manufacture of these particles in real time. Given recent developments in the underlying science and required technology, the project provides for the first time a realistic chance at addressing these two complex applications. In turbulence control, computational power now allows direct simulation of turbulent flows, as well as the promise of model-based control approaches. Second, the advent of MEMS technology makes it possible to envisage sensors and actuators that can work at the scale of turbulence-producing coherent structures, which can be on the order of 100-1000 um. Finally, a better fundamental understanding of these coherent structures has recently been achieved. In measuring and controlling particle populations, the project will integrate computational and measurement capability to analyze video microscopy images in real time to determine particle size and shape distributions. By manipulating environmental variables such as pH, impurity concentration, and temperature, we can influence the evolving particle shape, which can be used as a marker for crystal structure (enabling polymorph control) in pharmaceutical applications.<br\/><br\/>The applications chosen are ideal for developing DDDAS tools because of the following features: complex models with large numbers of degrees of freedom, high complexity measurements, significant sources of noise and uncertainty, and significant industrial and economic impact. The research conducted under this project will develop and demonstrate the state estimation method known as moving horizon estimation as the algorithm for assimilating in real time the data and dynamic, nonlinear model, and will develop and implement the autocovariance least squares method for identifying the disturbance structures from the measurement data and models. By identifying the disturbance structures from data, the derived models do not have to be perfect in order to represent and predict the data accurately and enable model-based feedback control. The project will develop the new optimization tools that are required to enable state estimation, disturbance identification, and model-based feedback control. Industrial collaborations and participation in industrial consortia provide ample opportunities for technology transfer of the state estimation and model predictive control (ExxonMobil, Eastman Chemical, Shell), video imaging (MettlerToledo), and crystal size and shape distribution control (Mitsubishi and GlaxoSmithKline).","title":"DDDAS-SMRP: Measuring and Controlling Turbulence and Particle Populations","awardID":"0540147","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1403","name":"PROCESS & REACTION ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}}],"PIcoPI":["523876","517079","556394","378536"],"PO":["493916"]},"110414":{"abstract":"The next generation of wireless sensor networks will be dynamic systems with the potential to<br\/>revolutionize understanding of environmental change, provided they can assimilate large amounts of heterogeneous data in real time, rapidly assess (optimize) the relative value and costs of new data collection, and schedule subsequent measurements accordingly. Thus, they are Dynamic Data Driven Application Systems that integrate sensing with modeling in an adaptive framework. Keen interest in broad application of wireless sensing of the environment, as in NEON and CLEANER, awaits DDDAS technology that can estimate the value of future data in terms of its contribution to understanding against the costs of deployment, acquisition, transmission, and storage. This balance is especially important for environmental data, because networks will typically be deployed in remote locations without access to infrastructure (e.g., power), and sampling intervals will range from meters and seconds to landscapes and years, depending on the process, the current state of the system, the uncertainty about that state, and the perceived potential for rapid change. Network control must be dynamic and driven by models capable of learning about both the environment and the network. The focus of this project is the dynamic sensor network application involving understanding how biodiversity and carbon storage are influenced by global change. Specifically, this project is designed to learn how the growth, survival, and reproduction of forest trees are influenced by changes in climate, CO2 and disturbance, in the context of these and other variables that can fluctuate rapidly. This goal involves models of how tree growth and resource allocation are influenced by variables that can be understood through adaptive sampling across diverse scales in both time and space. The project will enable a general framework for dynamic data-driven wireless network control that combines environmental modeling and sensor network modeling both in and out of the network. Out of the network, environmental modeling entails full assimilation of all information, with exploitation of computing resources available there. Environmental modeling in the network is based on simplified representations that provide real-time, approximate answers. The in-network control model provides rapid scheduling for new measurements, and it communicates network information to the server, for diagnostics, supervisory control, and data assimilation. Periodically, the in-network model is updated based on this most complete understanding of the environmental variables, parameters, and battery life. Specific goals are (i) to construct a wireless sensing and networking infrastructure that supports a new paradigm of joint in-network and supervisory measurement, modeling, and prediction, (ii) to develop the modeling strategy needed to combine system understanding with costs for efficient wireless sensing of the environment, (iii) to make significant progress in understanding the maintenance of biodiversity and in measuring ecosystem properties, and (iv) to improve collaboration between computer sciences, engineering, statisticians and environmental scientists.","title":"Collaborative Research: DDDAS-TMRP: Dynamic Sensor Networks - Enabling the Measurement, Modeling, and Prediction of Biophysical Change in a Landscape","awardID":"0540414","effectiveDate":"2006-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"7350","name":"NAT ECOLOGICAL OBSERVATORY NET"}}],"PIcoPI":["498157"],"PO":["493916"]},"111449":{"abstract":"This project will combine social scientific research on infrastructure development and the diffusion of innovations to generate a predictive spatial model of unlicensed spectrum use based on human factors. Advances in wireless technology and the present market success of \"Wi-Fi\" (IEEE 802.11a\/b\/g) wireless data networking have combined to convince many that unlicensed spectrum - spectrum that does not require permission to transmit - is now a viable way to manage a much larger amount of our wireless communication. By definition, however, use of unlicensed spectrum is unplanned and decentralized. The literature has characterized this as \"chaotic\" and unpredictable, and has warned that a zero price for spectrum will quickly lead to congestion failure. This project hypothesizes that unlicensed spectrum is very predictable and likely viable.<br\/><br\/>Approaches to spectrum planning so far have considered few human factors. For instance, population density is often considered, but only in a simplistic manner. Hypotheses assert that spectrum in cities is more likely to be \"full,\" and that in rural areas it is more likely to be \"empty.\" However, many high-density areas are populated by economically disadvantaged people who may be unlikely to use a technology like Wi-Fi. This research will strive for accurate spatial predictions that include the consideration of a complex of several human factors that are not simply a matter of socioeconomic status.<br\/><br\/>This project will gather and map wireless Internet use in selected census tracts in the Midwestern US and combine these data with demographics from the US Census. While the diffusion of innovations literature is well-developed, spatial analysis of diffusion is rarer and has the potential to transform our thinking about diffusion of new technologies. In addition, the project will develop the methodology of wireless mapping for social science, a promising new approach. Most significantly, the research will reconsider theories of communication infrastructure development in the light of important new technology and institutional arrangements, such as unlicensed spectrum, while building the scientific understanding of wireless data networking specifically.<br\/><br\/>Whether unlicensed is a viable means for managing the spectrum is currently a pressing policy question this research can address. In addition, it should be possible to predict \"holes\" in use that provide the basis for innovative policymaking in the area of universal access. For example, the findings might suggest geographic spectrum easements in economically depressed areas (rather than the current thinking that privileges empty areas). The empirical data would also answer practical questions on such issues as how prevalent low-powered unlicensed transmitters are and how close they are to each other. <br\/><br\/>The integrated teaching component of this project promotes a new kind of student with multidisciplinary expertise across engineering, communication, and policy. A new project-based course will be taught to teach students to collect the wireless data. As a service project successive years of the course will develop a demonstration Internet \"mapserver\" that allows people to visualize, test and refine predictions of spectrum use by entering their addresses, thereby promoting public understanding of science and technology.","title":"CAREER: Predicting the Development of Decentralized Communication Systems","awardID":"0546409","effectiveDate":"2006-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["529185"],"PO":["564456"]},"111648":{"abstract":"The application of telerobotic technology to minimally invasive surgery has seen increased interest over the last decade. Patients benefit from reduced trauma and recovery time, as tools enter the body through 1cm or smaller ports. Surgeons guide the tiny dexterous robotic instruments with natural hand motions, while seated comfortably at a console next to the patient. Despite its significant potential, adoption of this technology continues to be hindered by the surgeon's inability to touch and feel the surgical site. While visual feedback is sufficient to guide precise motions, the sense of touch is necessary for delicate tasks such as palpation and suturing of diseased or weak tissue. The current lack of this haptic feedback can be traced to the master-slave control strategies inherited from traditional robotics. Fortunately, recent ideas focusing on human-centered teleoperative control are showing great promise. In this project the PI will adopt this approach to develop a telerobotic surgery testbed that incorporates novel sensors and control algorithms based on a human-centered paradigm, which enable it to provide high fidelity haptic feedback during the performance of real tasks such as suturing, thereby assuring the surgeon's accurate perception of the surgical site. The two-handed testbed will be built on state-of-the-art hardware pledged by Intuitive Surgical Inc (makers of the da Vinci telerobotic surgery system and leaders in the field), and will use a networked open architecture to facilitate sensorization, algorithm development, and future interoperability. The new control algorithms will refine, extend and integrate into the surgical application several unique concepts that have each shown promise on simple systems: wave variables will overcome the destabilizing effects of communication delays, stably incorporating high frequency force feedback; model-based cancellation of induced motion will allow estimation of the user's intention and achieve smooth, precise slave commands; acceleration matching will shape the feedback to yield one-to-one force feedback at low frequency and one-to-one acceleration feedback at high frequency; and observation of the user state via grip force levels will allow appropriate modulation of the feedback. Coordination with Stanford surgeons will ensure that control algorithms are clinically applicable, well tested, and beneficial to surgery erformance.<br\/><br\/>Broader Impacts: The outcomes of this project will allow surgeons to perform procedures with greater sensitivity and enable new minimally invasive procedures, reducing patient trauma and health care costs. Because the PI will employ standard hardware and surgical tasks, the control improvements should directly influence future designs and quickly lead to clinical testing and adoption by industry. The results will also be shared with the academic research community, including development software and operating system support, in the hopes of creating a standardized testing facility for telerobotic surgery. Integration of the proposed research with teaching activities and undergraduate mentoring will be carried out via a new graduate telerobotics course with multimedia content that brings classroom students into the research environment and allows research students to participate in teaching, and a freshman robotics seminar whose purpose is to expose incoming students to science and engineering, encourage their involvement in research, and provide mentorship especially to women and minorities.","title":"CAREER: High Fidelity Telerobotics in a Surgical System","awardID":"0547672","effectiveDate":"2006-01-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":[295554],"PO":["565227"]},"110418":{"abstract":"Observing systems facilitate scientific studies by instrumenting the real world and collecting corresponding measurements, with the aim of detecting and tracking phenomena of interest. In this proposal, we focus on a class of observing systems which are (1) embedded into the environment, (2) consist of stationary and mobile sensors, and (3) react to collected observations by reconfiguring the system and adapting which observations are collected next, these are referred to as Reactive Observing Systems (ROS). The goal of ROS is to help scientists verify or falsify hypotheses with useful samples taken by the stationary and mobile units, as well as to analyze data autonomously to discover interesting trends or alarming conditions.<br\/>A wide range of critical environmental monitoring objectives in resource management, environmental protection, and public health all require distributed observing systems. This project will explore ROS in the context of a marine biology application, where the system monitors, e.g., water temperature and light as well as concentrations of micro-organisms and algae in a body of water. Using a hybrid network of stationary and mobile sensors, communicating both via wired and wireless links, the system collects fine-grained measurements of interesting information in near real-time. An example of the use of such a system is the rapid identification of micro-organisms to predict the onset of algal blooms. Such blooms can have devastating economic consequences. <br\/><br\/>Current technology precludes sampling all possibly relevant data. Therefore there is need to develop approaches for optimizing and controlling the set of samples to be taken at any given time, taking into consideration the application's objectives and system resource constraints. To support such an optimization and control process, a significant part of the framework must be dedicated to the development of models of data, and their automatic validation or adaptation. As part of the validation and adaptation process, the framework must also include a distributed support mechanism for locating data of interest. The methods to be pursued in the project include a multi-scale modeling framework for ROS, that allows applications to construct inter-related models of varying spatio-temporal scope based on collected data. Guided by the models, the reactive elements of the system predict where interesting data and phenomena are likely to be found. In the process of constructing models, the system actively seeks most useful data to improve both, the models and phenomenon detection and tracking. In a feedback cycle, this data acquisition is guided by previous, perhaps less precise, models. Thus, the system to be developed (AMBROsia) enables optimal collection of measurements in a manner that respects system resource constraints, yet improves the overall fidelity of phenomenon detection and tracking. Such a system will aid scientific research by facilitating the testing of scientific hypothesis. It will provide timely predictions of sampling needs, and tracking information for dynamic phenomena. Overall, AMBROSia will facilitate observation, detection, and tracking of scientific phenomena that were previous only partially (or not at all) observable and\/or understood.","title":"DDDAS-TMRP: A Generic Multi-scale Modeling Framework for Reactive Observing Systems","awardID":"0540420","effectiveDate":"2006-01-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"S115","name":"NOAA"}}],"PIcoPI":["495864","410098","553707","560335","294917"],"PO":["551712"]},"110408":{"abstract":"Focusing on the rich and very urgent scientific problems of ecological and coastal modeling of Lousiana's coastal region, DynaCode will create a powerful, generic, modern cyberinfrastructure for a new generation of complex DDDAS applications that will advance many areas of science and engineering. We will build upon and integrate well developed and widely used computational infrastructures and emerging standards, including Cactus, Triana, and grid services. By using very powerful application development tools that have already demonstrated advanced DDDAS capabilities, we are able to concentrate efforts on developing specific DDDAS algorithms and software modules that will apply not only to ecological and coastal modeling, but many other applications. The project will address scientific problems of particular interest to NOAA, involving scenarios that couple ocean circulation, storm surge, and wave generation models for the Gulf, as well as ecological, hydrodynamic, and sediment transport models of the Mississippi River Delta region of Louisiana, and will develop infrastructure and algorithms that enable these models to be coupled, both to each other and to external inputs from sensors, wind, and other data, and databases to optimize execution of complex workflows on grids, invoking appropriate models, meshes, and algorithms, depending on current conditions. The real time coupling of input data and complex workflows will allow, for example, dynamically invoking more accurate models and algorithms as a hurricane approaches the coast, choosing appropriate computing resources, comparing model results with actual observations, coupling freshwater control diversions with storm surge models to reduce hurricane damage and flooding, or guiding placement of future sensors and dams. In the course of this coastal modeling project, we will develop toolkits to facilitate DDDAS scenarios by enabling functionalities such as wrapping legacy codes, integrating framework support for advanced codes that allow dynamic composition of data as it becomes available, running multi scale simulations, and adapting to current conditions by dynamically recomposing if necessary.","title":"DDDAS-TMRP: DynaCode: A General DDDAS Framework with Coast and Environment Modeling Applications","awardID":"0540374","effectiveDate":"2006-01-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":[292456,"450614","496127","298963","521159"],"PO":["551712"]},"109580":{"abstract":"The FrameNet Project at the International Computer Science Institute<br\/>is building a uniquely detailed lexicon of English, both readable by<br\/>humans and usable by computers for natural language processing<br\/>(NLP). It is based on the theory of Frame Semantics, originated by<br\/>Charles Fillmore, which recognizes that the meanings of many words are<br\/>best understood in relation to semantic frames defining the set<br\/>of participants and props in an event or state. For example, in<br\/>\"Alicia boiled the potatoes for 20 minutes\", the word \"boiled\" evokes a<br\/>frame involving Alicia as the Cook, the potatoes as the Food, and 20<br\/>minutes as the Duration---but also some kind of Container (a pot?) and<br\/>some Heating instrument (a stove?)--these are not mentioned, but are<br\/>essential parts of the frame. Frames range from very simple, like<br\/>Placing, to very complex, like Revenge.<br\/><br\/>Since 1997, the FrameNet project has been describing semantic frames<br\/>(currently > 750, containing roughly 10,000 word senses), and<br\/>annotating sentences which evoke them (> 135,000), showing which words<br\/>play which roles in the frame. Annotated sentences are then<br\/>automatically tabulated to produce a lexical entry exemplifying<br\/>all possible syntactic patterns for each frame-evoking word. This<br\/>lexicon is used in hundreds of NLP research projects around the world;<br\/>and similar projects are underway for other languages.<br\/><br\/>This methodology is, however, very labor-intensive, requiring careful<br\/>examination of sentences in the corpus to guarantee that all semantic<br\/>and syntactic combinations are extracted and annotated. This award is<br\/>for a three-year effort to integrate sophisticated tools for grouping<br\/>corpus examples, (developed by Adam Kilgarriff), into the FrameNet<br\/>extraction and annotation work, enabling staff to find syntactic<br\/>patterns faster and annotate examples semi-automatically, thus rapidly<br\/>increasing the number of words covered and making the FrameNet lexicon<br\/>useful in more practical NLP applications. For further information,<br\/>visit http:\/\/framenet.icsi.berkeley.edu.","title":"IIS: Rapid Development of a Frame Semantic Lexicon","awardID":"0535297","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["353897","561714"],"PO":["565215"]},"109383":{"abstract":"Collaborative Research:<br\/>New Privacy Frameworks for Collaborative Information Sharing<br\/>------------------------------------------------------------<br\/>PI: Vitaly Shmatikov (The University of Texas at Austin)<br\/>Co-PI: Joan Feigenbaum (Yale University)<br\/><br\/>When collaborations involve sharing of sensitive data about individuals and organizations, these data must be protected from unauthorized searches, abuse, and misuse. Conventional interpretations of privacy as confidentiality and\/or inaccessibility of any individual piece of information are inadequate in collaborative environments, where some collaborators may legitimately be allowed to access parts of the joint dataset, and no trust assumptions can be made about their computing platforms.<br\/><br\/>The goal of this project is to develop new concepts and frameworks for privacy in collaborative environments, focusing on global properties of the joint dataset such as security against unreasonable searches and abusive information harvesting. Techniques include provably secure data transformations that assure global and individual privacy properties after information has been released in response to a legitimate request. Another research objective is a theory of privacy that explicitly incorporates economic measures of information value. To enforce global privacy policies, this project will develop new cryptographic techniques for dataset obfuscation and sanitization, ensuring that only policy-compliant queries can be computed on the dataset after it has been transferred to the collaborators.<br\/><br\/>The main objective is to design privacy-preserving data transformations that are provably secure without unrealistic assumptions about \"tamper-proof\" software or hardware. Privacy technologies developed in the course of the project will enable important collaborative applications, ranging from joint analysis of patient data in multi-institution clinical trials to transaction monitoring by law enforcement agencies that complies with the citizens' Fourth Amendment right to be secure against unreasonable searches. <br\/><br\/>Project URL: http:\/\/www.cs.utexas.edu\/~shmat\/privacyframeworks\/","title":"Collaborative Research: New Privacy Frameworks for Collaborative Information Sharing","awardID":"0534052","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}}],"PIcoPI":["450982"],"PO":["565136"]},"109550":{"abstract":"This project will develop and validate a novel cooperative, co-evolutionary algorithm design for multi-agent systems: Orthogonal Evolution of Teams (OET). Many real-world problems are too large and too complex to expect a single, monolithic intelligent agent to solve them successfully. Monolithic agents tend to overlook specialized sub-domains within a larger problem space and thus to make errors on those sub-domains. As problems grow progressively larger and more complex, this weakness will become increasingly critical. Thus, considerable research has focused on team or ensemble approaches, generating agents that consist of integrated subsystems each of which is specialized to find solutions within a sub-domain of the total problem space. For a team approach to succeed it must meet two criteria: The team members must be relatively successful and the team members must collaborate in a way that improves the performance of the team as a whole. <br\/><br\/>Research has shown that evolutionary techniques are effective and broadly applicable to the evolution of teams. However, existing evolutionary approaches have significant weaknesses. They either produce relatively poor team members, or they do not sufficiently encourage specialization between the team members. The specific aim of this research is to investigate OET's ability to meet the two criteria and to validate its performance as compared to other team approaches on a number of problems, including artificial problems specifically designed to test features of its performance, typical test problems from the evolutionary computation and classification fields, and the real-world problem of identifying disordered regions in proteins. Validation will include using the predicted fault (or error) rate model to measure the specialization of the team members with OET and with other team based learning algorithms, comparison of results with OET to benchmark algorithms and published results, and entering an OET based algorithm in the biannual Critical Assessment of Techniques for Protein Structure Prediction (CASP) experiment. <br\/><br\/>The results will lead to significantly improved algorithms for generating teams of classifiers, predictors, and similar learning agents with wide applications in a number of fields. More directly, the work will create better identifiers of disordered proteins, a significant problem in its own right. The work will support, directly and indirectly, a number of graduate student research programs, and it will be incorporated into existing undergraduate programs.","title":"Orthogonal Evolution of Teams: Evolving Teams of Specialized Members for Robust Intelligence","awardID":"0535130","effectiveDate":"2006-01-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[290026],"PO":["564456"]},"109451":{"abstract":"NSF Curriculum Development Proposal IIS-0534567<br\/><br\/>A Graduate Program for Scientific Communication Specialists: <br\/>Getting Past the Prototype in Biological Informatics<br\/><br\/>Carole L. Palmer, PI<br\/>P. Bryan Heidorn, Co-PI<br\/><br\/><br\/><br\/>This award supports the development of a biological informatics masters degree program for Scientific Communication Specialists (SCS). Unlike most existing educational programs in bioinformatics, the SCS program takes a broad view of biology and informatics to train professionals to bridge arenas of information technology development in the biological sciences. Based at the Graduate School of Library and Information Science at the University of Illinois at Urbana-Champaign, the program is building on a long-standing, top-rated masters of science in library and information science and a digital library certificate of advanced study program, and ongoing information technology research initiatives in biodiversity, neuroscience, and genomics. The objectives of the project are to develop curriculum, establish internships, integrate course work with informatics research, share the educational approach, and expand understanding of the role of informatics in scientific progress.<br\/><br\/>The SCS program is aimed at making progress toward the problem of \"getting past the prototype\" by educating information professionals responsible for the implementation, evaluation, continual improvement, sustainability, and integration of information and data systems about biology. SCS professionals are trained to exploit existing data standards and work toward \"long-lived data\" and interoperability, and to build and integrate the increasing number of digital libraries, repositories, indexing systems, ontologies, taxonomies, vocabularies, and tools associated with digital data and products. The impacts of SCS education include functional applications that are integrated with current scientific practice and greater attention to standards development, data curation, data and literature federation, and equitable dissemination of research results.","title":"A Graduate Program for Scientific Communication Specialists: Getting Past the Prototype in Biological Informatics","awardID":"0534567","effectiveDate":"2006-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}}],"PIcoPI":["289308","381713",289764],"PO":["565227"]},"106031":{"abstract":"A novel theoretical\/computational approach, termed the Generalized Multitime Partial Differential Equation (GeMPDE), is being investigated. The chief advantage of the GeMPDE formulation is that it fundamentally enables, speeds up or greatly simplifies theoretical and computational analysis of physical and engineering systems, which feature slow\/fast rates of dynamical change separated by many orders of magnitude.<br\/><br\/>Differentiating features and intellectual merits that make the GeMPDE considerably more attractive than existing approaches include: its ability (demonstrated in preliminary results) to perform linearized .AC analysis of oscillatory systems with full generality and rigor (not possible previously); its use of multivariate phase and local frequency variables to yield theoretically and computationally robust system formulations; and its clean separation of disparate rates of variation using separated artificial time variables.<br\/><br\/>Core theoretical and computational tasks being explored include: stochastic GeMPDE analysis, investigation of specialized GeMPDE forms targeting specific application domains, the development of robust GeMPDE-based solvers that adapt automatically to nonlinear systems containing both oscillatory and non-oscillatory components, large signal GeMPDE-based envelope analysis, and applications to periodically forced systems, systems of coupled oscillators and non-periodic autonomous systems.<br\/><br\/>Broader impacts include a strongly linking educational and research components; direct application\/validation on electronic circuits (PLLs, SD modulators), nano technological devices (arrays of Josephson junctions and single-electron tunneling devices), and biological systems (networks of firing neurons); and the use of open source methodologies for developing and disseminating prototype code resulting from this research.","title":"Generalized artificial-time PDE formulations and computational techniques for multi-rate systems","awardID":"0515227","effectiveDate":"2006-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["520671"],"PO":["562984"]},"109386":{"abstract":"Patterns of land use and available transportation systems play a critical role in determining the economic vitality, livability, and sustainability of urban areas. Transportation interacts strongly with land use, and both land use and transportation has substantial environmental effects, in particular on emissions, resource consumption, and open space. Government policies and investments affect patterns of land use and transportation in many, complex, and sometimes unintended ways. With prior supportthe research team has developed UrbanSim, a sophisticated simulation system to model urban development. The goal is to provide strong technical support to help government agencies and citizens make more informed decisions and to allow stakeholders to be able to consider different scenarios, packages of possible policies and investments, and then, based on these alternatives, model the effects of these scenarios over periods of twenty or more years. However, major challenges remain. Two significant ones are addressed in an integrated fashion in the research proposed : first, assessing and representing uncertainty; and second, supporting presentation of results and interaction with the simulation in an appropriate way for a wide range of stakeholders. Predicting the future is a risky business. There are numerous, complex, and interacting sources of uncertainty in urban simulations of the sort we are developing. These include measurement errors (such as missing or incorrect information in the input data), uncertainty regarding exogenous data and other input parameters (for example, regarding a macroeconomic forecast), systematic errors (for example, due to problems with sampling), and uncertainty arising from the model structure and from the stochastic nature of the simulation. Nevertheless, citizens and governments do have to make decisions, using the best available information. At the same time, it is necessary to represent the uncertainty in conclusions as well as possible, both for truthfulness and as important data to assist in selecting among alternatives. For example, iti may be desirable to select an apparently slightly less desirable alternative, if it substantially reduced uncertainty, or provided more flexibility to address situations with particularly high uncertainty. To play a useful and legitimate role in the political process, the results from modeling alternate scenarios must be presented in useful ways to elected officials and citizens in the region, in ways that let them understand the alternatives in light of what is important to them. Our primary tool for presenting these results are indicator; numeric quantities<br\/>that distill attributes of interest from the voluminous output of the simulation. These presentations should include clear and useful representations of uncertainty, as it propagates through the model and to the indicator values. In addition, the research may go beyond simply presenting the results to support stakeholders in being able to explore and test alternate scenarios (and the uncertainties around them), via a web interface.<br\/><br\/>Intellectual Merit<br\/>This proposal is grounded in the research challenges in the two principal areas of research. 1) In computational statistics these are developing, analyzing, and validating techniques for representing and propagating uncertainty through a sophisticated modeling system. The research approach uses promising but preliminary results in Bayesian melding. New statistical methods may be needed which are adapted to the challenges posed by UrbanSim, including model stochasticity, large effects of measurement and systematic errors, high dimension of model inputs and outputs, and significant running time for the underlying model. 2) In addition to the statistical challenges, however, undertaking this approach makes extreme computational demands; and achieving acceptable performance will require algorithmic advances, as well as sound software engineering. In human computer interaction, among the research challenges are supporting meaningful stakeholder access to and interaction with complex simulations, including representations of uncertainty. Finally, in the emerging area of science of design, an important question is how to design and evaluate the system overall, in a principled way, to support such basic values as accurate presentation of results (including limitations and uncertainties) and transparency.<br\/><br\/>Broader Impacts<br\/>If this work succeeds, UrbanSim has the potential to significantly aid in public deliberation over major decisions regarding urban sprawl, economic health, sustainability, and other issues. Urban Sim is Open Source and freely available, and has attracted considerable interest and use. Further, the results in computational statistics should be applicable to a broad range of simulations of economic or environmental processes to inform public policy development and deliberation. Finally, the interaction t","title":"Modeling Uncertainty in Land Use and Transportation Policy Impacts: Statistical Methods, Computational Algorithms, and Stakeholder Interaction","awardID":"0534094","effectiveDate":"2006-01-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["438603","345374","440155"],"PO":["560586"]},"109432":{"abstract":"IIS-0534389<br\/>Kenneth A. Ross <kar@cs.columbia.edu><br\/>Columbia University<br\/><br\/>Cache-Aware Database Systems on Modern Multithreading Processors<br\/><br\/>This project studies how to best utilize the resources available in<br\/>modern processors in the development of database system software. A<br\/>primary objective is avoiding cache interference between threads in<br\/>multithreaded and multi-core processors, so that performance scales<br\/>well as the number of cores\/threads increases. A variety of<br\/>techniques are considered, including multi-threaded algorithm design,<br\/>threads explicitly devoted to resource management, and scheduling<br\/>algorithms that are aware of thread interference patterns.<br\/>Simulations and implementations on real hardware are used to measure<br\/>the effectiveness of each approach.<br\/><br\/>The project will result in the development of algorithms designed for<br\/>the global management (and minimization) of processor- and<br\/>memory-related delays in database systems. Based on preliminary<br\/>experiments, overall improvements in throughput of thirty to fifty<br\/>percent are expected. A database prototype will be developed, and<br\/>made available for download over the web.<br\/><br\/>This project has relevance to commercial and public-domain database<br\/>systems. Performance improvements would enhance the experience of<br\/>database system users, and reduce hardware requirements for a given<br\/>level of performance. This project makes significant contributions to<br\/>education through reseach projects, a new advanced course, and by<br\/>providing a prototype system for use by others.<br\/><br\/>Project-related information can be found at<br\/>http:\/\/www.cs.columbia.edu\/~kar\/fastqueryproj.html","title":"Cache-Aware Database Systems on Modern Multithreading Processors","awardID":"0534389","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["531167"],"PO":["469867"]},"109553":{"abstract":"This project extends the depth of analysis of natural language<br\/> understanding systems for open-domain newspaper texts by capturing<br\/> important dependencies between clauses. Two co-dependent tasks are the<br\/> focus of the study: (1) the determination of discourse structure and<br\/> (2) the identification of referential links between anaphoric<br\/> expressions and their antecedents.<br\/><br\/> This project utilizes the formal theory of discourse structure known<br\/> as Segmented Discourse Representation Theory (SDRT). SDRT claims<br\/> that tasks (1) and (2) strongly interact: discourse structure can rule<br\/> out many possible anaphoric dependencies, while resolved anaphoric<br\/> links can inform the determination of discourse relations and<br\/> segments. This project tests this hypothesis in a limited setting for<br\/> a restricted set of discourse relations.<br\/><br\/> Baldridge's Probabilistic Discourse Structure Parser (PDiSP) is the<br\/> principal tool for addressing task (1), while a Maximum Entropy based<br\/> Anaphor Resolver (AR) handles task (2). The project involves<br\/> annotation for discourse structure and anaphoric dependencies to help<br\/> guide and train the tools. Features relevant to both tools, like<br\/> predicate argument structure, tense and aspect, are drawn from<br\/> wide-coverage sentential parsers. Lexical information are drawn from<br\/> Wordnet ''sanitized'' by OntoClean. The first phase of the project<br\/> investigates the interdependency of tasks (1) and (2) by using<br\/> anaphora-based features in the PDiSP and then features based on<br\/> discourse structure accessibility in the AR. The results are then<br\/> compared to base line models and to running AR and PDiSP without those<br\/> features. Both software and annotated materials developed in the<br\/> project will be made available to the community.","title":"Extracting and Using Discourse Structure to Resolve Anaphoric Dependencies: Combining Logico-Semantics and Statistical Approaches","awardID":"0535154","effectiveDate":"2006-01-15","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[290033,290034,"347769"],"PO":["565215"]},"109443":{"abstract":"Our emotions and moods play a central role in our everyday experiences. To design interfaces that more adequately engage this full range of human experience, some researchers now advocate affective computing, in which computers automatically sense, process, and respond to human emotions, but having computers measure and report on intimate data without users' explicit awareness and consent raises substantial concerns around who is in control. Furthermore, it is challenging to accurately sense complex and elusive emotions influenced by many physiological, individual, and cultural factors that are unavailable to computational sensors, and the need to simplify emotions in order to computationally model them may lead to interfaces that flatten our emotional experiences rather than engaging our emotions in their full everyday richness. Such problems are based on a fundamental affective gap, a disjunction between the subjective, situated, cultural, and social ways in which people think about and experience emotions and the objective, formalized ways in which computers model them. In this project the PIs will attempt to close the affective gap by sharing the burden of affective interpretation between people and machines. In this model, people and machines collaborate to construct affective experiences; machines track user behavior and supply feedback, which users interpret to develop affective awareness. Shifting the center of interpretation and reflection from the system towards the user keeps users in charge of emotional meaning-making, addresses emotions that computational systems alone cannot truly understand, and focuses our design efforts not on formalizations of affect but on rich, complex, idiosyncratic, and potentially enigmatic emotional experiences. Systems requiring active user interpretation pose serious challenges for design and evaluation in HCI, since we no longer have direct control of system meaning but instead design and evaluate for unexpected appropriation. Drawing from the arts, humanities, and critical design, the PIs' systems will encourage interpretation by reflecting the complex, ambiguous nature of affect, allowing people to actively make sense of the system's output in the context of their everyday lives and relationships.<br\/><br\/>Broader Impacts: The PIs will develop systematic design and evaluation strategies, a theoretical foundation, and detailed case studies that make affective presence a sustainable, reproducible contribution to HCI. The work will lead to new technology that leaves users in charge of the interpretation of their emotions yet allows construction of systems that touch on intimate issues without being intrusive, supports user reflection on the role of affect in technology, and enables designers to create a new, wide range of emotional experiences even though computers have difficulty modeling those experiences.","title":"Collaborative Research: Closing the Affective Gap","awardID":"0534445","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["517929"],"PO":["565227"]},"109575":{"abstract":"The goal of \"Skill Acquisition Through Interactive Avatars\" is to create a computer-based humanoid simulation that can teach humans how to move. The hardware requirements for such as system in its final stage would be an inexpensive state-of-the-art personal computer equipped with a camera system. The avatar will be able to demonstrate movements to its user, monitor the execution of these movements by the user, and suggest corrections in case of inadequate performance. In order to be effective, the avatar will take into account neuroscientific knowledge about the organization of human motor control and human motivation during learning. This research will be useful in a large number of applications, including rehabilitation of movement-impaired patients (e.g., stroke-patients), sport and exercise education, dance instruction, childcare and special needs education, and interactive entertainment industry. Additionally, the technology developed for this project has the potential to pioneer new algorithms for autonomous robot control using \"teaching from demonstration\", to contribute to the development of automated surveillance systems for human environments, to the generation of humanoid computer simulations, and also to gaining new insights into biological motor control and the functioning of the nervous system. <br\/>As intellectual merits, it will be necessary to gain new understanding of how to recognize and classify human movement from real-time motion capture, how to create skilled movement, and how to teach humans effectively. The basic research problems of understanding human movement, both in terms of movement perception as well as movement generation, are central to advancing information technology in human-computer as well as human-robot interaction, i.e., the creation of autonomous artificial perception and movement systems. Research on intrinsic motivation in motor learning will advance important insights into how to help humans with learning disabilities, but also how to create machines that are motivating to interact with.<br\/>As broader impact, the research of this project will make important steps towards creating interactive environments that can assist people in their professional and private lives. Such technology will soon become a major component of our world, starting with clinical, entertainment, and business scenarios, and finally finding its way into private households. Understanding how to create and teach skilled movement in a user friendly way will be useful in building autonomous robot systems that can assist humans, entertain humans, replace humans in hazardous environments, rescue humans, or simply become a companion","title":"Skill Acquisition Through Interactive Avatars","awardID":"0535282","effectiveDate":"2006-01-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["492859","458607"],"PO":["491702"]},"133082":{"abstract":"Severe motor disabilities significantly impact the quality of life for millions of people worldwide. The most profound motor disability, so-called locked-in syndrome, describes people who are completely paralyzed and unable to speak - they are intelligent and alert, but unable to communicate even their most basic needs. Several technologies, based on detecting minute electrical changes in brain signals, have been assessed for whether they can provide a channel of communication for people with locked-in syndrome; although the results from these studies are encouraging, the interfaces are slow, highly error prone, and often require weeks or months of training before control is achieved. Functional Near-Infrared (fNIR) imaging is a new and promising brain-imaging technology that measures small changes in blood volume and oxygenation in the brain. The technology has been explored for augmented cognition and for diagnosis, but has not been investigated for its control potential. Initial studies in able-bodied and locked-in subjects suggest that fNIR control is more accurate, easier to activate, and does not require any training. The overall goal of this research is to fully characterize and test fNIR imaging for control application. To this end, the PIs will first conduct a comprehensive study to determine optimal fNIR activation methods (e.g., determination of mental tasks that can be easily performed and that result in detectable brain activations). The product of this study will be a screening protocol that can be used to determine the most controllable brain area and device configuration for an individual user. The PIs will also work to improve fNIR imaging methods, by conducting offline and online studies to determine optimal sensitivity, cortical depth, filters, and signal processing algorithms for fNIR control. The product of this study will be an fNIR imaging device that is as accurate, sensitive, and robust as possible, as well as a set of heuristics for optimally configuring the device for a particular user. Finally, the PIs will demonstrate fNIR control in real-world applications by determining optimal mappings of fNIR signals to traditional assistive technology control interfaces such as scanning or logical interfaces, cursor movement, and direct selection. The results from all of these studies will be validated by combining and incorporating the findings into a comprehensive test of the fNIR system, by implementing a system for in-home use to control devices such as light switches, a television, and an MP3 player, which will be tested with five locked-in subjects.<br\/><br\/>Broader Impacts: For people with severe motor disabilities, the implications of researching and improving access to assistive technologies are profound. This research will make a significant contribution to the area of brain-computer interfaces by introducing a new, unexplored brain imaging method for control. It will also add to the body of knowledge for assistive technology and human-computer interfaces, by establishing protocols and mappings between an fNIR device and control interfaces. There are many people with less profound motor impairments (e.g., palsy), who might also be helped by an fNIR input device. Further research in fNIR control could lead to control of prosthetics that could restore movement in paralyzed limbs. Additionally, interface strategies for low-bandwidth, high error rate contexts may have significant application in other domains such as mobile and wearable computing systems and hands-free device operation.","title":"Collaborative Proposal: Functional Near Infrared Imaging for Communication and Control","awardID":"0739526","effectiveDate":"2006-01-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":[353970],"PO":["565227"]},"109433":{"abstract":"This project addresses tool use by intelligent agents--so-called cognitive \"habile\" agents--in their environment. The research is inspired by examples of tool use among animals, ranging from chimpanzees that fish for insects with sticks to crows that bend wire into hooks. Tool use is viewed as a basis for intelligent behavior. The project focuses on three issues: (1) establishing general characteristics of cognitive habile agents, including development of a taxonomy of tools and their usages; (2) identifying core capabilities of habile agents, including their ability to enhance their interaction with the environment via tools, to perform detailed internal simulations of hypothetical scenarios for tool use, and to exploit symmetries in between tools and task constraints to identify opportunities for appropriate action; and (3) evaluating different control architectures (e.g., hierarchical, iterative) for such agents. It builds upon the PI's recent NSF-supported work on agents and graphical user interfaces, which involved issues of control and cognitive modeling. The Broader Impact of this work will be realized in two ways related to undergraduate research and graduate education: undergraduate researchers are being involved in the research through the AURICS (Accelerated Undergraduate Research in Computer Science) program at NCSU, and a new graduate course focusing on building AI systems and topics related to this research (e.g., embodied agents, cognitive modeling, control architectures) is being developed.","title":"Toward cognitive habile agents","awardID":"0534398","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[289699],"PO":["387198"]},"110390":{"abstract":"DDDAS-TMRP (COLLABORATIVE RESEARCH): AN ADAPTIVE CYBERINFRASTRUCTURE FOR THREAT MANAGEMENT IN URBAN WATER DISTRIBUTION SYSTEMS<br\/><br\/><br\/>Contamination threat management in drinking water distribution systems involves real-time characterization of the contaminant source and plume, identification of control strategies, and design of incremental data sampling schedules. This requires dynamic integration of time-varying measurements of flow, pressure and contaminant concentration with analytical modules including models to simulate the state of the system, statistical methods for adaptive sampling, and optimization methods to search for efficient control strategies. For realistic distribution systems, the analytical modules are highly compute-intensive, requiring multi-level parallel processing via computer clusters. While data often drive the analytical modules, data needs for improving the accuracy and certainty of the solutions generated by these modules dynamically change when a contamination event unfolds. Since such time-sensitive threat events require real-time responses, the computational needs must also be adaptively matched with available resources. Thus, a software system is needed to facilitate this integration via a high-performance computing architecture (e.g., the TeraGrid) such that the measurement system, the analytical modules and the computing resources can mutually adapt and steer each other. The goal of this multi-disciplinary research is to develop a cyberinfrastructure system that will both adapt to and control changing needs in data, models, computer resources and management choices facilitated by a dynamic workflow design. Using virtual simulation and a field study, this cyberinfrastructure will be tested on illustrative scenarios for adaptive management of contamination events in water distribution systems.<br\/><br\/>Urban water distribution systems are vulnerable to accidental and intentional contamination incidents that could result in adverse human health and safety impacts. The pipe network in a typical municipal distribution system includes redundant flow paths to ensure service when parts of the network are unavailable, and is designed with significant storage to deliver water during daily peak demand periods. Thus, a typical network is highly interconnected and experiences significant and frequent fluctuations in flows and transport paths. These design features unintentionally enable contamination at a single point in the system to spread rapidly via different pathways through the network, unbeknown to consumers and operators. When a contamination event is detected via the first line of defense, e.g., data from a water quality surveillance sensor network and reports from consumers, the municipal authorities are faced with several critical questions as the contamination event unfolds: Where is the source of contamination? When and for how long did this contamination occur? Where additional hydraulic or water quality measurements should be taken to pinpoint the source more accurately? What is the current and near future extent of contamination? What response action, such as shutting down portions of the network, implementing hydraulic control strategies, or introducing decontaminants, should be taken to minimize the impact of the contamination event? What would be the impact on consumers by these actions? Real-time answers to such complex questions will present significant computational challenges. This project will address these challenges by developing an adaptive cyberinfrastucture that will enable real-time processing and control through dynamic integration of computational components and real-time sensor data. This system will be evaluated using contamination scenarios based on field-scale data from a large metropolitan area.","title":"DDDAS-TMRP (Collaborative Research): An Adaptive Cyberinfrastructure for Threat Management in Urban Water Distribution Systems","awardID":"0540289","effectiveDate":"2006-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":["398870"],"PO":["411536"]},"109522":{"abstract":"In an effort to cope with information overload, much effort has been devoted in recent years to summarization, categorization, and retrieval of text documents. Yet relatively little attention has been paid to the graphics that appear in text documents, although they are an important resource and often convey information that is absent from any accompanying text. In this project the PI will develop a methodology for automatically summarizing informational (non-pictorial) graphics, such as bar charts and line graphs, that convey attributes of entities and relationships among the entities. Although some informational graphics are only intended to display data, the majority of them that appear in newspapers, magazines, and formal reports are intended to convey a message. This message captures the graphic's overall content and can serve as a summary of the graphic for storage, indexing, and retrieval. The underlying hypothesis of the project is that information graphics contain communicative signals that can be utilized to identify the message that the graphic conveys. These signals include the relative effort required for different perceptual tasks (since the easiest tasks are the ones a viewer will naturally perform and that will contribute the most to the message conveyed by the graphic), design choices such as graphic type, coloring, annotations, an exploded wedge in a pie chart, etc. (all of which may be used to draw attention to certain entities and relations in the graphic), and elements of the graphic's caption (although captions are of limited utility due to their generally ill-formed nature). The evidence about the graphic's message provided by the communicative signals will be entered into a Bayesian network that will attempt to deduce the graphic's message. As part of the research, a large corpus of information graphics will be collected and annotated with their identified messages, in order to compute the probability tables required by the Bayesian network. Evaluation experiments will be conducted to assess the system's ability to identify the message of an information graphic and the effectiveness of the message as a summary of the graphic. In addition to simple bar charts and line graphs, the project will investigate the summarization of complex graphics such as grouped charts and composite graphs consisting of several interrelated graphics. Although the project is only investigating the summarization of informational graphics, the PI expects the general approach and methodology developed here will provide insights into summarization methods for other kinds of graphics as well.<br\/><br\/>Broader Impacts: The project will create technology that enables access to informational graphics in a digital library and thereby empowers individuals to better utilize the wealth of information available in graphical form. In addition, the outcomes of this research will include resources for use by others in the HCI community (e.g., the corpus of collected and annotated informational graphics will be made available to the research community). The research will also contribute to the training of future scientists, by providing interdisciplinary thesis topics that overlap computer science and cognitive science.","title":"Exploiting Communicative Signals to Summarize Information Graphics","awardID":"0534948","effectiveDate":"2006-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["451009"],"PO":["565227"]},"109423":{"abstract":"IIS-0534343<br\/>Wang-Chien Lee <wlee@cse.psu.edu><br\/>Pennsylvania State University, University Park<br\/><br\/>Indexing Multi-Dimensional Data in Peer-to-Peer Systems<br\/><br\/>The goal of this project is to provide support for efficient search of multi-dimensional data in Peer-to-Peer (P2P) systems. The project achieves its goal using the following approaches: (1) Develop a new P2P overlay, called semantic small world (SSW), to serve as a general infrastructure (which includes a network, a distributed index, as well as a logical file structure) for supporting a variety of queries at the same time; (2) Develop an innovative dimensionality reduction method that maps data clustered in high-dimensional space to a low-dimensional SSW to reduce the high maintenance overhead required for storing high-dimensional data in constantly changing P2P environments; (3) Develop search algorithms for point query, range query, K nearest neighbor (KNN) search, Top-K query, similarity search and joins based on SSW; (4) Prototype SSW and the search algorithms on PlanetLab; and (5) Develop simulators and analytical models to evaluate the performance of the developed techniques. The research results will have great impacts on distributed data management in e-commerce, information retrieval, digital government and scientific studies. This project supports Ph.D students to pursue research in the areas of distributed data management and P2P systems. A new graduate-level course covering these areas and integrating the research results from the project will be introduced into the curriculum. Publications, technical reports, software and experimental data from this research will be disseminated via the project web site (http:\/\/www.cse.psu.edu\/pda\/P2P).","title":"Indexing Multi-Dimensional Data in Peer-to-Peer Systems","awardID":"0534343","effectiveDate":"2006-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["316300","542015"],"PO":["469867"]},"109434":{"abstract":"In the Information Age, career and life-long learning are increasingly dependent on information-retrieval (IR) skills in order to utilize digital and on-line information effectively. However, integration of IR into undergraduate curricula has not kept up with this demand. IR deserves more attention as an integral element of many disciplines. To address primary problems in the current college-level IR education and possible causes of the problems, this project is carrying out three kinds of activities: <br\/>(1) Creation of a module-based curricular model, which facilitates the development of an array of IR modules that enable flexible adoption and integration. These modules, including general IR modules mainly designed for IT\/CS programs, and discipline-oriented IR modules based on specific disciplines such as Biology and Psychology, can be adopted based on the specific needs of different universities and programs.<br\/>(2) Creation of a Multi-Disciplinary Information Retrieval Laboratory across departments at Armstrong Atlantic State University, which provides not only a desirable environment for faculty and student training, but also a platform to systematically integrate IR into multidisciplinary curricula. <br\/>(3) Dissemination achievements of the project to facilitate the adoption by other universities of the module-based approach through different channels including conferences, workshops and forums.<br\/>This project provides students and faculty with an appreciation of the connection between theoretical and practical aspects of IR, from different angles of different disciplines. It also emphasizes the ubiquitous nature of IR in multiple disciplines and promotes the status of IR in undergraduate education.","title":"Curriculum Development: Integrating Information Retrieval into Undergraduate Curricula for Small and Medium Sized Universities - A Module-Based Approach","awardID":"0534403","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}}],"PIcoPI":["352587","525890",289703],"PO":["565227"]},"109577":{"abstract":"The primary purpose of the project is to develop methods that dramatically increase the utility and reliability of a robot's sense of touch. The PIs' proposed study of robot haptics (perception and manipulation through active touch interaction) particularly addresses the use of robots in unstructured situations where little may be known about the objects to be manipulated and where visual information alone is not sufficient to guarantee robust task performance.<br\/><br\/>This research will consist of three main components:<br\/>1. Probabilistic sensor processing methods for haptics. The strength of probabilistic techniques is their ability to fuse together many streams of noisy sensor data (such as contact information) based on a given physical model.<br\/>2. New active perceptual methods. As with human senses, active exploration is required to provide sensors with a rich source of information about physical properties of the world.<br\/>3. Autonomous strategy selection. Often it is necessary to switch between manipulation and exploration in order to accomplish a task. A key contribution of this research will be a decision-theoretic probabilistic method for determining when manipulation is likely to succeed and when further haptic exploration is required.<br\/><br\/>In order to support the proposed robot haptics research, the construction of the Probabilistic Manipulation Experiment Table (PMET) is proposed. The PMET will consist of one or two small manipulating arms with instrumented 'fingertip' end effecters that support force sensors, accelerometers, and tactile sensors. An interactive control software package, the Probabilistic Robotics Studio (PRS), will be developed to provide a graphical interface to configure experiments and view probabilistic models in real-time. Initial phases of research will develop probabilistic models and exploration strategies that characterize properties of contact (including contact slip) and non-visual properties of objects (frictional coefficients, center of mass, etc.).<br\/><br\/>Intermediate phases will demonstrate autonomous strategy selection during robust one-finger manipulation of objects in the plane. The final phases will include two-finger exploration, two finger manipulation, and lifting objects.<br\/><br\/>Increased understanding of touch sensory information from this work will give the robot design community better construction techniques for robot hands and their sensor systems. The PMET and PRS will provide an interactive experimental platform that can be used to train robotics students and explore new ideas. The PIs plan summer internships for high school students in the area around Stanford University to allow experimentation with the PRS. In addition, the PIs will aid the interns in development of presentations for K-12 students.","title":"Robot Haptics: Probabilistic Methods for Active Perception","awardID":"0535289","effectiveDate":"2006-01-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["353783","91932"],"PO":["403839"]},"110391":{"abstract":"A rough estimate of the numbers of power transformers and circuit breakers comprising the US transmission system (138-765 kV) are 150,000 and 600,000, respectively; in addition, there are 254,000 miles of high voltage transmission lines. Total replacement value of the lines alone (excluding land) is conservatively estimated at over $100 billion dollars [1] and triples when including transformers and circuit breakers. Investment in new transmission equipment has significantly declined over the past 15 years. Maintaining acceptable electric transmission system reliability and delivering electric energy at low energy prices requires innovations in sensing, diagnostics, communications, data management, processing, algorithms, risk-assessment, decision-making (for operations, maintenance, and planning), and process coordination. Among these asset management problems, the data-driven electric power industry has made strides in sensing and diagnostics. Yet there has been less progress in communications, data management, information processing and associated algorithms, risk assessment methods, and decision-making paradigms, and progress has been almost nonexistent in process coordination; it is precisely in these areas that we propose our work. The objective of this project is to develop a hardware-software prototype capable of auto-steering the information-decision cycles inherent to managing operations, maintenance, and planning of the high-voltage electric power transmission systems. In pursuing this objective, we will implement and advance creative approaches to 5 main problems inherent to management of capital-intensive, geographically distributed physical assets: (a) Sensing and communications; (b) Integrating data;<br\/>(c) Transforming condition measurements to reliability metrics; (d) Developing and linking multi-time scale stochastic decision algorithms; (e) Valuation of information and subsequent sensor deployment. The project will also build a prototype auto-steered information-decision process on top of a novel simulation environment representing the Iowa power system that is driven by, and drives, field installations. The immediate impact will be an increased ability and confidence therein to handle and use the massive data streams associated with owning and operating transmission equipment, resulting in better investment, maintenance, and operating decisions, and ultimately, more economic and more reliable electric delivery of electric power.","title":"DDDAS-TMRP: Auto-Steered Information-Decision Processes for Electric System Asset Management","awardID":"0540293","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["493327","560586",292392,"511484","382141"],"PO":["493916"]},"111370":{"abstract":"Abstract<br\/><br\/>This research encompasses novel attempts in several research topics on flapping flight in insects and birds. The goal of this research is to a) quantitatively study the flight trajectory feasibility and stability observed in insects and birds; b) investigate the underlying principles that cause their flight stability and performance differences in order to develop a methodology and guideline for designing flapping wing micro-aerial vehicles; and c) design and fabricate flapping wing micro-aerial vehicles capable of stable and maneuverable flight with biomimetic sensors. Our previous study on the theory of nonlinear systems including harmonic balance and bifurcation methods will be utilized to conduct theoretical and mathematical modeling of flapping flight. We will verify our analysis using the free-flight measurements on the fruit fly and the experimental data from the current generation of fabricated Micromechanical Flying Insects (MFIs). Based on our analysis, we will develop guidelines to aid the design and fabrication of future MFIs and flapping wing micro-aerial vehicle in general, with the capability to ensure the flight feasibility and stability of the vehicle.<br\/><br\/>The theories developed from this research will provide new understanding of the inherent flight stability and maneuverability present in insects and birds, and hopefully will lead to developing a new theory describing the underlying principles of the different flight phenomena observed in nature.<br\/><br\/>The educational activities include incorporating research materials into graduate and undergraduate curricula, and the developed research and educational activities will be outreached to the K-12 students and teachers as well as underrepresented and women groups in Delaware through the University of Delaware's Design and Discovery summer camp for girls. Another broader impact of this program will be to create an Internet-based flapping flight gait simulator accessible to students and researchers to simulate and visualize realistic flight patterns of different insects and birds, given their morphological data.","title":"CAREER: Theory and Practices of Flapping Flight: From Biological to Robotic Insects","awardID":"0545931","effectiveDate":"2006-01-15","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["538011","524924"],"PO":["429182"]},"109402":{"abstract":"Collaborative Research:<br\/>New Privacy Frameworks for Collaborative Information Sharing<br\/>------------------------------------------------------------<br\/>PI: Vitaly Shmatikov (The University of Texas at Austin)<br\/>Co-PI: Joan Feigenbaum (Yale University)<br\/><br\/>When collaborations involve sharing of sensitive data about individuals and organizations, these data must be protected from unauthorized searches, abuse, and misuse. Conventional interpretations of privacy as confidentiality and\/or inaccessibility of any individual piece of information are inadequate in collaborative environments, where some collaborators may legitimately be allowed to access parts of the joint dataset, and no trust assumptions can be made about their computing platforms.<br\/><br\/>The goal of this project is to develop new concepts and frameworks for privacy in collaborative environments, focusing on global properties of the joint dataset such as security against unreasonable searches and abusive information harvesting. Techniques include provably secure data transformations that assure global and individual privacy properties after information has been released in response to a legitimate request. Another research objective is a theory of privacy that explicitly incorporates economic measures of information value. To enforce global privacy policies, this project will develop new cryptographic techniques for dataset obfuscation and sanitization, ensuring that only policy-compliant queries can be computed on the dataset after it has been transferred to the collaborators.<br\/><br\/>The main objective is to design privacy-preserving data transformations that are provably secure without unrealistic assumptions about \"tamper-proof\" software or hardware. Privacy technologies developed in the course of the project will enable important collaborative applications, ranging from joint analysis of patient data in multi-institution clinical trials to transaction monitoring by law enforcement agencies that complies with the citizens' Fourth Amendment right to be secure against unreasonable searches.<br\/><br\/>Project URL: http:\/\/www.cs.utexas.edu\/~shmat\/privacyframeworks\/","title":"Collaborative Research: New Privacy Frameworks for Collaborative Information Sharing","awardID":"0534198","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}}],"PIcoPI":["519592"],"PO":["565136"]},"110381":{"abstract":"This project will create a \"Numerical Fluid-Laboratory System\" to enable enhancing the understanding of the Earth's weather and climate, which depend critically on accurate forecasting and state-estimation technology. This research effort aims to design and build a laboratory-scale DDDAS, called Planet-in-a-Bottle, as a practical and inexpensive step toward a planet-scale DDDAS. The Planet-in-a-Bottle DDDAS will emulate many of the large-scale challenges of meteorological and oceanographic state-estimation and forecasting but provide a controlled setting to allow systematic engineering strategies to be employed to devise more efficient and accurate techniques. The Planet-in-a-Bottle DDDAS will consist of two interacting parts: a fluid lab experiment and a numerical simulator. The system will employ data assimilation in which actual observations are fed into the simulator to keep the models on track with reality, and will employ sensitivity-driven observations and mesh refinement in which the simulator targets the real-time deployment of sensors to particular geographical regions and times for maximal effect, and refines the mesh to better predict the future course of the fluid experiment. In addition, the feedback loop between targeting of both the observational system and mesh refinement will be mediated, if desired, by human control.<br\/><br\/>The project will investigate adjoint methods to determine how and where to deploy observations, as well as how and where to refine the simulation. The laboratory will provide insights into nonlinear fluid dynamics by visualizing and analyzing the three-dimensional behavior of a natural fluid noninvasively. Fundamental questions regarding the predictability of chaotic systems and the impact of adapting models and observations dynamically on the predictive capabilities will be explored. To design an effective Planet-in-a-Bottle DDDAS requires a substantial investment in advanced computing technology, because a naive simulation on regular meshes take far longer than the real-time evolution of the fluid. To enhance performance, the research project will devise novel algorithms and software that exploit low-cost clusters of commodity processors. Specifically, the researchers will investigate memory layout strategies for irregular meshes based on the theory of decomposition trees, which will lead to algorithms that can effectively exploit both memory hierarchy and parallelism. To investigate how the programming of such complex algorithms can be simplified, they shall investigate and develop a distributed transactional memory library to integrate sharing and synchronization in a cluster programming environment. Developing these computer-science technologies will require substantial technical expertise in the areas of algorithms and computer systems.","title":"DDDAS-TMRP: Planet-in-a-Bottle: A Numerical Fluid-Laboratory System","awardID":"0540248","effectiveDate":"2006-01-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["548187","471720","558026","521815"],"PO":["535244"]},"119897":{"abstract":"The goal of this project is to parse video from a moving platform in real-time to produce retinotopic maps that reveal the spatial layout of the scene as well as any independently moving objects present. The project proposes to duplicate the function of the early visual system in a multichip neuromorphic system with two hundred and thirty thousand silicon neurons (three quarters the number of pixels in a VGA image) and three billion synaptic interactions several orders of magnitude larger than anything built to date. The outcome of this project will be SEER, a subwatt, paperback-size seeing machine.<br\/><br\/>The intellectual merit of the proposed research stems from the tight synergy between the<br\/>computational theory, based on the principle of compositionality ,and the neuromorphic implementation, based on reentrant networks. Compositionality dictates that the various parts of the vision problem should be attacked simultaneously and reentrancy gives us the capability to do exactly that.<br\/><br\/>The broader impact of the proposed effort could be enormous. A multichip neuromorphic system performing multimodal segmentations would reinvigorate robotics and computer vision. By providing the infrastructure for early vision, it will facilitate the study of cognition, which will most likely generate a flood of new theories and experiments, in the Neurosciences and in the sciences of the artificial.","title":"Collaborative Research: Seer: A Gigascale Neuromorphic Visual System","awardID":"0630505","effectiveDate":"2006-01-01","expirationDate":"2009-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":[318078],"PO":["565223"]},"109436":{"abstract":"This project seeks to answer several basic questions about developing next-generation instant messaging in a manner that is robust, privacy-sensitive, and easy for people to appropriate into their lives. Three technological trends are providing a remarkable opportunity for extending and reconceptualizing instant messaging. By combining (1) mobile devices with (2) multimodal communication and (3) location technologies, next-generation instant messaging (NGIM) can provide richer communication and better coordination, for more kinds of people, in a wider range of situations, than is possible today. For example, using NGIM, one person can easily share real-time location information with another, who could then draw on top of a map that shows both their locations as they move, making it easier to micro-coordinate. Thus, one thrust of this research is to design, implement, and evaluate a range of novel interaction techniques for facilitating communication and coordination, as well as developing the technological substrates for supporting these interactions.<br\/><br\/>However, a problem inherent to instant messaging, and especially with location technologies, is the issue of privacy. Privacy is perhaps the greatest barrier to the long-term success of these kinds of ubiquitous computing services. One can imagine numerous scenarios where information about one's location or availability is abused, for example between employers and employees, between overzealous parents and independent-minded teens, and between governments concerned with safety and citizens concerned about civil rights. Thus, another thrust of this research is to design, implement, and evaluate both system architectures and user interfaces that will maximize the real benefit of next-generation instant messaging, while minimizing foreseeable potential risks and tensions. <br\/><br\/>The results from this line of research will influence system architectures and user interfaces for location-enhanced applications (and the devices they are on), helping to make them more useful, usable, and privacy-sensitive. They could also help catalyze and drive adoption of location-enhanced services, a promising area with a great amount of potential. This work also looks at how to help dual-career families where both parents work, facilitate communication and coordination within families about such important issues as child care. The project will also contribute to the mentoring of undergraduate and graduate students.","title":"Next Generation Instant Messaging: Communication, Coordination, and Privacy for Mobile, Multimodal, and Location-Aware Devices","awardID":"0534406","effectiveDate":"2006-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["561943"],"PO":["564456"]},"109557":{"abstract":"Separating signals that have been mixed together is an archetypal engineering probelm. The past decade has seen the emergence of a several approaches applicable to separating sound mixtures -- for example, a restaurant scenario in which a desired target voice must be extracted from the background babble of other patrons. However, the most appropriate goal, and hence the way to measure performance, is not always clear. In this project, the goal is established as improving intelligibility i.e. processing sound mixtures so a human listener can better understand what can be said. This requires a collaboration between computer science\/electrical engineering -- to provide the separation algorithms -- and auditory scientists\/psychologists -- to guide the results towards perceptually-relevant improvements, and to evaluate the results in listener tests.<br\/><br\/>The particular techniques to be developed and combined include blind source separation (such as independent component analysis), computational auditory scene analysis (simulations of what is understood about human perceptual processing), and model-driven approaches derived from the machine-learning techniques of speech recognition. One specific area of interest is the synthesis of `minimally-informative noise', acoustic tokens that effectively communicate both what can be inferred and what remains unknown about the target signal, and which can leverage the powerful perceptual inference of human listeners.<br\/><br\/>This project will lead to implementations of acoustic signal separation that deliver the greatest benefit to human listeners, potentially including both normal-hearing and hearing-impaired individuals. This <br\/>has a broad range of applications from processing archival recordings through to improved real-time communications technologies, as well as the potential to help automatic speech recognition systems.","title":"Collaborative Research: Separating Speech from Speech Noise to Improve Intelligibility","awardID":"0535168","effectiveDate":"2006-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[290043,"554697","554699","385941"],"PO":["565215"]},"109337":{"abstract":"IIS-0533625<br\/>Betty Salzberg <salzberg@ccs.neu.edu><br\/>Northeastern University<br\/><br\/>Recovery for Service-Oriented Applications<br\/><br\/>The goal of this research project is to provide application recovery<br\/>in a realistic setting. The server software, called an SOA, or<br\/>Service-Oriented Application, is realized as a process and provides<br\/>its service through an interface consisting of application methods. A<br\/>client, either an end client application or another SOA, uses the SOA<br\/>service via remote procedure call to application methods. Many<br\/>mission-critical electronic business application servers fit this<br\/>model.<br\/><br\/>The recovery model is tiered. The innermost tier consists of shared<br\/>memory (application variables shared by the different threads of the<br\/>server process). The middle tier, called a service domain, consists of<br\/>tightly-coupled SOAS. Optimistic logging is used within the service<br\/>domain. Optimistic logging does not write log records to disk before<br\/>sending messages and is thus low-overhead. Communication outside the<br\/>service domain uses pessimistic logging, where log records are written<br\/>to disk before messages are sent. Special result logging is used to<br\/>communicate with transactional systems such as DBMSs.<br\/><br\/>The results of this research will help provide availability for<br\/>applications which use web services. Since many mission-critical<br\/>electronic business application servers fit this model, the greatest<br\/>impact of this research will be in increasing availability for those<br\/>servers and hence for the applications which depend on them. In<br\/>addition, the project will be used in training of Computer Science<br\/>Ph.D. students, currently a national priority. The code and<br\/>manuscripts for this project will be disseminated via the project web<br\/>site http:\/\/www.ccs.neu.edu\/home\/salzberg\/soa\/","title":"Recovery for Service-Oriented Applications","awardID":"0533625","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":[289452,"535376"],"PO":["469867"]},"110371":{"abstract":"The research project is aimed to create a Dynamic Data Driven Application aimed at improving the understanding of a complex biophysical system - the flight of bats. The system is comprised of a multi-level hierarchical simulation of bat flight based on parameterized features of bat morphology and behavior. The simulation operates at multiple levels of physical approximation and computational speed, and is capable of very rapid solutions but requires input from measurements to ensure fidelity and optimality. This input will be provided in an integrated fashion, drawing from a parallel series of experiments in which several discrete data streams will be generated, including kinematic wing data, wake velocity data over a series of two dimensional cutting planes, as well as other data such as bone deformation,experimentally-determined material properties, etc. This data will direct the simulation ensuring accurate solutions, but still with high responsiveness. The data streams will be monitored, synthesized, combined and processed using an advanced immersive visualization environment which will be used to guide the interactions between the measurement and simulation and to organize the disparate streams of data. The simulation environment to be developed is the first such system capable of generating timely solutions of complex flows over highly unsteady and deformable structures. This has multiple scientific and engineering benefits ranging from the ability to address fundamental questions in evolutionary biology to the design of bio-mimetic structures that draw from the abilities of bats on the wing. The direction provided by the experiment will guide scientists to the key sensitivities of these complex flying systems and provide insight to the complexities of animal flight mechanics. Lastly, the visualization systems will provide a unique tool for the synthesis and management of dynamic data drawn from a wide and disparate variety of data sources each having different qualities.","title":"DDDAS-TMRP: Interactive Data-driven Flow-Simulation Parameter Refinement for Understanding the Evolution of Bat Flight","awardID":"0540203","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":[292330,292331,292332],"PO":["551712"]},"115399":{"abstract":"This is funding to support a doctoral consortium for 10-14 promising graduate students from the United States, along with distinguished research faculty, and up to 5 non-U.S. students (who will be invited to participate without financial support), which will take place in conjunction with the 2006 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC'06), to be held September 4-8 in Brighton, UK, and sponsored by the IEEE Computer Society. Our society has evolved into two distinct classes: the information haves and have-nots. Research in human-computer interaction and related disciplines has demonstrated the usefulness of multiple modes of access in augmenting human-to-computer and human-to-human interaction and their applicability to a diversified range of communities. But the rapid development of mobile computing and hand-held device technologies raises a number of challenging issues in effective and efficient access methods and techniques across a variety of devices, people, and capabilities, which continue to outpace efforts to find solutions. Thus, the focus of this year's VL\/HCC doctoral consortium, the fourth to be funded by NSF in this series, is once again on how designers of digital devices and environments can better address universal access issues through multiple modes of interaction. Participants will explore multimodal and multimedia interaction between human and computer, between human and human with the help and mediation of the computer, and between people and the Web. The goal is to stimulate thinking on issues such as: how the modality\/media of a tool or device may affect users' willingness and ability to access, manipulate, and program; what are the special needs of disadvantaged populations; and how devices\/environments might be designed to better meet these needs. The workshop will bring together and build community among young researchers working on different aspects of these problems from the perspectives of diverse fields including computer science, the social sciences, and education. It will guide the work of these new researchers by providing an opportunity for experts in the research field (as well as their peers) to give them advice, in that student participants will make formal presentations of their work during the workshop and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Extended abstracts of the students' work will be published in the conference proceedings, which has wide print and electronic distribution. The conference steering committee will evaluate the workshop outcome, and the results will be made available to the organizers of possible similar future events.<br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other.","title":"WORKSHOP: Visual Languages and Human-Centric Computing (VL\/HCC'06) Doctoral Consortium; September 4-8, 2006; Brighton, United Kingdom","awardID":"0608618","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["548134"],"PO":["565227"]},"109503":{"abstract":"Separating signals that have been mixed together is an archetypal engineering probelm. The past decade has seen the emergence of a several approaches applicable to separating sound mixtures -- for example, a restaurant scenario in which a desired target voice must be extracted from the background babble of other patrons. However, the most appropriate goal, and hence the way to measure performance, is not always clear. In this project, the goal is established as improving intelligibility i.e. processing sound mixtures so a human listener can better understand what can be said. This requires a collaboration between computer science\/electrical engineering -- to provide the separation algorithms -- and auditory scientists\/psychologists -- to guide the results towards perceptually-relevant improvements, and to evaluate the results in listener tests.<br\/><br\/>The particular techniques to be developed and combined include blind source separation (such as independent component analysis), computational auditory scene analysis (simulations of what is understood about human perceptual processing), and model-driven approaches derived from the machine-learning techniques of speech recognition. One specific area of interest is the synthesis of `minimally-informative noise', acoustic tokens that effectively communicate both what can be inferred and what remains unknown about the target signal, and which can leverage the powerful perceptual inference of human listeners.<br\/><br\/>This project will lead to implementations of acoustic signal separation that deliver the greatest benefit to human listeners, potentially including both normal-hearing and hearing-impaired individuals. This <br\/>has a broad range of applications from processing archival recordings through to improved real-time communications technologies, as well as the potential to help automatic speech recognition systems.","title":"Collaborative Research: Separating Speech from Speech Noise to Improve Intelligibility","awardID":"0534841","effectiveDate":"2006-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["385941"],"PO":["565215"]},"109536":{"abstract":"NSF Proposals IIS-0535057 and IIS-0535060<br\/>Collaborative Research: Curriculum Development: Digital Libraries<br\/><br\/>Abstract<br\/><br\/><br\/>Virginia Tech (VT) and the University of North Carolina at Chapel Hill (UNC-CH) are addressing the important problem of preparing students of computer science (CS) and library and information science (LIS), for study and workforce opportunities in the Digital Libraries (DLs) area. We are continuing development of the 5S (Streams, Structures, Spaces, Scenarios, and Societies) approach as both a formal foundation and a practical base for pedagogy and DL implementation. With the assistance of our Advisory Board and students in doctoral consortia, we are planning and developing approximately 12 lesson\/modules, to be evaluated by DL experts.<br\/><br\/>These and other educational materials will be made available through the National Science Digital Library (NSDL), after refinement and field testing at VT and UNC-CH as well as diverse cooperating universities, and cataloging with metadata. Programs in CS, as well as LIS, at any institution with any degree of interest in DLs, may draw upon project deliverables, to enhance existing courses, add DL (related) courses, or even deploy a DL curriculum. Students will learn about the 5S framework, and may learn to use 5S as a base for modeling, designing, implementing, and improving DLs.<br\/><br\/>Presentations at key DL, CS, and LIS conferences will expand awareness of the work. Future CS and LIS graduates focusing on DLs will have a sound basis to continue in the field, as practitioners, educators, researchers, and developers. DL users will benefit from the improved understanding of those who build the next generation of DL systems.","title":"Collaborative Research: Curriculum Development: Digital Libraries","awardID":"0535057","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["550462"],"PO":["427499"]},"109569":{"abstract":"Computer algorithms that analyze auditory scenes and extract individual sound sources would have a strong impact in several domains. For example, to facilitate natural interaction with computing devices by voice, an automatic speech recognition system must be able to focus on the voice of the person speaking to it and ignore sounds from all other sources. A hearing device must perform a similar task to allow a hearing impaired person conduct a conversation in a noisy, multiple source environment. Building on recent advances in the fields of machine learning and signal processing, we are developing sophisticated adaptive algorithms for analyzing auditory scenes with multiple sound sources. Our algorithms are based on probabilistic modeling of different sound sources and of the manner in which they overlap each other and distorted by reverberation and background noise. We use advanced recent techniques for inferring our models from sound data captured by a microphone array, separating those data into individual sources, and automatically determining the type of each source present and its location. Moreover, by reconstructing the clean signal of individual sound sources, we dramatically enhance the accuracy of automatic speech recognition for human speakers in multiple source environments. To facilitate the development and evaluation of our algorithms, and also to encourage competition between other research groups ultimately resulting in improved techniques, we collect a large dataset of multiple source auditory scenes, and make it publicly available on a dedicated website.","title":"Machine learning algorithms for analyzing auditory scenes with multiple sound sources","awardID":"0535251","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["560905",290073],"PO":["565215"]},"107028":{"abstract":"0520349<br\/>0520318<br\/><br\/>Inter-domain routing can be viewed as a means to implement economic relationships among competing ISPs. Examination of technical details of the BGP routing protocol alone is insufficient to understand the current behavior, or predict future requirements, of global connectivity without taking into account the dynamics of the economic relationships they implement.<br\/><br\/>A full account of the shortcomings of BGP, and proposals to modify it, must be developed rigorously with a clear understanding of the kinds of economic relationships and service models that it can and cannot implement well. The goal of this project is to develop a theoretical framework together with experimental capability to understand, predict, and design the interplay between economics and technologies that implement Internet connectivity. The principal investigators' (PIs) unique angle is an optimization perspective to inter-domain routing where profit maximization, physical connectivity, and AS pricing interact with routing decisions, peering structure, resource constraints, and traffic matrix. The PIs will develop mathematical models that capture the interactions between routing and economics, characterize the basic structures of BGP equilibrium and dynamics, discover and verify these properties in the operational Internet, and derive practical design and operation guidelines and algorithms.<br\/><br\/>Broader Impact: Through this research, the PIs will educate a new generation of network researchers with not only strong practical skills, but also the ability and the habit of applying rigorous mathematical techniques to solve a wide range of engineering problems. They can make unique and broad impact to both the academia and the industry.","title":"Collaborative Research: NeTS-NBD: Optimization and Games in Inter-domain Routing","awardID":"0520318","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["543560"],"PO":["565090"]},"107039":{"abstract":"0520349<br\/>0520318<br\/><br\/>Inter-domain routing can be viewed as a means to implement economic relationships among competing ISPs. Examination of technical details of the BGP routing protocol alone is insufficient to understand the current behavior, or predict future requirements, of global connectivity without taking into account the dynamics of the economic relationships they implement.<br\/><br\/>A full account of the shortcomings of BGP, and proposals to modify it, must be developed rigorously with a clear understanding of the kinds of economic relationships and service models that it can and cannot implement well. The goal of this project is to develop a theoretical framework together with experimental capability to understand, predict, and design the interplay between economics and technologies that implement Internet connectivity. The principal investigators' (PIs) unique angle is an optimization perspective to inter-domain routing where profit maximization, physical connectivity, and AS pricing interact with routing decisions, peering structure, resource constraints, and traffic matrix. The PIs will develop mathematical models that capture the interactions between routing and economics, characterize the basic structures of BGP equilibrium and dynamics, discover and verify these properties in the operational Internet, and derive practical design and operation guidelines and algorithms.<br\/><br\/>Broader Impact: Through this research, the PIs will educate a new generation of network researchers with not only strong practical skills, but also the ability and the habit of applying rigorous mathematical techniques to solve a wide range of engineering problems. They can make unique and broad impact to both the academia and the industry.","title":"Collaborative Research: NeTS-NBD: Optimization and Games in Inter-domain Routing","awardID":"0520349","effectiveDate":"2006-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["490256","564049"],"PO":["565090"]},"110383":{"abstract":"An ideal DDDAS will optimally coordinate state estimation and the observation process. This is indispensable for environmental applications, where models are imperfect and measurements are limited and uncertain. A key part of environmental DDDAS is data assimilation, broadly defined as the process of estimating the state of a system using all relevant information. This project will develop a new approach to data assimilation that makes better use of observations to deal with model imperfections. This new approachwill be developed in the context of mesoscale weather, such as thunderstorms, squall-lines, hurricanes, precipitation, and fronts. In these situations, forecast errors occur in both position (\"the storm is in the wrong place\") and amplitude (\"forecast winds are off\"). Position errors are particularly important since they degrade our ability to predict storm tracks, issue warnings, and properly target observation platforms such as aircraft. Current assimilation methods have problems dealing with position errors. Instead of correcting these errors directly, they tend to compensate for them by distorting amplitudes. Distorted amplitude estimates can produce poor forecasts. Poor forecasts are a problem in their own right but, in the case of an environmental DDDAS, they can easily make strategies for gathering new observations ineffective. In this new formulation for data assimilation accounts for errors in both position and amplitude. This leads to a minimization algorithm that can be expressed in two steps: a regularized variational alignment problem and an amplitude adjustment problem. Alignment can be formulated with or without feature detection, it maintains dynamical consistency, and it permits the smoothness of the solution to be systematically controlled. Field alignment should significantly advance the state of DDDAS for environmental problems.<br\/><br\/>This work will lead to better analysis of mesoscale weather, especially hurricanes and severe storms. It turns out that expressing errors in terms of position and amplitude is quite general. Thus, from the perspective of DDDAS, this work will provide new ways to deal with model error in applications as diverse as hydrology, ecology, and oceanography. Field alignment also nicely complements existing amplitude-oriented assimilation methods used in operational weather forecasting centers. Finally, the regularization aspects of this work will also advance the state of the art in alignment methods, which will benefit biomedical imaging and object recognition research.","title":"DDDAS-SMRP: Data Assimilation by Field Alignment","awardID":"0540259","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":[292367,"559934","500856"],"PO":["535244"]},"110394":{"abstract":"Two related DDDAS application areas considered in this project are (1) cognitive brain modeling from experiments with live subjects and (2) the design of brain-inspired assistive systems to help human beings with severe motor behavior limitations (e.g. paraplegics) through brain-machine interfaces (BMIs). Simply stated, a BMI uses brain signals to directly control devices such as computers and robots. Today's BMI designs are extremely primitive and are a far cry from the seamless interface between brain and body in animals. In a healthy animal, the brain constantly learns and adapts to the needs of new physical movement, in addition to providing perfectly timed signals to the motor system. In this process, the brain receives and uses sensory feedback to both learn and generate the signals that lead to purposeful motion. In order to inch closer to BMI designs that are of use to humans, better models of brain motor control and movement planning are needed along with the necessary adaptive algorithms and computational architecture needed for their execution in real time. In light of such goals, this project's activities aim to significantly advance the state of the art of BMI research by developing the models, algorithms and computational architecture of dynamically-data-driven BMIs (DDDBMIs) that implement recently proposed advanced brain models of motor control. Achieving this goal in the proposed approaches will also allow to address a chief problem in current BMI research: The fact that paraplegics cannot train their own network models because they cannot move their limbs.<br\/><br\/>The research on DDDBMI systems conducted under this project is a drastic departure of the conventional BMI paradigm. The control interface architecture is distributed and borrowed from recent models of neurophysiology of movement, which will enable better overall performance. Learning occurs simultaneously for the subject and the control models in a synergistic manner, which requires more powerful adaptation schemes. Selective use of many computational models is the reason why a dynamically data-driven system is needed to provide the computational needs of a DDDBMI. The project interdisciplinary activities are closely intertwined around the development and integration of the DDDBMI components into a platform for BMI research. Research on middleware addresses the need for dynamic aggregation of Grid-resources with Quality-of-Service guarantees, and support for dynamic computation steering. Research on adaptive algorithms focuses on new data models and learning algorithms. Research on brain modeling concentrates on cognitive models of motor control and advancing our understanding of the neurobiology of movement. In the long run, the BMI experimental research platform will have a dual role: it will help validate the brain models under investigation and it will provide insights on to how to design BMIs for use by paraplegic patients.","title":"DDDAS-TMRP: Dynamic Data-Driven Brain-Machine Interfaces","awardID":"0540304","effectiveDate":"2006-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"S058","name":"NATL LIBRARY OF MEDICINE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T252","name":"NIH-DYNAMIC DATE DRIVEN BRAIN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T627","name":"NIH-DYN DATA DRIVEN BRAIN MACH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"7641","name":"INT'L RES & EDU IN ENGINEERING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["540130","438490","558495","376147",292405],"PO":["535244"]},"111373":{"abstract":"CAREER: Motion Capabilities for Autonomous Mobile Manipulation<br\/><br\/>Abstract<br\/>Concerted efforts in industry and academia have lead to the design and construction of highly advanced humanoid robots and mobile manipulators. These mechanisms combine dexterous manipulation capabilities with mobility and are equipped with multi-modal sensor suites. Autonomous motion of these complex mechanisms is subject to a multitude of constraints, each requiring the consideration of feedback at a specific frequency. The investigator proposes to devise a novel motion generation generation approach that addresses motion constraints and their feedback constraints. At the low end of the frequency spectrum, the investigator proposes the application of techniques from active learning and utility theory to global motion planning. These techniques permit the exploitation of structure inherent in any real-world motion-planning problem to increase the efficiency of motion planning. The resulting planning methods will satisfy the feedback requirements of autonomous mobile manipulation. To obtain adequate feedback about the state of the environment, perceptual information is provided by novel sensing and modeling techniques, which will also be developed as part of this effort. To address motion constraints that require high-frequency feedback, the investigator proposes to combine multi-objective control methods with planning approaches for constraint satisfaction. These planning methods overcome the susceptibility of control-based motion generation to local minima. The resulting overall approach to motion generation addresses the motion requirements of autonomous mobile manipulation, offering a significant advance towards the autonomous operation of humanoid robots and mobile manipulators in unstructured environments.","title":"CAREER: Motion Capabilities for Autonomous Mobile Manipulation","awardID":"0545934","effectiveDate":"2006-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["376899"],"PO":["543539"]},"111384":{"abstract":"IIS-0546027<br\/>Xintao Wu <xwu@uncc.edu><br\/>University of North Carolina at Charlotte<br\/><br\/>CAREER: Towards Privacy and Confidentiality Preserving Databases<br\/><br\/>Many databases from government, commercial and non-profit organizations maintain a huge amount of data on sensitive or confidential information such as income and medical records. As a result, protecting the privacy and confidentiality of such databases is of primary concern. Data perturbation approach is often adopted when database owners export or publish their sensitive or confidential data. However, it is very hard to quantify and evaluate the tradeoffs between the data utility and the disclosure risk in practice since the data space which is used for disclosure analysis is almost infinite. This project develops a novel model-based disclosure analysis approach which builds statistical models first and analyzes potential disclosure at the models' parameter level. Since the search space of parameters is much smaller than that of data and all information which attackers can derive is contained in those parameters, this approach is more effective and efficient. This project also conducts the theoretical study of perturbation based approach by developing the explicit form between construction accuracy and noise added for various reconstruction methods since previous research only conducted empirical evaluations. The results of this project will provide a prototype system which can fully conduct disclosure analysis using both model based and randomization based approaches to satisfy users' complex privacy and confidentiality specifications. <br\/><br\/>The system aims to be used by local industry partners and other organizations. Education impacts of this project will include involvement of graduate and undergraduate students and incorporation of research projects into courses related to database security and privacy. Two Ph.D. graduate students will be produced to enhance the nation's capability in information security. All results including publications, empirical studies and software will be disseminated via the project web site (http:\/\/www.cs.uncc.edu\/~xwu\/career).","title":"CAREER: Towards Privacy and Confidentiality Preserving Databases","awardID":"0546027","effectiveDate":"2006-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}}],"PIcoPI":["492490"],"PO":["469867"]},"113287":{"abstract":"This research project investigates the ways in which the actions of governmental and non-governmental agencies and organizations affect the ability of disaster victims to recover psychologically, economically, and socially, while dealing with grief and loss and adapting to new situations. The response to hurricane Katrina makes it clear that local human services organizations, while extremely valuable, are unable to address the full range of needs of disaster victims, and that federal and state governments must provide basic coordination, as well as large-scale resources. By examining both the failures and successes of both governmental and nongovernmental organizations in response to the human crisis the research provides practical insights into the most effective division of roles between different levels of government and civil society. The wide-ranging crisis precipitated by Hurricane Katrina provides the opportunity to better understand the complementary roles of government, non-governmental organization, and the smaller informal networks composed of relatives and friends in determining the long-term consequences of disasters, as well as more chronic difficulties. <br\/><br\/>The data relate to the period most proximate to the disaster and represent an invaluable baseline on which future research will build. The research team will identify and contact a diverse group of evacuees to Texas and remain in contact with them over time in order to identify how the actions of various agencies influences a family's long-term adaptation. The panel of evacuees will consist of individuals from various racial and ethnic groups and will represent different socioeconomic strata. Ethnographically oriented interviews investigate families' situation and activities prior to the storm, and their activities and movements during the storm and afterwards. The interviews focus specifically on contact with all forms of help providers, including government agencies, non-governmental organizations, and more informal community and kin networks. The objective is the development of a qualitative database that will make it possible to develop generalizations concerning the different ways in which evacuees sought and received help, and how their strategies related to their race, ethnicity, and socio-economic status, their personal resources and the eventual outcomes. The project includes on-going follow-up with evacuees over the period of a year. The study is being carried out in Austin, Texas, which received a substantial population of evacuees and sponsors a range of helping organizations.<br\/><br\/>This research contributes theoretically and practically to a better understanding of how both governmental and non-governmental organizations enhance resiliency and mediate the impact of loss on human behavior, social inequities in disaster relief efforts, and the relationship of individual capabilities to the effective access to both government and civil supports and benefits.","title":"SGER: The Parallel Strengths and Weaknesses of the Civil Society and the State: The Example of Katrina Survivors","awardID":"0555113","effectiveDate":"2006-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":[299967,299968,"314715",299970,"494327"],"PO":["564435"]},"109416":{"abstract":"0534314<br\/>Furuta Richard<br\/>Texas Engineering Experiment Station<br\/>Mediation of Research Group Scholarly Activities in a Digital Library: Steps towards the Nautical Archaeology Digital Library <br\/><br\/><br\/>The project is a collaborative effort of researchers in Texas A&M University's Center for the Study of Digital Libraries (CSDL) and Nautical Archaeology Program (NAP). The project will develop an initial digital library of artifacts gathered in the domain of Nautical Archaeology and use it to examine and build tools and applications for research and scholarly practice in the area. The project will design, implement, and evaluate a framework that will: 1) efficiently catalog, store, and manage artifacts and ship remains along its associated data and information produced by an underwater archeological excavation, 2) integrate heterogeneous data sources from different media to facilitate research work and handle uncertainty in data and structure, 3) incorporate historic sources to help in the study of current artifacts, 4) develop visualization tools to help researchers manipulate, observe, study, and analyze artifacts and their relationships; and 5) develop algorithm and visualization based mechanisms for ship reconstruction, i.e., to determine where recovered pieces and fragments fit in a whole.. The project will draw its materials from an extensive collection of artifacts gathered from a shipwreck in Portugal as well as the extensive archives collected at the NAP during field studies over the past 32 years. Gathering artifacts from the field provides the basic data that drives many areas of scientific inquiry. While a major focus of today's digital libraries research is concerned with collecting, organizing and managing archives of diverse topical data, research focused in specific topic areas can produce digital libraries that functionally go beyond mere information warehousing to support very specific tasks necessary for scholarship in a given topical area. The intellectual merit of this proposal is relevant to both Computer Science and Nautical Archaeology research agendas. The project's research has the potential for application within many areas of scientific study, particularly within those that incorporate aspects of fieldwork.","title":"Mediation of Research Group Scholarly Activities in a Digital Library: Steps Towards the Nautical Archaeology Digital Library","awardID":"0534314","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["465209",289657],"PO":["565227"]},"109537":{"abstract":"NSF Proposals IIS-0535057 and IIS-0535060<br\/>Collaborative Research: Curriculum Development: Digital Libraries<br\/><br\/>Abstract<br\/><br\/><br\/>Virginia Tech (VT) and the University of North Carolina at Chapel Hill (UNC-CH) are addressing the important problem of preparing students of computer science (CS) and library and information science (LIS), for study and workforce opportunities in the Digital Libraries (DLs) area. We are continuing development of the 5S (Streams, Structures, Spaces, Scenarios, and Societies) approach as both a formal foundation and a practical base for pedagogy and DL implementation. With the assistance of our Advisory Board and students in doctoral consortia, we are planning and developing approximately 12 lesson\/modules, to be evaluated by DL experts.<br\/><br\/>These and other educational materials will be made available through the National Science Digital Library (NSDL), after refinement and field testing at VT and UNC-CH as well as diverse cooperating universities, and cataloging with metadata. Programs in CS, as well as LIS, at any institution with any degree of interest in DLs, may draw upon project deliverables, to enhance existing courses, add DL (related) courses, or even deploy a DL curriculum. Students will learn about the 5S framework, and may learn to use 5S as a base for modeling, designing, implementing, and improving DLs.<br\/><br\/>Presentations at key DL, CS, and LIS conferences will expand awareness of the work. Future CS and LIS graduates focusing on DLs will have a sound basis to continue in the field, as practitioners, educators, researchers, and developers. DL users will benefit from the improved understanding of those who build the next generation of DL systems.","title":"Collaborative Research: Curriculum Development: Digital Libraries","awardID":"0535060","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[289988,"408947"],"PO":["427499"]},"109449":{"abstract":"IIS-0534530<br\/>Raju Rangaswami raju@cis.fiu.edu (PI)<br\/>Vagelis Hristidis vagelis@cis.fiu.edu (Co-PI)<br\/>School of Computing and Information Sciences<br\/>Florida International University<br\/><br\/>Title: Building Efficient, Native Storage Systems for Semi-structured Data<br\/><br\/>Abstract:<br\/><br\/>The objective of the proposed project is to provide generic, efficient, and native support for storing and accessing semi-structured data. The first step towards this goal is to minimize the access overhead for navigating semi-structured data by developing methodologies that tightly map its structure to those of common storage devices (hard disks and MEMS-based storage). The second step is to augment the developed storage mechanisms and interface to allow efficient implementation of key data-oriented operations (locking, access rights enforcement, index creation, and efficient updates). The third step is to design and implement a prototype of the native semi-structured storage system. Native support for semi-structured data developed during the course of this project will result in broad impact across several application domains including XML, legacy directory-file structures, video databases, Bioinformatics data analysis, and other areas of physical sciences that deal extensively with semi-structured data. Furthermore, the PIs are involving Florida International University students from minority communities in the project. This will help increase the graduation rate of minority students especially at the Ph.D. level, and consequently their representation in the research community. The results of the project will be disseminated via the project Web site: http:\/\/www.cis.fiu.edu\/SSS\/.","title":"Building Efficient, Native Storage Systems for Semi-structured Data","awardID":"0534530","effectiveDate":"2006-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["550842","516939"],"PO":["469867"]},"111440":{"abstract":"Title: CAREER: Generalized Separation of Style and Content on Nonlinear Manifolds with Application to Human Motion Analysis<br\/><br\/>The visual input is a function of various conceptually orthogonal factors. Each of these factors, typically, can be represented as an underlying nonlinear manifold. So, in general, each data point lies on a mixture of manifolds. Therefore, we have a product space of all these factors, which makes the problem very challenging. However, the problem can be approached if we understand conceptually, to some extent, the topology, dimensionality and the properties of each individual manifold of the orthogonal factors that generated the data. The ultimate goal of this research is to establish general mathematical frameworks for the separation of multiple factors in the data. In particular, in context of human motion, the objective is to establish a mathematical framework that decouples intrinsic body configuration from other sources of variability that affect the visual input and, consequently, to exploit such models in recovering body configuration. To achieve this goal four research directions will be investigated 1) Learning a unified invariant content manifold representation from various style variations on the same manifold. 2) Learning factorized generative models for the data given representation of one or more of the underlying manifolds. 3) Given representation of the underlying manifold, how that can be used to select discriminative features in the visual input. 4) Applying the findings towards the recovery of intrinsic body configuration.<br\/><br\/>The problem of separation of style and content is an essential task in visual perception and is a fundamental mystery of perception. It is not clear how we perceive a common motion, such as walking, regardless of all sources of variations in its appearance. The fundamental research problems addressed in this research plan appear extensively in different computer vision as well as machine learning applications. The findings will help promote the state-of-the-art in computer vision and machine learning fields as well as bringing interesting computational models to researchers in the cognitive science field. Human motion analysis will be the main applied domain for this research. The proposed research in human motion analysis has various important applications such as surveillance, security, human computer interaction, etc. Human motion analysis will be the integrating theme between the research and the educational activities for motivating Math and Science education. The educational plan consists of several integrated activities targeting the graduate level, the undergraduate level, and high school educators and students. The goal is to develop educational tools that will integrate the efforts of the PI, high school educators, undergraduate and high school students through collaborating in the design, implementation, and evaluation of a computer vision virtual classroom.<br\/><br\/>URL: http:\/\/www.cs.rutgers.edu\/~elgammal\/Research\/GStyleContent.htm","title":"CAREER: Generalized Separation of Style and Content on Nonlinear Manifolds with Application to Human Motion Analysis","awardID":"0546372","effectiveDate":"2006-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["518508"],"PO":["564316"]}}