{"49271":{"abstract":"","title":"Micro-Robot Manipulators-Complete Electromechanical Systems in a Cubic Centimeter","awardID":"9996251","effectiveDate":"1997-12-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z533","name":"ARPA-REALTIME PLAN & CONTROL"}}],"PIcoPI":["195851"],"PO":["475621"]},"26790":{"abstract":"9729863 Goodman, David J. WINLAB (Wireless Information Network Laboratory),Rutgers University CISE Research Instrumentation: Parallel Computing For Wireless Networking Research This research instrumentation grant enables the following research projects: - Scalable Simulations of Telecommunication Systems- Interference and Coexistence of U-NII Band Wireless Systems - Routing and Power Control in Multihop Packet Radio Networks - Interference Cancellation. WINLAB, an NSF\/Industry Cooperative Research Center, will purchase a high performance 14-processor SMP computer (SUN UltraSparc HPC 4000) to support computation-intensive research projects in wireless data networking which exhibit considerable degree of untapped parallelism. The new and ongoing projects that critically depend on such a computing platform include:- Development of a Virtual Wireless Testbed for parallel simulations of radio propagation, mobility, network traffic and protocols. The Testbed evolves to become a standard research and education tool.- Investigations of interference and robust protocols for the wireless systems in the recently allocated 5 GHz bands for the Unlicensed National Information Infrastructure (U-NII).- Investigations of power control and feasible routing schemes in multihop radio networks.- Design of a testbed implementing sophisticated multiuser detectors for new CDMA systems. The purchase of the multiprocessor SUN UltraSparc will greatly accelerate research in these areas, as well as in other projects involving DIMACS (an NSF S&T Center) and ECE and CS Departments at Rutgers, which currently do not have a comparable high performance multiprocessor with parallel thread support.","title":"CISE Research Instrumentation: Parallel Computing For Wireless Networking Research","awardID":"9729863","effectiveDate":"1997-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["142722",67495,"475434","466323","258464"],"PO":["557609"]},"26780":{"abstract":"9729844 Allen, Peter Columbia University CISE Research Instrumentation: Acquisition of a Mobile Robot Scanning System This research instrumentation grant contributes to the purchase of a mobile robot scanning system, comprised of a an outdoor, autonomous robot vehicle with a large payload and an on-board centimeter resolution Global Positioning System for accurate location of the vehicle. The instrumentation will enable the following projects:- Automatic 3-D Site Modeling,- Automated Visual Navigation,- Integration of Physical and Virtual Views, and- Optimal Representation and Verbal Description of Large Scale Objects and Path. The mobile scanning equipment acquired will contribute to develop highly accurate 3-D site models that encompass geometric and photometric properties of the scene. There are 4 aspects to this research which require a mobile base robot, an accurate GPS location system, and 2-D and 3-D imaging sensors. First, the models will be built by using the mobile base to acquire images and a new range scan mesh extrusion algorithm will create volumetric models. Sensor planning algorithms will also be developed to determine regions where the robot can navigate to complete a partially built model by further sensing. Second, the robot will be equipped with omnidirectional cameras which can be used for structure-from-motion scene recovery, and model registration research. Third, the system will be used for research on change detection and model evolution on existing models of the environment. The GPS system can provide ground truth for the accuracy of these algorithms, and allow interaction with an existing low-precision human-mounted system for tracking. Fourth, the system will be used as a \"guide\" through an environment. It can take navigational and environmental queries in verbal\/gestural form, and present its findings about the objects of interest in the scene in natural language.","title":"CISE Research Instrumentaion: Acquisition of a Mobile Robot Scanning System","awardID":"9729844","effectiveDate":"1997-12-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["337904","518026","438618","530199"],"PO":["301532"]},"49088":{"abstract":"","title":"CAREER: MEMS for the Masses","awardID":"9996065","effectiveDate":"1997-12-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4730","name":"PROTOTYPING TOOLS & METH PROGR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1501","name":"MICROELECTROMECHANICAL RSCH"}}],"PIcoPI":["195851"],"PO":["321058"]},"26793":{"abstract":"9729875 Heimdahl, Mats, P.E. University of Minnesota, Twin Cities CISE Research Instrumentation: Applying Software Engineering Methodologies to Robotics Tasks: A Cross Disciplinary Approach This research instrumentation enables research projects in:- Rapid Prototyping and Synthesis of Software for Embedded Systems, - Studies of Different Issues in Vision-Based Robotic Grasping,- Sensor Fusion in Vehicle Applications, and - Behaviors of Multiple Self-Interested Robots. To support the aforementioned projects, the Department of Computer Science at the University of Minnesota will purchase a VXI-bus embedded real-time software development environment, several mobile platforms, and robot simulation software which will be dedicated to research in software engineering, robotics, and artificial intelligence. The equipment will be used for several research projects, including in particular: requirements-based prototyping and synthesis of control software for embedded systems, closed-loop vision-based robotic grasping, sensor fusion for vehicle applications, and behaviors of multiple self-interested robots. In addition to the contributions of the individual projects, the collaboration between the PIs will help evaluate cutting edge software engineering techniques on realistic projects (for example, evaluation of scalability, evaluation of ease of use, and applicability to the domain) as well as evaluate the use of rigorous software engineering techniques in robotics and AI applications (for example, the effect on reuse of control algorithms, and the effect on system performance, robustness, and safety). The equipment purchase includes (1) a complete VXI-bus embedded software development environment, (2) one VXI-bus embedded computer with interfaces for sensing and control applications, (3) low-cost mobile platforms serving as testbeds for the proposed projects, and (4) robotics simulations software to be used in task planning and software prototyping.","title":"CISE Instrumentation: Applying Software Engineering Methodologies to Robotics Tasks: A Cross Disciplinary Approach","awardID":"9729875","effectiveDate":"1997-12-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550553","561562","421080","557449"],"PO":["301532"]},"24142":{"abstract":"9720676 Baruah, Sanjoy K. University of Vermont and State Agricultural College CISE Research Instrumentation: A High-performance Computing Facility for Experimental Algorithmics This research instrumentation grant enables research in several projects: - Computing Euclidean Steiner Minimum Trees,- Research on Blocking Behavior of Multicast Networks,- Feasibility Analysis via Computation-Intensive Simulations, - Finite Sample Analyses of Nearest Neighbor Algorithms, and - Reliability of Large Scale Disk Arrays. To support the aforementioned projects, the newly-formed Department of Computer Science at the University of Vermont will purchase high-performance computing equipment. The equipment will be used in particular for: - Developing efficient algorithms for generating the shortest network interconnecting a given set of points.- Investigating the blocking behavior of multicast networks.- Developing simulation algorithms for the feasibility analysis of hard-real-time application systems.- Developing and evaluating nearest-neighbor algorithms for pattern recognition.- Exploring techniques for enhancing the reliability of disk arrays. Each project will explore the impact of the recent dramatic advances in computing technology upon algorithm design issues in a particular application domain. New techniques, methodologies, and algorithms will be designed which make extensive use of large-scale simulation and\/ or combinatorial search. The equipment made available through this grant will be used to both perform the computational experiments necessary to guide the research, and to validate the findings thus obtained.","title":"CISE Research Instrumentation: A High-Performance Computing Facility for Experimental Algorithms","awardID":"9720676","effectiveDate":"1997-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[60753,"517891","550688","518412","97608"],"PO":["557609"]},"23021":{"abstract":"Algorithms for learning by interaction, or reinforcement learning, typically ignore all structure in the environment and consequently tend to scale poorly. The goal of this research is to develop novel, efficient, and theoretically well-founded algorithms and architectures for learning by interaction in structured environments. Three kinds of environmental structure are considered: factorial structure in states and actions, additive structure in payoff functions, and hierarchical structure in states and actions. Such structure is common because many environments are composed from multiple, weakly interacting, components that are often organized hierarchically. The approach consists of exploiting this structure by learning separately for the different components and then compensating in a structure dependent manner for the approximation so introduced. The results of this research will elucidate many different interesting and useful structures common in learning by interaction problems and provide new reinforcement learning algorithms that make it possible to solve significantly larger structured problems than possible with the traditional approach. Possible applications include large-scale, dynamic, resource allocation problems intelecommunications, networking, and scheduling, as well as multi-agent problems from distributed control and artificial intelligence.","title":"Exploiting Structure in Reinforcement Learning Problems","awardID":"9711753","effectiveDate":"1997-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["550371"],"PO":["565227"]},"25100":{"abstract":"Real agents must work within the limitations (bounds) imposed by their own makeup. Among the resources available only in limited quantities are time, space, and information. This project is to study the rational utilization of limited resources in reasoning. Specifically, the tasks will be: (1) to devise and implement a treatment of reasoning in bounded agents embedded in a rich environment, paying special attention to their planning, reasoning about action, and resolution of conflicting information, using the formalism of active logic; (b) to focus on the application of the above to web agents and their autonomous time management (planning and scheduling) in order to meet user requests; (c) to continue the development of a standard logic engine; and (4) to develop a computationally attractive syntactic account of propositional attitudes, including belief, desire, and attention. The results of the research will allow the development of bounded web agents based on a firm theoretical foundation.","title":"Investigation of Bounded Agents","awardID":"9724937","effectiveDate":"1997-12-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["366055","333993",63296],"PO":["565227"]},"26794":{"abstract":"9729877 Aluru, Srinivas New Mexico State University CISE Research Instrumentation: Application Oriented Parallel Computing and Scientific Computing Research on a Commodity Parallel System This research instrumentation serves primarily as an experimental testbed for the following research projects:- Scalable Parallelization of Spatial Data Structures and Applications, - Parallel Methods for Protein Accessible Surface Area Calculations,- Development of Parallel Smoothed Particle Hydrodynamics (SPH) Methods for Simulating Transient Electromagnetic Problems,- Direct Solution of Large Sparse Irregular Systems of Equations on Massively Parallel Computers, and- Performance Measurement in Distributed Systems. The instrumentation grant funds the purchase of a 32-processor workstation cluster built from commodity microprocessors and networking components. The equipment is to be used to set up a Parallel Computing Laboratory in the Department of Computer Science at New Mexico State University. The workstation cluster will be used as a distributed memory parallel computer dedicated to support application-driven parallel computing and high-performance scientific computing research on low-cost commodity-based systems. Results from this research are to be made available in the form of libraries, tools and applications software for researchers interested in low-cost commodity-based parallel computing. The equipment also supports an interdisciplinary educational program in computational science.","title":"CISE Research Instrumentation: Application Oriented Parallel Computing & Scientific Computing Research on a Commodity Parallel System","awardID":"9729877","effectiveDate":"1997-12-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["456141","377649","565135"],"PO":["301532"]},"26785":{"abstract":"9729854 Dobkin, Davis Princeton University CISE Research Instrumentation :Instrumentation Support for Graphics and Visualization Research at Princeton This research instrumentation enables research projects in:- Virtual Environments,- Scientific Visualization, and- Digital Media. The Departments of Computer Science and Astrophysics at Princeton University will purchase equipment for high performance graphics and for outputting of high resolution graphics in various formats (video, hardcopy and slides). The equipment will be used for several research projects, including in particular: (1) work in walkthroughs of buildings and cities, (2) visualization of scientific data and (3) digital techniques in multimedia. The equipment requested will be used by faculty, graduate students and undergraduates in both computer science and astrophysics to support individual and cross-disciplinary research projects. An important consequence of the proposed projects is that they not only enhance the current faculty and student research and education but they also act as a catalyst for new collaborations between these two departments and other related science and engineering departments at Princeton. The synergy created will thus make the whole significantly greater than the sum of the parts.","title":"CISE Research Instrumentation: Instrumentation Support for Graphics and Visualization Research at Princeton","awardID":"9729854","effectiveDate":"1997-12-15","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["213809","462746"],"PO":["557609"]},"23683":{"abstract":"This research is on developing algorithms and tools to synthesize testable digital sequential circuits. The testable synthesis problem has in the past been dealt with as two independent problems namely, the state assignment problem and the testing problem. Algorithms and tools that can synthesize area-efficient and testable designs of sequential circuits represented as finite state machines are being developed. Methods of partitioning and re-synthesizing large sequential circuits using the CAD tools and\/or the test architectures developed in this project and generation of test vectors for the resulting circuits are being explored.","title":"Optimized Testable Synthesis of Sequential Circuits","awardID":"9714034","effectiveDate":"1997-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["370773"],"PO":["564898"]},"26786":{"abstract":"9729856 Kaeli, David R. Northeastern University CISE Research Instrumentation : Development of a Digital Signal Processing (DSP) Compilation Testbed This research instrumentation grant enables the following projects: - Digital Signal Processing Applications in Telecommunications and Magnetic Recording Systems, - Improved Program Layout for High Performance Signal Processors, and - Dynamic Compilations for Networked Signal Processors. Digital Signal Processors are commonly used to execute a range of performance-critical signal processing applications. High-level language compilers have only recently been targeted for DSPs. The optimization technology provided in these compilers lacks the level of sophistication commonly found in most microprocessor compilers, and has discouraged the use of high-level languages for performance-critical DSP applications. As a result, assembly-language programming still dominates DSP development, and there can be very high costs associated with maintaining legacy assembly code. New code generation technologies must be developed which capitalize both on the characteristics of signal processing algorithms and on the resources available in modern DSPs. Compiler technologies that exploit the evolving architectural features present in state-of-the-art signal processors must also be used to develop highly performance-tuned signal processing applications. The equipment requested by this grant will be used as a DSP testbed by the principal investigators to develop new signal processing and telecommunications applications, as well as to investigate new compilation techniques which address the issues of producing maintainable, high performance signal processing software.","title":"CISE Research Instrumentation: Development of a Digital Signal Processing (DSP) Compilation Testbed","awardID":"9729856","effectiveDate":"1997-12-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[67479,"557272","138361"],"PO":["301532"]},"23894":{"abstract":"Turbo coding is the conventional name given to an exciting and relatively new digital communication technique capable of approaching the theoretical limits imposed by Shannon theory. The technique has enjoyed enormous recent attention from coding theorists, but many practical, engineering-oriented issues remain before these coding techniques will see widescale practical implementation. We propose research in the areas of: (1) reduction of decoder latency and complexity; (2) developing stream encoder and decoder architectures; (3) efficient synchronization at low SNR; (4) improving performance of small-frame turbo systems; (5) robustness to channel modeling error, either in estimation of SNR or non-Gaussian noise; and (6) use of turbo codes on non-coherent or differentially-coherent channels.","title":"Turbo Codes: Moving Theory Into Practice","awardID":"9714646","effectiveDate":"1997-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["556971"],"PO":["188393"]},"21595":{"abstract":"Scalable signal compression algorithms are required by the evolving communication network, which is composed of a variety of channels with widely differing static and dynamic capacities, and by the recent trend toward incremental capacity and bandwidth reservation channels. Current multimedia compression algorithms implicitly assume simple point to point transmission as well as fixed bandwidth allocation, and result in under-utilization of the network resources. The development of truly scalable coders with rate controlled by the local source statistics, network traffic load, and channel condition will directly impact the next generation of audio internetworking for multicasting, videotelephone, videoteleconferencing, and various applications for information retrieval from multimedia databases. This research focuses on new audio compression techniques for voice and music signals, that allow efficient scaling of bit rate and audio bandwidth within the framework of multimedia compression. The primary thrust centers on audio signal modeling with a sinusoidal signal representation, which is bandwidth and rate scalable and achieves good performance in a variety of coding environments from low-rate coding of narrow-band speech (2 kb\/s) to high-quality coding of audio signals (16-64 kb\/s). Methods under investigation include sophisticated phonetic and music classification to allow content-adaptive audio decomposition and modeling, generalized product code vector quantization, and in particular, multi- stage vector quantization, to implement scalable quantization techniques. Inter- stream optimization for joint compression of audio and video signals is studied with emphasis on potential applicability to packet transmission and in particular to TCP\/IP Internet protocols. An important sub-problem is the inter-stream rate allocation optimization taking into account each stream's level of activity, user requirements, and sensitivity to quantization and channel errors. Sourc e-channel coding and error concealment issues are studied in order to maintain quality of service requirements under packet losses for both wired and wireless channels.","title":"\"Scalable Audio Compression for Multimedia Applications\"","awardID":"9707764","effectiveDate":"1997-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[54362,"550914",54364],"PO":["564898"]},"26777":{"abstract":"This is a workshop to bring together researchers and designers from academia and industry to discuss possible directions in the development of high-performance, parallel, distributed, and multimedia processors and systems. The topics center around systems on a chip and their utilization in building larger systems. The participants include designers of processors, compilers and operating systems, together with application experts. The wide representation will allow rich interaction concerning ideas and emphasis in the field.","title":"International Workshop on Innovative Architecture for Future Generation High-Performance Processors and Systems; October 22-24, 1997; Maui, Hawaii","awardID":"9729840","effectiveDate":"1997-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["532654"],"PO":[67448]},"38856":{"abstract":"","title":"Cooperative Assistance through Visual Interaction: Perception and Problem-Solving in Complex-Environments","awardID":"9896178","effectiveDate":"1997-12-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["173143"],"PO":["565227"]},"23797":{"abstract":"This research is investigating the issues related to designs and performance evaluations of several innovative disk I\/O architectures. These architectures may improve the I\/O response time by orders of magnitude over current state-of-the-art disk architectures for office\/engineering workloads. The focus of the research includes: * Minimization of disk write times by means of disk caching disk (DCD). This is a technique of using a small disk to cache writes sequentially, as in a log-structured file system, then using the log to update the file system on the larger disks. * Using a combination of DRAM and DCD to replace non-volatile RAM caches that are currently used in RAID systems. * Using DRAM as a component of the file system to allow fast reads and writes. In this scheme, a log of files written to RAM will be kept in either NVRAM or on disk, but only the RAM access will be in the critical path. * Upgrading existing file servers to emulate DCD using multiple existing disks. These architectures will be investigated using simulation to compare them to existing architectures under a wide range of I\/O workloads. New analytical models will also be devised and used in evaluation of architectures. Actual implementations of the DCD architectures will be carried out using disk partitions as caches on the computers in the department. Performance measurements will be performed on the DCD implementations and used to compare with existing disk architectures.","title":"A New Spectrum of Hierarchical Storage Architectures for High Performance Disk I\/Os","awardID":"9714370","effectiveDate":"1997-12-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["414327"],"PO":["197478"]},"26834":{"abstract":"9729990 Teller, Patricia J. The University of Texas at El Paso CISE Research Instrumentation: A Multiprocessor Platform for Cross-Disciplinary Research in Parallel Systems This research instrumentation enables the following research projects:- Dynamic and Adaptive Multiprocessor Resource Management, - Run-Time Monitoring of Parallel Programs, and- A Parallel Implementation of SequenceL Programs. To support the aforementioned projects, the Department of Computer Science at the University of Texas at El Paso (UTEP) will purchase additional processors and memory, a star router to interconnect them, a DLT autochanger, a spare hot-swappable hard drive, and software to upgrade their SGI\/Cray Origin 2000. The upgraded multiprocessor system provides a platform that builds upon funded-research efforts and creates new cross-disciplinary research opportunities in the area of parallel systems. The system supports research in computer and information science and engineering, in particular, research in: end-to-end performance modeling of large, heterogeneous, adaptive parallel\/distributed computer\/communication systems; dynamic and adaptive multiprocessor resource management; run-time monitoring of sequential and parallel programs; and very high-level parallel programming languages for data mining applications. This research is significant because it addresses important performance issues with respect to the design of future parallel architectures, in particular, the memory hierarchy of these systems; the feasibility of run-time monitoring of the integrity of software; and the effectiveness of mining large databases. The research requires, and the system provides, the ability to: characterize process resource demands, measure application performance, acquire parameters for multiprocessor system modeling, validate multiprocessor simulations, and perform parallel discrete event simulation. With these methods, it is possible to evaluate the performance of dynamic and adaptive multiprocessor resource management policies; various implementations of integrity-constraint monitoring, in particular, concurrent processes; and very high-level programming constructs.","title":"CISE Research Instrumentation: A Multiprocessor Platform for Cross-Disciplinary Research in Parallel Systems","awardID":"9729990","effectiveDate":"1997-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[67630,"318770","559621"],"PO":["557609"]},"24009":{"abstract":"Layered manufacturing refers to the fabrication of a physical part by depositing material, layer-by-layer, under computer control. The fabrication of multi- material structures as well as the embedding of prefabricated components is possible using layered manufacturing. Mesoscopic devices and functioning assemblies can also be made directly. The automation of layered manufacturing depends on proper CAD representations of non-homogeneous objects and computer algorithms for extracting process information from the CAD models. Present CAD systems are unable to represent non-homogeneous and multi-material objects. This project addresses these problems. Research tasks include the design and implementation of algorithms and the subsequent fabrication of multi-material parts in several media.","title":"CAD Representations and Process Planning Algorithms for Layer Manufacturing of Heterogenous Reject","awardID":"9714951","effectiveDate":"1997-12-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["554087"],"PO":["562984"]},"26715":{"abstract":"9729719 Kazovsky, Leonid G. Stanford University CISE Research Instrumentation: Ultra-High-Speed Optical Networks This research instrumentation grant enables the utilization of the requested BER test set in studies which include:- optical packet switching,- fiber nonlinearities, and- high-speed communication integrated circuits. The objective of proposed research is to explore the multi-TeraHertz bandwidth potential of optical fibers to support ultra-high-speed, wavelength-division-multiplexed (WDM) optical links and networks. That objective will be achieved via construction and experimental investigation of novel ultra-high-speed experimental links and networks operating in the 10 - 100 Gb\/s range. The requested instrument, a 12 Gb\/s bit error rate (BER) test set, is vitally important for the proposed research as it provides a means to (a) generate data at extremely high data rates and(b) test BER performance of experimental links and networks at such high data rates. The BER test set will be used in our experiments in conjunction with external time-division and wavelength-division multiplexing to measure the performance of our experimental systems in the 10 - 100 Gb\/s range. Thus, the proposed instrument will have a strong positive impact on our research as it will allow us to move toward much higher bit rates previously inaccessible with older equipment. Specifically, the new BER test set will be used in our 84 km WDM experimental ring network interconnecting Stanford University with Sprint ATL. The network currently operates at 2.5 Gb\/s per wavelength. The proposed BER test set will help to increase the bit rate to 40 Gb\/s per wavelength by allowing us to time-division-multiplex four 10 Gb\/s bit streams into a 40 Gb\/s data stream. Several additional research projects in the laboratory and elsewhere at Stanford will utilize the requested BER test set.","title":"CISE Research Instrumentation: Ultra-High-Speed Optical Networks","awardID":"9729719","effectiveDate":"1997-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["483588"],"PO":["557609"]},"30338":{"abstract":"Funding is to support a workshop (spring 1998) to explore challenges in digital system design posed by the very large integrated circuits (systems-on-silicon) made possible by advances in VLSI technology. With 100 million transistor chips imminent and 500-million transistor designs feasible, there is a pressing need to assess what new design technologies and methodologies must be created to make the creation of such systems feasible. Workshop participants include CAD and design experts from both academia and industry. The workshop report includes: 1) a statement of pressing problems posed by systems-on-silicon; 2) recommendations about important research areas relating to systems-on-silicon; and 3) viewpoints on how to make these CAD and design communities aware of these trends and challenges.","title":"Workshop: Design Challenges of 100-Million Transistor VLSI Systems","awardID":"9802662","effectiveDate":"1997-12-01","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["431683"],"PO":["321058"]},"22858":{"abstract":"The goal of this research project is to create new algorithms for numerical function approximation that are particularly suited to value function approximation in reinforcement learning. These algorithms localize the approximation error in the domain of the function, and respond by constructing features that enable further error reduction. It is essential that these algorithms be able to approximate well even when the function appears to be changing as learning progresses. The results of this research will be algorithms that reduce error in a repeatable manner, and that produce an approximation that is inspectable and understandable. Application tasks for the research will include instruction scheduling and autonomous agent policy learning. The research aims to enable practioners who employ automatic learning methods to achieve more accurate and more understandable results with less human engineering.","title":"Constructive Function Approximation","awardID":"9711239","effectiveDate":"1997-12-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["225743"],"PO":["565227"]}}