{"32818":{"abstract":"Czech belongs to the family of Slavic languages, which exhibit phenomena that will prove challenging to speech recognition. The characteristics of a high degree of inflection, a high degree of derivation, a relatively free word order, and having phones that appear in no other language make speech recognition difficult. The development of a large vocabulary speaker independent continuous speech recognizer for Czech is proposed as a collaborative effort between Johns Hopkins' Center for Language and Speech Processing and three university teams from the Czech Republic. The proposed research is attempting to take advantage of the synergistic opportunities offered by the experience and tools of Johns Hopkins researchers, by the capabilities of the Czech partners, and by the existence of extensive text resources in their possession. The research cooperation will forge international scientific ties and create new centers of language engineering excellence outside the United States.","title":"U.S.-Czech Cooperative Research: Speech Recognition of a Slavic Language","awardID":"9810517","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y981","name":"DARPA-JOHNS HOPKINS UNIV SUMME"}}],"PIcoPI":["445172","168075"],"PO":["246649"]},"37181":{"abstract":"9860826<br\/> This Small Business Innovation Research Phase I project from Mini-Surgery, Incorporated proposes the development of a Micro-ElectroMechnical System (\"MEMS\") flexural microhydraulic actuator with significant performance and cost advantages. The MEMS-based actuator design enables the use of low-cost large-batch planar manufacturing techniques such as thin film deposition and etching, lapping, and polishing for production from centimeter-scale to sub-millimeter scale. At the millimeter-to-centimeter scale, these devices could be produced at orders of magnitude lower cost than conventional hydraulic actuators. <br\/> The proposed design for a novel, miniature, lightweight, low maintenance actuator offers superior reliability, speed, and force compared to conventional actuators and micromotors. The actuator is targeted for valves, pumps, compressors, electric motors, and sensors in many medical, automotive, aerospace, and industrial devices.","title":"SBIR Phase I: Flexural Hydraulic Actuators","awardID":"9860826","effectiveDate":"1999-01-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"5371","name":"SMALL BUSINESS PHASE I"}}],"PIcoPI":[94116],"PO":["565053"]},"49381":{"abstract":"","title":"CAREER: Design and Control of Biomimetic Mobile Robots","awardID":"9996366","effectiveDate":"1999-01-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[126281],"PO":["335186"]},"49172":{"abstract":"","title":"Lemma Generation and Failure Heuristics for an Induction Theorem Prover (RRL)","awardID":"9996150","effectiveDate":"1999-01-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["531861"],"PO":["179846"]},"49285":{"abstract":"","title":"Software Requirements and the Human-Computer Interface","awardID":"9996265","effectiveDate":"1999-01-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["296879"],"PO":["150697"]},"38076":{"abstract":"By all accounts, the Web is humanity's largest and fastest growing repository of digital information. Many collections of information are Internet-accessible, and most will provide a searchable Web interface. While some collections have a broad array of materials, trends show an explosion in the number of specialized<br\/>collections with narrow but very deep content. Thus a principle challenge facing users will be the selection of Web information sources capable of answering their query. In a physical library, users rely on a reference librarian to help point them at the correct resource, but while human librarians are becoming increasingly<br\/>sophisticated in their use of the Web, they are only part of the solution. We need more powerful automatic reference tools to help people efficiently retrieve high quality information from the Web. Typically, reference librarians are not specialists in the topic of inquiry (e.g., computational fluid dynamics) but they are expert at identifying relevant resources (e.g., The International Journal of Fluid Dynamics) and at appropriate strategies for obtaining the necessary information. The central objective of this proposal is to create software agents that posses reference intelligence --- a limited understanding of complex technical topics, but a very sophisticated understanding of how and where to find high-quality information on the World Wide Web.","title":"Automatic Reference Librarians for the World Wide Web","awardID":"9874759","effectiveDate":"1999-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y811","name":"NIH-DIG LIBRARIES RES & APPLIC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["365925","450900"],"PO":["433760"]},"35690":{"abstract":"9818415<br\/>Paar, Christof<br\/>Worcester Polytechnic Institute<br\/><br\/>Cryptographic Algorithms and Systems on Reconfigurable Hardware<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Public-Key Algorithms on Reconfigurable Hardware,<br\/>- Private-Key Algorithms on Reconfigurable Hardware, and <br\/>- Algorithm-Agile Cryptographic Systems.<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of digital hardware development equipment--workstations, a logic analyzer, a pulse\/data generator, a digital oscilloscope, power supplies, etc. -- by the Department of Electrical and Computer Engineering at Worcester Polytechnic Institute. Cryptography is of central importance for security in information technology systems. Due to the algorithm independent design paradigm of modern security protocols, high flexibility with respect to algorithm choice and algorithm parameters is extremely desirable. At the same time the hardware realization of cryptographic algorithms is highly desirable for performance as well as for physical security reasons. In order to overcome the reduced flexibility of traditional hardware approaches, the implementation of cryptographic alrogithms on reconfigurable hardware (RCHW) is a promising answer. The research conducted through the requested equipment (high-end workstations and a hardware development lab) deals with the detailed investigation and implementation of the cited research using RCHW. The VHDL based designs of full-size public and private-key algorithms pose challenges to existing automated design tools (synthesis and place and route tools) which can only be met with the requested high-end workstations. The physical implementation of algorithm-agile systems, such as high performance prototype boards that allow algorithm switch on the fly, requires modern hardware development tools. The required hardware development equipment includes a logic analyzer, data and functions generators, and digital oscilloscopes.","title":"CISE Research Instrumentation: Cryptographic Algorithms and Systems on Reconfigurable Hardware","awardID":"9818415","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["549951"],"PO":["557609"]},"49143":{"abstract":"","title":"CAREER: An Energy-Subtraction Compton Scatter Camera for Medical Imaging","awardID":"9996121","effectiveDate":"1999-01-04","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["546422"],"PO":["561702"]},"27286":{"abstract":"9731293<br\/>MacDonald<br\/>The National Nanofabrication Users Network (NNUN) was established by NSF in 1994 as a partnership of advanced user facilities providing the national research and development community with access to state-of-the-art micro- and nanofabrication facilities, instrumentation, processes, and expertise. The Network is composed of a consortium of five universities: Cornell University, Stanford University, University of California at Santa Barbara, Howard University, and Pennsylvania State University. The NNUN is supported by the Directorates for Engineering (ENG), Mathematical and Physical Sciences (MPS), Biological Sciences (BIO), and Computer and Information Science and Engineering (CISE).<br\/><br\/>The NNUN's mission is to provide opportunities for the nation's scientists, engineers and educators to move innovative ideas in nano-scale science and technology to the laboratory to develop prototype structures, devices and systems. The network serves a broad and diverse engineering and scientific community in academia, industry and government, and is committed to education, training and technical outreach.<br\/><br\/>The experimental activities carried out at the NNUN facilities impact a wide range of scientific and technical fields including biology, chemistry, physics, electronics, magnetics, superconductivity, materials, MEMS, nanostructures, and optics.<br\/><br\/>The NNUN facilities are hands-on user facilities where researchers, with minimal training, can perform individual state-of-the-art projects with tools otherwise inaccessible to them. Research activities undertaken at NNUN may range in duration from a day or so, to an extended period of time. In some cases, research projects can be undertaken remotely, with NNUN personnel assisting with fabrication processes for network users.<br\/><br\/>Under new 5-year Cooperative Agreements, NNUN will continue to operate as five university nodes and will enhance the capability and infrastructure to support an increasing number of external users in traditional and in emerging new fields that are impacted by micro- and nanofabrication. The NNUN will continue to support and enhance its mission in the integration of research and education through the training of students, outreach activities and topical workshops.<br\/><br\/>The URL is http:\/\/www.nnun.org\/ to obtain information about the National Nanofabrication Users Network.<br\/>***","title":"Renewal Proposal for the National Nanofabrication Users Network","awardID":"9731293","effectiveDate":"1999-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1743","name":"NATIONAL FACILITIES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1978","name":"PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1938","name":"CHEMICAL INSTRUMENTATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1516","name":"RESOURCES & INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1674","name":"NANOSCALE: INTRDISCPL RESRCH T"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1417","name":"CHEMICAL & BIOLOGICAL SEPAR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1788","name":"NANOMANUFACTURING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1108","name":"INSTRUMENTAT & INSTRUMENT DEVP"}}],"PIcoPI":["492139"],"PO":["508629"]},"35592":{"abstract":"9818212<br\/>Boyer, Kim L.<br\/>Flynn, Patrick J.<br\/>The Ohio State University<br\/><br\/>CISE Research Instrumentation: A High-Performance Computing and Imaging Facility for<br\/>Research in Image Understanding and Analysis<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Perceptual Organization and Image Annotation with Machine Learning<br\/>- Advanced Object Recognition: Free-Form Objects and Large Modelbases, and<br\/>- Intelligent Image Compression.<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of high performance computing, data acquisition, and display facilities: several Pentiums, switches, disks, backup tape drives, image analysis workstations, scanners, digital video disk, digital cameras, printers, monitors, etc. The research constitutes a cooperative effort of the Department of Electrical Engineering and the Center for Mapping at Ohio State University. The equipment enables studies in image and video understanding and<br\/>analysis, specifically the research projects cited. Work in computer vision and image analysis is highly computationally intensive, owing to the large datasets and complex algorithms involved. All of this computing activity is sandwiched between the data acquisition (imaging) step and the display or other dissemination of results. The facility will provide a flexible and powerful testbed for the development<br\/>and implementation of distributed algorithms for image and video understanding, based on Bayesian network formalisms, as well as the acquisition of high-quality digital imagery and video. To this end, the facility incorporates a commodity supercomputer (Beowulf cluster) and image analysis workstations with sufficient storage and network bandwidth to handle the demands of image and video processing datasets and algorithms.<br\/>Because many of the applications studied involve high resolution aerial imagery, (near) real-time demands, or motion, this capability and flexibility is crucial. To maximize the utility of the installation, many input sources and image storage facilities, such as digital cameras and camcorders, framestores, satellite digital video receiver, and 3D scanner are included.","title":"CISE Research Instrumentation: A High-Performance Computing and Imaging Facility for Research in Image Understanding and Analysis","awardID":"9818212","effectiveDate":"1999-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["108023","313372",89511],"PO":["301532"]},"37473":{"abstract":"MATLAB has become the most popular rapid prototyping language for<br\/>scientific computing. Highlevel mathematical languages like MATLAB<br\/>dramatically simplify program development. Unfortunately, this<br\/>simplification often has come at the expense of efficient implementation.<br\/>Today, MATLAB programs are usually interpreted on sequential machines.<br\/>Thus, the performance of these programs suffers in comparison with Fortran<br\/>programs compiled on parallel high-performance computers. The objective of<br\/>this project is to develop and evaluate language extensions, run-time<br\/>libraries, and tools for compiling MATLAB and similar interactive languages<br\/>for efficient execution on classes of target machines ranging from<br\/>uniprocessor workstations to highly-parallel distributed systems.<br\/><br\/>The technical thrust of this project is to develop restructuring compiler<br\/>technology that will enable the translation of MATLAB codes into sequential<br\/>or parallel object code that is competitive with handwritten code produced<br\/>by skillful FORTRAN programmers. The work will build on previous work by<br\/>the investigators and will take advantage of existing software modules from<br\/>the Falcon system (developed at Illinois). The compiler will accept<br\/>parallel extensions and will be able to automatically translate sequential<br\/>MATLAB loops into parallel form. The compiler will transform the code to<br\/>enhance locality and generate efficient sparse code from dense<br\/>computations. This transformation is necessary because MATLAB codes usually<br\/>represent sparse computations in dense form. The investigators will also<br\/>consider incorporating some of the compiler modules into the interpreter<br\/>for just-in-time restructuring.","title":"MATLAB Extensions and Compiler Techniques for High-Performance Computing","awardID":"9870687","effectiveDate":"1999-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["533380",94786],"PO":["551992"]},"49166":{"abstract":"","title":"Investigation of the Dixon Resultants","awardID":"9996144","effectiveDate":"1999-01-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["531861"],"PO":["179846"]},"27287":{"abstract":"9731294<br\/>Plummer<br\/>The National Nanofabrication Users Network (NNUN) was established by NSF in 1994 as a partnership of advanced user facilities providing the national research and development community with access to state-of-the-art micro- and nanofabrication facilities, instrumentation, processes, and expertise. The Network is composed of a consortium of five universities: Cornell University, Stanford University, University of California at Santa Barbara, Howard University, and Pennsylvania State University. The NNUN is supported by the Directorates for Engineering (ENG ), Mathematical and Physical Sciences (MPS), Biological Sciences (BIO), and Computer and Information Science and Engineering (CISE).<br\/><br\/>The NNUN's mission is to provide opportunities for the nation's scientists, engineers and educators to move innovative ideas in nano-scale science and technology to the laboratory to develop prototype structures, devices and systems. The network serves a broad and diverse engineering and scientific community in academia, industry and government, and is committed to education, training and technical outreach.<br\/><br\/>The experimental activities carried out at the NNUN facilities impact a wide range of scientific and technical fields including biology, chemistry, physics, electronics, magnetics, superconductivity, materials, MEMS, nanostructures, and optics.<br\/><br\/>The NNUN facilities are hands-on user facilities where researchers, with minimal training, can perform individual state-of-the-art projects with tools otherwise inaccessible to them. Research activities undertaken at NNUN may range in duration from a day or so, to an extended period of time. In some cases, research projects can be undertaken remotely, with NNUN personnel assisting with fabrication processes for network users.<br\/><br\/>Under new 5-year Cooperative Agreements, NNUN will continue to operate as five university nodes and will enhance the capability and infrastructure to support an increasing number of external users in traditional and in emerging new fields that are impacted by micro- and nanofabrication. The NNUN will continue to support and enhance its mission in the integration of research and education through the training of students, outreach activities and topical workshops.<br\/><br\/>The URL is http:\/\/www.nnun.org\/ to obtain information about the National Nanofabrication Users Network.<br\/>***","title":"Renewal Proposal for National Nanofabrication Users Network","awardID":"9731294","effectiveDate":"1999-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1743","name":"NATIONAL FACILITIES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1978","name":"PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1938","name":"CHEMICAL INSTRUMENTATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1516","name":"RESOURCES & INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1674","name":"NANOSCALE: INTRDISCPL RESRCH T"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1417","name":"CHEMICAL & BIOLOGICAL SEPAR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1788","name":"NANOMANUFACTURING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1108","name":"INSTRUMENTAT & INSTRUMENT DEVP"}}],"PIcoPI":["475892","124538"],"PO":["537331"]},"39795":{"abstract":"This is a proposal from American Association for the Advancement of Science (AAAS) to hold a workshop to capture community input and to produce a publicly available report summarizing visions as to the future of NSF's Advanced Network Infrastructure programs following the present vBNS generation. This is an essential part of the NSF planning process and the information gathered and published will be extremely helpful to NSF and the R&E community at large. The Advanced Network Infrastructure program has a number of important constituent groups that should be consulted as a part of a post-vBNS planning activity. These groups include at least the following sectors: university CIOs and administrators, the general science and university research community, the computer and networking science research community, industry, and those involved with the Partnerships for Advanced Computational Infrastructure (PACI). This AAAS proposal will allow us to cover the general science and university research community.","title":"Guidelines for NSF Networking Initiatives in the 21st Century","awardID":"9902033","effectiveDate":"1999-01-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["345426",100908],"PO":["121202"]},"49288":{"abstract":"","title":"Specification and Design Support for Software Evolution","awardID":"9996268","effectiveDate":"1999-01-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["296879"],"PO":["150697"]},"35352":{"abstract":"The goal of this project is to help expert problem solvers find needed information in a large, complex information space. The focus is on one example of expert problem solving; the health care field. Sorting through such a heterogeneous collection of electronic and other media materials to find needed information, sometimes under time duress can be formidable. This project proposes to capture the trace of information used by experts - to monitor the paths taken and collection resources used by, in this case physicians, in moving from observation, to information gathering, to solution of a given health care problem. By capturing the artifactual trace information associated with information seeking and selection, it is hypothesized that greater insight can be gained into behaviors of users and patterns of usage. This knowledge can then be fed-back into the design and development of new information environments. The work will be conducted by a cross-disciplinary team comprised of an MD focusing on information seeking behaviors of physicians, and a group of computer scientists focussing on extracting and using regulary structured information. The usefulness of the approaches will be tested in domains other than health care, in particular the aircraft design industry through the active support of the Boeing Corporation.","title":"Tracking Footprints Through an Information Space: Leveraging the Document Selections of Expert Problem Solvers","awardID":"9817492","effectiveDate":"1999-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y811","name":"NIH-DIG LIBRARIES RES & APPLIC"}}],"PIcoPI":["483300","533018","289873"],"PO":["433760"]},"38443":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 968-102. It provides partial support for two years for an OC-3 connection to the vBNS. Applications include projects in network QoS management, remote robotics control for tele-surgery involving both national and international collaborators; simulation of free fluid dynamics, research in multimedia communications, high energy particle physics, databases in geological and archaeological sciences and distance learning. Collaborating institutions include the Texas A&M, Cornell U, GTE, Bryn Mawr, the Meadows School of the Arts, International Craniofacial Institute in Dallas and the Institute of Neurosurgery N.N. Burdenko in Moscow, Russia.","title":"vBNS Connectivity for Southern Methodist University","awardID":"9876411","effectiveDate":"1999-01-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["410030","502875",97604],"PO":["198445"]},"36420":{"abstract":"EIA-9820471<br\/>Computing Research Association<br\/>Berman, Francine<br\/>Aspray, William<br\/><br\/>Special Project: Travel Support for the CRA-W FCRC ``Super-Mentoring\" Workshop: Atlanta GA <br\/>This grant aims at sponsoring ``super-mentoring'' workshop for FCRC <br\/>'99 which expands the previous (primarily junior and academic) <br\/>mentoring workshop target audience to include women involved in <br\/>research careers at national laboratories and within the industrial <br\/>sector, as well as senior (post-tenure) women who may be beginning to <br\/>deal with impediments to further promotion. The requested support is <br\/>for travel grants for participants and speakers, and support for the <br\/>primary workshop social event. Past experience has shown that the <br\/>travel grants are critical for many women who could not have attended <br\/>otherwise. Based on the comments from women who have attended similar <br\/>workshops organized by the Computing Research Association in the <br\/>past, it is expected that this workshop will serve as a catalyst for <br\/>positive and important changes in participant's lives.","title":"Special Project: Travel Support for CRA-W FCRC Super-Mentoring Workshop, Atlanta, Georgia","awardID":"9820471","effectiveDate":"1999-01-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["562621","208531"],"PO":["430923"]},"49257":{"abstract":"","title":"POWRE: Geometric Computation and Applications","awardID":"9996237","effectiveDate":"1999-01-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["426503"],"PO":["173164"]},"49268":{"abstract":"","title":"The Internet Atlas","awardID":"9996248","effectiveDate":"1999-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["521741",126025],"PO":["182196"]},"35574":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in studying educational outcomes of networked multimedia, networked-based monitoring and fault diagnosis, distributed services telemedicine, interconnecting distributed biological databases to establish a \"virtual computational resource center\"; network-based scheduling and supply chain coordination and networking controls for network edge multimedia appliances. Collaborating institutions include the Jackson Laboratory, the Institute of Genomic Research, Lawrence Livermore National Laboratory, Lawrence Berkeley National Laboratory, Los Alamos National Laboratory, Brookhaven National Laboratory, Oak Ridge National Laboratory, and the National Human Genome Research Institute, the Jefferson Laboratory at the University of Virginia and others.","title":"University of Connecticut's High Performance Connections to the Internet","awardID":"9818174","effectiveDate":"1999-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["526615","554505","147158","356315","554506",89455],"PO":["182196"]},"35354":{"abstract":"An increasing amount of information being transmitted over the Internet isin image form. This trend includes medical images used in diagnosis and research, and other materials for which it is desirable to avoid violations of security and privacy. While privacy and secuity control of textual materials has long been a focus of research activities, images present new and more challenging problems. Filtering of images in addition to text becmes more essential as modern computing and communications facilitates the use of information in image form. This project proposes to provide image filtering capabilities to complement other means of checking the contents of documents. The domain of interest is electronic medical records, but the research products are expected to be generalizable to other domains of interest. The effort will forcus on developing further wavelet-based algorithms for searching medical image databases and retrieving relevant information from multimedia medical databases; extracting textual information from images; advancing practices for the protection of privacy and implementing a security mediator; and exploring WWW interfaces for security mediators.","title":"Image Filtering for Secure Distribution of Medical Information","awardID":"9817511","effectiveDate":"1999-01-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y811","name":"NIH-DIG LIBRARIES RES & APPLIC"}}],"PIcoPI":["370768"],"PO":["564456"]},"49357":{"abstract":"","title":"POWRE: Real-Time Reconfigurable Network Interfaces","awardID":"9996339","effectiveDate":"1999-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":[126227],"PO":["297837"]},"35651":{"abstract":"9818338<br\/>Tripathi, Anand<br\/>Zhang, Zhi-Li<br\/>University of Minnesota - Twin Cities<br\/><br\/>CISE Research Instrumentation: Research in Networked Information Systems<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Scalable and QoS-Aware Multimedia Systems<br\/>- Agent-Based Distributed Computing<br\/>- High Performance Geographic Information Systems, and<br\/>- High Performance Data Mining<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase, consisting mainly of a CISCO Catalyst 5505 network switch, two Sun Enterprise, and various Sun Ultra, by the Department of Computer<br\/>Science and Engineering at the University of Minnesota. This instrumentation will support research in new paradigms, system architectures, and algorithms for network computing involving distributed multimedia systems, mobile Internet agents, geographic information systems (GIS), and data mining and information search over the Internet. The research in distributed multimedia systems is investigating scalable server<br\/>architectures, specification of QoS measures, and mapping of QoS measures to resource allocation and scheduling decisions. The research in agent-based Internet computing focuses on programming abstractions and their underlying mechanisms for secure and robust agent-based computing. Several agent based applications are being investigated by this project, including a multimedia based active mail system. The research activity in GIS is investigating parallelization and other approaches for efficient execution of range query and map overlay operations. This research, together with the activities in distributed multimedia, is addressing QoS problems for the presentation of graphics and images resulting from GIS queries. The research in data mining is investigating parallel algorithms for large data sets obtained from various Internet sites. The synergy among the various activities of these projects is realized through several<br\/>focal-point applications. These applications are related to agent-based multimedia mail system, Digital Earth initiative, and the Sky Survey project.","title":"CISE Research Instrumentation: Research in Networked Information Systems","awardID":"9818338","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["543509","550903","563608","532009","74434"],"PO":["301532"]},"38611":{"abstract":"9876942<br\/>Miller, John<br\/>Murphey, Yi L.<br\/>University of Michigan - Dearborn<br\/><br\/>REU: Undergraduate Research in Advanced Imaging and Intelligent Systems<br\/><br\/>These Research Experiences for Undergraduates (REU) Site project supports nine students per year in programs carried out during the summers, for three years. In addition, two students are supported by the institution, as part of the machine intelligence including image recognition, fuzzy logic and pattern recognition, machine vision, and related areas. There are good recruitment plans and the plan is to have at least 25% of the participants from members of underrepresented groups.<br\/><br\/>Students are chosen on basis of their interests, grades, computer skills and other demonstrated abilities. The research activities are generally applied rather than theoretical and most projects are directed toward real-world applications. Significant institutional support is provided.","title":"REU: Undergraduate Research in Advanced Imaging and Intelligent Systems","awardID":"9876942","effectiveDate":"1999-01-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["462213","462275"],"PO":["329035"]},"36345":{"abstract":"EIA-9820278<br\/>U of CA, Berkeley<br\/>Katz, Randy<br\/><br\/>REU: Summer Undergraduate Program in Engineering Research at Berkeley<br\/><br\/>This Research Experiences for Undergraduates (REU) Site project supports six students per year in programs carried out during the summers for three years. The students work on projects involving new architectural solutions for the converged information and communications networks of the next century. Projects include networking and quality of service, Internet demand, wireless communication, video compression, neural models and language learning, computer-telephony integration and other related areas.<br\/><br\/>Students are matched with faculty and graduate student mentors on the basis of interests. The project recruits students nationwide and the department has a strong tradition of undergraduate participation in research as well as to diversity. The evaluation plan calls for systematic tracking of the REU students and the program's effect on their educational plans after participation.","title":"REU: Summer Undergraduate Program in Engineering Research at Berkeley","awardID":"9820278","effectiveDate":"1999-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["527078",91528,"526900"],"PO":["329035"]},"38347":{"abstract":"Computer simulations and even experimental devices generate more than a<br\/>single variable. These variables typically exhibit complex<br\/>interdependencies which must be thoroughly understood to improve the<br\/>simulation codes and understand the complex systems being studied.<br\/>Unfortunately, cluttering prevents this from being achieved in current<br\/>visualization systems. Users are thus left with generating several<br\/>different representations and mentally merging them together, a nearly<br\/>impossible feat. The goal of this project is to provide new methods that<br\/>will let scientists browse through their terabytes of data searching for<br\/>interesting patterns or irregularities. A secondary component of this<br\/>project is to illustrate the utility of the new technique to the rest of<br\/>the computer graphics industry, including efficient volume rendering for<br\/>objects such as fire, clouds and water. These solutions will bring<br\/>computational scientists one step closer to a seamless environment for<br\/>studying both multiple simulations and complex interactions within a<br\/>simulation.<br\/><br\/><br\/>Technically, the project will investigate new methods for representing<br\/>complex vector fields and multi-dimensional scalar fields defined over a<br\/>three-dimensional mesh topology. A particular emphasis will be on extending<br\/>a direct volume rendering technique known as \"splatting\" to provide<br\/>integrated representations of multiple data variables. (The name comes from<br\/>a step in the method that constructs a footprint or \"splat\" used to project<br\/>3D basis functions onto surface textures.) In particular, this research<br\/>will extend the state-of-the-art in direct volume rendering by developing<br\/>techniques to depict non-homogenous or isotropic volumes. These volume<br\/>textures will be developed along with efficient rendering techniques to<br\/>allow them to reinforce or segregate different regions of a volume,<br\/>control representations of time-varying data, and apply the representations<br\/>to virtual reality settings.","title":"CAREER: Three-Dimensional Volume Visualization of Multi-Variate Data","awardID":"9876022","effectiveDate":"1999-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["196100"],"PO":["551992"]},"35641":{"abstract":"9818320<br\/>Agrawal, Divyakant<br\/>Acharya, Anurag<br\/>University of California at Santa Barbara<br\/><br\/>Scalable Storage Servers for Advanced Information Systems<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Architecture for Rapidly Growing Datasets,<br\/>- A Scalable Distributed Architecture for Locating Heterogeneous Information Sources,<br\/>- Data Placement and Information Access, and <br\/>- Clustering Support for Parallel Digital Library\/Web Servers.<br\/><br\/>To support the aforementioned projects, this award contributes in building an instrumentation infrastructure for conducting experimental research on scalable storage servers at the University of California at Santa Barbara, Computer Science Department. The funds will contribute to the purchase of a cluster of quad-processor Workstations, several single processor PCs, a Fast Ethernet switch and a Fibervault with a large number of FiberChannel disks. This equipment will be dedicated to support research in databases, operating systems, and parallel computing. The equipment will be used for several interrelated research projects, including in particular: evaluation of architectures for rapidly growing datasets, design and implementation of a scalable distributed architecture for locating information, data placement for efficient content-based retrieval and design and implementation of cluster-based servers for digital libraries. Active Disk architectures which integrate significant processing power and memory into a disk drive will be investigated. Data placement and information access techniques on active disks will be explored. A scalable distributed architecture for locating heterogeneous information sources will be developed on the proposed instrumentation infrastructure. Finally, clustering support for parrallel digital library and parallel web servers will be developed. A common theme among the proposed research projects is to provide efficient and scalable support for advanced information systems.","title":"CISE Research Instrumentation: Scalable Storage Servers for Advanced Information Systems","awardID":"9818320","effectiveDate":"1999-01-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["92290","536696","486626","97258",89651],"PO":["301532"]},"35631":{"abstract":"9818299<br\/>Rus, Daniela<br\/>Bruce, Donald<br\/>Dartmouth College<br\/><br\/>CISE Research Instrumentation: Distributed Reconfigurable Robot Systems<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Self-Reconfiguring Robotics<br\/>- Distributed Manipulation with MEMS Devices<br\/>- Distributed Control for Massively Parallel Reconfiguring Robot Systems, and <br\/>- Self-Reconfiguring MEMS Robots<br\/><br\/>This award supports on-going research in the Department of Computer Science at Dartmouth College and contributes to simulation facilities (for design and control) and physical hardware (for robotics experiments). The Department will purchase computing and fabrication equipment which will be dedicated to support the aforementioned projects: Stratasys system, workstations, MotionStar motion capture system, etc. The goal of this research project is to build self-reconfiguring robotics systems at the mini and MEMS scale, and to develop a science-based for planning and controlling highly distributed reconfigurable robot systems. Mini and MEMS self-configuring robots that employ the principles of self-organization and self-assembly to combine structure with function will be designed and built. The equipment will be used for the research mentioned, including in particular: (1) developing self-configuring mini-robot systems; (2) developing massively parallel control algorithms for MEMS devices; (3) developing novel algorithms for distributed control of massively parallel reconfiguring robot systems; and (4) combining the results on massively-parallel micro-fabricated MEMS actuators and self-reconfiguring systems to design, fabricate, control and program self-reconfiguring micro-robot systems, built using MEMS technology. These advances in reconfigurable robotics science will greatly enhance the capabilities of distributed robot systems.","title":"CISE Research Instrumentation: Distributed Reconfigurable Robot Systems","awardID":"9818299","effectiveDate":"1999-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["213293","527733"],"PO":["301532"]},"35653":{"abstract":"9818342<br\/>Chiueh, Tzi-Cker<br\/>Kaufman, Arie<br\/>State University of New York at Stony Brook<br\/><br\/>SAMSON--Scalable Active Memory Server on the Net<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Computer Systems Research,<br\/>- XSB Tabled Logic Programming,<br\/>- Formal Verification and Model Checking, and<br\/>- Graphics.<br\/><br\/>The SAMSON project aims to build up a cluster-based network memory server. Thus, to support the aforementioned projects, this award contributes to the purchase of several Compaq Alpha machines connected by four 8-port 1.2 Gigabit\/sec Myrinet switches, with 21 GBytes of main memory and 110 GBytes of disk space. The software platform consists of the Linux operating system, the message passing library for Myrinet hardware, and a basic network paging subsystem. Four research groups in the Computer Science<br\/>Department at the State University of New York-Stony Brook will benefit from the massive amount of memory in the SAMSON server. 1. The Systems group will use SAMSON to develop advanced network memory services such as application-specific storage management, as well as to gather access characteristics of memory-intensive applications. 2. The Formal Verification group will use SAMSON to re-examine space\/time tradeoffs in new and existing verification algorithms. 3. The XSB group will exploit the memory in SAMSON to further the advances of tabling techniques in Logic Programming. 4. The Graphics\/Visualization group will investigate the interaction of multi-resolution rendering with the memory hierarchy in SAMSON. With SAMSON, the researchers will have access to an order of magnitude, more physical memory than is currently available, and will be able to experiment with regions of the design space that were not possible previously.","title":"CISE Research Instrumentation: SAMSON--Scalable Active Memory Server on the Net","awardID":"9818342","effectiveDate":"1999-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["123463",89698,"451745","124818","518366","541908","202714","477226","509519"],"PO":["557609"]},"37777":{"abstract":"Simulations of fluid dynamics, such as the flow of air over an airplane<br\/>wing, are vital for understanding the fluids, but cannot be computed fast<br\/>enough for humans to interact with the simulation. This project will<br\/>develop an efficient, accurate, integrated environment for the simulation,<br\/>visualization, and analysis of time-dependent turbulent flow fields using<br\/>advanced physical and numerical models. The investigators will create<br\/>low-order (relatively cheap and fast) approximations to an existing<br\/>Navier-Stokes code, and use the approximations to provide interactive<br\/>explorations of the simulation database while the main code continues to<br\/>run. They will also add a graphical user interface to the existing code to<br\/>allow remote visualization. The key subtasks in this process will include:<br\/><br\/>* Developing physically-based models, called surrogate models, of the<br\/>compressible Navier-Stokes equations that sharply reduce the cost of the<br\/>simulation yet capture the dominant flow structures.<br\/><br\/>* Using the surrogate models to visualize particle paths, streaklines, and<br\/>pathlines interactively while the full simulation continues.<br\/><br\/>* Using the flow features to assess the error of the surrogate models.<br\/><br\/>* Developing efficient parallel algorithms for the surrogates, and<br\/>assessing more advanced strategies for incrementally constructing and<br\/>adapting them to simulation data.","title":"Interactive Concurrent Visualization of Unsteady Flows on Parallel Architectures","awardID":"9872140","effectiveDate":"1999-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["370318"],"PO":["551992"]},"37898":{"abstract":"Doerschuck<br\/>The resolution of many important questions in science, engineering, and operations research requires the solution of a global optimization problem. The objective of this research is to apply state-of the art methodology in global optimization to several hard problems of scientific or engineering interest, and to develop, analyze, and implement new methodology which is capable of achieving a new level of performance on these and other complex applications.<br\/><br\/>This project will focus on three areas: 1) structural biology problems, especially 3D virus reconstructions from x-ray scattering and cryo-electron microscopy data, 2) pattern classification for seismic oil exploration problems, and 3) system design and evaluation for nonlinear satellite communications links. These problems exhibit cost functions with multiple local minima and a wide variety of characteristics which complicate their optimization, including: a) cost functions that are driven by data that has a multi-scale structure, b) cost functions that are computed analytically but at great expense, c) cost functions that are computed by simulation or by a combination of analytical formulas and simulation (so-called semi-analytical simulation), and d) cost functions that are driven by changing data, where the global minimum must be tracked, possibly in real time.<br\/><br\/>The first part of the work involves applying current global random search algorithms to get a baseline for the performance and computational characteristics of these methods which have not been studied extensively in the problem areas described above. The second part of the work will involve developing and analyzing algorithms with improved efficiency. <br\/><br\/>Much of the practicality of global optimization stems from the extraordinary (and still growing) computation resources that are now available. The most cost-effective resources are clusters of off-the-shelf computers. This research group has access to a leading edge machine of this type. Because local searches and simulations can be carried out in parallel with minimal communication overhead, the algorithms to be developed here are ideal candidates for implementation on such computers. Implementation efforts will be focused in this direction.","title":"KDI: Global Adaptive Optimization for Structural Biology anand Other Complex Signal Reconstruction, Pattern Recognition and System Design Problems","awardID":"9873139","effectiveDate":"1999-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"8876","name":"KDI OPPORTUNITY FUND"}}],"PIcoPI":["226023","518003"],"PO":["564395"]},"35654":{"abstract":"9818344<br\/>Thompson, William B.<br\/>Cohen, Elaine<br\/>Utah University<br\/><br\/>Realistic Computer Graphics<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Locomotion Interfaces,<br\/>- Virtual Prototyping,<br\/>- Perception of Spatial Organization in Large-Scale Synthetic Environments, and<br\/>- Realistic Computer Graphics for Natural Scenes.<br\/><br\/>The award supports the acquistion of a system for generating and projecting high quality computer graphics. The equipment supports research projects involving immersive interfaces and realistic computer graphics. Four projects are taking advantage of this resource. Improved locomotion interfaces are being developed, allowing a user to walk through a virtual environment. Work on haptic interfaces for computer aided design (CAD) is being extended, with particular attention to the integration of visual and haptic displays to better convey a sense of the complex geometries involved in most mechanical designs. Methods are being developed for more accurately conveying a sense of distance, scale, and speed in computer generated imagery. Because current techniques have great difficulty producing images of objects which appear to be far away and\/or of significant size this important work may contribute to the field. Finally, an analysis of how to generate realistic looking synthetic images of outdoor scenes is being initiated. To be successful, all four of these efforts require the graphical rendering power and high resolution display capabilities being made available as part of this infrastructure acquisition.","title":"CISE Research Instrumentation: Realistic Computer Graphics","awardID":"9818344","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["560997"],"PO":["301532"]},"39978":{"abstract":"This is a proposal from Corporation for National Research to hold a workshop to capture community input and to produce a publicly available report summarizing visions as to the future of NSF's Advanced Network Infrastructure programs following the present vBNS generation. This is an essential part of the NSF planning process and the information gathered and published will be extremely helpful to NSF and the R&E community at large. The Advanced Network Infrastructure program has a number of important constituent groups that should be consulted as a part of a post-vBNS planning activity. These groups include at least the following sectors: university CIOs and administrators, the general science and university research community, the computer and networking science research community, industry, and those involved with the Partnerships for Advanced Computational Infrastructure (PACI). This Corporation for National Research proposal will allow us to cover the industry community.","title":"Industry Workshop on Requirements and Opportunities for Advanced Networking Research","awardID":"9902758","effectiveDate":"1999-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["298189"],"PO":["121202"]},"37889":{"abstract":"This is a three-year standard award. Recent advances in computing and telecommunications may have as much impact on multidisciplinary collaboration in science and industry as those technologies have had within business organizations and households. For instance, global networks make it possible to create project teams whose members include biologists, medical scientists, and managers in pharmaceutical firms. These changes may benefit from a better understanding of the requirements for successful multidisciplinary work, which often faces problems of both geographic and functional distance. Functional distance is a theoretical construct referring to a variety of cultural barriers to collaboration created by differences in norms, practices, and languages of differing disciplines or professions. This research will examine collaborations within and among disciplines using a variety of research strategies (e.g. interviews, citation analyses). A series of experiments will test hypotheses about the role of geographic and functional distance in the appropriation of ideas, privacy, attribution of credit, and productivity of collaborative projects. Finally, the PIs will develop and evaluate new computer applications for creating and supporting multidisciplinary collaborations. This research tackles a range of theoretical problems in the fields of social psychology, sociology, anthropology, and computer science. It will be important to science policy in describing how scientists organize their work in response to new technology, and more generally, in specifying the kinds of technology and management techniques that are required for successful teamwork and collaboration across time, space, and professional cultures and conditions. It will also aid in understanding how multidisciplinary work affects career patterns of scientists and professionals. Finally, the research will result in the development and test of usable computer-mediated communication technologies that help create and support collaborations.","title":"KDI: Multidisciplinary Collaboration","awardID":"9872996","effectiveDate":"1999-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8815","name":"Studies of Policy Sci Eng Tech"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8876","name":"KDI OPPORTUNITY FUND"}}],"PIcoPI":["228096","518945","519226"],"PO":["495796"]},"35634":{"abstract":"9818308<br\/>Singh, Jaswinder Pal<br\/>Ostriker, Jeremiah<br\/>Princeton University<br\/><br\/>Applications and Programming Environments for Cache-Coherent Distributed Memory Machines<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Parallel Applications and Programming Environments for Computational Cosmology on Cache-Coherent DSM Architectures,<br\/>- Parallel Applications and Programming Environments for Computational Protein Structure Determination on Cache-Coherent DSM Architectures, and<br\/>- Parallel Workload for System Evaluation and their Implications for Software and Hardware.<br\/>To support integrated application-driven research in the aforementioned projects, this award contributes to the purchase of an upgrade to an existing 64-processor SGI Origin2000 multiprocessor by the Departments of Computer Science and Astrophysics together with the Princeton Plasma Physics Laboratory at Princeton University. The equipment will be used to continue and enhance the research projects listed and to support new projects between computer science and the Plasma Physics Laboratory. The first project, a collaboration between Computer Science and Astrophysics, deals with problems particularly challenging for parallel implementation due to the combination of interacting models and a highly irregular dynamic nature. The goals are to develop parallel algorithms and implementations for a range of computations, to develop generalizable and portable techniques preserving locality while providing load balance, to extend existing parallel languages; use runtime systems of these languages, to build libraries of partitioning techniques and<br\/>algorithms. The second project, a collaboration between CS and the School of Medicine at Stanford University, with similar goals, simulates inherently slow processes in structural biology. The last project will broaden the set of workloads available. The SPLASH suites of parallel applications in critical emerging application areas serve as benchmarks for architectural studies, as well as testbeds for programming languages and compilers.","title":"CISE Research Instrumentation: Applications and Programming Environments for Cache-Coherent Distributed Memory Machines","awardID":"9818308","effectiveDate":"1999-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["462746","462748","491962"],"PO":["301532"]},"35536":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 968-102. It provides partial support for two years for an OC-3 connection to the vBNS. Applications include projects in remote NMR studies, modeling of problems in mathematical sciences, data base design, acquisition, modeling and visualization; management of primary care at satellite centers, MPEG2 distance leaning technology, and static and dynamic physical propoerties of polymers using visualization methodology. Collaborating institutions include: NASA-Lewis, OARnet, Ohio SuperComputer Center, Texas Tech University, Purdue University, Medina County Schools, University of Delaware, University of Wisconsin, Madison and others.","title":"High Performance Connection to vBNS","awardID":"9818075","effectiveDate":"1999-01-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["483444",89349,"402233",89351,"539994","416891"],"PO":["198445"]},"35657":{"abstract":"9818356<br\/>Petropulu, Athina P.<br\/>Maja, Bystrom<br\/>Drexel University<br\/><br\/>CISE Research Instrumentation: Wireless Networks for Delivery of Multimedia Services<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Channel Equalization \/ Multipath Mitigation<br\/>- Efficient Transmission Schemes for Low Bitrate Transport of Digital Video over Wireless Channels, and<br\/>- Interference Rejection in Direct Sequence Spread Spectrum Communications.<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of equipment by the Department of Electrical and Computer Engineering at Drexel University for research in the area of delivery of multimedia services over wireless networks. The facility to be implemented consists of one mobile base receiver station and three mobile transmitters. Its goal is to create a realistic wireless communications environment by providing remote, multi-point signal transmission of various formats such as voice, video, and data, as well as providing for signal reception and analysis. The proposed testbed will be used to evaluate spread-spectrum and mobile system models, as well as to implement and evaluate current<br\/>algorithms developed by the PI's for wireless communications. Examples of the areas under development are: Channel equalization\/multipath mitigation, code development, rate allocation and service guarantees for spread spectrum systems, and interference rejection in direct sequence spread spectrum communications. The research projects listed above involve two faculty from Drexel University and one faculty from Villanova University. In addition to promoting research, the proposed facility will enhance the education and training of both graduate and undergraduate students. Furthermore, it will initiate collaboration between both faculty and students of Drexel and Villanova Universities.","title":"CISE Research Instrumentation: Wireless Networks for Delivery of Multimedia Services","awardID":"9818356","effectiveDate":"1999-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["435023","526916","208545"],"PO":["301532"]},"37913":{"abstract":"The ability to speak and understand language is probably the most intricate skill that people possess. It is certainly our most uniquely human ability. This project investigates how such an important skill is acquired and continues to develop throughout our lives. The resulting research findings will have applications in three areas: (1) the design of computer systems that can recognize and produce language, (2) the teaching of language skills, including reading, writing, and foreign language learning, and (3) the remediation of language disorders such as aphasia and dyslexia. <br\/><br\/> The skills of language production and comprehension together comprise the language processing system, a complex system within the brain that turns thoughts into grammatical sequences of words and then articulates those words, and also understands the speech of others. The central claim of this project is that the language processing system is constantly changing. It adapts quickly to recent experience, while continuing to reflect the accumulated experience of a lifetime of speaking, listening, reading, and writing. Such adaptation, or learning, which usually occurs without any awareness, enables us to speak and comprehend effortlessly in the face of ever-changing situations. This perspective leads to two key research questions: (1) What learning mechanisms enable the language processing system to adapt swiftly and effectively to experience? (2) How can the study of learning tell us more about how the language processing system works?<br\/><br\/> The current project addresses these questions by investigating the comprehension and production of individual words as well as words combined into sentences. The research is multi-disciplinary, integrating the work of psychologists, linguists, and computer scientists. It involves experiments that measure how the abilities to speak and understand change with experience. For example, one set of experiments will determine how quickly children and adults can recognize a spoken word, as a function of how recently they have heard or said the same word before. More generally, the project's experiments involve measurement of the time it takes people to say or to recognize words, the kinds of errors that commonly occur during speech, and the patterns of eye movements and brain electrical activity that accompany word and sentence comprehension. The research is carried out on normal adults and children, and also on individuals with brain damage affecting their abilities to learn skills. The experimental work is combined with the development of computer models of the language processor that are capable of learning. These models, some of which will consist of artificial neural networks, will serve two functions. First, the models will instantiate theories of how people process language, and second, the models will offer insights into how machines can be designed to interact with people through language and speech.","title":"KDI: The Role of Experience in Language Processing","awardID":"9873450","effectiveDate":"1999-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["389587",96403,96404,"312643","537717"],"PO":["209752"]},"37924":{"abstract":"9873520<br\/>Bransford<br\/><br\/>This project combines insights from recent work in computer science, psychology and education to create and study \"teachable agent\" (TA) environments in mathematics and science that are motivating to students, intuitive to teachers and parents, and lead to high degrees of student learning. The hallmark of these environments is that students learn by instructing \"teachable agents\" who then venture forth in simulation-based exploratory environments and attempt to solve problems that require knowledge relevant to the disciplines of mathematics or science. If the agents have been taught properly they solve the problems; otherwise they need to be educated further. The simulation-based environments are carefully designed to focus attention on important concepts in science and mathematics, and to make explicit the errors that occur during problem solving. Students \"scout\" the problem solving requirements of various environments before attempting to teach their agents. Additional help and coaching agents are available to point students in the right direction when they make errors or produce sub-optimal solutions. The focus of the TA environments is on learning standards-based content in science and mathematics, not on learning to program.<br\/><br\/>One key issue to be studied is how student learning is affected by opportunities to teach agents to prepare for particular sets of challenges. Also to be studied is how learning is influenced by the design of systems that vary in the degree to which they let students (a) \"scout\" to find problems that arise in the agents' environments; (b) teach the agents with different representations and techniques; (c) measure the successfulness of their teaching by placing their agents in mini-assessment environments prior to engaging them in full-blown \"challenge environments\"; (d) receive different degrees and forms of feedback when their agents encounter difficulties; and (e) educate the personality, as well as the knowledge variables, relevant to learning, problem solving and collaboration.<br\/><br\/>The project requires contributions from, and has important implications for, at least three disciplines: computer science, psychology, and education. The project has the potential to create new forms of assessment, and to transform popular video technologies into environments that help students learn important content. The quality and impact of the project will be enhanced through its association with the NSF-funded Center for Innovative Learning Technologies (CILT), whose mission is to foster collaboration among members of the education and technology community.","title":"KDI: Teachable Agents: Computer Environments for Supporting High Achievement in Science and Mathematics","awardID":"9873520","effectiveDate":"1999-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}}],"PIcoPI":["533534","536406","556816"],"PO":["564318"]},"35647":{"abstract":"9818332<br\/>Jaynes, Christopher<br\/>Seales, Brent<br\/>University of Kentucky<br\/><br\/>Video Analysis and Reconstruction in a Distributed Environment<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Video Analysis and Sensor Control in Distributed Heterogeneous Networks,<br\/>- Automatic Site Model Acquisition and Reconstruction,<br\/>- Real-Time Synthetic Environment Visualization and User-Guided Error Correction, and<br\/>- Real-Time Depth Warping for Unstructured Visualization Environments.<br\/><br\/>This award supports on-going research in the Department of Computer Science at the University of Kentucky and contributes to the purchase of three components: Active-Control Stereo Vision Sensor Platform, High Performance Image Processing Compute Server, and a Real-Time Visualization Environment. The video analysis and reconstruction project seeks to develop distributed real-time approaches to large-scale video and image based problems. The project utilizes three component platforms connected by a high-speed computer network: an active sensor platform, a distributed high performance computing environment, and a flexible real-time display system. The overall goal of sensing, reconstructing, and visualizing an environment in real-time leads to several specific problems that require the use of one or more of the platforms. The active sensor platform allows investigation of sensor control and issues in the compression and communication of large-scale image data. Typically, datasets may contain thousands of images of a complex environment. A high-performance computing platform, in conjunction with sophisticated computer vision algorithms, is necessary for the reconstruction of these environments in real-time. The flexible<br\/>display system enables research in the visualization of synthetic environments. Sophisticated user interaction with the model can lead to model improvement by the communication of user-indicated errors from the visualization platform to the sensor platform for the acquisition of new data, or to the compute server, for reprocessing of the data in light of the new information. This real-time interaction between platforms is facilitated via the high-speed network.","title":"CISE Research Instrumentation: Video Analysis and Reconstruction in a Distributed Environment","awardID":"9818332","effectiveDate":"1999-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["530999","494196","359059"],"PO":["301532"]},"35714":{"abstract":"9818489<br\/>Skjellum, Anthony<br\/>Hodges, Julia<br\/>Mississippi State University<br\/><br\/>A Gigabit\/s, VIA-Enabled Cluster Architecture for Research in High<br\/>Performance Systems Software, Scalable Knowledge Discovery, Visualization,<br\/>and Parallel Planning under Uncertainty<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Multi-Grain Parallel Processing,<br\/>- Scalable Knowledge Discovery,<br\/>- Parallel Volume Visualization for Computational Field Simulation, and<br\/>- Parallel Processing for Markov Model Planning.<br\/><br\/>Concurrency is an important enabling technology for several areas of computational science, unlocking the potential for new science. This research instrumentation proposal brings together three innovative<br\/>computational activities together with a fourth research activity that enhances the capability and understanding of parallel processing environments, notations, and services. Six investigators at Mississippi<br\/>State University, Department of Computer Science, undertake the following projects: enhanced infrastructure for multi-grain parallel processing (including extensions to MPI, MPI-2, and MPI\/RT), scalable knowledge<br\/>discovery (artificial intelligence plus high performance computing to achieve automatic document classification and unsupervised learning algorithms), parallel volume visualization for computational field<br\/>simulation, and parallel processing for Markov Model Planning (study of fast algorithms for exact solutions to planning under uncertainty). To achieve this new science, a parallel processing cluster, consisting of thirty, two-way SMP Pentium II systems is to be assembled, together with multiple high speed networks, one of which supports the Virtual Interface Architecture for low processor overhead and high bandwidth. Commercial-grade message passing software (MPI) and scheduling software are used to provide a production environment under Windows NT immediately, in complement to the research experiments involving parallel processing that further enable the environment over time, including part-time Linux-based operation.","title":"A Gigabits\/s, VIA-Enabled Cluster Arch. for Res. in High Performance Systems Software, Scalable Knowledge Discovery, Visualization, and Parallel Planning under Uncertainty","awardID":"9818489","effectiveDate":"1999-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[89862,"425802","425803","473694","527384","475211","39192"],"PO":["301532"]},"35638":{"abstract":"9818315<br\/>Liu, Hui<br\/>Azizoglu, Murat<br\/>University of Washington<br\/><br\/>CISE Research Instrumentation: A Broadband Software Radio Testbed for Research in Wireless Communications<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Wireless Laboratory Enhancement,<br\/>- DSP Solutions for Low Complexity Multi-User Detectors, and<br\/>- Bit-Interleaved Coded Modulation for Wireless Data Network.<br\/><br\/>To support the aforementioned projects, the Department of Electrical<br\/>Engineering at the University of Washington will purchase microware testing<br\/>equipment and computing facilities for upgrading an existing wireless<br\/>communication laboratory. The equipment is used to set up a broadband<br\/>software radio testbed which consists of a multichannel RF transceiver<br\/>module, a multiple broadband data acquisition system (>10Ms\/c\/s), an<br\/>arbitrary RF signal generator, and a wireless channel fading simulator. The<br\/>new testbed enables experimental research in the areas of broadband<br\/>multiple-access, multiuser detection, time\/space diversity combining,<br\/>wireless networking, as well as other potential multidisciplinary research<br\/>related to personal communication services (PCS). Both the quality and<br\/>scope of on-going and future research in wireless technology is enhanced<br\/>by the proposed instrumentation. Anticipated impacts of this project<br\/>include larger capacity, better interference and fading resistance, and<br\/>higher power efficiency and system flexibility for wireless systems.","title":"CISE Research Instrumentation: A Broadband Software Radio Testbed for Research in Wireless Communications","awardID":"9818315","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["119553","52879","529904","134296"],"PO":["301532"]},"35649":{"abstract":"9818335<br\/>Wesley, Leonard P.<br\/>Duda, Richard O<br\/>San Jose State University<br\/><br\/><br\/>Agent-Based Research and Applications<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Development Environment for Intelligent Agents,<br\/>- Binaural Localization and Interpretation of Sound Sources,<br\/>- Component Embeddable and Distributed Agents for Computer Integrated Manufacturing (CIM), and<br\/>- Agent-Based Multi-Media Distance Learning for CIM.<br\/><br\/>This award supports on-going research in the Department(s) of Computer, Information and Systems Engineering (CISE) and Electrical Engineering (EE) at San Jose State University and contributes to the purchase of an E450 server tower, two Pentium II, and a Fiber channel disk. The objectives of the proposed four R&D projects include; (1) extending real-time object-oriented agent development system (ROADS) to allow users to specify their particular agent language using Abadi and Cardelli's object-oriented language model, (2) building ROADS agents for multi-sensor integration of sonar-localization, laser range-finding, and image data for mobile robot navigation and planning using the belief function and fuzzy logic calculi, (3) real-time binaural localization of multiple sources by clustering the spatial location of estimates from cepstral analyses and interaural time differences in multiple frequency bands, (4) building scalable multimedia servers and distance learning agents by applying system and content information in load balancing, data striping, and data recovery, (5) building agents that can control manufacturing processes and adapt to decentralized, evolving, and concurrent environments by representing diverse CIM knowledge and exploiting the ability to readily re-deploy ROADS agents.","title":"CISE Research Instrumentation: Agent-Based Research and Applications","awardID":"9818335","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["151490",89679,89680,89681],"PO":["557609"]},"35628":{"abstract":"9818289<br\/>Zhang, Aidong<br\/>Srihari, Rohini K.<br\/>State University of New York at Buffalo<br\/><br\/>CISE Research Infrastructure: Experimental Infrastructure for Indexing, Retrieval, and Robost Presentation of Multimedia Data<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Consistent and Robust Retrieval, Transmission and Presentation of Multimedia Data<br\/>- Multimedia Image annotation, Indexing and Retrieval, and <br\/>- Multidimensional Data Mining and Applications in Large-Scale Multimedia Databases<br\/><br\/>This research instrumentation grant contributes to the purchase of a high performance storage system to establish an experimental infrastructure for conducting research on multimedia information management and retrieval. The requested instrumentation enables three projects which require high-capacity machines with large memory and huge disk space: supporting customized multimedia presentations in distributed environments; multimedia data annotation, indexing and retrieval; and data mining and applications in large-scale multimedia databases. The first project establishes an underlying framework and develops techniques for ensuring consistent and robust retrieval, transmission and presentation of multimedia data. Experimental research will be conducted on concurrent presentations of heterogeneous multimedia data, robust end-to-end transmission protocols, incorporation of user interactions and delay effects in synchronizing strategies. The second project investigates the integration of text and photographic information in both the indexing and retrieval stages of a large-scale picture retrieval system. Experimental analysis will be conducted to demonstrate the utility of these techniques. The third project investigates multi-resolution clustering approaches on vast amount of multi-dimensional data generated from real-life images. The peformance of the clustering approaches will be studied and the effectiveness of these approaches will be demonstrated through different types of distributions of data.","title":"CISE Research Instrumentation: Experimental Infrastructure for Indexing, Retrieval and Robust Presentation of Multimedia Data","awardID":"9818289","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["518277","225944"],"PO":["301532"]},"35639":{"abstract":"9818316<br\/>Shenai, Krishna<br\/>University of Illinois at Chicago (UIC)<br\/><br\/>CISE Research Instrumentation: Experimental Prototyping of RF Low-Power Microsystems<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Computer Aided Design (CAD) Tools and Modeling of Low-Power RF Devices and Technologies,<br\/>- Circuits and Architectures of Low-Power RF Microsystems,<br\/>- RF CMOS Technology Development and Optimization, and<br\/>- Application of Electronic Visualization (EV) and Virtual Reality (VR).<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of a probe station, a precision parameter analyzer, DD system power supply, a test system, and mixed-signal test systems by the Department of Electrical Engineering and Computer Science at the University of Illinois-Chicago.<br\/><br\/>The equipment requested in this project will enable fundamental and applied research in RF microsystems for communications and logic. First, at the technology level, is the need for improved device characterization and<br\/>modeling. Existing digital models sacrifice small-signal accuracy and require extensive curve-fitting in parameter extraction. Our approach applies parameter techniques to account for reflections and interconnect parasitics. In optimizing and developing devices in the deep submicron regime, the resolution of the HP 4156B is necessary. Second, at the systems level, increasing mixed-signal functional integration is posing challenges to signal integrity, with noise contributions occurring in interconnects, the substrate, and within devices. Detection of these picosecond transients requires equipment with a wide bandwidth and low noise. The combination of the E2900A as a stimulus source and the 54616TC as a monitor will enable<br\/>real-time detection of signal degradation. HP power supplies will provide extremely clean biasing for sub-1V device operation. The Cascade Summit RF probe station is the foundation of the test environment, enabling on-wafer measurement of device characteristics and signal integrity, free from package parasitics. The HP-IB interfaces will automate the measurement process for more efficient use of the equipment.","title":"CISE Research Instrumentation: Instrumentation for Experimental Prototyping of RF Low-Power Microsystems","awardID":"9818316","effectiveDate":"1999-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["396971"],"PO":["557609"]},"44913":{"abstract":"This is a proposal from the University of California San Diego to hold a workshop to capture community input and to produce a publicly available report summarizing visions as to the future of NSF's Advanced Network Infrastructure programs following the present vBNS generation. This is an essential part of the NSF planning process and the information gathered and published will be extremely helpful to NSF and the R&E community at large. The Advanced Network Infrastructure program has a number of important constituent groups that should be consulted as a part of a post-vBNS planning activity. These groups include at least the following sectors: university CIOs and administrators, the general science and university research community, the computer and networking science research community, industry, and those involved with the Partnerships for Advanced Computational Infrastructure (PACI). This University of California, San Diego proposal will allow us to cover the computer and networking science research community.","title":"Workshop on the Post- vBNS Computing Research Agenda; January 12-14, 1999; San Diego, CA","awardID":"9972562","effectiveDate":"1999-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["288449"],"PO":["121202"]},"40469":{"abstract":"EIA - 9904324<br\/>Gallagher, William<br\/>Society for Computer Simulation<br\/><br\/>SPECIAL PROJECT: INTERNATIONAL CONFERENCE ON VIRTUAL WORLDS <br\/>AND SIMULATION<br\/><br\/>Over the last four years, new advances have been made in creating collaborative Virtual places, popular with both intelligent agents and human players. These virtual worlds make use of simulations to create the collaborative environment or virtual world, along with its objects and agents. New applications of these technologies are appearing in fields as diverse as business, manufacturing and design, medicine, education, and training. This award provides support for university attendance at a conference to exchange new ideas for advancing the use of virtual worlds in different fields of application.","title":"Special Project: International Conference on Virtual Worlds and Simulation; San Francisco, California, January 18 - 20, 1999","awardID":"9904324","effectiveDate":"1999-01-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["332121"],"PO":["564181"]},"44914":{"abstract":"This is a proposal from the University of California, San Diego to hold a workshop to capture community input and to produce a publicly available report summarizing visions as to the future of NSF's Advanced Network Infrastructure programs following the present vBNS generation. This is an essential part of the NSF planning process and the information gathered and published will be extremely helpful to NSF and the R&E community at large. The Advanced Network Infrastructure program has a number of important constituent groups that should be consulted as a part of a post-vBNS planning activity. These groups include at least the following sectors: university CIOs and administrators, the general science and university research community, the computer and networking science research community, industry, and those involved with the Partnerships for Advanced Computational Infrastructure (PACI). This University of California, San Diego proposal will allow us to cover the PACI initiatives.","title":"Workshop on the Post-vBNS Program for PACI; February 17-19, 1999; San Diego, CA","awardID":"9972563","effectiveDate":"1999-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["288449"],"PO":["121202"]}}