{"61309":{"abstract":"Georgios Giannakis<br\/>Title: \"Chip_interleaved Block-Spread Code Division Multiple Access\"<br\/>CCR-0105612<br\/><br\/>With the demand for higher data rates and wireless services rising as fast as the Internet permeated our lives, the need to cope with the idiosyncrasies of the shared wireless medium increases along with the challenges : multi-user interference (MUI), fading propagation effects, mobility-induced impairments, and high-performance telecommunication systems that are also bandwidth- and power-efficient. Today's Code-Division Multiple Access (CDMA) relies on long aperiodic pseudo-noise codes and strict power control to suppress MUI. On the other hand, CDMA proposals with symbol-periodic short spreading codes relax the need for power control at the expense of high-complexity MUI cancellation which is less affordable at the mobile unit in the downlink. But also in the uplink, the frequency-selective fading that asynchronous high-rate transmissions experience as they propagate through multipath-rich channels, degrades performance unless bandwidth is sacrificed. <br\/><br\/>The CDMA system of this grant relies on the novel idea of spreading a block of symbols with long, yet structured and deterministic, user codes. Our block-spread transmissions can be viewed as (and are implemented by) chip-interleaving of symbols spread by short codes. The attractive features of the resulting <br\/>Chip-Interleaved Block-Spread (CIBS) CDMA system: i)flexibility to revert as block-spread TDMA, FDMA, Direct-Sequence-, or, Multicarrier-CDMA; ii)power- and bandwidth-efficiency; iii)MUI avoidance by-design; iv)full-multipath diversity and no loss of optimality with matched-filter reception; and v)low-complexity. Basic research directions include: performance analysis and comparisons with competing alternatives in terms of capacity and bit error rates; mobility studies and development of timing-offset, <br\/>carrier-frequency offset and channel estimation algorithms for acquisition and tracking; incorporation of multiple antennas to enhance diversity with space-time coding gains; investigation of optimal precoding, power-and-bit loading and adaptive modulation; and study of cellular system-level issues.","title":"Chip-Interleaved Block-Spread Code Division Multiple Access","awardID":"0105612","effectiveDate":"2001-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["564051"],"PO":["564898"]},"59380":{"abstract":"The Internet and wireless communication explosion increase the demand for privacy, authentication and security in general. Encryption is not only added to PC's and Internet routers. There is a whole new class of embedded applications that requires high levels of security at low power. Examples are smart cards, cell phones, PDA's, sensor networks, etc. The current approach is to build an ASIC library of so-called IP (Intellectual Property) modules, each implementing one algorithm: DES, triple DES, RSA, SHA-1, and so on. Due to the increased demand for security, there is also a proliferation of encryption algorithms. Examples are the new AES standard, the Camellia initiative of the Japanese NTT, Kasumi for 3th generation cellular standards, IPSEC, etc. So this IP approach can no longer be sustained. <br\/>Therefore, the focus of this research is the design of new fast, low power encryption platforms that at the same time can easily be reprogrammed and reconfigured. On top of this, cryptographic implementations need to withstand power and timing attacks. To withstand these attacks, the execution time and the power consumption has to be independent of the data or the key. This is in contradiction with low power or high speed implementation techniques. The VLSI design methodology to build these processors covers different levels of abstraction. At the circuit level, new circuit styles are developed that withstand power and timing attacks. At the interconnect level a novel RF on-chip wireless LAN technique is integrated. At the architecture level, reconfigurable data path modules are designed which execute the unusual arithmetic of encryption algorithms.","title":"Vlsi Design Methods for Low Power Embedded Encryption","awardID":"0098361","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["293104"],"PO":["562984"]},"59381":{"abstract":"The use of persistent RAM in consumer products has increased its capacity and decreased its price. These trends suggest that typical computers could contain large quantities of this kind of memory in the near future. This project will investigate how to change operating system design for workstation and server machines to make best use of the availability of large quantities of persistent RAM. In particular, the project will investigate the use of persistent RAM for a machine's primary stable storage, replacing hard disks. The project will perform a test design and implementation to demonstrate the feasibility of the concept and to suggest possible advantages of the approach. This implementation will be performed on a Linux system augmented with 2 Gbytes or more of RAM that will serve as its primary storage device, with a hard disk used only for large files, such as video and audio data. The project will demonstrate advantages in speed and simplicity of the system. It will also point out interesting possibilities for improvements in operating system services made possible by the use of persistent RAM.","title":"Improving Operating Systems by Replacing Hard Disks with Persistent Solid State Memory","awardID":"0098363","effectiveDate":"2001-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["485932"],"PO":["241298"]},"59194":{"abstract":"This is the first year funding of a three year continuing award. Despite a number of successful applications, current discourse parsers are still far from human performance levels. Two factors contribute to this situation. First, the relationship between discourse structure and lexicogrammar is insufficiently understood; we still do not know what lexicogrammatical features correlate with discourse structures and relations. Second, the discourse parsing algorithms implemented to date do not take advantage of formalism and algorithms specific to information and probability theories, which have been shown to produce impressive results in the field of syntactic parsing. The goal of this research is to address these two shortcomings. To this end, the PI will focus on the following two directions: (a) He will investigate empirically, using the principle of maximum entropy and the improved iterative scaling algorithm, the relationship between cue phrases, syntactic-, anaphoric-, and discourse-specific features\/structures; (b) He will develop robust probability- and maximum-entropy-based discourse parsing algorithms. The empirical aspects of the project will contribute to a better understanding of the relationship between lexicogrammar, cohesion, and coherence, while the computational aspects will provide a thorough study of the features and search strategies that are best suited for probabilistic discourse parsing. This work will also provide computational linguists with robust discourse parsers, enabling them to investigate how the high-level structure of text can be exploited in a variety of natural language applications.","title":"A Maximum Entropy-Based Approach to Discourse Parsing","awardID":"0097846","effectiveDate":"2001-05-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["257577"],"PO":["246649"]},"59250":{"abstract":"Distributed real-time systems are often very complex. They are composed of heterogeneous systems intended to perform tasks subject to many constraints, including time constraints in the face of dynamic environmental changes. In order to meet these challenges, a unifying, extensible, compiler-based framework is proposed for the design and engineering of complex real-time systems, with the following research objectives:<br\/><br\/>- To devise a systems engineering framework that includes a systems specification language and multiple problem-solving approaches, as well as an automated mapping between them.<br\/><br\/>- To discover common properties of extant on-line performance visualization tools for parallel and distributed, heterogeneous systems, as well as gather desired properties of the on-line performance analysis and visualization as a real-time middleware. Using the findings, to devise a comprehensive performance and analysis framework as a basis for advanced extensions.<br\/><br\/>- To integrate the systems engineering and on-line performance and analysis frameworks in a way that facilities on-line system <br\/>steering\/reconfiguration of complex real-time systems. The integrated approach should be semi-automated, and allow algorithmic and visual analyses of instrumentation data received from the target system to utilize problem-solving tools.","title":"Integrated Design and Performance Steering of Real-Time Systems","awardID":"0098017","effectiveDate":"2001-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550895"],"PO":["309350"]},"59151":{"abstract":"EIA-0097688<br\/>Van Scoy, Van L<br\/>Baker, David V<br\/>West Virginia University Research Corporation<br\/><br\/>REU Sites: Virtual Environments REU Site<br\/><br\/> The focus of this NSF-REU program to be hosted at West Virginia University is \"virtual environments.\" The objectives of the program are (1) to give undergraduate students practical skills in advanced visualization techniques where \"visualization\" has the extended meaning of \"presentation of information to the ears, or the fingers, or even the nose\"; (2) to give undergraduate students practical experience in multidisciplinary research applying virtual environments (VE) technology to problems in physical science, health science, and social science; (3) to help undergraduates discover the excitement of a career in research; and (4) to provide a cross cultural experience, by bringing together students primarily from the Appalachian region and from Puerto Rico and by giving some students the opportunity to work in an academic research lab in Japan.<br\/><br\/>Our recruiting goal is to have 3 students from the University of Puerto Rico-Mayaguez, 6 students from four year colleges in West Virginia and the Appalachian region, and 3 students from WVU each summer. These students are expected to come from a variety of majors, including biology, computer science, geography, and physics and will be divided into teams to work with faculty and graduate student researchers on problems in computer science, geographic information systems, materials science, and pharmacy. Each week except for the first and last week of the summer program, students will work on Mondays, Wednesday, and Fridays with researchers on specific disciplinary research projects. On Tuesdays and Thursdays they will attend half day training sessions on specific VE technologies and tools, work in the VE Lab, and participate in a weekly research seminar involving all participants, undergraduate students, graduate students, and faculty. <br\/><br\/>After each summer program in 2001, 2002, and 2003, three students will be selected from that year's participants to work in the Virtual Systems Laboratory at Gifu University in Japan during the following summer. The program will provide Japanese language and culture training for these selected participants during spring before their summer experience in Japan.","title":"REU SITES: Virtual Environments REU Site","awardID":"0097688","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["271025","555090"],"PO":["564181"]},"59691":{"abstract":"This is the first year funding of a three year continuing award. The project is devoted to the study of relational structures in the context of machine learning and reasoning. A lot of progress has been made in these areas in recent years, but much of this work ignores structure in examples and representations. Relational representations are natural for many application areas, e.g. molecular problems in bioinformatics, or sentence structure in natural language processing (NLP). The PI believes that further progress can be made by considering relational structures and techniques explicitly in such contexts. A large part of this project is concerned with algorithms based on first order Horn expressions, where reasoning problems have long been studied, and learning within inductive logic programming . Recent results suggest that some learning problems are feasible if the learner can ask questions. This project will extend that work in an attempt to identify more learnable classes, the associated complexity of the problems, and the limits of the approach. The PI will continue work on the LogAn-H system, so that algorithmic ideas developed can also feed directly into heuristics for learning from examples. The PI will also explore alternative representations and reasoning mechanisms for relational structures, and their effect on learnability. This includes both the use of linear threshold elements (perceptrons) to embed relational structures, and the logic-based approach of reasoning with models. While most of the work is concerned with theoretical foundations, applications in NLP and bioinformatics will be explored. All these directions are part of an effort to develop foundations for systems that learn their knowledge and use it for reasoning.","title":"Learning and Reasoning with Relational Structures","awardID":"0099446","effectiveDate":"2001-05-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["438626"],"PO":["491702"]},"59582":{"abstract":"0099059\/Schopf<br\/><br\/>This project focuses on the development and testing of a numerical <br\/>ocean general circulation model, including its application to dense <br\/>overflows and the deep circulation of the ocean. If successful, the <br\/>primary outcomes will be an enhancement of infrastructure, in the form <br\/>of better ocean modeling capability, and better insight into the <br\/>dynamics of dense overflows. The ocean model at the heart of the <br\/>project is the Poseidon model which uses a generalized vertical <br\/>coordinate. The model development will center on improving the <br\/>representation of ocean mixing, using existing observational data and <br\/>theoretical results on dense overflows, such as the Mediterranean <br\/>outflow, to define test problems and calibrate the results. The <br\/>project will also explore the effectiveness of several other <br\/>algorithmic refinements.","title":"Examination of Sill Flow, Mixing and Water Mass Modification in a Generalized Hybrid-Coordinate Ocean Model","awardID":"0099059","effectiveDate":"2001-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1610","name":"PHYSICAL OCEANOGRAPHY"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["489959"],"PO":["563981"]},"59362":{"abstract":"We investigate a new application of the theory of signals and systems to test and verification of mixed-signal systems-on-a-chip. Both digital and analog input signals are considered as a set of time-varying waveforms, characterized by a correlation matrix. The matrix elements are the auto-correlation and cross-correlation coefficients. Auto-correlation indicates how much a signal resembles its prior values in time. Cross-correlation indicates how similar or dissimilar two signals are. The matrix is determined from circuit inputs having \"good\" fault detection properties. Auto-correlation was used on tests for a sequential digital circuit. Random vectors were generated, and only those detecting faults were retained during vector compaction. The correlation matrix (generated from the vectors) was used to create additional test vectors. The results were spectacular -- more faults were detected, using significantly fewer vectors, and with less computation, than by any other known method. The shorter vector length significantly reduces testing costs, which are typically one third of integrated circuit costs.<br\/><br\/>We apply this idea to analog and mixed-signal circuits. We compose the Hadamard matrix (which describes the time history of prior vectors) for a digital circuit with an analog circuit transfer function. The matrix expresses successful digital test waveforms in terms of their digital spectrum. Analog circuits are tested using spectral analysis, but this is the first time that digital circuits have been tested spectrally. In a mixed digital\/analog system, we arrange digital test waveforms to configure the digital part as a \"programmable tone generator\" to test the analog part. Likewise, the analog part is configured to provide the appropriate signal spectrum to test the digital part. The possible benefits would be: (1) Removal of isolation test hardware between digital and analog circuits, which are now tested together; (2) Elimination of delays and distortion due to test hardware; (3) Lower cost; and (4) Simpler test generation algorithms. We also are applying spectral testing ideas to formal hardware verification, which determines whether a circuit, as implemented, is consistent with its specification.","title":"Digital Spectral Analysis for Mixed-Signal System-on-a-Chip Testing and Verification","awardID":"0098304","effectiveDate":"2001-05-15","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485659","260890","494757"],"PO":["562984"]},"59263":{"abstract":"This is the first year funding of a three year continuing award. Imagine a factory of the future that teems with intelligent autonomous robots and machines engaged in production. Machines that can not only sense and act, but can also optimize their own behavior without being explicitly programmed. And robots that can learn to coordinate their actions with other robots in order to satisfy an overall optimization criterion. The ability to build such machines and robots radically reorganizes the factories, so that people's role is reduced to specifying an optimization criterion and giving feedback to the machines, leaving the low level control and optimization issues to the machines themselves. This project seeks to design and study the algorithmic and computational tools necessary to build such machines and robots. The long-term scientific goal is to gain a better understanding of the tradeoffs involved in the design of adaptive autonomous multi-agent systems; in particular, the tradeoffs between the optimality of the behavior, computational and communication efficiencies, generality, and speed of learning. Optimizing the performance of programs via rewards and punishments, or reinforcement learning, appears to be the most promising approach to building such adaptive multi-agent systems for complex real-world domains. Many real-world problems in manufacturing, such as production scheduling and inventory control, are best seen as \"average-reward reinforcement learning\" (ARL) problems, where the optimization criterion is to maximize the average reward received per unit of time. The goal of this project is to develop scaleable algorithms, programs and techniques for solving large ARL problems, with manufacturing as the primary application domain. The PI will push the frontiers of this technology to the point where it can be applied to factories with hundreds of machines and job types, with realistic assumptions such as partial observability and scalability to multiple agents. Successful completion of this project will lead to new scaleable algorithms and programs for solving large ARL problems, which could well have significant economic impact.","title":"Average Reward Reinforcement Learning: Scaling up","awardID":"0098050","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["518680"],"PO":["491702"]},"59065":{"abstract":"This is the first year funding of a three year continuing award. Digital video is revolutionizing communication. However, while the technology has provided a means to capture, store, and deliver video, it has not adequately addressed the issue of content creation. Effectively utilizing the medium of video is still a resource- and talent-intensive task. In this proposal, the PI will address this issue by developing Virtual Videography, systems that help automate the production of communicative video. He will develop methodologies that enable events to be recorded with minimal intrusion and processed without expert intervention into informative video. The plan for implementing Virtual Videography is based on the observation that a good portion of the challenge of videography is the range of disparate tasks that a videographer must be proficient at. This traditional decomposition of video into its subtasks suggests a scheme where each task is mimicked by a system component. The PI will develop a software architecture where the traditional video production process has practitioners replaced by software components, and the production pipeline is augmented by a centralized repository for not only video data, but also for annotations about the video's content. Such annotations, created by an image analysis component, will guide: (a) a computational cinematographer in pointing a virtual camera that synthetically created novel views using image-based rendering methods; (b) a virtual editor in selecting shots; and even (c) a virtual effects supervisor in using visual effects to add additional emphasis. The PI will focus his efforts on a specific domain: capturing and presenting university lectures. He will demonstrate a system that automatically processes video recorded by stationary cameras in a lecture hall into edited video, showing multiple viewpoints, editing, and special effects. He will not only develop the technology required to construct such systems, but will also evaluate the utility of the results. This project will contribute insight into how the advanced features of video may be used in pedagogy; it will provide useful tools for disseminating lectures and for educational science research, as well as making technical contributions to the many fields that the effort draws upon.","title":"Virtual Videography","awardID":"0097456","effectiveDate":"2001-05-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["531411"],"PO":["565227"]},"57581":{"abstract":"Now that numerous genomes have been sequenced, a significant challenge confronting biologists is to determine the functions of the genes contained in these genomes. One aspect of understanding the function of a given gene is to determine the conditions under which it is active, the mechanisms responsible for controlling its level of activity, and the interactions it has with other genes. Toward this end, in the current project the PI will develop new computational approaches to uncovering the regulatory mechanisms and interactions of genes in a given organism. In particular, the focus is on developing new machine learning methods which are able to predictively identify various regulatory elements of a genome, using well-characterized aspects of the genome as training data. The expected impact of this research is twofold: it will produce new methods and software that can be applied by molecular biologists to gain insight into the regulatory apparatus of the cell; and it will advance the state of the art in machine learning by developing new methods for problem domains that involve (i) multiple inter-related learning tasks, (ii) rich and varied sources of data including sequence and text data, and (iii) the need for rich representation languages, such as stochastic context-free grammars and relational rules.","title":"CAREER: Machine Learning with Rich Data Sources and Interrelated Tasks","awardID":"0093016","effectiveDate":"2001-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["518513"],"PO":["387198"]},"55076":{"abstract":"This multidisciplinary research effort develops methods for content based retrieval, analysis and visualization of probabilistic 3D spatial maps, in particular, the statistical parametric maps obtained from the fMRI (functional Magnetic Resonance Imaging) analysis of the brain. The approach is based on \"activation signatures\" which represent fMRI brain activations by size, shape, number (of foci), location, density, orientation, and other parameters. These signatures are used in providing automatic classification of activations into classes. Since fMRI brain imaging is a non-invasive technique it has attracted enormous interest in recent years because of its potential to solve fundamental problems explaining cognitive processes and to find relations between brain structure and function. The environment developed in this project can fully utilize fMRI's potential by enabling inter- and intra- studies and support large-scale mining of fMRI brain activations. The techniques can extract associations at multiple levels: among different activations for the same or different (groups of) individuals, between activations and tasks, between activations and ancillary data, and between tasks and ancillary data. Automatic characterization tools open the field to numerous new research opportunities, as they can offer common signature formats to do cross-modality brain data searches and correlation over multiple studies. In turn, the mined results can speed up discovery in the neuroscience field. The methods will be demonstrated on a prototype robust database of brain activations that includes scan data as well as biographical, clinical, historical and other subject-centered ancillary data. This database supports retrieval requests and subsequent analysis incorporating spatial statistics, classification, and visualization techniques and provides an evaluation of the system by the professional communities. The results of this work will be applicable to the analysis of other brain data such as brain lesions, Positron Emission Tomography (PET) scans, and MRI scans; thus helping to create tools for search across brain data formats. In addition, objects similar to brain activations appear in many other different domains, including cellular biology, tumor analysis, fluid dynamics, or financial records, therefore, the resulting techniques are expected to have broad impact.<br\/>http:\/\/devlab.dartmouth.edu\/","title":"Mining Human Brain Data: Analysis, Classification and Visualization","awardID":"0083423","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["486250","217882","409593","229551"],"PO":["563751"]},"59379":{"abstract":"Abstract:<br\/><br\/>This research considers the design of bandwidth efficient coded modulation for partially coherent channels. Such channels occur in practice when coherent receivers are operated at low or moderate signal-to-noise ratios (SNRs), resulting in noisy phase estimates. This happens for example on wireless channels, where multipath fading causes fluctuations in received SNR. This research leverages a recent breakthrough known as turbo coding, wherein the outputs of two or more encoders at the transmitter are iteratively decoded at the receiver, resulting in reliable communication at SNRs within 1 dB of channel capacity. This research integrates phase-tracking error into all aspects of turbo coded modulation design, thereby reducing the required SNR for practical coherent communication systems. The new design techniques stemming <br\/>from this research will therefore interest not only communication and coding theorists, but also engineers designing practical communication systems.<br\/><br\/>The goal of this research is to develop theoretically based, practical design methods for parallel and serially concatenated turbo coded modulation over partially coherent (PC) channels, including PC additive white Gaussian noise (AWGN) channels, and PC fading channels with and without channel state information (CSI), with and without correlated fading, and with closed-loop and open-loop phase estimation. The investigators study the information capacity of PC channels, and determine capacity-achieving input probability density functions (PDFs) and capacity-optimal constellations for equiprobable and non-equiprobable signaling under average and peak power constraints. Distance metrics based on pairwise symbol error probabilities will be derived for PC fading channels, and iterative decoder performance prediction tools based on union bounds and convergence-region analysis will be developed. The investigators will then study set-partitioning, bits-to-symbol mapping, and code-search procedures for both linear and non-linear recursive convolutional encoders used as constituent codes in concatenated trellis-coded modulation schemes. Finally, shaping code design techniques for turbo coded modulation on power-constrained PC channels will be developed, based on the capacity-achieving PDFs of these channels, which are known to be non-Gaussian. These codes will shape the high-dimensional space of encoder output symbol sequences so that the induced two-dimensional PDF will <br\/>closely approximate the capacity-optimal input PDF.","title":"Turbo Coded Modulation for Partially Coherent Channels","awardID":"0098357","effectiveDate":"2001-05-15","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["518515"],"PO":["223414"]},"59347":{"abstract":"This project proposes to build a Multi-View Storage System, MVSS. Similar to a Multi-View Database System, MVSS allows multiple views of the same file on the physical disk to be generated dynamically.<br\/>To support multiple views, devices will be \"multiported\". Different views of a file can be customized to provide different types of service at a multiported device. MVSS separates the deployment of services from file system implementations and thus allows services to be performed at various levels of the<br\/>storage system. Multiple views of the file are provided to the user through file system namespace.<br\/>Through these views, MVSS provides a flexible and extensible way for supporting a wide range of services including device-level enhancements.<br\/><br\/>In this project, we will build an experimental testbed incorporating these ideas and plan to evaluate them through real applications. Database Select operations, MPEG filtering for QOS, sorting and a<br\/>number of other applications will be used to drive the prototype system.","title":"Multiview Storage Systems","awardID":"0098263","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550709"],"PO":["309350"]},"64583":{"abstract":"Riley<br\/>0120472<br\/><br\/>Evolution has long served to unify the study of biology, but it has now acquired a more central role. Today evolution informs and directs data acquisition, analysis and interpretation in all of the life sciences. This transformation comes in part from the explosion of raw data, from sources as far-ranging as genome sequences, adaptive physiology, population genetics, long-term behavioral studies, developmental mechanisms, ecological genetics, large-scale ecosystem studies, functional genomics, and phylogenetics. Such data can only be interpreted and synthesized using highly developed database management and analysis tools and requires the comparative tools of evolution. There is no institution dedicated to the consolidation, synthesis and dissemination of this broad sweep of evolutionarily relevant information. Therefore the goal of the proposed workshop is to discuss the need for an evolutionary synthesis center, as well as the practical, data-related capacities required for such a center. A center for evolutionary synthesis would serve the needs of the evolutionary biology community by providing mechanisms to foster collaborative, cross-disciplinary synthesis of existing and newly-produced datasets. The center would also play a critical role in the further unification of the biological sciences as it draws together knowledge from disparate fields to increase our general understanding of biological form and function. Finally, the center would also play a valuable role in organizing and synthesizing evolutionary knowledge that will inform non-academics, for example, in areas of applied evolution such as infectious disease, drug design, and bioremediation.","title":"Evolutionary Synthesis Center Workshop, May 30-June 1, 2001 in Arlington, VA","awardID":"0120472","effectiveDate":"2001-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1571","name":"SCEC"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1112","name":"Genetic Mechanisms"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1148","name":"ECOLOGICAL & EVOLUTIONARY PHYS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1160","name":"IBN ANIMAL BEHAVIOR"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1171","name":"PHYLOGENETIC SYSTEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1174","name":"POPULATION DYNAMICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1182","name":"POP & COMMUNITY ECOL PROG"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1198","name":"Biodiversity: Discov &Analysis"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1392","name":"Biological Anthropology"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1089","name":"MICRO OBS & MICRO INTER & PRO"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1329","name":"PLANT GENOME RESEARCH PROJECT"}}],"PIcoPI":["263931"],"PO":["329448"]},"57642":{"abstract":"Many emerging Internet and broadband wireless network services such as real-time stock quotes and information services, pay per view, and dynamic coalition for collaborations are based on group communications. Innovative new networking specifications such as Bluetooth (1999), WAP (1998), and SWAP (1998) allow multiple devices with different capabilities to form groups and take advantage of each other's capabilities. Emerging from these innovations is the potential for developing group communication at the level of embedded systems, which has enormous ramifications both academically and commercially. The most relevant enabling network technology for group communications is the multicast which supports the requirements of the service providers as well as the end users. However, research into secure multicast communications has been emerging only recently. The extensive efforst addressing reliable data delivery, guaranteed quality of service provision, congestion control and resource allocation for conventional and multi-rate multicast indicate the importance of multicast for Internet applications. However, the adaptation of multicast communications into commercial and selective applications depends on the ability to secure the multicast communications so that only the intended receivers have access to the data. Due to the untrusted nature of the network medium used for multicast communications, securing multicast communications requires cryptographic methods. In particular, generating, storing, distributing, deleting and updating of the cryptographic keys used for secure group communications from the core of the key management problem. This career proposal contains the following three components: Key Distribution: Research into new key distribution schemes that will be significant improvements over the currently available methods and will be efficient with respect to user and\/or sender key storage, and rekeying messages whil preventing user collusion with the focus of this effort. PI previously answered a conjecture related to the optimality of a key distribution scheme and demonstrated security flaw of a \"secure\" multicast key distribution scheme. Group Key Generation: Group key generation schemes allow a set of members to jointly generate cryptographic keys. Permitting group membership changes, preventing illegal collaboration among members trying to steal secrets or bias the final joint key are some of the features that need to be considered in designing new group key generation schemes. The proposed work will be based on the current work of PI in the area of distributed key generation. The past work has resulted in a pending national and international patent and is currently being commercialized by a collaboration with Lockheed Martin Global Telecommunications under Maryland Industrial partnership program. (Dr. Roger Mancuso, CTO, LMCO) Education: PI will develop and introduce two new undergraduate courses at University of Washington Seattle and an advanced network security laboratory that will house the course related projects and basic research. Since there is a strong presence of Information Technology companies in Seattle, the university-industry collaboration will help to provide strong research and educational background to UW students and lead to higher return on investment to the academia, industry and the NSF. PI has been in contact with the research and development groups of security at Microsoft to establish close ties. (Dr. Sekar Chandrasekaran, Lead NT security manager, MSFT)","title":"CAREER: Key Management for Secure Dynamic Group Communications","awardID":"0093187","effectiveDate":"2001-05-15","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["393827"],"PO":["565090"]},"59721":{"abstract":"This is the first year funding of a three year continuing award. This project will afford people agile views - effortless control over different representations - for digital video objects, by providing a multiplicity of indexes that are attuned to people's experiences, leverage the features of the content, and are easily and rapidly used and changed. The PI will specify such an interface, create prototype instantiations, and develop and apply procedures for testing the usability of the prototypes and specifications. Most research on digital video systems focuses on the retrieval of specific objects and on one or a few indexing attributes. This project is unique in three ways. First, it aims to address tasks at the collection level as well as at the item level; thus, in addition to the retrieval task, it aims to help people understand a video collection's structure, what is and is not available, and what attributes might be useful for retrieval purposes. Second, it aims to provide people with a range of surrogates and to integrate these into an effective and efficient interface; it aims to create an environment that provides multiple surrogates at the collection level as well as at the individual item level, and to provide novel control mechanisms to manage these alternatives. Third, it aims to assess user performance on these different tasks using these surrogates; evaluating browsing behavior is a challenge in any medium, and this work will build upon tasks and metrics developed in previous studies to go beyond traditional metrics to address time-benefit tradeoff measures. For this project, the video objects will be drawn from the Open Video Repository. Surrogates such as key-frames (in slide shows, storyboards, and skims), audio extracts, and keywords will be used as the basic representa-tions for specific video segments, and will be user-manipulable through a variety of interaction mechanisms. Additional surrogates (such as two-dimensional layouts of metadata and coordinated metadata lists) for collections of videos will also be developed, and additional views, i.e., histories (reviews), peripheral views, and shared views, will also be investigated within the agile views environment. The usability of the agile views environment (its individual components and the completely-integrated interface) will be evaluated iteratively, concluding with assessments of user performance (object and action recognition, and video comprehension), tradeoffs associated with viewing compaction rates, and user satisfaction with the interface. These evaluation techniques will themselves contribute to research and development by providing metrics and techniques for assessing interactive browsing. The ultimate goal of this work is to provide an information-rich and interactive environment that enables people to go beyond their innate visual and audio abilities to browse video content and process large volumes of video information.","title":"Agile Views for Video Browsing: Advanced Surrogates, Control Mechanisms, and Usability","awardID":"0099538","effectiveDate":"2001-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["531548","289988"],"PO":["565227"]},"56212":{"abstract":"Low Earth Orbit (LEO) satellite systems provide global coverage with short round trip delays. With these properties they will play a crucial role in the global Internet to support real-time and non-real-time applications. Routing and multicasting in LEO satellite systems are the key issues to support these services. Non-real-time applications are characterized by relaxed delay bounds. They are also insensitive to the variations in delay. Thus, datagram-based routing schemes can be used to support this type of traffic. the Semi-Centralized Datagram Routing Protocol (SC-DRP) is proposed to support connectionless routing in LEO satellite networks. The SC-DRP aims to foward the packets in the LEO satellite network on minimum delay paths. SC-DRP utilized LEO and MEO\/GEO satellites to calculate routing tables, which will increase the reliability and delay performance of datagram traffic in satellite networks, where the data traffic is carried in the LEO satellite network. The Datagram Multicast Protocol (DMP) is proposed to support connectionless multicasting. DMP is based on the SC-DRP and creates shortest path trees. Real-time applications impose strict delay bounds and are sensitive to delay varations. Thus, real-time traffic can be supported by connection-oriented routing schemes. The changing connectivity pattern of satellites affects the estbalished paths in LEO satellite networks. Thus, determining stable paths is very important. The Delay-Coupled Probabilistic Routing Protocol (DC-PRP) is proposed for connection-oriented routing in LEO satellite networks. DC-PRP computes paths conforming to the delay and delay jitter bounds of the connections. The Connection-Oriented Multicast Protocol (LEOCOM) is proposed for the connection-oriented multicasting, which creates delay-constrained multicast trees. The multicast tree length is optimized using a greedy search algorithm.","title":"Routing and Multicast Algorithms for LEO Satellite Networks","awardID":"0087762","effectiveDate":"2001-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["562752"],"PO":["250082"]},"57478":{"abstract":"Singer ABSTRACT:<br\/><br\/>One of the most difficult aspects of the application of theoretical methods to practical systems lies in the translation of a real-world problem into a manageable theoretical model. Often there are a number of aspects of the problem that are either difficult to model concisely, or that are completely unknown. For example, in many commercial and military applications, compact, efficient devices are desired that can operate in a wide range of possible environments. This research is developing a framework for explicitly dealing with such uncertainties in a number of important areas such as wireless and underwater acoustic communications, signal estimation and detection, and forecasting.<br\/><br\/>In particular, this research leverages some of the new and exciting methods for dealing with uncertainty and complexity from the information theory literature. Problems of uncertainty and variability are being addressed through the development of robust signal processing methods motivated by contemporary applications in lossless source coding and competitive on-line algorithms. Such universal algorithms can provide a particularly effective means for handling uncertainty in a variety of adaptive estimation problems. These include universal estimation and equalization strategies which without prior knowledge of the signal or channel can asymptotically achieve the performance of the optimal filter tuned to the signal or channel in use. These algorithms can be practically implemented and integrated into larger systems with relatively low complexity through the use of graphical models and iterative processing techniques used in the study of turbo codes and low-density parity check codes. Iterative algorithms such as factor graphs provide a natural framework for the joint optimization of a variety of tasks typically treated separately. Motivated by the near-capacity achieving performance of iterative decoding and turbo-codes, this research is developing practical, efficient iterative algorithms for joint detection, estimation and decoding of digital communications over single and multi-user channels with inter-symbol interference. The educational component of this research program includes significant curriculum development at both the undergraduate and graduate levels, and a strong investment in the mentoring of graduate students. A key aspect of this research includes the active involvement of undergraduates in ongoing research.<br\/><br\/><br\/><br\/>Singer LEVEL OF EFFORT STATEMENT:<br\/><br\/>At the recommended level of support, Andrew Singer will make every attempt to meet the original scope and level of effort of this project.","title":"CAREER: A Unified Approach to Iterative and Universal Methods for Signal Processing and Communications","awardID":"0092598","effectiveDate":"2001-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["551642"],"PO":["564898"]},"59458":{"abstract":"The annual IEEE International Conference on Robotics and Automation, sponsored by the IEEE Robotics and Automation Society, has become the largest annual conference in robotics and automation worldwide, and serves as a key forum where international researchers gather to exchange ideas on emerging technologies as well as technical problems and their solutions. It is important that the U.S. be well-represented at each of these conferences, which unfortunately are often held in places to which it is difficult for some of our best researchers to travel due to the cost involved. The purpose of this funding is to bolster U.S. participation at ICRA'01 by helping U.S. researchers who could not otherwise afford to attend the conference. The availability of NSF travel assistance will be announced in the IEEE Robotics and Automation Society Magazine as well as on the web site of ICRA'01. A 4-member selection committee will be formed by the conference organizers to screen applicants according to a set of criteria, such as: the applicant's technical area of interest; the expected impact of conference participation on the applicant's professional development; the opportunities for planned visits, talks, and interactions by the applicant before, during, and\/or after the conference; and any other sources of funding available to the applicant to help defray the cost of attending. With this funding we hope to have a strong U.S. presence at ICRA'2001.","title":"2001 IEEE International Conference on Robotics and Automation in Seoul, Korea from May 21, 2001 -May 26, 2001","awardID":"0098575","effectiveDate":"2001-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["172870"],"PO":["564456"]},"59348":{"abstract":"Many important applications must provide guaranteed real-time <br\/>performance in spite of uncertain workloads, highly varying <br\/>computation times for tasks, and with a large number of <br\/>interacting sites. Examples of such applications include <br\/>smart spaces, financial markets on the Internet, collections <br\/>of factories supporting agile manufacturing, and high-tech <br\/>battlefield coordination. The objective of this research is <br\/>to develop a software-oriented theory and practice of feedback <br\/>control that will provide aggregate performance guarantees for <br\/>these types of systems. Methods to embed such controllers in <br\/>the operating systems of these types of applications is <br\/>investigated. The ultimate vision of this research is that <br\/>software designers will be able to model parts of software <br\/>systems and use those models to develop software control <br\/>algorithms based on a theory of feedback control.<br\/>This work establishes a scientific basis upon which to design <br\/>and analyze the aggregate behavior of large systems that operate <br\/>under a great deal of uncertainty. The solutions can be embedded <br\/>in operating systems to meet the performance specs in transient <br\/>and steady states, such as deadline miss ratio, stability, <br\/>overshoot, settling time, and sensitivity requirements.","title":"A Control-Theoretical Approach to Performance Guarantees in Performance-Critical Systems","awardID":"0098269","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550342","309127","301560","553633"],"PO":["309350"]},"57654":{"abstract":"The project focuses on geometry-based robotic manipulation and motion planning. The proposed research includes development of algorithms for manipulation, motion planning, and design of articulated objects with many degrees of freedom. Example objects include cardboard cartons folded from blanks, and ``pop-up'' 3D micro-electromechanical systems (MEMS) made from 2D hinged elements. In contrast with work on rigid object manipulation, this research will enable robots with only a few degrees of freedom to manipulate non-rigid articulated objects with many degrees of freedom. Applications include eliminating repetitive stress injuries due to carton folding during packaging, and batch fabrication of 3D micro-optical MEMS devices for optical networks. The education plan closely complements the research program and includes development of new courses, mentoring graduate students, involving undergraduates in research, and organizing robotics workshops.","title":"CAREER: Manipulation and Motion Planning of Articulated Objects","awardID":"0093233","effectiveDate":"2001-05-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["553786"],"PO":["335186"]},"55245":{"abstract":"0084330<br\/>Hatcher<br\/><br\/>This three-year award for U.S.-France cooperative research involves Philip J. Hatcher and Robert D. Russell of the University of New Hampshire and Luc Bouge's research group at the French National Institute for Research in Informatics and Applied Mathematics'(INRIA) Laboratoire de l'Informatique du Parallelisme in Lyon, France. The proposal addresses implementation of the Java programming language for parallel programs on cluster computers using the multithreading package PM2 developed by the French researchers. The work will be performed in the context of the Hyperion environment, developed at the University of New Hampshire and comprised of a Java-bytecode-to-C translator and a run-time library for the distributed execution of Java threads. The proposal will advance understanding of Java language as a tool for programming distributed memory parallel computers. <br\/><br\/>This award represents the US side of a joint proposal to NSF and the French National Institute for Research in Informatics and Applied Mathematics (INRIA). NSF will cover travel funds and living expenses for US Investigator. INRIA will support visits of French researchers to the US.","title":"U.S.-France Cooperative Research (INRIA): Implementing a Cluster Version of Java with the PM2 Distributed and Multithreaded Run-Time System","awardID":"0084330","effectiveDate":"2001-05-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["562576",141392],"PO":["564152"]},"56324":{"abstract":"EIA-0088081<br\/>Walsh, Gregory C.<br\/>University of Maryland<br\/><br\/>CRCD: A Curriculum in Networked and Distributed Systems<br\/><br\/>This project develops an innovative senior\/masters-level curriculum designed to: (a) bring the important new technologies in Wireless and Networked Distributed Systems into the classroom, (b) make use of novel teaching and evaluation methods to enhance faculty productivity in laboratory and project courses, and (c) improve the educational value of students' experiences in laboratory and project courses. The laboratory facilities, which are part of this work, also play a key role in enabling multi-disciplinary research in networks, communications, embedded systems, and controls. The project crosses several disciplinary boundaries and has clearly defined deliverables that expose students to bodies of knowledge in great demand in the workforce. Two leading companies in this emerging area, United Technologies and General Electric, mentor this project.","title":"CRCD: A Curriculum in Networked and Distributed Systems","awardID":"0088081","effectiveDate":"2001-05-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}}],"PIcoPI":["310230","310230",144657,"446708",144659],"PO":["551712"]},"69569":{"abstract":"","title":"An Integrated Pose and Correspondence Approach to Non-rigid Image Matching","awardID":"0196457","effectiveDate":"2001-05-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["499432"],"PO":["234178"]},"64203":{"abstract":"This is funding for a jointly sponsored NSF\/EU workshop to be held May 22-25, 2001, at the \"Pousada D. Afonso II\" situated in Alcacer do Sal outside of Lisbon, Portugal. This relatively secluded site has been chosen by the organizers so that attendees can participate without distraction in the workshop, which will bring together 35-45 leaders in the fields of universal access research, business, academics and policy to review the current state-of-the-art and produce a set of research agenda items for near and long term activities whose goal is to assure universal accessibility of ubiquitous computing by the elderly. Particular emphasis will be placed on articulating an integrated approach to addressing the problems in the context of technology and human rights and values, paying attention to challenges due not only to physical limitations but also to differences in perception, culture and background. Prior to arrival, all attendees will provide background papers highlighting their individual perspectives. The workshop will begin with a plenary session setting the framework for what is to follow; subsequent sessions will each include a short formal presentation followed by a facilitator-led discussion. The tentative list of session topics includes: pervasive mobile computing and the aging population; exploratory user centered design for all citizens; accessibility and the elderly; accessibility for people with cognitive impairments; user-centered design with senior citizens; sociological integration facilitated by technology; and profile of the senior citizen's varied needs. Approximately half a dozen graduate students will be included among the invitees; they will have a unique opportunity to share the direction of their thesis work and receive mentoring from senior members of the field. The revised, peer-reviewed workshop proceedings will be published as a book by a respected publisher (negotiations are currently under way by the organizers with ACM Press and North-Holland). Additionally, a report and research agenda will be submitted to the two major funding bodies (NSF and the EU), and workshop contributions, summaries and discussions will be made available online through a Web site to ensure timely dissemination to the community at large. The organizers have received expressions of support from IFIP TC13 (HCI) and WG13.3 (People with Disabilities), and from ACM SIGCHI, SIGCAPH, and SIGGRAPH. NSF funds will be used primarily to support American attendees, as well as some general expenses.","title":"Workshop on Universal Accessibility of Ubiquitous Computing: Providing for the Elderly; May 22-25, 2001; Alcacer do Sal, Portugal","awardID":"0118350","effectiveDate":"2001-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["492597"],"PO":["565227"]},"61256":{"abstract":"Electro\/Magnetoencephalography<br\/>Signal Processing Methods and Performance<br\/><br\/>Arye Nehorai<br\/>EECS Department<br\/>University of Illinois at Chicago<br\/><br\/>Detecting electric sources in the brain is important for both understanding its function and for clinical applications. Examples include mapping the brain activities and finding foci of epilepsy activities before surgical treatment. We are developing detection methods that find the sources through computer processing of measurements from arrays of sensors around the head. More specifically, we employ Electro\/Magnetoencephalography (E\/MEG) sensors that measure electric potentials on the scalp and induced magnetic field outside the head. We are developing several new methods of processing the E\/MEG signals, analyzing their performance and validating with real data their applicability, thus contributing to improvements in the use and performance of E\/MEG equipment and to increase the capabilities of neurological data processing tools.<br\/><br\/>We hope to solve some of the most currently relevant E\/MEG problems: (i) estimating and tracking paths of functional and neuronal connectivity, following the trajectories of cerebral sources, (ii) estimating concentrated and extended sources, in the presence of noise with unknown spatio-temporal covariance, (iii) simultaneously estimating source parameters and tissue conductivities, (iv) developing computationally efficient methods for realistically-shaped head models, which reduce the demands on segmentation algorithms, (v) estimating source parameters for evoked responses with inhomogeneous epochs. <br\/><br\/>We are also deriving performance measures for evaluating the newly proposed methods allowing comparison with existing systems and techniques; identifying those that are effective and helping in the optimum design of future systems. <br\/><br\/>Finally, we are using empirical data sets evaluate and validate methods. These data sets are being derived by the Dr. Jeffrey Lewine's group from Clinical and Cognitive Neurosciences studies where whole-head MEG and high-density EEG are recorded simultaneously. The Nehorai group is developing the processing methods and the two groups will collaborate on their evaluation and validation.","title":"Electro\/Magnetoencephalography Signal Processing Methods and Performance","awardID":"0105334","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["449854"],"PO":["564898"]},"61756":{"abstract":"The project will investigate ways of making robots more user-friendly via an innovative approach whereby the robot will be able to recognized the affecting state of the interacting human and modify it's (robot's) own actions to make the human feel comfortable to work with the robot. Wearable biofeedback sensors will be used to measure a variety of physiological indices to infer the underlying affective human states.","title":"SGER: An Affect-Sensitive, Anticipatory Control Framework for Human-Robot Cooperation","awardID":"0107775","effectiveDate":"2001-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["539704"],"PO":["234178"]},"61327":{"abstract":"Koetter Abstract<br\/><br\/>Phase unwrapping in 2-dimensional topologies is a signal-processing problem that has been extensively studied over the past 20 years and has important applications, such as medical imaging and synthetic aperture radar. However, despite its importance in science and engineering, to date, phase unwrapping in 2-dimensional grids has remained an essentially unsolved problem. This research takes a fresh approach to the problem using methods from probabilistic inference. The work not only holds the promise of resulting in powerful phase unwrapping schemes based on the sum-product algorithm and structured variational methods, but also has the potential to provide deep theoretical insight into the ill-posed nature and solvability of the phase unwrapping problem. Such an insight is extremely important for guiding the development of practical algorithms.<br\/><br\/>The main objective of this research is to develop and refine algorithms for phase unwrapping that are versatile, efficient and that significantly improve upon earlier approaches. One of the guiding ideas in this context is the use of probability inference as a nonlinear preprocessing step in a phase unwrapping scheme. Initial experiments have confirmed that the performance of traditional techniques can indeed be significantly boosted with such an approach. Success of this research can have a profound practical impact. For example, in SAR interferometry, phase unwrapping is an essential step in generating terrain elevation maps, and this work can significantly enhance the accuracy of existing algorithms based on deterministic phase models. Similarly, the proposed work will make routine phase imaging using Magnetic Resonance Imaging (MRI) signals feasible, which will significantly extend the clinical utility of MRI.","title":"Unwrapping Phase Images: Theory and Applications Using Probabilistic Inference Techniques","awardID":"0105719","effectiveDate":"2001-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["258712","320975"],"PO":["564898"]},"61604":{"abstract":"This is funding to subsidize the expenses of graduate students participating in the doctoral consortium immediately preceding the Fourth International Conference on Cognitive Modeling (ICCM'2001), to be held July 26-28, 2001 in Fairfax, VA. Computational modeling has emerged as a central, but complex and sometimes fractionated, theme in research on cognition. The ICCM conferences provide a unique worldwide forum where researchers from diverse backgrounds come together to compare cognitive models, to evaluate models using human data, and to further the development, accumulation and integration of cognitive theory. ICCM-2001 will be the first of these important events to take place outside of Europe. Attending the conference and participating in the doctoral consortium which precedes it will enable the students to present their work to and receive feedback from the scientific community, will help them develop a supportive community, and will foster interaction with and mentoring by senior researchers. The students will be selected by a committee, with special consideration to be given to students from under-represented groups and from institutions where cognitive modeling is not a strength.","title":"Workshop: Student Attendees at the Fourth International Conference on Cognitive Modeling (ICCM 2001); Fairfax, Virginia; July 26-28, 2001","awardID":"0107211","effectiveDate":"2001-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["505248"],"PO":["565227"]}}