{"14182":{"abstract":"This project investigates high performance algorithms in the areas of model reduction algorithms for dynamical linear systems, eigenproblem solvers, and iterative methods for sparse nonsymmetric linear systems with one or multiple right-hand side vectors. The model reduction work is based on the rational Lanczos algorithm which performs multipoint moment matching-based model reduction with automatic point selection from a specified grid. It uses a novel shifting strategy which exploits a mix of imaginary and real positive scalar values that provide a multiscale view of the frequency response of the dynamical system being modeled. The restriction to moment-matched reduced order models will be relaxed in order to improve the efficiency of the model production. This will entail the development of new error modeling techniques as well as the assessment of the effect of the use of iterative methods to approximately solve the linear systems that occur in each iteration of rational approximation algorithms. This will also drive the development of new preconditioning and iterative method strategies. A strategy for point placement (rather than point selection from a predetermined grid) will be developed and used in order to improve the accuracy of the reduced order model and to drive a load balancing strategy for the large grain parallel processing in a multilevel parallelism implementation. In the work on eigenproblems, technology will be transferred and adapted from the rational Lanczos domain to Krylov-based eigenproblem solvers. This includes adapting the model reduction shift strategy to yield a multilevel approach to locate appropriate sections of the complex plane in which eigenvalues reside. The choice of spaces used to form the projector will also be updated via rational Lanczos technology. A Gershgorin disk-based alternative to Krylov-based approaches will also be studied. The approach is a generalization and improvement of work by Varga and other s. The methods natural multilevel parallelism will be analyzed and exploited in an experimental implementation. The area of nonsymmetric sparse linear system solving via preconditioned iterative methods supports the advances in the two areas above, and also contributes to the state-of-the-art in numerical algorithms. Three basic tasks will be undertaken. The first is to continue work on a robust parallel preconditioned iterative method-based package for the solution of nonsymmetric systems. This work will build on earlier efforts on the EN-like family of methods, partitioned row projection schemes, and an accelerated block Stiefel iteration adapted to nonsymmetric systems. Preconditioners based on eigenvalue deflation, incomplete orthogonalization, and modified Krylov methods will be considered. The second system linear system solving task that will be addressed is the development and analysis of a family of block EN-like methods for linear systems with multiple right-hand side vectors encountered in multiple-input-multiple-output dynamical systems and applications such as electromagnetics. Finally, the linear system solvers above will be adapted to the situation encountered in model reduction -- multiple linear systems defined by a matrix pencil (A,E), and a set of scalar shifts with associated right-hand sides.","title":"High Performance Computing for Large Dynamical Systems","awardID":"9619763","effectiveDate":"1997-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["501195"],"PO":["187585"]},"13370":{"abstract":"Presentation College, Lakota Campus requests support from NSF to connect it's campus to the Internet. The College, located on the Cheyenne River Sioux Indian Reservation in Eagle Butte, South Dakota. It has approximately 50 students enrolled in the associate or bachelor nursing degree programs. The college intends to connect to the Internet through IWAY, a local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Presentation College Internet Connection Project","awardID":"9617136","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33856],"PO":["121202"]},"13293":{"abstract":"This award is made under the high performance connections portion It provides partial support for an OC-3 connection to the Very High Performance Backbone Network Service (vBNS). Applications include: - Acquisition of a CAVE: Breaking Research and Education Barriers by Developing and Evaluating 3D Visualization Tools with CAVE Technology - Human Computer Interaction: Visualization and Animation Groups - High Speed Civil Transport - Network-based Engineering course delivery and collaboration - National Digital Library of Theses and Dissertations - Distributed Interactive Simulation Collaborating with: Carnegy Mellon University Central Florida Institute for Simulation and Training Cornell University Eisenhower National Clearinghouse for Math & Science Education George Mason University North Carolina State University Old Dominion University University of California at Berkeley University of Illinois at Chicago University of Florida University of Georgia College of Veterinary Medicine University of North Carolina Chapel Hill University of Virginia Virginia-Maryland Veterinary College William and Mary College Argonne National Laboratory Army Research Office Defense Modeling and Simulation Office NASA Langley Naval Research and Development Center Naval Surface Warfare Center Naval Training and Simulation Center Oak Ridge National Laboratory Alcoa Durability Inc. Institute for Academic Technology John Deere The award provides partial support of the project for two years.","title":"A High Performance Connection for Research and Education Institutions and Facilities in Virginia","awardID":"9616956","effectiveDate":"1997-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["550462",33640,"559094"],"PO":["121202"]},"14196":{"abstract":"9619805 Maxwell, Bruce North Dakota University System REU: Research Training and Collaborative Projects for Undergraduates in Computer Science This Research Experience for Undergraduates (REU) Site project supports 10 students per year in programs carried out during the summers, for three years. Students participate in a spring semester research seminar offered at the University and on-line via the WWW to off-campus participants. The seminar covers basic research, writing, and presentation skills, and helps students to select an advisor and design a research project in their advisor's area of specialty. The participants are selected from area universities and community colleges, including the five Tribally Controlled Community Colleges located in North Dakota. Research areas include neural networks, computer vision, speech recognition, network design and simulation, human-computer interfaces, and application development for remote sensing tasks. Students are able to select from this diverse set of topics for their summer projects. The goal of the project is to provide research experiences and training to undergraduates in computer science, focusing on students from regional institutions where opportunities for research are rare.","title":"REU: Research Training and Collaborative Projects for Undergraduates in Computer Science","awardID":"9619805","effectiveDate":"1997-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["439956",36065],"PO":["329035"]},"13152":{"abstract":"9616681 Blumenthal, Marjory National Academy of Sciences Special Project: What Everyone Should Know About Information Technology, NAS, CSTB A broad-based study designed to outline the body of knowledge about information technology that a person with a high school or college education should know is being conducted by the Computer Science and Technology Board (CSTB). The study involves engaging a large community of organizations including the AAAS, accreditation organizations, school administrative groups, career counseling groups, and other appropriate organizations and is expected to provide the basis for formulating appropriate curricula and materials. It is being carried out under the direction of an eight-member steering committee and includes extensive Internet-based input, a two or three day workshop and a two-stage review process on the report and recommendations of the workshop, which will then be widely distributed.","title":"Special Project: What Everyone Should Know About Information Technology","awardID":"9616681","effectiveDate":"1997-02-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["234699"],"PO":["297837"]},"13461":{"abstract":"9617370 Singh, Gurdip Wallentine, Virgil Kansas State University CISE Research Instrumentation: Multiprocessor Computing Facilities This instrumentation grant enables the purchase of a Unix-based multiprocessor system to develop tools for analysis and development of parallel and distributed programs. The project includes a study of parallel implementation of protocols, development of coordination abstractions that capture common patterns of process interaction in various applications, empirical evaluation of parallel flow analysis algorithms, development of an implementation testbed for distributed and shared memory programs, and development of a general parallel hydrologic routing system for hydraulic and hydrologic analysis of dams. The multiprocessor system requested will be used to evaluate the performance benefits of parallelism in the analysis algorithms and as a part of a network configuration to evaluate the performance of network\/distributed protocols and the throughput gains achieved by their parallel implementations.","title":"CISE Research Instrumentation: Tools for Analysis and Development of Concurrent Programs","awardID":"9617370","effectiveDate":"1997-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["119116","528451","495163","475718","561782"],"PO":["557609"]},"13494":{"abstract":"9617465 Solworth, Jon A. Lobo, Jorge University of Illinois at Chicago CISE Research Instrumentation: A Data-Intensive Distributed Computing System As ever larger data sets--both structured and unstructured--are created and digitized, new techniques are need to better store, organize, and access this data. This is challenging since mass storage subsystem performance has increased slowly relative to processor performance and because data is usually distributed over computers which communicate using high-speed networks. Hence, new storage optimization techniques are needed for both performance and availability. This research instrumentation grant facilitates acquiring a system consisting of workstations with very large experimental disk and tape capacity, communicating over very high speed networks to empowered research in the following projects: -Persistent Object Store System- Dynamically Distributed Replication Experiments-Picture and Video Retrieval by Contents System-Distributed Database Processing System Experimental evaluation of realistic data-intensive applications and systems will thus be enabled. The equipment will be used to construct a picture and video retrieval by contents application enabling large video archives to be queried by characteristics. A distributed deductive database system targeted initially at answering protein data bank queries enables rule-based data analysis. These applications exist in prototype form and will now be scaled to realistic sized systems, enabling better understanding of performance and semantics. Complementing these applications is system research on constructing large scale object stores and distributed replication of data. This systems research would enable the construction of higher performance, more flexible stores while easing the programming burden.","title":"CISE Reasearch Instrumentation: A Data-Intensive DistributedComputing System","awardID":"9617465","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["389044","438703","550555","557651",34211],"PO":["301532"]},"13395":{"abstract":"9617196 Hou, Chao-Ju Jennifer Han, Ching-Chih Ohio State University A Myrinet Testbed for Research in Distributed Real-Time Environments The instrumentation grant will fund several Sun SPARC stations, one 8-port and seven 4-port Myrinet switches and host interfaces, and two software licenses for Open-Invention visualization to support distributed real-time system research in Computer and Information Science and Engineering. The equipment will be used by five research projects, including - Design and implementation of a load sharing mechanism; - Application of distance-constrained task model to message scheduling; - Design and implementation of a fast restoration mechanism; - Design and implementation of multisensor integration algorithms that take advantage of load sharing and real-time communication schemes; and - Design and implementation of matching and scheduling algorithms, all in distributed heterogeneous environments. All projects are composed of two synergistic parts: development of effective task management schemes, communication protocols, or multisensor integration algorithms based on a rigorous analytical foundation, and their validation with software system building and experiments. The experimentation is essential, since a true evaluation of system performance can only be obtained through implementation and direct measurement. The research instrumentation allows the construction of an inexpensive distributed real-time environment to conduct the work described.","title":"CISE Research Instrumentation: A Myrinet Testbed for Research in Distributed Real-Time Environments","awardID":"9617196","effectiveDate":"1997-02-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["518511","420958","342042",33926],"PO":["557609"]},"17972":{"abstract":"The University of Arkansas requests support from NSF to connect eight institutions of higher education and one unique library to the Internet. These institutions include: Arkansas Valley Technical Institute, Crowley's Ridge Technical Institute, Delta Technical Institute, Foothills Technical Institute, Forest Echoes Technical Institute, Great Rivers Vocational Technical School, Ozarks Regional Library, Quapaw Technical Institute, and Rice Belt Technical Institute.","title":"ARKnet - Phase V: A Project to Expand Arkansas' Statewide Academic\/Research Network","awardID":"9634832","effectiveDate":"1997-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["437690",45173],"PO":["121202"]},"14100":{"abstract":"The aim of this project is the development and implementation of parallelizable numerical methods for solving matrix Riccati equations that arise from large control problems. One effective and widely used approach to their solution is via the computation of the stable invariant subspace of an associated Hamiltonian matrix. Existing methods have one or more drawbacks: limited parallelizability, lack of structure-preservation, numerical instability, or slow convergence. In this project, new Jacobi type algorithms for Hamiltonian and other structured eigenproblems will be developed. Existing structure-preserving Jacobi algorithms suffer from poor convergence: they use 2x2 symplectic-rotations, which limit the positions on the off-diagonal that can be targeted for annihilation. By exploiting the correspondence between 4x4 matrices and the tensor square of the quaternion algebra, this proposal studies ways to overcome this restriction, and develop structure-preserving algorithms that have better convergence properties, while retaining numerical stability and parallelizability. The algorithms developed will be evaluated for speed and stability in serial and parallel settings. Improved parallel algorithms will enable scientists and engineers to solve larger control problems with greater accuracy. ***","title":"Parallel Jacobi Methods for Large Control Problems","awardID":"9619514","effectiveDate":"1997-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["450638"],"PO":["187585"]},"13275":{"abstract":"D'Youville College requests support from NSF to connect it's campus to the Internet. D'Youville College is an independent liberal arts institution in Western New York with nearly 2000 graduate and undergraduate students. The College intends to connect to the Internet through the NYSERNet, a local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Information Technology Plan: Internet and Remote Connectivity","awardID":"9616925","effectiveDate":"1997-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33594],"PO":["121202"]},"13396":{"abstract":"9617197 Haines, Matthew D. Miser, Shivakant University of Wyoming CISE Research Instrumentation: High-Speed Cluster Computing at the University of Wyoming This instrumentation grant enables research among the faculty in the Computer Science Department at the University of Wyoming, where distributed computing constitutes a focus area of research. Most research today in the area of distributed computing centers around high-speed, high-bandwidth networks. This funding will enable research in at least three areas.- Runtime Support for Multidisciplinary Applications on Cluster Computers- Building Dependable Software using Group Communication Services - Real-time Distance Monitoring of Medical Information-The first is runtime support for multidisciplinary applications on cluster computers, in which several computing nodes are connected with a high-speed network to form a cluster computer. This research area will focus on language and runtime support to enable efficient execution of multidisciplinary applications on this platform.-The second area of research involves building dependable thread-based communication services to enable reliable distributed software. The goal of this research is to design reliable group communication services that can exploit a high-speed network.- The third area of research supports real-time distance monitoring of medical information. The goal of this research is to evaluate the abilities of a high-speed network to support real-time transmission and consumption of multimedia medical information.","title":"CISE Research Instrumentation: High Speed Cluster at the University of Wyoming","awardID":"9617197","effectiveDate":"1997-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[33928,"508532","179737"],"PO":["557609"]},"14155":{"abstract":"9619680 Cordes, David University of Alabama REU: The University of Alabama Undergraduate Computer Science Research Program : Research Experiences for Undergraduates This Research Experiences for Undergraduates (REU) Site project supports 9 students per year in programs carried out during the summers, for three years. Students are recruited from smaller, primarily undergraduate schools throughout the South with emphasis on recruitment of women and minority students. Research projects within the department from which the students have an opportunity to select include software testing, database systems, parallel algorithms, human-computer interfaces, distributed systems, artificial intelligence, programming languages, and performance analysis. Students are required to create a formal, written report documenting their summer activities and, at the completion of the program, to present a short talk to the students and faculty of their home institution.","title":"REU: The University of Alabama Undergraduate Computer Science Research Program: Research Experiences for Undergraduates","awardID":"9619680","effectiveDate":"1997-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["426940","394731"],"PO":["329035"]},"13198":{"abstract":"9616757 Nelson, Bradley J. University of Illinois at Chicago CISE Research Instrumentation: Visually Servoed Micromanipulation The research projects supported by this award address a potential technology barrier to the commercial success of MEMS devices by theoretically and experimentally investigating micropart manipulation of rigid and deformable objects. The equipment provided by this award, high performance computing hardware for image processing and computer graphics, microforce sensors, micro positioning devices, and high resolution optics, are an important part of the following projects: Visually Servoed Micromanipulators for Automatic Assembly and Packing of MEMS Devices- Sensor-Based Manipulation of Deformable Objects and Microstructures The first investigates and develops visually servoed micromanipulators including development of a real-time task representation defined in terms of geometric object models of rigid objects, sensor models, and the microphysics of micromanipulation. The latter investigates and develops a real-time task representation defined in terms of deformable object models of rigid objects, sensor models, and the microphysics of micromanipulation. The projects pursue experimental and theoretical analyses that illuminate the similarities and differences between sensor-based manipulation in macro and micro domains. The realization of successful micromanipulation strategies contributes to the development of automatic assembly machines for assembling and packaging future MEMS devices that require increasingly complex assembly strategies.","title":"CISE Research Instrumentation: Visually Servoed Micromanipulation","awardID":"9616757","effectiveDate":"1997-02-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["196704"],"PO":["557609"]},"19303":{"abstract":"9700336 Fasse, Ernest D. Ousterhout, Karl B. University of Arizona CISE Research Instrumentation: A Robot System for Contour Grinding of Objects with Complex Spatial Forms The award supports the purchase of a robot system consisting of a robot manipulator and its controlling computer system. The equipment will be used for several research projects, including in particular - robotic variable-axis contour grinding, - robotic variable-axis curvilinear feature grinding, - robotic polishing of objects with complex spatial forms, and - programming robots to perform spatially complex tasks using spatial impedance control, an intuitive Euclidean-geometric version of impedance control well suited for compliant motion control of articulated robots interacting with other spatial systems. These projects are all in the more general area of CAD-oriented robot control, where the robot software interface is designed so that it is easier to use spatial geometric information about bodies in the environment available from CAD models. Each of these projects requires a robot with at least six degrees-of-freedom. This research will make it easier to program robots to perform spatially complex tasks involving mechanical interaction with objects in the environment.","title":"CISE Research Instrumentation: Engineering Research Project: A Robot System for Contour Grinding of Objects with Complex Spatial Forms","awardID":"9700336","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[48970,48971],"PO":["557609"]},"13298":{"abstract":"96-16969 Roman, Gruia-Catalin Hubbard, P. M. Washington University in St. Louis CISE Research Instrumentation: Effective Visual Presentation of Computer Generated Information The instrumentation grant will fund four SGI graphics workstations connected to a high speed communication network to provide a testbed configuration supporting four projects whose common goal is to enhance the computer's ability to communicate information in visual form for human consumption. Query -Based Visualization of Distributed Computations- Visualization for Network Management- Practical Computational Geometry- Time Critical Graphics Operations. Query-based visualization is a technique that allows one to explore an executing distributed computation in a totally visual environment. A graphical vocabulary is used to formulate questions about and construct answers regarding the state of the computation. This will lead to a novel perspective on visual debugging and monitoring of distributed software. The network visualization, management, and control project seeks to explore the use of visualization and interactive steering in an environment characterized by high-speed, high-volume data production and a demand for rapid response. The techniques developed in this work will be applicable to a wide range of complex applications that can benefit from human-directed, dynamic adjustment of parameters. Practical computational geometry project deals with the issues of simplicity and robustness in geometric algorithms, seeking a theoretical understanding of fundamental problems in computer graphics, computational biology, and visualization. Finally, time-critical computer graphics is a research effort to develop graphical operations such as rendering and collision detection that adapt to resource limitations with minimal impact on human performance.","title":"CISE Research Instrumentation: Effective Visual Presentation of Computer Generated Information","awardID":"9616969","effectiveDate":"1997-02-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["384032","536698","214934",33659],"PO":["557609"]},"13321":{"abstract":"This project connects Wallace Community College in Selma AL to the Internet over a T1 (1.544 million bits per second) line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"WCCS Internet Connection","awardID":"9617019","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["563673",33736,33737,33738],"PO":["121202"]},"13453":{"abstract":"Shaw 9617353 The award supports the Research Needs and Opportunities in Superconductivity Workshop to be held at the Monterey Marriott Hotel, Monterey,CA, February 10-12, 1997. The objectives of the conference are: 1.) to review major advances in superconductivity R&D since the last workshop in 1991; 2) to identify key problems that are bottlenecking progress; 3.) to specify areas where major breakthroughs appear possible; 4.) to identify new research facilities or techniques that may lead to new research opportunities. The Conference plans to invite research leaders to discuss fundamental issues in superconductivity. The workshop will be divided into four panels: fundamentals, materials, thin film and devices, and bulk superconductor, wires, and applications. A proceeding will be put together by the Conference for the report. The P.I. and his colleagues have organized similar conferences in the past. The findings of the workshop would be able to provide NSF with suggestions for research direction in the area of superconductivity materials processing in the future.","title":"Workshop: Research Needs and Opportunities in Superconductivity, Monterey, CA, February 10-12, 1997","awardID":"9617353","effectiveDate":"1997-02-01","expirationDate":"1997-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1467","name":"MATERIALS PROCESSING AND MANFG"}}],"PIcoPI":["533278"],"PO":["561940"]},"13277":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to connect an elementary school to a high school using wireless techniques. The high school is already connected to the Internet over a telephone line.","title":"Cambria County Connections to the Internet - Wireless","awardID":"9616928","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33600],"PO":["57343"]},"14256":{"abstract":"The synthesis of images directly into a procedural format will be investigated. The realistic imaging techniques to be developed will determine the parameters and coefficients necessary for a procedural description instead of finding the individual pixels that compose a spatial representation. This approach will permit the new algorithms to take advantage of information that is not available when only the spatial form has been computed. This should make it possible to exploit such things as the statistical properties of images and the effect of visual masking. By moving the output of an image synthesis technique closer to what is produced by an image compression algorithm, the computation of unnecessary information will be avoided and the final result will be more consistent with current practices for storing or transmitting computer graphic images. Finally, the use of perceptually based procedural representations will facilitate the use of visual metrics to control how a picture is computed and to decide whether it is of adequate quality. ***","title":"Image Synthesis into a Procedural Format","awardID":"9619967","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["426498"],"PO":["187585"]},"13530":{"abstract":"CDA-96-17579 Hamilton, Martin A..Harkin, Gary J. Montana State University - Bozeman CISE Research Instrumentation: Modeling and Image Analysis of Biofilm Systems The instrumentation grant will support a high-powered workstation requested for use in modeling and image analyses of biofilm processes. A biofilm is a gelatinous mass, consisting of microbes and the slime they secrete, attached to a substratum. Many natural and engineered systems involving liquids are profoundly influenced by biofilms. Observations of biofilms are mainly via digitized images from sophisticated microscopes and surface science instruments. It is important to quantify the images and to model biofilm processes. The requested workstation is necessary to support three interrelated, complex computational projects: analyzing biofilm images, simulating transport phenomena in biofilms, and constructing a 3-dimensional cellular automata model of biofilm development. Quantitative image analysis is required to estimate parameters for fundamental biological and physico- chemical mechanisms. Many biofilms contain channels that provide a rudimentary circulatory system around cell clusters. Any realistic model of nutrient concentration profiles and associated microbial growth in the biofilm must account for advective transport in the channels, as well as diffusion. A 3-dimensional model is required to represent key processes such as interactions among microbes, interactions of microbes with the environment, and microbial attachment to and detachment from the biofilm. Cellular automata modeling is the most feasible initial strategy for constructing a plausible 3-dimensional model.","title":"CISE Research Instrumentation: Modeling and Image Analysis of Biofilm Systems","awardID":"9617579","effectiveDate":"1997-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[34302,"223271","95273","414218"],"PO":["557609"]},"13443":{"abstract":"9617327 Kuipers, Benjamin J. Wood, Kristin L. The University of Texas at Austin CISE Research Instrumentation: Research on Assistive Intelligence To support several ongoing research projects in computer and information science and engineering, the Departments of Computer Sciences and Mechanical Engineering at the University of Texas at Austin are acquiring a mobile robot configured as an intelligent wheelchair. It consists of a powered wheelchair base augmented with proximity sensors, visual sensors, manipulation capability, speech input and output, and onboard computation. The robot provides a test and application for our Spatial Semantic Hierarchy theory of spatial knowledge in the cognitive map, and for our research on goal-oriented computer vision. It also supports a collaboration between University of Texas researchers and occupational therapists at the Rosedale School in Austin, developing the intelligent wheelchair as assistive technology for people with disabilities such as cerebral palsy. Advances in intelligent robotics serve the assistive technology application by improving the service the wheelchair can provide for its driver. Meanwhile, the presence of an intelligent driver can compensate for limitations of the robot.The results of this research should be important for other application areas where intelligent man-machine systems would be useful, including space telerobotics, manufacturing and construction automation, and intelligent transportation systems.","title":"CISE Research Instrumentation: Robotics Equipment for Research on Assistive Intelligence","awardID":"9617327","effectiveDate":"1997-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["534124","453967","549435"],"PO":["301532"]},"13454":{"abstract":"9617355 Phatak, Dhananjay S. Gupta, Vipul State University of New York, Binghamton CISE Research Instrumentation: Computation Engines and Mobile Computing Testbed This research instrumentation grant enables research in the following projects: -Fault Tolerance of Feedforward Artificial Neural Networks (ANNs) and Synthesis of Robust Nets-Constructive Algorithms to Incrementally Build Feedforward ANNs that Lead to Efficient Hardware Implementations-Novel Number Representations for High Speed and Low Power Arithmetic Circuits- Mobile and High Performance Networking-Network Reconfiguration and Processor Scheduling in Parallel Systems The project supports collaborative research in multiple areas of Electrical Engineering and Computer Science. The equipment consists of computation engines supporting a small wireless Local Area Network and peripherals. It is envisaged to serve a dual purpose: - providing the computational power and graphical environment required by CPU\/memory intensive projects in Neural Networks, Signal Processing, and VLSI CAD, and -providing a test-bed for mobile computing research. Neural net research includes synthesis of fault tolerant networks, and constructive algorithms for efficient hardware implementations. VLSI CAD focuses on low power designs crucial for today's laptops and portables. Ultrafast algorithms and VLSI architectures are also being developed for real-time arithmetic processing. As the computing paradigm continues to shift from institutional to personal to mobile\/ubiquitous, supporting nomadic users becomes an interesting research challenge. The proposed instrumentation supports exploration of mobility supporting protocols, security and privacy for mobile users, specialized protocols for wireless media and adaptive applications. In addition to these state-of-the-art research projects, the proposed setup also enables novel experiments in integrating conventional server functions (CPU\/memory\/data-storage\/retrieval) with mobility support services.","title":"CISE Research Instrumentation: Computation Engines and Mobile Computing Testbed","awardID":"9617355","effectiveDate":"1997-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["179836","49397"],"PO":["557609"]},"13124":{"abstract":"9616611 Kozma, Robert SRI International CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: Building Virtual Places for Collaborative Simulations: A Heterogeneous Network Architecture to Support Distant Learning SRI International has been awarded $599,947 over 25 months for an effort to study collaborative learning within two learning communities: undergraduate chemistry students and science teachers involved in professional development. The results of the research will be used to design and develop a network-based learning environment that supports a range of asynchronous and synchronous collaborative interaction among distributed teams on heterogeneous platforms. The project will involve collaborations between social scientists studying social and task environments in learning, and computer scientists developing collaboration technologies that will support these environments.","title":"Collaborative Research on Learning Technologies: Building Virtual Places for Collaborative Science Simulations: A Heterogeneous Network Architecture to Support Distant Learning","awardID":"9616611","effectiveDate":"1997-02-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["546530",33234],"PO":["297837"]},"12035":{"abstract":"9613703 This NSF-CONACyT collaborative research project is on very high level programming languages that will facilitate flexible ways of problem as well as query specification. The term \"very high level\" is used to mean a declarative (as opposed to a conventional, procedural) language, in which the emphasis is on what a program should compute rather than on the details of how the computation should be carried out. The focus of the research is on sets, which are central in applications of database query languages and logical specifications of problems. While previous research has laid the foundations for a set-oriented declarative language, the new research will expand the paradigm with two important capabilities: constraints and preferences. In this programming paradigm, a user can specify the mandatory requirements (or constraints) of a problem and also the optional requirements (or preferences) that guide the search for optimal solutions. In considering how to formulate preferences based upon aggregate values, the research will examine how to integrate sets, constraints, and preferences. The proposed research covers design and implementation issues, as well as applications, and will be carried out in collaboration with Professor Mauricio Osorio, at the Universidad de las Americas, Puebla, Mexico. ***","title":"CONACyT: Research on Sets, Constraints and Preferences","awardID":"9613703","effectiveDate":"1997-02-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["284791"],"PO":["150697"]},"13366":{"abstract":"Los Angeles Pierce College requests support from NSF to connect it's campus to the Internet. The College, located in the western San Fernando Valley has approximately 15,000 students. The college intends to connect through NETWAY a local Internet service provider used by all the colleges in the district. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Campuswide Internet Access","awardID":"9617131","effectiveDate":"1997-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33848],"PO":["121202"]},"20791":{"abstract":"*** The objective of this workshop is to bring together leading scientists, engineers, practitioners, and entrepreneurs in the robotics and healthcare communities, display state-of-the-art of healthcare robotics, and identify fundamental issues and key technologies which require long term research endeavors. The rapid increase of the aged population and soaring healthcare costs are crucial problems faced by today's society. Traditional labor-intensive services and costly treatments will no longer be affordable, yet demands for quality care continue to increase. New healthcare technologies are emerging from robotics and intelligent systems which would make significant changes in the current practice of healthcare services. Minimally invasive surgery, for example, allows patients to be quickly discharged from the hospital. Remote health monitoring and tele-nursing systems allow patients to stay at home, thus avoiding costly hospital stays. Robotic vehicles and manipulation technologies allow bedridden patients and elderly people to live independently. Miniaturized sensors and actuators, wireless communication, advanced human-machine interface, and their integration technologies are pointing in the future direction of healthcare technology. Furthermore, strategic planning of research, development, and deployment as well as the social and economic impact of the new technologies will be discussed at the workshop. The workshop will be held on March 26 and 27, 1997 in the Boston area. Participants will be invited from various sectors of the healthcare community, e.g., hospitals, home health agencies, nursing homes, insurance companies, as well as the vendors and researchers in robotics, biomedical engineering, communication, and software. The result will be published and disseminated as workshop proceedings as well as by web page and virtual librari es.***","title":"Healthcare Robotics Workshop; Boston, MA; March 26-27, 1997","awardID":"9705435","effectiveDate":"1997-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["351676"],"PO":["475621"]},"20241":{"abstract":"This grant supports a workshop on the applications of Voronoi diagrams and splines. Voronoi diagrams are one of the central concepts in computational geometry, and have found applications in a broad range of scientific applications. This workshop brings together leading researchers on Voronoi diagrams from various areas of expertise. NSF funds are being used primarily to support participation by young researchers.","title":"Workshop on Voronoi Diagrams, Splines and Applications to be held February 19-21, 1997 at Arizona State University Tempe, Arizona","awardID":"9703910","effectiveDate":"1997-02-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["279394"],"PO":["187585"]},"13312":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the Very High Performance Backbone Network Service (vBNS). Applications include scalable extended computing environments, remote sensing data analysis, brain mapping, automatic target recognition, numerical simulation of nematic liquid crystals, digital cardiography, teleconferencing technology, and virtual reality user interfaces. Collaborating institutions include Cornell Theory Center, Pittsburgh Supercomputer Center, several NASA facilities, Naval Research Laboratory, California Institute of Technology, University of North Carolina and University of Utah.","title":"Scaling of an Internet Connection to Support Research Applications","awardID":"9616996","effectiveDate":"1997-02-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["173825",33709],"PO":["198445"]},"13367":{"abstract":"Frederick Community College requests support from NSF to connect it's campus to the Internet. Frederick Community College, located in Frederick, MD has approximately 4,400 students. The college intends to connect through IISNET, the County government's Interagency Information System Network which serves as their local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connection of Frederick Community College to IISNET and NSFNET","awardID":"9617133","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33850],"PO":["121202"]},"14236":{"abstract":"9619900 Chaudhary, Vipin Wayne State University REU: REU Site for Parallel and Distributed Applications This Research Experiences for Undergraduates (REU) Site project supports 6 students in the first year and 12 students in the second and third years in programs carried out during the summers and the academic years, for three years. The students will work on projects involving 1) programming tools for parallel and distributed systems, 2) high-performance solutions for scientific and engineering problems, and 3) high-performance solutions for medical sciences. Substantial effort is placed on recruiting minority students and students from non-research institutions with at least 50% of the students from undergraduate institutions or community colleges in the Detroit Metropolitan area. A special feature of the project is that the students work with industrial research mentors during their second year. Student growth and the fostering of independence in research is encouraged through regular guidance, including weekly discussions and thorough evaluations of objectives and summaries of work accomplished. A cooperative learning system, whereby students provide constructive criticism to improve work of other students, is also employed.","title":"REU: REU Site for Parallel and Distributed Applications","awardID":"9619900","effectiveDate":"1997-02-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["558152","501549","451038"],"PO":["69811"]},"14247":{"abstract":"9619946 Senger, Steve University of Wisconsin - LaCrosse REU: An REU Site in Applications of Computer Graphics to Medical Imaging This Research Experiences for Undergraduates (REU) Site project supports eight students per year in programs carried out during the summers, for two years. The participants work in areas of computer graphics and related disciplines as applied to medical imaging. Two of the students are from the host institution and six from other four year colleges and universities. The research experiences focus on applying computer graphics, distributed computing and image processing to producing three dimensional images of CT, MRI and cryosection data obtained through the Visible Human Dataset sponsored by the National Library of Medicine. A specific goal of this REU site is to encourage participation by women, one of the underrepresented groups in computing, and special recruiting efforts are planned to reach this goal.","title":"REU: Applications of Computer Graphics to Medical Imaging","awardID":"9619946","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["347771","558254","291712"],"PO":["329035"]},"13698":{"abstract":"Quite recently, there has been a good deal of common interest among researchers in machine learning (whether it be algorithmic or neural net or genetic algorithms), in models of biological learning, and in statistics, all of which make inductive estimates of data dependencies. It is still the case, however, that the different disciplines have their own terminology and approaches. It is important to begin providing a common terminology and framework for the different disciplines by investigating inductive principles, which provide general prescriptions for what to do with training data in order to learn a model. There is just a handful of known inductive principles (Regularization, Structural Risk Minimization, Bayesian Inference, Minimum Description Length), but there are many learning methods - constructive implementations based on these principles. This research project will develop an understanding of the differences among inductive principles, how they vary in power, and their use in model selection and the development of learning algorithms, in order to provide more solid foundations for the fields that are using them and better appreciation of the commonalities among the fields.","title":"SGER: Inductive Principles for Learning from DATA","awardID":"9618167","effectiveDate":"1997-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["364882"],"PO":["54008"]},"21376":{"abstract":"*** This award, in the Small Grants for Exploratory Research mode, will investigate ways to group images to facilitate the development of effective indexing methods for image search. Most current approaches to this problem focus on texture and color characteristics in the images. This effort, building on prior funded research in this laboratory on nonparametric shape modeling, seeks to determine whether structural encoding can be used more effectively to give the search engine more information about the image, and thereby facilitate the search. Generally, contemporary approaches have avoided relying on such structural information as too difficult to obtain. The planned approach will combine geometrical and topological considerations such as symmetry, parallelness, orthogonality, and connectivity to gainmore of an understanding of the image content, leading to the production of digital geometric primitives to aid in image search. These geometric\/topologic primitives should complement the texture and color information currently used for this purpose.***","title":"SGER: Developing a Non-parametric Digital Image Search Engine","awardID":"9707090","effectiveDate":"1997-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["416565"],"PO":["475621"]},"13511":{"abstract":"9617519 Peters, Richard Alan Vanderbilt Univesity CISE Research Instrumentation: Instrumentation to Support Image Analysis and Control System Software Research at Vanderbilt University This award supports the purchase of equipment to be used in five projects which depend heavily on high performance computing: -A New Software Framework for the Development of Control Systems for Distributed Robots- Active Stereo Vision for Robotic Visual Servoing- Mathematical Morphology for Color Images-Morphometric Analysis of the Brain-Image Guided Surgery. The first will break a robotic control system into groups of behavior producing agents and provide arbitration mechanisms to control the resources used by agents. The second will implement a new algorithm for (robot) visual control of robot arm motion. The third project will port a software system for research in mathematical morphology (a branch of non-linear image processing) from Unix to NT and incorporate new hue-based morphological image operators recently developed by one of the investigators. The fourth will develop and rigorously evaluate algorithms to detect subtle changes in the morphology of brain structures through the computer analysis of 3D imagery. The fifth project will assist, through computed imagery, neurosurgeons performing tumor resection. All five of the projects are computationally intensive and will make heavy use of computer graphics and image processing (both 2D and 3D). Two of six computers and an embedded Pentium system will be dedicated the first project. One computer each will be used by the other four. Projects 1 and 5 will use graphics accelerators and 3D glasses. Project 2 will use a frame grabber. Projects 4 and 5 will use the CD-ROM recorder. Projects 1 and 2 will use MSN developer's licenses. All 5 will need C++ and will be serviced by the remaining hardware and software.","title":"CISE Research Instrumentation: Instrumentation to Support Image Analysis and Control System Software Research at Vanderbilt University","awardID":"9617519","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["259953","91864",34250],"PO":["301532"]},"13457":{"abstract":"9617360 Erik Ydstie Carnegie Mellon University CISE Research Instrumentation: Computational Techniques for Distributed Process Engineering The grant supports equipment to enable research in the following projects: -Modeling and Large Scale Simulation, - Discrete and Nonlinear Optimization, - Process Control and Production Scheduling,- Synthesis and Verification of High Integrity Control Systems and Operating Procedures, -Information Systems and Distributed Data. The chemical manufacturing industry in the US is facing the challenge of integrating process design and operation to respond to changes in technology, increased global pressures, new regulation and safety constraints. CMU has developed expertise and decision support systems that answer to a number such problems. This research focuses on integrating the areas outlined. Models for efficient information storage and retrieval in large scale design problems are developed to enable more efficient methods for optimization and sequencing. Theory and computational tools will also be developed for exploring trade-off issues between design and control. The long term goal is to advance integrated strategies for decision support systems and efficient methods for coordinating symbolic and numerical computation for process design and operation in distributed computer networks.","title":"CISE Research Instrumentation: Computational Techniques for Distributed Process Engineering","awardID":"9617360","effectiveDate":"1997-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["56584","421356",34094,"506987","507180"],"PO":["557609"]},"13468":{"abstract":"9617384 Apon, Amy W. Pickens III, David R. Vanderbilt University CISE Research Instrumentation: Low Cost Parallel Processing Platform An instrumentation grant will fund an assembly of a network of low-cost computers linked by high-speed interconnections. Our low-cost, high-speed network will serve as a test-bed for three projects, which will simultaneously advance research in the application areas and demonstrate the cost-effectiveness of the network as a parallel processing platform. One project will focus on functional magnetic resonance imaging (fMRI), which indicates areas of the brain that are actively processing information. Current processing techniques can take hours on large data sets. Software will be reimplemented on the parallel system with the goal of reducing processing time so that fMRI is more practical for research into brain function. A second project will focus on data mining, which discovers `meaningful' patterns in data. Data is being amassed at a rate that far exceeds our ability to analyze it. The network will allow parallelism to be exploited for analyzing scientific and industrial data. The third project will focus on techniques such as thread and data placement and communication strategies that improve the performance of parallel applications on the high-speed network. The experimental platform will allow various techniques to be developed and evaluated. Analytic models will be used to generalize the results across comparable architectures.","title":"CISE Research Instrumentation: Application and Evaluation of a Low Cost Parallel Processing Platform","awardID":"9617384","effectiveDate":"1997-02-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["387198","540643","511023"],"PO":["301532"]},"20233":{"abstract":"9703892 Schorr This grant for $78,150 to the Information Science Institute of the University of Southern California will fund a workshop on research and development opportunities in Federal Information services. Three meetings will be held, resulting in a workshop report which should be of great value to individual federal agencies, both research and mission, and also to cross-agency planning and budgeting organizations such as the Office of Management and Budget and the President's Government Information Technology Service Board.","title":"Workshop on Research & Development (R&D) Opportunities in Federal Information Services","awardID":"9703892","effectiveDate":"1997-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y233","name":"NIH-WORKSHOP IN FEDERAL INFOR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["427568"],"PO":["371077"]},"13436":{"abstract":"9617307 Cottrell, Garrison W. Charles Elkan, University of California, San Diego CISE Research Instrumentation: Active Learning for Text, Scene, and Biosequence Analysis Adaptation to changing environments and changing goals through autonomous learning is a central theme of research in the artificial intelligence laboratory at UCSD. The workstations, robots, and neural network hardware acquired through this grant will enable recently developed learning methods to be tested in four large-scale, real-world applications.-Learning Semantic Representations for Information Retrieval-Embedded Virtual Agents-MEME: A New Software Tool for Sequence Analysis-Real Time Face and Object Recognition in Embedded Agents. The first subproject will apply new algorithms for document rerepresentation and response to human feedback to gigabytes of text in the national TREC competition. Another project will port to the worldwide web software agents that learn and interact now in a simulated artificial life environment. A third project will scale up new software for finding patterns in DNA and protein sequences into a tool capable of autonomously analyzing entire genomes. Finally, a fourth project will validate new active vision methods for recognizing and tracking objects by implementing these methods in mobile robots with controllable cameras.","title":"CISE Research Instrumentation: Active Learning for Text, Scene, and Biosequence Analysis","awardID":"9617307","effectiveDate":"1997-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["228764","539251","76213","49069"],"PO":["301532"]},"13469":{"abstract":"9617388 Coyle, Edward J. Purdue University CISE Research Instrumentation: Storage and I\/O Devices for the Support of Research in Imaging Systems, Networks, and Video and Speech Processing This award enables the School of Electrical and Computer Engineering at Purdue University to purchase equipment for the support of research projects:- Quality Improvement in the Imaging Pipeline- Modeling, Analysis, and Control of Broadband Networks-Multiscale Search of Very Large Image and Video Databases- Scalable Video Compression, Video Servers, and Error Concealment - Speech Processing Algorithms. These areas of research are critical to the success of future imaging and networked multimedia systems. The equipment to be purchased includes RAID arrays, real-time video codecs, a high-resolution digital still camera, digital video cameras, audio equipment, and networking hardware. This equipment is to be shared amongst the five research laboratories connected to our VIADuct ATM\/HiPPI Networking Research Testbed: the Computer Vision and Image Processing Laboratory; the Electronic Imaging Systems Laboratory; the Multispectral Imaging Laboratory; the Parallel Processing Laboratory; and the Speech Processing Laboratory. This equipment will enable us to acquire, store and share the video, audio, and high-resolution images needed for our research projects in the following areas: quality improvement in the imaging pipeline; modeling, analysis and control of broadband networks carrying multimedia traffic; multiscale search of very large image and video databases; scalable video compression; architecture and management of video servers; and speech processing algorithms.","title":"CISE Research Instrumentation: Storage and I\/O Devices for the Support of Research in Imaging Systems, Networks, and Video and Speech Processing","awardID":"9617388","effectiveDate":"1997-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["385369","385330","284859","246649","258813"],"PO":["301532"]},"20784":{"abstract":"An international seminar on automated deduction, organized by Prof. Wolfgang Bibel(Technische Hochschule Darmstadt, Germany), Prof. Ulrich Furbach (University of Kopblenz, Germany), and Dr. Mark Stickel (SRI International, Menlo Park, CA, USA), will be held 24-28 February 1997 at the Dagstuhl Seminar Center in Waden, Germany. About 70 automated deduction researchers from around the world have been invited to participate. This grant supports the travel of American invitees to the seminar. ***","title":"Travel Support for the l997 Dagstuhl Seminar on Deduction, February 24-28, l997, Wadern, Germany","awardID":"9705408","effectiveDate":"1997-02-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["196814"],"PO":["187585"]},"13503":{"abstract":"9617484 Fanty, Mark A. Cole, Ron, A. Oregon Graduate Institute of Science and Technology CISE Research Instrumentation: File Server and Storage for Spoken Language Technologies This research instrumentation grant enables the purchase of a new file server and storage to be used for several research projects:- Segment-Based Language Recognition;Speaker Identification; Improving the Connectionist Approach to Automatize Speech Recognition;Robust and Portable Design Systems. Language recognition: the automatic identification of which language is being spoken from an excerpt of speech. A large 22 language telephone speech corpus is being collected. Speaker identification: the identification of who is talking from an excerpt of speech. A large corpus of realistic data collected over several channels across a large span of time is being collected. Improving the connectionist approach to automatic speech recognition: the extension of CSLU's neural network technology to large vocabulary recognition, providing an efficient alternative to the well-studied HMM systems. A large amount of data will be necessary. Robust and portable dialogue systems: the technology needed to build practical spoken language systems for the telephone packaged in a toolkit to make it accessible to a wide community. A large, regionally diverse cellular telephone corpus is being collected. Collectively, these corpora provide a valuable resource for research nation-wide as well as for the research described here. In each task domain, large amounts of annotated speech data are needed in order to study the sources of variability in speech, to train and evaluate recognition algorithms, and to compare research results across laboratories.","title":"CISE Research Instrumentation: File Server and Storage for Spoken Language Technologies","awardID":"9617484","effectiveDate":"1997-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[34230,"551122","511735"],"PO":["557609"]},"13306":{"abstract":"This award is made under the high performance connections portion. It provides partial support for an OC-3 connection to the Very High Performance Backbone Network Service (vBNS) via the Virginia Broadband Education Network (VBEN).With this high performance network capability the University of Virginia will support the Legion project. The objective of Legion is to create a wide-area virtual computing environment for researchers that transparently accesses data and computational resources across the country. On this project, collaborating institutions include: San Diego Supercomputing Center California Institute of Technology Old Dominion University Virginia Tech The award provides partial support of the project for two years.","title":"Networks, Middleware, and Applications for Next Generation Metasystems","awardID":"9616987","effectiveDate":"1997-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["368593",33682,"433584","263351"],"PO":["121202"]},"13328":{"abstract":"This project connects Ocean County College to the Internet over a T1 line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Internet Connection Project","awardID":"9617033","effectiveDate":"1997-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33753],"PO":["57343"]},"21028":{"abstract":"It has been a long-standing goal of both the Artificial Intelligence and the Robotics communities to develop physical artifacts that can act intelligently . From the Robotics side, the priority has been on the development of mechanical agents that would exhibit navigation, manipulation, perception, and action skills, along with the ability to work cooperatively. The results on low-level control, including sensor uncertainty, limited reasoning about geometric and physical properties, and skills like object avoidance have proved interesting and useful, but most autonomous robotic agents still lack the ability to perform higher level intelligent operations either alone or in concert. This is partly because of their need to proceed with reasonable expedience, while the known methods are demonstrably very complex, and therefore slow. It is hoped that recent results in AI planning, learning, reasoning, and cooperation among agents will help in bridging the gap between high-level reasoning and low-level physical execution. The purpose of this workshop is to examine the available results and research agenda in this `bridging` area, while also establishing international links between American and Brazilian researchers working in the same areas and between NSF and its Brazilian counterpart organization CNPq, which will provide support for the Brazilian participants.","title":"U.S.-Brazil Workshop on Intelligent Robotic Agents","awardID":"9706159","effectiveDate":"1997-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["518535"],"PO":["54008"]},"13902":{"abstract":"The goal of this project is to develop high performance iterative techniques for solving general sparse linear systems of equations. Here, high-performance is meant in the double sense of (1) intrinsically efficient and (2) designed for high- performance platforms. This research is motivated mainly by the belief that parallel iterative methods will be fully accepted in the applications world only if they are robust as well as efficient for solving linear systems arising from typical applications, such as Computational Fluid Dynamics. For this reason preconditioning techniques that utilize a high order of accuracy will be emphasized. These include the high level of fill in complete factorizations such as ILUT and ILU(k). The most general framework of irregularly structured sparse linear systems will be considered. These matrices are partitioned and mapped into a distributed memory multiprocessor system and the systems are then solved with a preconditioned Krylov subspace technique -- using a message passing library such as MPI for communicating between processors. There are three major issues to be considered with care. First, preconditioning techniques developed specifically for distributed sparse matrices will be investigated. Second, techniques to reduce the impact of inner products in Krylov subspace accelerators will be considered. These inner products cause the parallel implementations to become inefficient as the number of processors increases. Finally, independent of consideration of parallelism, robust iterative solvers will be sought with the ultimate goal of improving the current state-of-the-art. On the preconditioners side, the methods to be developed are of three types: (1) derived from a Domain Decomposition viewpoint but adapted to general sparse matrices, (2) ILU with multi- elimination (ILUM) and related techniques, and (3) Hybrid methods derived from approximate inverse techniques. On the accelerators side, hybrid techniques that lowe r the impact of inner-product computations, as well as block Krylov methods will be investigated. ***","title":"High Performance Interactive Solvers","awardID":"9618827","effectiveDate":"1997-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550000"],"PO":["187585"]},"13825":{"abstract":"The goal of the project is to develop effective joint source-channel coding techniques. The main objectives are to achieve a deep theoretical understanding of combined source-channel codes and to develop practical algorithms that can effectively be used in real applications such as low-bandwidth video compression and low-delay speech coding. Very narrow bandwidth transmission channels, such as mobile cellular telephony, require efficient coding schemes to protect the transmitted source information from the corruptive effects of channel errors. Some previous work on joint source-channel coding has yielded limited success at protecting source coded information. In particular, low complexity techniques are needed for low delay real time implementations. This project will investigate channel coding techniques for source coding applications with an emphasis on image, video, and speech coding applications. A summary of the topics to be investigated is: Classes of low-complexity redundancy free codes for discrete memoryless channels; error control coding will be incorporated into the source code design and the index assignment problem will be addressed for codes with redundancy. High resolution quantizer theory will be studied for sources transmitting across noisy channels. Some preliminary results give useful formulas for randomized index assignments, but a much stronger theory is needed for optimal index assignment. Lattice codes will be studied both for quantization and channel coding. A goal will be to develop efficient encoding algorithms for lattice source codes (respectively, decoding algorithms for channel codes). Preliminary results so far have yielded very fast algorithms for the leech lattice, as well as some of the best-known low dimensional lattices. Efficient decoding techniques will be developed for channel codes in Euclidean space using specific source coding information. In particular, trellis decoding algorithms and theory will be studied for unequal input probabilitie s and unequal error protection. This is currently an unsolved problem though extensions of techniques from traditional decoding algorithms have yielded some limited preliminary success.","title":"Channel Coding Techniques for Low-Complexity Source Coding Applications","awardID":"9618629","effectiveDate":"1997-02-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["517054"],"PO":["150411"]},"13419":{"abstract":"9617271 Chalasani, Suresh Agrawal, Rajeev University of Wisconsin-Madison CISE Research Instrumentation: Application and Evaluation of a Low Cost Parallel Processing Platform This research instrumentation grant enables the Department of Electrical and Computer Engineering at the University of Wisconsin-Madison to purchase three 12-port Asynchronous Transfer Mode (ATM) switches and nine personal computers to support distinct research projects on real-time, multimedia and parallel computing applications. The following research projects will benefit from this instrumentation: - Traffic Management in ATM Networks - Parallel Computing on ATM Networks - Distributed Multi-media Computing on a Desktop ATM Network - Quality of Service Guarantees to Real-Time Message Streams For these applications, several traffic management strategies to provide quality of service guarantees will be evaluated using this equipment. These strategies combine mechanisms such as admission control, policing, scheduling, and feedback-based flow control. ATM-based networks of workstations may cause performance degradation for parallel applications, if different virtual circuits have unequal bandwidths. The research projects on parallel computing use the equipment to develop techniques for studying and alleviating this performance degradation in large parallel applications. For multimedia applications such as video conferencing, current video coding schemes often cause abrupt, frequent fluctuation of network traffic rendering inefficient use of network resources. A low cost video conferencing application will be developed to evaluate the effectiveness of present and emerging video coding algorithms. The equipment is crucial for investigating all aspects of competing strategies developed in the above research projects including performance, complexity, and ease of implementation. The results from the experimental validation will demonstrate whether or not ATM-based networks are viable platforms for su pporting diverse applications.","title":"CISE Research Instrumentation: Application and Evaluation of a Low Cost Parallel Processing Platform","awardID":"9617271","effectiveDate":"1997-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[33983],"PO":["301532"]}}