{"159324":{"abstract":"Citizen Schools proposes to engage 5,700 disadvantaged middle school students in hands-on computing and related STEM projects across its 7-state network of after-school and extended learning programs. By working side-by-side with professionals and graduate students from information technology and other scientific fields, middle school students will realize a connection between their after-school computing apprenticeships and the college and career opportunities to which they can aspire. In the 11-week apprenticeship courses offered within existing Citizen Schools after-school programs, middle school students will create authentic projects that develop a combination of hard and soft skills. Students will build relationships with the adult volunteers who will lead their apprenticeship courses, and these volunteers will speak credibly to students, sharing with them career opportunities in the computing and STEM fields and discussing the academic preparation necessary to pursue them. As a result, disadvantaged middle school students will be more likely to enroll in challenging courses when they enter high school, to better prepare for college, and ultimately to pursue careers in computing and other scientific fields. The project will include four types of apprenticeships: Programming in Computer Game Design, Programming in Robotics, Web Design and Web Related Projects, and Apprenticeships in Astronomy, Solar Energy, Biotechnology, Engineering, and other STEM fields. The project will be evaluated based on pre-post assessments of students? interest in pursuing computing and STEM careers, their understanding of the educational requirements for entry and advancement in those fields, and their sense of efficacy in their ability to attain college admission and career opportunity.","title":"BCP-LSA: After-School Apprenticeships","awardID":"0940604","effectiveDate":"2010-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425930,425931,425932],"PO":["560704"]},"166872":{"abstract":"This workshop is made possible due to the generous support of the Information and Intelligent Systems Directorate and the Office of International Science and Engineering of the National Science Foundation.<br\/><br\/>Research in Computational Linguistics (CL) and related fields is carried out in all of the Americas. However, interaction among investigators from the different countries in this half of the world is rare. The goal of the workshop is to increase awareness of the state-of-the-art research on computational approaches to languages of the Americas by bringing together young investigators from across the Americas doing research on these languages.<br\/>The workshop program and activities allow the attendees to explore the possibilities for international collaborations. In addition, this workshop also includes an open discussion session for proposing mechanisms to promote a more interactive community in the Americas.<br\/><br\/>This event contributes to the advancement of science by: (1) helping participants to extend their network of collaboration across international borders, and (2) promoting cross pollination of research ideas by raising awareness of the research done in different countries in the Americas, as well as (3) disseminating information on funding opportunities for international collaborations.","title":"Young Investigators in the Americas Workshop","awardID":"1008711","effectiveDate":"2010-02-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["562856"],"PO":["565215"]},"159315":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940570","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["563532"],"PO":["561855"]},"173066":{"abstract":"Only two number-theoretic assumptions --- hardness of factoring and of<br\/>computing discrete logarithms --- underlie essentially all public-key<br\/>cryptosystems in widespread use today. For lower-level primitives<br\/>such as hash functions, random number generators, and stream ciphers,<br\/>the situation is even worse: existing provably-secure constructions<br\/>are too inefficient to compete with practical alternatives such as<br\/>SHA-1 or AES, and so the primitives in use today have no rigorous<br\/>justification for their security.<br\/><br\/>This research will investigate new classes of computational<br\/>assumptions based on lattices. Based on these assumptions, the<br\/>investigators will seek to design cryptographic primitives that are<br\/>both provably secure and comparably efficient to existing, deployed<br\/>schemes. The research will explore the use of lattices to construct<br\/>basic cryptographic primitives, including hash functions, pseudorandom<br\/>generators, shared-key authentication protocols, public-key encryption<br\/>schemes (including those secure against chosen-ciphertext attacks),<br\/>and digital signatures. The educational component of this work will<br\/>focus on educating graduate students as well as developing <br\/>introductory-level surveys of lattice-based cryptography.","title":"Collaborative Research: CT-ISG: Efficient Cryptography Based on Lattices","awardID":"1042585","effectiveDate":"2010-02-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["470062"],"PO":["565264"]},"165388":{"abstract":"Increasingly, the engineering of complex systems requires consideration of an intricate web of components and their interaction in diverse social and technical environments. Simulation can assist in designing and testing socio-technical systems by allowing the potential space of outcomes to be explored under given designs. Agent-based models have been developed as a method for building models of complex systems, with great success. Agents may be designed to represent system components and to specify the interactions between them in an incredible level of detail. While popular, the full potential of the methodology to support engineering of complex systems has not been reached, however, because of a set of key challenges. First, there exists a relative lack of robust methods for calibrating agent-based models to theory. Second, there is a paucity of reliable approaches for extracting coarse-grained, system level information as it emerges in agent-based simulations. Third, there is a dearth of schemes for handling uncertainty in the application of agent-based rules to system behavior. Fourth, computation of agent-based models is inefficient when agents are numerous in volume and richly-specified in behavior. Together, these impediments constrain the ability of agent-based modeling to enable prediction, to support decisions, and to facilitate the design, control, and optimization of complex systems. The main objective of this project is to broaden the extensibility of agent-based modeling beyond these constraints. This will be achieved by developing novel computational methods to fuse agent-based modeling, uncertainty measurement and quantification, and mathematics for pattern-extraction. <br\/><br\/>This project will expand the capabilities of agent-based modeling in supporting the design, engineering, and testing of complex systems. Our initial focus is to develop a prototype scheme that can be applied to complex socio-behavioral systems, but the project is of potential relevance across a diverse array of substantive areas. Indeed, one of our central aims is to provide the glue that can bridge diverse schemes for agent-based simulation across application areas. This could be incredibly useful in reconciling agent-based modeling into a larger ?ecology? of mathematical modeling and computation, fundamentally expanding the range of questions that can be posed and systems that can be explored in simulation, while better linking simulation to real-world dynamics.","title":"EAGER\/Collaborative Research: Accelerating Innovation in Agent-Based Simulations: Application to Complex Socio-Behavioral Phenomena","awardID":"1002517","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["455087"],"PO":["564988"]},"159305":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940534","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["542299"],"PO":["561855"]},"161681":{"abstract":"CAREER: Computational Models and Algorithms<br\/>for Differential Network Analysis in Systems Biology<br\/><br\/>PI: Mehmet Koyutürk, Case Western Reserve University<br\/><br\/>An important challenge in life sciences, emerging from various successful genome sequencing efforts, is the characterization of molecular mechanisms that underlie phenotypic differences (variation in observable characteristics of biological systems). These variations include developmental stages, disease, and evolution. Molecular sequence and expression datasets have been used effectively to identify frequently mutated genes and the relative abundance\/lack of their products in cells carrying the phenotype of interest. While the role of contextual information, manifested in networks of biomolecular interactions is widely acknowledged, lack of high-quality data has impeded the development and use of network-based analyses. Recent high-throughput methods for network inference hold tremendous potential for network-based phenotype analysis. However, existing computational methods are in relative infancy. The primary objective of this project is the development of computational models and algorithms that enable integration of disparate datasets (gene sequences, gene expression, protein expression, protein interactions) for phenotypic characterization.<br\/><br\/>Network-based modeling of phenotypic differences gives rise to deep intellectual questions relating to computational abstraction, algorithm design, and biological validation. These challenges are exacerbated by the incomplete, static, and noisy nature of available network data. The proposed research aims to overcome these difficulties through innovative use of combinatorial, probabilistic, and algebraic methods, including the following: (i) combinatorial modeling of coordinate changes in the expression of multiple interacting genes, (ii) probabilistic modeling of the crosstalk in biomolecular networks, for statistically sound evaluation of functional association between multiple genes and proteins, and (iii) algebraic modeling of information flow in the cell, to make indirect inferences on the effects of multiple genetic perturbations. The resulting computational tools will be integrated into frequently accessed application frameworks, including Cytoscape, R, and Matlab, used extensively by domain scientists at Case Center for Proteomics and Bioinformatics, for testing, validation, and calibration, and subsequently disseminated to the broader scientific community.<br\/><br\/>The proposed career plan also incorporates major educational and outreach initiatives that build on the interdisciplinary nature of proposed research. These initiatives include (i) novel instructional techniques based on active learning, (ii) continued development of a Computer Science education platform, TELESCOPE, for the purpose of illustrating basic algorithmic and problem solving principles, (iii) incorporation of TELESCOPE into outreach efforts, targeting K-12 schools, CWRUs TRIO programs for low income pre-college students, and CWRUs Equinox summer program, (iv) programs for student involvement (particularly minority and female) in outreach efforts, (v) development of new interdisciplinary courses and degree programs at undergraduate and graduate levels, and (vi) continued involvement of undergraduate students in research projects.","title":"CAREER: Computational Models and Algorithms for Differential Network Analysis in Systems Biology","awardID":"0953195","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":[432373],"PO":["565223"]},"165389":{"abstract":"Increasingly, the engineering of complex systems requires consideration of an intricate web of components and their interaction in diverse social and technical environments. Simulation can assist in designing and testing socio-technical systems by allowing the potential space of outcomes to be explored under given designs. Agent-based models have been developed as a method for building models of complex systems, with great success. Agents may be designed to represent system components and to specify the interactions between them in an incredible level of detail. While popular, the full potential of the methodology to support engineering of complex systems has not been reached, however, because of a set of key challenges. First, there exists a relative lack of robust methods for calibrating agent-based models to theory. Second, there is a paucity of reliable approaches for extracting coarse-grained, system level information as it emerges in agent-based simulations. Third, there is a dearth of schemes for handling uncertainty in the application of agent-based rules to system behavior. Fourth, computation of agent-based models is inefficient when agents are numerous in volume and richly-specified in behavior. Together, these impediments constrain the ability of agent-based modeling to enable prediction, to support decisions, and to facilitate the design, control, and optimization of complex systems. The main objective of this project is to broaden the extensibility of agent-based modeling beyond these constraints. This will be achieved by developing novel computational methods to fuse agent-based modeling, uncertainty measurement and quantification, and mathematics for pattern-extraction. <br\/><br\/>This project will expand the capabilities of agent-based modeling in supporting the design, engineering, and testing of complex systems. Our initial focus is to develop a prototype scheme that can be applied to complex socio-behavioral systems, but the project is of potential relevance across a diverse array of substantive areas. Indeed, one of our central aims is to provide the glue that can bridge diverse schemes for agent-based simulation across application areas. This could be incredibly useful in reconciling agent-based modeling into a larger \"ecology\" of mathematical modeling and computation, fundamentally expanding the range of questions that can be posed and systems that can be explored in simulation, while better linking simulation to real-world dynamics.","title":"EAGER\/Collaborative Research: Accelerating Innovation in Agent-Based Simulations: Application to Complex Socio-Behavioral Phenomena","awardID":"1002519","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["559176"],"PO":["564988"]},"159317":{"abstract":"Miami Dade College, California State University San Marco, and the University of Texas Pan-American propose a program-called SACI for \"Scaling and Adapting Computing Alliance of Hispanic-Serving Institutions (CAHSI) Inititatives\" which will join with CAHSI and apply CAHSI best practices to advance student success among Hispanics and other groups underrepresented in computing fields. CAHSI is an NSF-funded Alliance with seven universities that has developed and demonstrated the effectiveness of a series of initiatives. The SACI partners will adapt five CAHSI strategies: (1) a new introductory course designed to attract students and prepare them for majors in computing fields, (2) a peer-led team learning structure, to provide academic support and motivation for students to persist in computing disciplines, (3) an affinity research group model, to promote undergraduate retention through early research experiences and prepare students for success in upper-division and graduate studies, (4) faculty and peer mentoring, to improve student retention and success, and (5) outreach workshops, to stimulate interest in computing careers among high school and undergraduate students and to disseminate project research and evaluation findings. SACI will join CAHSI, significantly extending the Alliance and its impact, and leveraging the Alliance's educational and research strengths; SACI will participate in the CAHSI Alliance-wide evaluation.","title":"BPC-LSA: Scaling and Adapting Computing Alliance of Hispanic-Serving Institutions (CAHSI) Initiatives","awardID":"0940575","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425906,"476751",425908,425909,425910],"PO":["561855"]},"168888":{"abstract":"perfSONAR is an infrastructure for network performance monitoring, facilitating the ability to solve end-to-end performance problems on paths crossing several networks and to enable network-aware applications. This workshop facilitates the cross-fertilization of ideas from the perfSONAR and network research communities to meet the needs of the federal and R&E (research and education) networks in the United States. The long term goal is to create a system for solving end-to-end performance problems in an efficient, scalable fashion on an ongoing basis. The workshop brings together network researchers, applications developers, network developers, network managers, and others with an interest in network performance measurement. The workshop expects to generate community of interest coupled with a report summarizing the current community consensus on potential research focus areas, open issues, and operational requirements.","title":"Workshop for perfSONAR Community Engagement","awardID":"1019008","effectiveDate":"2010-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["510794",452007],"PO":["565090"]},"159307":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940542","effectiveDate":"2010-02-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425870,"465048"],"PO":["561855"]},"161771":{"abstract":"Peer-to-Peer (P2P) technology has enabled large-scale streaming services on the Internet. The success of the next-generation P2P streaming systems largely hinges on new designs delivering a higher level of efficiency, robustness and incentives. At the same time, the increasing popularity and high-streaming rate of P2P streaming systems have already generated significant traffic stress inside ISPs' networks. The operations of future P2P streaming systems will have significant impact on the stability and efficiency of the global network infrastructure. The PI and his PhD students are developing new theory and design for the next generation P2P streaming systems. They study the service differentiation in P2P streaming to address peer heterogeneity and provide incentives.<br\/>They derive the minimum delay bounds for realtime P2P streaming and propose streaming algorithms to approach the bounds. They apply the low-delay streaming algorithms to live video streaming and 3D streaming. They develop ISP-friendly P2P streaming design to largely reduce the traffic stress imposed on ISP networks by P2P streaming applications. They also build prototypes for the proposed new designs. The research of this project will lead to open protocols, software and tools, allowing a multitude of developers, researchers, and companies to expand, improve, and evolve the next-generation P2P streaming systems. Important insights and key techniques developed in this project can also be generalized to study data streaming in general distributed systems, such as Content Delivery Networks and distributed data centers.","title":"CAREER: Next-Generation Peer-to-Peer Streaming: Theory and Design","awardID":"0953682","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["312698"],"PO":["565090"]},"168911":{"abstract":"The next generation of distributed systems is slated for a huge ramp-up in terms of availability of distributed compute resources and thus shall largely depend for their success on the next generation Internet to be able to offer enough diversified network support for these extremely distributed contexts. Scientific applications, on consolidated resources ranging from private clouds within universities and research organizations, science clouds consisting of various grid resources such as supercomputing centers etc, and commercial clouds such as Amazon, GoGrid, Rackspace, etc, represent a highly distributed application context that shall hugely benefit from considerable diversification of the underlying network substrate.<br\/><br\/>The next generation Internet should allow multiple packet switching network contexts to co-exist over a shared substrate. Each context is allowed to independently optimize its specific context without adversely affecting the performance of other co-located network contexts. To that end, the principal investigators (PIs) present ?elastic pipes,? a dynamic, on-demand, end-to-end, infrastructure-provisioning layer for the Internet. Elastic pipes borrow themselves from elastic clouds, an on demand, dynamic, compute resource leasing architecture popularized by various cloud computing platforms. However, the primary motivation behind the elastic pipe concept is to add architectural support for the realization of multiple isolated ?requirement specific? networking contexts to co-exist over the multi-domain shared infrastructure of the current Internet. ?Isolation? as it applies to the proposed design is different from that in ?virtualization? mechanisms based on two fundamental design constraints that the PIs have imposed:<br\/><br\/>C1. The fundamental packet processing discipline in the native infrastructure has to be preserved.<br\/>C2. Independent routing domains (commonly known as Autonomous Systems (AS) need to be allowed to control and optimize their individual networks.<br\/><br\/>This project is a proof-of-concept implementation of a new object oriented Internet architecture. This implementation is expected to result in a thorough feasibility study of the basic principles behind the PIs? architectural ideas for the next generation Internet. Additionally, the elastic pipe abstraction is in itself an independent module that can be incrementally implemented over the present Internet to provide huge gains in terms of diversification of the presently ?ossified? Internet.<br\/><br\/>The PIs use the specific use-case context of large scale scientific experimentation to demonstrate the claims of our architecture. Large scale distributed scientific experiments consist of geographically spread out scientists, scientific installations using dedicated networking resources. Such specialized facilities incur huge setup costs and time that need to be amortized through sufficient long term usage. Large scale scientific experiments thus serve as the perfect use case for multiple ?requirement specific networking contexts.?<br\/><br\/>Broader Impact<br\/><br\/>The proposed research may serve as a basis of a next generation Internet architecture that will allow natural sharing of resources among multiple organizations by dynamically configuring and creating a requirement specific network context for a particular application. Work under this award will develop the primitives of the ?elastic pipes? abstraction that has the potential to change the basic paradigm of all distributed computing. Also, the basic constraints placed on the design allow an incremental deployment of the PIs? ideas to the present Internet. The PIs plan to organize special sessions at leading business and networking conferences, such as Globecom, Infocom, and SIGCOMM and the results of this project will be integrated in graduate courses on networking architecture at the two universities.","title":"Collaborative Research:EAGER:Large-Scale Distributed Scientific Experiments on Shared Substrate","awardID":"1019119","effectiveDate":"2010-02-15","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["532762"],"PO":["564993"]},"165765":{"abstract":"Computing is moving beyond the desktop into new physical and social contexts. One key area of innovation has been tangible computing, which pushes the user interface beyond the screen into the physical world by means of mobile devices, graspable interfaces, physical computing, and interactive surfaces. Closely related is embedded interaction in which the everyday objects and environments we interact with are computationally augmented in new ways. As physical artifacts gain new computational behaviors, they become reprogrammable, customizable, repurposeable, and interoperable in rich ecologies and diverse contexts. They also become more complex, and require intense design effort in order to be functional, usable, and enjoyable. Designing such systems requires interdisciplinary thinking, and making them encompasses not only technical knowledge of software, electronics, and mechanics, but also the use implications of a system's physical form and behavior as well as its impacts on society.<br\/><br\/>This is funding to support a research consortium (workshop) of approximately a dozen promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM SIGCHI TEI-10 conference, which will be held January 25-27, 2010, at the MIT Media Lab in Cambridge, MA. Launched in 2007 and now in its fourth year, the TEI conference series brings together researchers, designers, engineers, and artists who are working in the emerging field of tangible, embedded, and embodied interaction. It provides a meeting ground for the diverse communities of research and practice involved with tangibles, spanning topics ranging from computing, hardware, and sensor technology, to HCI, interaction design, and CSCW, to product and industrial design and interactive arts. The intimate size of this single-track conference (about 150 participants annually) provides a unique forum for exchanging ideas through talks, interactive exhibits, demos, posters, art installations and performances. The Web site for the conference is http:\/\/www.tei-conf.org\/10.<br\/><br\/>The TEI-10 Graduate Student Symposium, which will immediately precede the main conference on Sunday, January 24, will invite twelve graduate students from TEI fields to participate in a critical discussion and review of their work with four faculty mentors. Students will present their work in posters at the conference and their short papers will be included in the conference Proceedings. In addition, students enrolled in the Graduate Student Consortium will have the opportunity to review their research with their peers and with four faculty mentors experienced in the field who will constructively critique the students' work from diverse viewpoints. <br\/><br\/>Broader Impacts: This workshop will sharpen the research skills of a new generation of scientists, engineers, and designers who will shape human-centered computing as it takes place in physical things and places. Already we are observing the impact of this field in our daily lives, as computing becomes embedded in our phones, our bus stops, and soon even our clothing. Now is a critical moment in the field, as a wave of early exploratory prototypes begins to give way to disciplined investigations, the development of toolkits, and more rigorous evaluation methods. Mentoring a next generation of TEI researchers is crucial if the field is to retain its initial vigor and openness as it gains foothold in the academic establishment of human-computing research. The Graduate Student Consortium will broaden participation in the TEI 2010 conference by enabling 12 young scholars to attend. The TEI organizing committee will make special efforts to recruit a diverse set of student participants, particularly seeking members of groups that are under-represented in computer and information science and engineering, including women and members of U.S. minority populations. The committee is particularly concerned with increasing participation of underrepresented groups and will also ensure that the meeting is accessible to participants with disabilities.","title":"Workshop: Graduate Student Consortium at Tangible Embedded Interaction 2010","awardID":"1003935","effectiveDate":"2010-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["538656"],"PO":["565227"]},"159319":{"abstract":"The Association of Computing Machinery (ACM) propose to broaden participation in computing by leveraging the Broadening Engagement program of the SC (\"Supercomputing\") conferences for 2010-2012. For more than 20 years, the SC conference series has been the \"goto\" venue for technical development, community building, and interdisciplinary activity in high performance computing, networking, and storage. SC brings together computer scientists, applications scientists, government, industry, and education and can play a major role in facilitating the diversification of the computing community and workforce. The SC conference has continued to reach out to underrepresented groups to stimulate their successful engagement with HPC. The current proposal leverages SC Broadening Engagement programs for SC2010-SC2012 and extends community support and development and builds on existing networks and alliances in the BPC community to visibly increase the level of participation of underrepresented groups in high performance computing and computing disciplines. The project will foster lasting, collaborative relationships between faculty, IT professionals, students, and computer and research scientists who attend the conference. The project will be co-sponsored by the IEEE Computer Society and ACM and with NSF support will provide participation grants, networking, mentoring and research opportunities during and beyond the SC10-SC12 conferences.","title":"BPC-LSA: Beyond Broader Engagement at SC","awardID":"0940584","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["465048"],"PO":["561855"]},"170341":{"abstract":"Abstract for<br\/>?CAREER: Secure Communication via Source and Channel Randomness?<br\/>Current cryptosystem design depends on two main kinds of algorithms: secret-key and public-key algorithms. Secret-key algorithms are simple and efficient but have key management difficulty. Public-key algorithms are simple in key management but are computationally costly and vulnerable to the man-in-the-middle attack. This research investigates the emerging physical layer security approaches, which either achieve secure communication without keys, or simplify key management by generating keys using powerful coding techniques. This research aims at facilitating implementation of the physical layer security approaches to practical wireless communication systems, and stimulating interdisciplinary collaborations among researchers in mathematics, computer science and electrical engineering.<br\/>This research provides a comprehensive framework to solve the problems of keyless secure communication and key agreement (key generation and distribution) for a variety of communication environments including noncoherent communication, channels with compound states, fading channels, noisy eavesdropping, and multihop networks. To be specific, this research investigates robust secure communication under channel uncertainty and delay constraint, fundamental tradeoff in multi-key agreement for different terminal pairs, key agreement algorithms by jointly using source and channel randomness, and key agreement protocols in multihop networks by exploiting network coding. This program is strongly coupled with educational and curriculum development at the University of Hawaii, and involves development of an advanced monograph on the topic of physical layer security to help disseminate the progresses in this active area in and outside the communication society.","title":"CAREER: Secure Communication via Source and Channel Randomness","awardID":"1026565","effectiveDate":"2010-02-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["518302"],"PO":["564924"]},"164897":{"abstract":"This proposal requests support for student travel to the 48th IEEE Conference on Decision and Control (CDC) in Shanghai, China, December 16-18, 2009. In the pages that follow, it is argued that the proposed use of NSF funds has substantial INTELLECTUAL MERIT and will have a positive BROADER IMPACT on our technical community and the field at large.<br\/><br\/><br\/>INTELLECTUAL MERIT: It is increasingly evident that current research on many technological frontiers is heavily influenced by foundational ideas from control and system theory. This research is creating advances in such diverse applications domains as communications and manufacturing networks, finance and risk management, cooperative control of systems of multiple autonomous agents, and systems biology. The IEEE CDC is the premier annual international conference on systems and automatic control research. The 48th CDC now has an expected level of participation over 1700. The overarching intellectual merit of the proposed use of funds is that graduate students will see firsthand how the foundations of control and systems are evolving and shaping the frontiers of research in many applications domains.<br\/><br\/><br\/>BROADER IMPACT: With around 1500 reseach presentations, including several plenary lectures, numerous tutorial presentations, workshops and exhibits the CDC provides attendees with exposure to the state-of-the-art in emerging areas of control research and technology. The broader impact of this travel support is that it will help train the next generation of control researchers<br\/>and practitioners. The future security and well-being of the United States relies on maintaining pools of trained scientists and engineers in critical areas such as control technology. The students to be supported under the proposed project represent the future technological leaders of the IEEE Control Systems Society, which is the world?s leading professional organization<br\/>in the discipline.","title":"Student Travel Support for the 2009 IEEE Conference on Decision and Control. To be held in Shanghai, China, on December 16-18, 2009.","awardID":"0970028","effectiveDate":"2010-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7607","name":"ENERGY,POWER,ADAPTIVE SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["461699"],"PO":["564728"]},"168912":{"abstract":"The next generation of distributed systems is slated for a huge ramp-up in terms of availability of distributed compute resources and thus shall largely depend for their success on the next generation Internet to be able to offer enough diversified network support for these extremely distributed contexts. Scientific applications, on consolidated resources ranging from private clouds within universities and research organizations, science clouds consisting of various grid resources such as supercomputing centers etc, and commercial clouds such as Amazon, GoGrid, Rackspace, etc, represent a highly distributed application context that shall hugely benefit from considerable diversification of the underlying network substrate.<br\/><br\/>The next generation Internet should allow multiple packet switching network contexts to co-exist over a shared substrate. Each context is allowed to independently optimize its specific context without adversely affecting the performance of other co-located network contexts. To that end, the principal investigators (PIs) present ?elastic pipes,? a dynamic, on-demand, end-to-end, infrastructure-provisioning layer for the Internet. Elastic pipes borrow themselves from elastic clouds, an on demand, dynamic, compute resource leasing architecture popularized by various cloud computing platforms. However, the primary motivation behind the elastic pipe concept is to add architectural support for the realization of multiple isolated ?requirement specific? networking contexts to co-exist over the multi-domain shared infrastructure of the current Internet. ?Isolation? as it applies to the proposed design is different from that in ?virtualization? mechanisms based on two fundamental design constraints that the PIs have imposed:<br\/><br\/>C1. The fundamental packet processing discipline in the native infrastructure has to be preserved.<br\/>C2. Independent routing domains (commonly known as Autonomous Systems (AS) need to be allowed to control and optimize their individual networks.<br\/><br\/>This project is a proof-of-concept implementation of a new object oriented Internet architecture. This implementation is expected to result in a thorough feasibility study of the basic principles behind the PIs? architectural ideas for the next generation Internet. Additionally, the elastic pipe abstraction is in itself an independent module that can be incrementally implemented over the present Internet to provide huge gains in terms of diversification of the presently ?ossified? Internet.<br\/><br\/>The PIs use the specific use-case context of large scale scientific experimentation to demonstrate the claims of our architecture. Large scale distributed scientific experiments consist of geographically spread out scientists, scientific installations using dedicated networking resources. Such specialized facilities incur huge setup costs and time that need to be amortized through sufficient long term usage. Large scale scientific experiments thus serve as the perfect use case for multiple ?requirement specific networking contexts.?<br\/><br\/>Broader Impact<br\/><br\/>The proposed research may serve as a basis of a next generation Internet architecture that will allow natural sharing of resources among multiple organizations by dynamically configuring and creating a requirement specific network context for a particular application. Work under this award will develop the primitives of the ?elastic pipes? abstraction that has the potential to change the basic paradigm of all distributed computing. Also, the basic constraints placed on the design allow an incremental deployment of the PIs? ideas to the present Internet. The PIs plan to organize special sessions at leading business and networking conferences, such as Globecom, Infocom, and SIGCOMM and the results of this project will be integrated in graduate courses on networking architecture at the two universities.","title":"Collaborative Research:EAGER:Large-Scale Distributed Scientific Experiments on Shared Substrate","awardID":"1019120","effectiveDate":"2010-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["532760"],"PO":["564993"]},"170342":{"abstract":"CIF: Small: Collaborative Research: Wireless Networks: Fundamental Limits via Extremal Entropy Properties<br\/><br\/>Using extremal entropy properties to characterize the fundamental performance limits of network communication is a tradition of information theory. Most historical successes, however, relied on one particular extremal entropy inequality: the entropy-power inequality of Shannon and Stam, which, though powerful, applies mainly to networks with certain degradedness structure. Moreover, wireless features such as multiple-input multiple-output (MIMO) communications, channel uncertainty incurred by fading, and secrecy constraints due to the broadcast nature of radio communication bring new challenges that cannot be overcome by the entropy-power inequality of Shannon and Stam alone. This situation calls for in-depth investigations of the interaction between converse problems in network information theory and extremal entropy properties in statistics, resorting to powerful statistical tools to solve important communication engineering problems.<br\/><br\/>The specific goals of this research are: 1) to examine systematic ways of establishing extremal entropy properties through links between information theory and statistics; 2) to establish channel-enhancement as a general framework for solving the converse problems for MIMO downlink communication; and 3) to identify general frameworks for solving the converse problems for collaborative communication in cognitive wireless networks. <br\/><br\/>Recent years have seen substantial efforts in designing new coding schemes to achieve better performance for wireless networks. Fundamental understanding of the limits of these coding schemes is thus extremely important from the engineering viewpoint to direct future research and to prevent over-engineering and bolster confidence for simple and structured coding schemes. Intellectual results obtained from this research will also be disseminated via course developments on network information theory and wireless communications at Texas A&M and the University of Hawaii.","title":"CIF: Small: Collaborative Research: Wireless Networks: Fundamental Limits via Extremal Entropy Properties","awardID":"1026566","effectiveDate":"2010-02-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["518302"],"PO":["564924"]},"166823":{"abstract":"This proposal applies for NSF support to broaden participation in the Fifteenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS?10), to be held in Pittsburgh, Pennsylvania on March 13?17, 2010. ASPLOS is the premiere forum for research involving the interaction of computer architecture, compilers, and operating systems.<br\/>This proposal aims to increase the impact of this conference by enabling participation by additional students and faculty for whom travel support would otherwise preclude their attendance. The PIs are requesting funds to cover expenses of up to 40 US-based students, post-docs and junior faculty with no NSF travel support.","title":"Workshop: Support for the Fifteenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2010","awardID":"1008376","effectiveDate":"2010-02-15","expirationDate":"2010-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["508314","475186"],"PO":["565272"]},"161697":{"abstract":"Complex network systems are extremely vulnerable. This vulnerability may be propagated, leading to a much more devastating consequence. Furthermore, several network algorithms must be adaptable to changes in order to maintain their functions. In the presence of uncertainty, network vulnerability and adaptability are the two major aspects that must be deeply investigated.<br\/><br\/>This proposal is using optimization theory and approximation techniques to address the following fundamental questions: How do we quantitatively measure the vulnerability degree of the network? How is the vulnerability propagated? What are the quantitative benefits of using adaptive solutions vs. re-computing it from scratch? What techniques can we use for adaptive solutions in order to theoretically bound their performance? The proposal provides several new theoretical frameworks and approximation techniques to characterize the network vulnerability and adaptability, which brings the understanding of network vulnerability and adaptability to the next level.<br\/><br\/>This research can potentially impact nearly all applications that benefit from networks such as the Internet, critical network infrastructures, and transportation networks where vulnerability and adaptability are important characteristics. In addition to its obvious impact on networks, the project crosses several research areas such as graph theory, approximation algorithms, combinatorial optimization, and computational complexity, thus it has a profound impact on the theory of optimization and approximation, especially the adaptive approximation techniques.","title":"CAREER: Optimization Models and Approximation Algorithms for Network Vulnerability and Adaptability","awardID":"0953284","effectiveDate":"2010-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[432405],"PO":["565090"]},"167847":{"abstract":"This is funding to support attendance by approximately 25 advanced doctoral students from the United States and abroad at the 10th International Conference on Intelligent Tutoring Systems (ITS 2010), which will take place June 14-18, 2010, in Pittsburgh. The first ITS conference was held in 1988 in Montreal, and they have continued every two years for the past 12 years in locations that include Brazil, Taiwan, France, and Canada as well as the United States. The ITS conferences offer a rare professional opportunity for interdisciplinary researchers from around the world to converge and present cutting-edge results from the fields of artificial intelligence, computer science, cognitive and learning sciences, psychology, and educational technology. The goal is to promote studies in advanced systems in computer science applied to education, cognitive science and human learning for learners of all ages. To that end, the series provides a forum for the interchange of ideas in all areas of computer science and human learning, a unique environment in which researchers and practitioners exchange ideas, theories, experiments, techniques, applications and evaluations of initiatives supporting new developments relevant for the future. Comments and feedback from each previous ITS conference indicate that the carefully structured conference format continues to be professionally rewarding and stimulating to all who attend. ITS conferences are highly refereed international events and serve as reference guidelines for the research community; each paper is generally reviewed by 4 referees so that having a paper published at ITS is a reference of quality for any researcher evaluation. The conferences operate under the auspices of an independent nonprofit organization and are funded entirely by registration fees. More information about the conference is available at http:\/\/www.cmu.edu\/its2010.<br\/><br\/>Students supported by NSF funds will have the opportunity to attend sessions with papers, posters, tutorials, workshops, and informal interactions with accomplished researchers, the latter within the framework of a Young Researchers Track that includes special sessions for the students to present their research ideas, meet peers who have related interests, and receive feedback and mentoring from senior members of the ITS community. A structured program will be provided in which each student is matched with a mentor who will be encouraged to offer feedback and support to students as they prepare their presentations, during the doctoral consortium sessions, and in at least one 1-on-1 meeting. The doctoral consortium will be situated within the main conference program in order to encourage maximal community involvement. Its structure will facilitate as much discussion and feedback as possible. With this goal in mind, students will present their work at lunchtime poster sessions open to all attendees. To avoid competition with other events and to maximize attendance, no other talks will be scheduled at this time and posters will be in the same rooms as the buffet lunch for all conference attendees. To acquaint attendees with student work, student poster sessions will be immediately preceded by \"fire-hose\" sessions where students summarize their work very briefly. To enable poster presenters to see and discuss each other's posters, poster presentations will span all 3 days of the main conference so as to give students one day to present their posters and two days to see others. Space and logistics permitting, presenters will be able to leave their posters up all 3 days of the conference, affording additional opportunities to discuss them with other researchers, for example during coffee breaks. <br\/><br\/>Broader Impacts: This activity supports one of NSF's core missions, to train more advanced professionals in Science, Technology, Engineering, and Mathematics (STEM). Participating in the conference will provide the selected students with a unique opportunity to be exposed to current research directions in different research communities both domestic and foreign. This is important for the field, because it has been recognized that transformative advances in research tend to derive from the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming years. The PI will place high priority on supporting young researchers (intermediate and advanced doctoral students) from degree-granting institutions that lack the funding necessary to support attendance by their students at international conferences such as ITS.","title":"Student Support for the Tenth International Conference on Intelligent Tutoring Systems","awardID":"1014092","effectiveDate":"2010-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["554179","551746"],"PO":["565227"]},"161841":{"abstract":"This project aims to create a systematic framework with novel approaches and techniques to defend against current and next generation botnets. A botnet is a network of compromised computers (bots) that are under the control of an attacker (botmaster) through some command & control (C&C) channel. In recent years, botnets have distinguished themselves from previous generation malware as the primary platform and root-cause for most Internet attacks and illegal activities. With the magnitude and the potency of attacks afforded by their combined bandwidth and processing power, botnets are now considered as the greatest single threat to Internet security. As botnets involve both host-level and network-level activities, a systematic defensive framework should consider both host- and network-level information. We can achieve better defense by utilizing host-network coordination, community-based intelligence, and a cross-layer view, instead of relying on a single (or a set of separate) host- or network-level information source(s). <br\/><br\/>This project establishes a host-network coordination- and correlation-based framework for systematic botnet defense in depth. It addresses three major questions covering detection, prevention, and attribution of botnets: How to detect the existence of botnets in an efficient, accurate, robust, fast, and automatic way? How to prevent botnets from penetrating into a protected network? Where does the command and control (C&C) actually originate from? The methodology and techniques proposed in the project can have a profound impact on future malware defense in terms of improving its effectiveness, efficiency, and robustness.","title":"CAREER: Coordination- and Correlation-based Botnet Defense","awardID":"0954096","effectiveDate":"2010-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["548314"],"PO":["565327"]},"161742":{"abstract":"CAREER: Foundations of Markets as Information Aggregation Mechanisms<br\/><br\/>Prediction markets are markets designed for information aggregation. To achieve its goal, a prediction market offers a contract whose future payoff is tied to outcomes of an event of interest. Participants of the market express their information about the event through trading the contract. The market price hence potentially incorporates the information of all participants and approximately represents a consensus forecast for the event. Prediction markets have shown great potential as highly effective information aggregation tools in practice. However, they may be subject to manipulation. Participants have incentives to lie about their information in order to seize more profit in the market or be rewarded outside the market. With manipulation, information aggregation may fail and the credibility of market prices is put into question. Another challenge is the computational problem of operating combinatorial prediction markets. When the mechanism becomes more expressive and participants can reveal their information on combinations of outcomes, the process of operating a market may become computationally intractable, which makes such combinatorial prediction markets impractical to use. The goal of this project is to perform a foundational study on issues that arise in prediction market design<br\/>because of the self-interest of participants and the need of expressiveness. Using computer science theory and game theory as the main research approaches, Dr. Chen will establish the strategic and computational foundations for prediction markets so as to design market mechanisms that are not only theoretically sound but also practically applicable for information aggregation in complex real-world settings.<br\/><br\/>This project is centered around two themes: manipulation-resistant prediction markets and computationally efficient combinatorial prediction markets. The research on manipulation-resistant prediction markets investigates when manipulation arises, how manipulation affects information aggregation, and how to design prediction market mechanisms to explicitly control the impact of manipulation. It will provide answers to the most fundamental question of whether people can trust the<br\/>information conveyed by prediction markets and design robust market mechanisms for information aggregation. The research on computationally efficient combinatorial prediction markets examines the tradeoff between expressiveness and computational complexity of combinatorial prediction markets, designs tractable combinatorial prediction markets, and develops efficient approximation algorithms for intractable combinatorial prediction markets. It will help to transfer combinatorial prediction markets from theoretical artifacts to practical devices for aggregating richer information. This project does not depend on any specific application domain. Hence, mechanisms designed in this project can be applied to aggregate information in many settings, including business, government, and society. Results of this project will also help to inform policy making on the possible regulation of prediction markets.","title":"CAREER: Foundataions of Markets as Information Aggregation Mechanisms","awardID":"0953516","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":["541778"],"PO":["565251"]},"161863":{"abstract":"Security risks associated with software that communicates over networks have become an increasingly costly problem for consumers, firms, and governments. A key characteristic of any interconnected system (e.g., network software such as Apache HTTP server, the smart grid, and airline baggage operations) is that choices made in the design, deployment, and usage of these systems can have significant implications for security risk. Because these choices are often driven by economic tradeoffs, both firm and consumer incentives can be designed to encourage the development of systems that are less vulnerable. Further, due to the fact that seemingly disparate systems are connected through the network, security weaknesses in one system can rapidly cause major problems for another. Because of these negative externalities, governments may need to intervene through regulation or legislation to ensure the security of critical components of the public infrastructure (e.g., the Internet). This project develops a research framework to analyze the relationship between government policy, economic incentives of firms and consumers, and software security risks of networks. The goal of the project is to gain new insights into how the efforts of firms, consumers, and government can be coordinated to improve software security. To better understand this socio-technical problem, the research will generate formal economic theory to analyze the complex interactions between these entities, each of whom has varying economic incentives. Three important aspects of the software security landscape are studied: software liability, the impact of software deployment models, and open source software incentives for security. To clarify the interplay between public and private forces on security, this research program rigorously studies the role of government in setting policy on software liability, security investment, and technology-specific subsidization to help control software security risks. It will provide guidelines on how software liability should be employed in a context with security interdependence. Also, since design choices by software firms partially determine a given product?s risk exposure to both directed and undirected security attacks, a modeling framework is built to examine how each type of attack distinctly influences software security in consideration of user behavior; the results have important implications for optimal software design. An important outcome of the work is to combine for the first time research on the economics of open source software with that on security risk, two significant streams of research in the literature. In this dimension, the project investigates whether open source software can lower security risks and lead to socially preferable outcomes.<br\/><br\/>By advancing one?s understanding of how to manage software security risk, this project will have wideranging impacts. First, the results will provide guidance to policy makers on how to craft policies which account for firm and user behavior while mitigating the enormous social and economic losses from security attacks on software. Since software security is critical to national defense, one priority is to keep an open dialogue with appropriate government agencies on the project?s outcomes. Second, this work can advise software firms on improved software design and using source code strategy to achieve greater security. Third, society can benefit substantially from improved software and reduced economic losses. By involving undergraduate and graduate students in the research process, the project will provide mentorship on economic modeling and quantitative analysis. As part of the educational activities, a case study that focuses on the interaction between open source incentives and security risk will be generated.<br\/>By integrating the research findings and the case study with IT curricula, the project will educate future business leaders on IT strategy and security.","title":"CAREER: Control of Information Security Risk Using Economic Incentives","awardID":"0954234","effectiveDate":"2010-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[432750],"PO":["565136"]},"165428":{"abstract":"The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing. The ACL's annual conference is the major international conference in this field. This project is to subsidize travel, conference, and housing expenses of students selected to participate in the Association for Computational Linguistics (ACL) Student Research Workshop, which is part of the ACL conference on July 11-16, 2010 in Uppsala, Sweden. The workshop consists of two tracks: paper presentations and poster presentations. Each paper presentation is followed by a discussion chaired by respected researchers in the field. The poster session provides a further opportunity for extended one-on-one interaction with the members of the CL research community. All selected work has only student authors and the workshop is organized and run by students.<br\/><br\/>The Student Research Workshop provides a valuable opportunity for the next generation of natural language processing researchers to enter the computational linguistics community. It allows the best students in the field to take their first important step toward becoming professional computational linguists by receiving critical feedback on their work from external experts, and by making contacts with other students and senior researchers in their field. The students who are involved in running and selecting papers for the workshop also gain valuable opportunities for professional growth and interaction with the researchers on the organizing committee of the main conference. The workshop contributes to the maintenance and development of a skilled and diverse computational linguistics and natural language processing research community.","title":"Student Research Workshop in Computational Linguistics at the ACL 2010 Conference","awardID":"1002634","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[443147],"PO":["565215"]},"167408":{"abstract":"This project, supported by an EArly-concept Grant for Exploratory Research (EAGER), is developing computational models of how manuscripts of premodern texts changed over time due to copying with errors, intentional editing, and translation into different languages. The purpose of these models is to reconstruct the original texts and to better understand the forces that shaped them. We are building on work applying ideas from computational evolutionary biology to the task, but the main focus of the project is to explore whether cutting-edge ideas from computational linguistics and natural language processing are better suited for modeling the evolution of natural-language texts. In particular we are exploring the use of techniques from nonprojective dependency parsing to model the tree of relationships among manuscripts and statistical machine translation to model the relationship between pairs of manuscripts.<br\/><br\/>The tools that result from the project will be made publicly available in order to foster cross-disciplinary research. These tools will enable scholars of ancient and medieval literature to use our models to analyze collections of manuscripts that may not have been possible to analyze by hand before. The techniques explored will shed light on computationally hard learning and search problems such as those that frequently arise in natural language processing.","title":"EAGER: Phylo: Phylogenetic Reconstruction of Textual Histories","awardID":"1011778","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["499581"],"PO":["565215"]},"161622":{"abstract":"Elevated temperature is a major problem for the reliability, performance, power consumption, and packaging costs of integrated electronic devices. Temperature is a main physical barrier limiting the performance benefits of future technologies that promise tera-scale integration. To meet the thermal management challenges of future many-core processors, this research program envisions a new class of intelligent dynamic thermal management systems that explore the vast search space of possible control parameter settings and decide the optimal temperature and performance targets. This research program also investigates new cooling system designs that enable the thermal management system to target directly hot spots at the micro scale. Directly targeting hot spots alleviates the thermal constraints on performance.<br\/><br\/><br\/>The proposed research program will lead to transformative solutions and tools that address the fundamental thermal management challenges of computing systems and ensure their scalability. The proposed program will lead to the training of a diverse workforce of undergraduate and graduate students to be well prepared to deal with tomorrow?s thermal management challenges. The educational component of this program includes (1) research experiences for undergraduates; (2) integrated approach to entrepreneurship education with research; (3) hands-on training through the development of educational laboratories based on a state-of-the-art infrared camera; and (4) continuous education through the development of high-quality educational materials and an interactive technical Web site.","title":"CAREER: Transcending the Thermal Management Challenges of Tera-Scale Computing","awardID":"0952866","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["543459"],"PO":["562984"]},"161578":{"abstract":"The rampant growth of stealthy rootkits poses a serious security <br\/>threat to cyberspace. Specifically, with the capability of directly <br\/>subverting the software root of trust of a computer system, a rootkit <br\/>can surreptitiously take over the control of the system and maintain <br\/>a hidden presence thereafter. To effectively defend against them, <br\/>researchers have explored various anti-rootkit solutions. Unfortunately, <br\/>to our disadvantage, the state-of-the-art defense is mainly reactive <br\/>and cannot meet the challenges in the arms-race against them.<br\/><br\/>This project is developing a systematic immunization approach to <br\/>proactively prevent and exterminate rootkit attacks. This goal is <br\/>being achieved in three key steps. First, we are developing a fundamental <br\/>immunization capability self-nonself discrimination to reliably discern <br\/>and prevent malicious rootkit code execution. Second, we are investigating <br\/>a kernel shepherding technique to enforce kernel control-flow integrity. <br\/>Third, we are designing and implementing a high-assurance hypervisor <br\/>with a minimal trusted computing base to establish and sustain the <br\/>root-of-trust of the entire computer system. We expect the results <br\/>from this research will substantially elevate our defense capability <br\/>against elusive rootkits as well as more generic malware. We will <br\/>disseminate our results by releasing the tools developed as well as <br\/>associated education materials appropriate for undergraduate and <br\/>graduate courses and IT staff training in industry and government <br\/>agencies.","title":"CAREER: Towards Exterminating Stealthy Rootkits - A Systematic Immunization Approach","awardID":"0952640","effectiveDate":"2010-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["434616"],"PO":["557315"]},"153989":{"abstract":"Currently in the Internet there is an increasing number of unwanted, unsolicited \"garbage\" packets mainly generated by botnets, which can launch Distributed Denial-of-Service attacks, worm attacks, and spam. These garbage packets are allowed to traverse the Internet to cause severe traffic burdens, waste communication resources, and disrupt the Internet?s normal functions. Such packets need to be discarded as close to their sources as possible to increase the availability and reliability of the Internet.<br\/><br\/>This project aims to establish a comprehensive and sustainable architecture that coordinates the routers in the Internet to achieve early filtering of botnet garbage packets in Internet traffic. The architecture comprises four major components: rule generation component, rule dissemination component, rule management component, and rule security component. The objective is to investigate and quantify the tradeoff between the saved bandwidth originally consumed by the garbage traffic and the throughput slowdown introduced by the routers' extra filtering overhead, and find optimal solutions under the tradeoff function. The evaluation plan will use benchmarks developed under various traffic traces and network topologies to evaluate the performance of the developed algorithms and technologies, and derive insights on how far and wide the filtering rules should be disseminated and installed under different attack scenarios in order to optimize the performance.<br\/><br\/>Completion of the project will create techniques and software that improve the security and capacity of the Internet overall. Additionally, early filtering of garbage traffic will limit the damages caused by large-scale botnet attacks, reduce operational costs for ISPs, enhance the performance of many online services and applications, and increase the reliability of critical national infrastructures.","title":"TC: Small: Dynamic Early Filtering of Botnet Garbage Traffic","awardID":"0916857","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["423741"],"PO":["565239"]},"161821":{"abstract":"Hybrid systems (deterministic and stochastic) are widely used as the mathematical framework to model many engineering systems and natural phenomena, ranging from biomolecular processes to modern air traffic control systems. One of the most important analysis problems in hybrid systems is reachability\/safety analysis, where the question of interest is whether the system can enter an undesirable state during its execution. For stochastic hybrid systems, the same question is asked with a probabilistic qualifier, i.e., what is the probability of the occurrence of such an event. This question is crucial in analyzing the performance or correctness of engineering systems, and the accuracy of the mathematical models of natural phenomena, such as cellular biomolecular processes. <br\/><br\/>This project develops formal analysis methods for reachability\/safety analysis based on the execution trajectories of stochastic hybrid systems or their abstraction. The main tool used in this research is the notion of trajectory robustness, which is established using bisimulation functions. This technique offers a number of advantages over other methods, including simplicity of implementation, better complexity, easiness of parallel implementation, and possibility of partial verification. The project also aims to extend the analysis from static reachability\/safety properties to dynamic ones that are specified by temporal logic.<br\/><br\/>The research program includes the development of necessary theoretical results, algorithms, and software tools for the application of the theory of trajectory based analysis. The integration of the theoretical results in a software tool will play an important role in disseminating the research output in the industry and academia. There are also ongoing efforts in applying the results in cutting edge engineering challenges, such as microscale actuation using bacteria and the development of portable UV-based water sterilizer.<br\/><br\/>In parallel with the research program, this project has an educational agenda involving K-12, undergraduate and graduate level education. The broader impact of the educational program is in educating new engineers and researchers that are fluent in multidisciplinary research collaborations and are aware of the tremendous potentials of such activities. The outreach component of the educational program will also improve pre-college students' awareness of the potential and attractiveness of engineering and research careers.","title":"CAREER: Robust Trajectory Based Analysis for Stochastic Hybrid Systems Abstraction and Verification","awardID":"0953976","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518132"],"PO":["565255"]},"161722":{"abstract":"This CAREER proposal deals with the development of novel systems for automatic summarization which incorporate both linguistic and content quality considerations in their operation. The main motivation for the work is that even the best current systems do not take the characteristics of the input into account during their operation, they cannot estimate how successful they perform content selection, and completely ignore issues of linguistic quality of the output.<br\/><br\/>Improvement of linguistic quality of summaries requires a combination and relative assessment of a wide range of text quality factors:<br\/>discourse relations, topic\/entity\/word coherence, form of referring expressions, vocabulary. Tools for automatic extraction of such models from the input text, including automatic discourse analysis of explicit and implicit discourse relations, are developed as part of the project. The resulting models of linguistic quality will have broader impact on a whole range of text producing applications including questions answering, machine translation, automatic essay grading and computer-assisted writing tutoring.<br\/><br\/>Improvement of content quality requires taking into account characteristics of the input. In particular, we develop measures of input difficulty, which enable systems to automatically predict if they can produce a good quality summary for a given input and permit for change of summarization strategy when necessary. Specialized summarization strategies for input types where current system performance is known to be suboptimal are also elaborated.<br\/><br\/>Text quality and summarization are research topics with cross-disciplinary appeal. The PI will offer project-based courses at the undergraduate and graduate level which have the potential to attract young people to the field of computer science.","title":"CAREER: Capturing Content and Linguistic Quality in Automatic Extractive and Abstractive Summarization","awardID":"0953445","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["519134"],"PO":["565215"]},"168906":{"abstract":"This award supports a Doctoral Consortium (DC) at the 2010 ACM GROUP Conference to be held November 7-10, 2010 in Sanibel Island, FL. The ACM GROUP conference is held bi-annually, bringing together researchers and practitioners from the fields of organizational behavior, information systems, social informatics, information sciences, and computer supported cooperative work. The focus of the DC is the intellectual content of the students' doctoral research projects. Students are selected for attendance based on competitive review of the materials supplied. These projects represent state-of-the-art research in the study and development of organizational systems, information systems, social informatics, and computer supported cooperative work. The DC creates a social network among the next generation of researchers and several senior mentors selected from top academic institutions and research laboratories. Students and mentors will be a diverse group on several dimensions (nationality, scientific discipline, gender, institutional affiliation, under-represented minority status), therefore participation in the consortium will broaden the students' intellectual and social perspectives at a critical stage in their professional development.","title":"Workshop: Association for Computing Machinery Group'10 Conference Doctoral Research Consortium","awardID":"1019089","effectiveDate":"2010-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["264837"],"PO":["565227"]},"162945":{"abstract":"The University of Texas, Austin proposes a planning grant to bring its Computer Science Department and UTeach program together with the goal of creating UTeach-CS. UTeach started at The University of Texas as a new way to prepare secondary science, math and computer science teachers. It is a unique collaboration between the Colleges of Natural Sciences and Education, supporting undergraduates who want to teach, college graduates who want to return for certification, new teachers looking for a supportive community, and experienced teachers who want an advanced degree. It has proven to be so effective that it is now being replicated at universities across the United States. Yet few Computer Science students participate. This planning grant will do preliminary work to establish a UTeach-CS program at the UT-Austin and to help replicate it at other universities. In particular, the outcomes include (1) an understanding of how to better market UTeach and the teaching profession to CS students and IT professionals, (2) the development of a UTCS Bachelor?s degree plan that better accommodates the UTeach certificate, (3) an understanding of the prospects and challenges of replicating our UTeach-CS program to replication sites within Texas, (4) the exploration of CS curricula for training math and science students who are not CS majors and for training high school teachers who are not certified to teach CS, and (5) a plan for growing UTeach-CS beyond this first year and for replicating it to other institutions supported by the UTeach Institute. This effort is in alignment with the CISE CS\/10K goal of dramatically increasing the number of US high school computer science teachers by the year 2015.","title":"BPC-DP: A Planning Grant for Establishing UTeach-CS","awardID":"0959827","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["496821"],"PO":["561855"]},"161658":{"abstract":"Collections of distributions arise naturally when analyzing large data sets. Since it is impractical to store all but a small fraction of such data, distributional representations are typically used to summarize the data in compact form. For example, a document in a corpus is typically represented by a normalized vector of frequencies of occurrence of keywords, an image is represented by a histogram over gradient features and speech signals are represented by spectral densities over a frequency domain.<br\/><br\/>Representing data sets as collections of distributions enables analysis via powerful concepts from statistics, learning theory and information theory. Concepts like strength of belief, information content, and pattern likelihood are used to extract meaning and structure from the data and are quantified using information measures like the Kullback-Leibler distance and its parent class, the Bregman divergences.<br\/><br\/>These measures capture meaning in data in a manner that traditional metrics cannot, by connecting abstract notions of information loss and transfer with concrete geometric notions like distances. However, they lack properties like symmetry and the triangle inequality that are essential requirements for the application of traditional geometric algorithms for data analysis.<br\/><br\/>In this project, the PI will develop a systematic, rigorous and global algorithmic framework for manipulating these distances. This framework will provide the foundation for efficient and accurate data analysis of spaces of distributions, and will lead to deeper insights into analysis problems across a wide range of applications.","title":"CAREER: Geometric Algorithms For Data Analysis In Spaces Of Distributions","awardID":"0953066","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["542076"],"PO":["565157"]},"161758":{"abstract":"Enterprise network operators must frequently change the design of their networks to reflect new organizational needs (e.g., company mergers). Redesigning enterprise networks is challenging given the need to change hundreds of interdependent low-level configurations. Configuration errors can have catastrophic consequences (e.g., large-scale network outages). The project is investigating systematic frameworks to help operators redesign their networks to meet desired high-level objectives. Optimization problems are formulated that trade-off the benefits of a redesign task with the reconfiguration costs involved. Algorithms for the redesign tasks are derived by exploring synergies with theoretical work in the operations research community. The project is devising hybrid methodologies for validating configuration changes that combine static configuration analysis with information obtained from monitoring network behavior. Novel techniques based on data-mining are being developed that can capture configuration dependencies across network devices. The techniques are being applied to important and unexplored problem domains such as migrating security policies from enterprise data centers to a cloud computing model, reorganizing routing designs on mergers, and service differentiation policies. The research if successful will change how operators manage their networks, leading to large cost-savings for IT organizations, and the creation of more reliable and secure networks. The research will foster innovation by lowering the risks in migration to new enterprise network architectures such as cloud computing and clean-slate architectures. The PI is creating a network configuration data repository available to academic researchers, introducing new lecture material on enterprise management in the networking curriculum, and participating in summer camps for K-12 students.","title":"CAREER: Towards Automated and Assurable Enterprise Network Migration","awardID":"0953622","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8010","name":"Computing in the Cloud"}}],"PIcoPI":["508447"],"PO":["565090"]},"161836":{"abstract":"Networks are crucial to the future; these networks may govern the effectiveness of sensing and communication, social interactions, and power transmission. Current network research primarily proceeds on a disconnected problem-by-problem basis; this ignores the underlying similarities of problem domains, and is increasingly untenable as technology challenges proliferate. <br\/>This proposal takes first steps towards a more universal science for network algorithms. The intellectual foundations of our approach are new connections between networks and Markov Random Fields (MRFs) - a classic formalism for statistical inference. We develop general-purpose algorithmic frameworks for two broad classes of network problems: <br\/>(a) distributed combinatorial optimization; based on message-passing MRF estimation heuristics, like Belief Propagation. This simultaneously provides new algorithms for scheduling, network formation, facility location etc.<br\/>(b) network data analysis; based on regularization and rank-minimization techniques used for learning in MRFs. This enables new methods for tomography, social network clustering, localization etc.<br\/>For any particular application, our framework generates a new and competitive first-cut solution, which domain knowledge easily improves into a state-of-the-art solution.<br\/>This research will significantly impact both how we control large-scale networks, and interpret the high-dimensional data they generate. By providing a common algorithmic language, it will facilitate the easy migration of techniques across fields. Industry will continuously influence and absorb this research, via the WNCG industrial affiliates program at UT. We will build a social network for education, which will expose K-12 and undergraduates to network research, enhance pedagogical resources at UT, and generate real-world social network data.","title":"CAREER: Networks and Statistical Inference: New Connections and Algorithms","awardID":"0954059","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550745"],"PO":["564993"]},"160549":{"abstract":"Clinical simulation is emerging at the forefront of technologies for teaching medical professionals without endangering patient safety. Because of tremendous strides in computer graphics, haptics, bioengineering, human computer interaction, and decision sciences, we are at the crux of an impending revolution in the field of clinical simulations. This revolution will be fueled by new researchers that focus in this area of specialization. The \"Medicine Meets Virtual Reality\" (MMVR) conference series, established in 1992, has evolved into an annual international event that promotes emerging data-centered technologies for medical care and education. The conference is independent of any professional association or institution; papers are selected on the basis of peer review by a committee of scientists and physicians (http:\/\/www.nextmed.com\/mmvr_committee.html), and the conference proceedings are published by IOS Press (http:\/\/www.iospress.nl). Conference attendees are typically a mixture of computer scientists and engineers, physicians and surgeons, medical educators and students, military medicine specialists, and biomedical futurists. This makes for an audience that is interested in cutting edge science and promotes cross-cutting interdisciplinary studies in the area of clinical simulation. <br\/><br\/>This is funding to support a research consortium (workshop) of approximately 12-15 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event, the first of its kind to be associated with MMVR, will be held in conjunction with the MMVR18 conference which will take place January 14-16, 2010, in Newport Beach, California. The goal of the workshop is to guide students with their research theses, by providing specific feedback as well as broader advice on the research environment and its international dimensions. The workshop will take place on a single full day before the main conference begins. Students will present and discuss their research and get constructive feedback from a panel of about 6 leaders in the field, whose members include approximately equal numbers of prominent research faculty and experienced practitioners, and who represent multiple specialties and countries. At least one panelist will have a close relationship with industry, so students can acquire a better understanding of the commercial perspective. As an experimental activity, the workshop organizers plan to support the students and their academic pursuits beyond the conference, by developing a dedicated website along with a listserv that will link workshop participants together so they can continue to interact by sharing materials and interesting literature, discussing common concerns, etc. Thus, the workshop will promote development of a network of young researchers, which the organizers hope will serve as the basis for future collaborations.<br\/><br\/>Broader Impacts: This workshop will have both technical and societal impact. From a technical perspective, it will serve to train and guide the next generation of researchers, who will address the myriad research questions facing the clinical simulation community. Computing and technology research has a major role to play in the need for a more efficient healthcare system. Clinical simulation has emerged as a major tool for the healthcare industry in training the next generation of medical professionals, enabling healthcare institutes to make complex decisions and provide state of the art clinical and ambulatory services. Training doctoral students in computer science and related areas to conduct the necessary basic research in clinical simulation is critical to the successful translation of this basic research to tools and techniques used in the healthcare arena. The workshop will have impact in the short term by providing young researchers with an avenue to interact with leaders in the field and hone their skills; panelists will provide timely feedback to students and help them shape their future research directions. From a societal perspective, the workshop will further the goals of designing human centered systems that enable patient safety, by laying the foundation for research that is grounded and intricately designed from its inception to address key research challenges facing the biomedical computing community.","title":"Workshop: Doctoral Consortium at the Medicine Meets Virtual Reality (MMVR) 2010 Conference","awardID":"0946781","effectiveDate":"2010-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["438517"],"PO":["565227"]},"161848":{"abstract":"The next generation networks are envisaged to be very large-scale, highly complex systems that handle heterogeneous traffic in diverse environments, are truly distributed and have even greater capacity, reliability and capability. These attributes can be achieved by deploying sophisticated mathematical techniques that require cooperative behavior among the various independent entities that often have economic interests. Such cooperation however, can be hard to achieve in practice leading to suboptimal performance. <br\/><br\/>In this project, we are developing a systematic and foundational theory of network incentives and cooperation that aids in methodical network architecture design for vastly greater capacity, more efficient operation and improved reliability. The theory, mechanisms and architectures for incentive engineered networks that we are developing combine ideas from mathematical economics, game theory, information and queueing theories. <br\/><br\/>The project will have substantial broader impact on the development of science, technology and education by leading to development of the emerging field of network economics, and has broad relevance in improving the efficiency and reliability of networks for communication, transportation, electrical power distribution, and civil infrastructure. <br\/><br\/>The project is developing a new framework of network market design for economics-informed resource allocation on the Internet, non-cooperative multi-user communication theory for cooperative spectrum sharing, and a new incentivized QoS network architecture for QoS provisioning on the Internet. These have the potential to transform existing wireless and communication networks. Conducted research shall be disseminated through a tutorial on networks economic and games that the PI is writing, through classroom teaching and a high school outreach program.","title":"CAREER: Network Economics: Theory and Architectures for Incentive-engineered Networks","awardID":"0954116","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[432720],"PO":["564993"]},"161708":{"abstract":"CAREER: Robustness in Genetic Regulatory Network Modeling and Control<br\/>Ranadip Pal<br\/>Department of Electrical and Computer Engineering, Texas Tech University<br\/><br\/>Current one-size-fits-all methods of cancer treatment select drugs that target the whole population, or some large segment of the population. The outlined research is based on the vision that considering a patient?s individual genetic make-up will help in selecting drugs that yields the best personalized prognosis. New generation of cancer drugs designed to interfere with specific molecular targets have been developed in the last decade. The success of these targeted drugs have been limited since the selection of the drugs and the time and sequence of drug administration are based on empirical principles without mathematical models to design and estimate the efficiency of intervention strategies. The goal of this proposal is to provide a theoretical and computational framework to estimate the uncertainties in genetic regulatory network modeling and generate robust therapeutic strategies for genetic diseases such as cancer. <br\/><br\/>One of the objectives of genetic regulatory network modeling is to design and analyze therapeutic intervention strategies aimed at moving the network out of undesirable states, such as those associated with disease, and into desirable ones. However, limited experimental data prevent accurate inference of the mathematical model of the genetic regulatory network. For the success of a mathematically designed intervention strategy for genetic diseases, it is critical to (a) study the effect of modeling errors on the predictive power of the inferred network model and on the intervention outcome and (b) design control strategies that posses some degree of robustness to the modeling uncertainties. The project is timely and appropriate as increasing the effectiveness of cancer therapies in the clinical setting will require intervention strategies that possess some degree of robustness to the uncertainties in the modeling process. The proposed research is expected to provide bounds on the performance of mathematically designed intervention strategies. Algorithms to design robust control strategies with the objectives of avoiding extremely undesirable results (minimax design) or improving the expected chances of success (Bayesian approach) will be developed. The developed strategies will be applied to the problem of intervention in human cancer cell lines and targeted therapy in mice models, in collaboration with the PI?s medical collaborators at Translational Genomics Research Institute (TGen) and University of Texas Health Sciences Center at San Antonio (UTHSCSA).<br\/><br\/>The interdisciplinary nature of this proposal promises to foster cross-fertilization of ideas between electrical engineering and systems biology through research and education. Some of the salient features of the education and outreach plan are to (i) develop an interdisciplinary graduate course on Genetic Regulatory Network Modeling and Control and an undergraduate course on Engineering Applications in Biology, (ii) establish a research laboratory at Texas Tech University to prepare students with skills in Genomic Signal Processing (GSP) research, (iii) involve undergraduates in GSP research through Project Laboratory Courses and the TTU Howard Hughes Medical Institute Undergraduate Science Education Program, (iv) increase awareness of GSP among K-12 students through the Clark Scholars program and presentations at events involving high school students, and (v) further interactions with the Medical Research Community. The research results will be disseminated to the broad audience via peer reviewed publications, conference presentations and seminars.","title":"CAREER: Robustness in Genetic Regulatory Network Modeling and Control","awardID":"0953366","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["559863"],"PO":["565223"]},"161819":{"abstract":"As Computer Science struggles to understand the Internet and its capabilities, computer scientists are incorporating concepts and methodologies from Economics and Game Theory into their discipline. In the past decade, there has been a tremendous growth in research, centering around the following questions: what game-theoretic tools are applicable to computer systems? How far is the performance of a system from optimality due to the conflict of interests of its users and administrators? And, how can we design a system whose performance is robust with respect to the potential conflict of interests inside the system? The proposed research aims to tackle some of the fundamental problems at the interface of Computer Science and Game Theory, with a focus on networked interactions.<br\/><br\/>The tools that game theorists have traditionally used to model behavior in systems of interacting individuals, such as the Nash and the market equilibria, have been recently shown to be computationally intractable. The intractability of these concepts limits their applicability to policy making since their predictions, although mathematically well-defined, are hard to compute. Moreover, this intractability result raises suspicion as to whether these predictions arise in actuality: if the behavior predicted by some equilibrium concept cannot be found efficiently, how is it that rational individuals find it and adopt it?<br\/><br\/>The goal of this project is to develop a theory of networked interactions that does not run into the computational complexity barrier, answering such questions as: In what settings is it possible to use existing tools, such as the Nash equilibrium, to predict selfish behavior computationally efficiently? How does the structure of the interaction graph affect the tractability of equilibria? When computing Nash equilibria is intractable, is it possible to make approximate predictions efficiently? And if this is infeasible, are there other concepts of equilibrium that are both plausible and tractable? Also, in the context of trading: What kind of market equilibrium comes about in a trading network? Is it always identical to the market equilibrium assuming full information? If so, how does it come to arise in the presence of the communication constraints imposed by the network structure? If not, how different is it? And for what kinds of networks is it similar to the full-information one?<br\/><br\/>The development of a successful theory of networked interactions will necessitate answering deep questions within the theory of computation. Equilibrium concepts typically correspond to fixed points of continuous maps, which have proven to be a challenging computational object for present techniques. In recent years, algorithmic progress on computing equilibria has brought new techniques to the theoretical computer science community. Likewise, characterizing the complexity of game-theoretic concepts has broadened the computational complexity landscape beyond traditional complexity classes. Several questions, such as the approximation complexity of Nash equilibria, the complexity of simple stochastic games as well as other fixed points at the intersection of the complexity classes known as PLS and PPAD, and the complexity of market equilibria for constant elasticity of substitution (CES) utility functions, are evading existing techniques. Furthering our understanding of rational behavior in large systems will necessarily involve developing novel algorithmic and complexity-theoretic tools to meet the challenges posed by these problems.","title":"CAREER: Towards a Constructive Theory of Networked Interactions","awardID":"0953960","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":["478035"],"PO":["565251"]},"161809":{"abstract":"The economic model of network services, both services for basic connectivity as well as application layer services delivered via the network, is undergoing a period of unprecedented change. For instance, Internet Service Providers (ISPs) that offer services such as voice over IP are deciding to use proprietary forms of service differentiation to improve these service offerings over those of competitors. As more ISPs implement service differentiation in a proprietary way, there is a danger that the opportunity to have a coherent architectural approach to service differentiation will be lost. This issue is tied to the net neutrality debate, in which one core issue is how ISPs and content\/application service providers should share revenue. Some fundamental questions include the following. What are the market effects of having only competition between proprietary service stacks versus having competition at each layer? What architectural principles should be established in law or standards to induce the development of a market structure that results in higher welfare for all the stakeholders? Should both standard interfaces and\/or charging practices be enforced between providers? This project investigates questions such as these in order to achieve a more complete understanding of the coupling of architecture and economics in network services. The project develops game theoretic models of the interaction of selfish users and providers, and then uses these models to understand the welfare effects of different architectural choices. The results of this project will inform the development of both the architecture and market structure of the network services industry.","title":"CAREER: Markets for Network Services","awardID":"0953884","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[432638],"PO":["564993"]},"159280":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940468","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["483386"],"PO":["560704"]},"159271":{"abstract":"Carnegie Mellon University proposes a project, called Robot Diaries, that aims to attract and engage a new group of middle school students in computing. With Robot Diaries, students use familiar materials along with motors, lights, and computation to design affective, programmable, tangible communication devices. They animate their creations with emotional expression in the context of collaborative storytelling. Robot Diaries motivates middle-school aged children to engage with technology as creators and authors rather than simply as consumers, and it increases students? confidence in their ability to be creative with technology. This proposal builds on three years of pilot Robot Diaries projects that included multiple rounds of participatory design with students and teachers, and a preliminary analysis of the impact of this program on learning and self-confidence. With this proposal, the audience for Robot Diaries will be significantly expanded ? with an emphasis on girls and underrepresented minorities ? through collaboration with the Pittsburgh public school system and schools in the suburban and rural regions of southwestern Pennsylvania. The project will create and deploy its new curriculum through co-design with local teachers.","title":"BPC-DP:Robot Diaries: Co-design of creative technology and middle school curriculum","awardID":"0940412","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["551205"],"PO":["561855"]},"159282":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940472","effectiveDate":"2010-02-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["521182","510094"],"PO":["561855"]},"159283":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940474","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425811],"PO":["561855"]},"159296":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940507","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["477225"],"PO":["561855"]},"159285":{"abstract":"Rice University leads a collaborative proposal to extend the impact of the Empowering Leadership: Computing Scholars of Tomorrow Alliance (ELA) through partnerships with new institutions and regional collaboratives that will adopt and expand ELA's successful models of engagement. The goal of ELA is to increase the number of students from underrepresented groups who major in computing at the nation's research universities. Additionally, ELA supports these students in securing positions in computing following graduation. The premise of the ELA is that minority students at research universities face challenges that can be mitigated by a supportive community that provides academic, social, and personal support. National in scope, the ELA is developing a network of computing faculty and leaders dedicated to providing this support. In addition to Rice University, ELA originally included Boston University, the University of California, Berkeley, and the University of Texas, Austin. With this proposal, the ELA will add the University of Georgia, Clemson University, Tufts University, and Stony Brook University as new lead institutions, along with several new partners including MentorNet, the Computer Science Teachers Association (CSTA), and the New England Computer Science Chairs (NECSC). The ELA uses three intersecting models of engagement, including the National, Regional and Local Models. The National Model seeks out and supports individuals across the country, building a virtual (and sometimes in-person) network; the Regional Model builds a support network among multiple universities within a region; and the Local Model builds a local support community within a single university. These three models serve to connect ELA students with each other and with tailored opportunities including internships, mentoring, conference participation, and summer research programs. The proposed extension will strengthen the three models at their current sites and test their scalability and transfer to the new lead institutions. It will also add programs developed under BPC demonstration projects to the suite of ELA offerings and test their scalability.","title":"BPC-AE: Collaborative Research: Strengthening and Expanding the Empowering Leadership Alliance","awardID":"0940478","effectiveDate":"2010-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425815],"PO":["561855"]},"159221":{"abstract":"The Georgia Institute of Technology proposes a project - called Accessible Robotic Programming for Students with Disabilities (ARoPability) - to investigate the use of alternative interface modalities in engaging middle and high school students with disabilities in robotics-based programming activities. ARoPability will leverage support from the Center for the Visually Impaired, the National Federation of the Blind of Georgia, Children's Healthcare of Atlanta, WizKidz Science and Technology Center, and the Georgia Institute of Technology. It will (1) create alternative programming tools and use them in developing accessible modules for students with visual or physical impairments, (2) run Robotic Institutes at the Center for the Visually Impaired and with the National Federation of the Blind to evaluate the modules' ability to engage students with visual impairments, (3) run Robotic Institutes in conjunction with Children's Healthcare of Atlanta to evaluate the modules ability to engage students with physical impairments, and (4) provide teacher training kits and documentation for classroom use. The work will focus on questions such as: What characteristics of robotics-based activities need to be transformed to engage students with visual impairments? What technologies can be adapted to enable achievement of robotics-based programming activities for students with physical impairments? Are there existing teaching modalities already employed by educators that can be used to train these new computing professionals? What methods can be exploited to broaden participation in computing for students with visual or physical impairments? The techniques developed by ARoPability will advance the state-of-the-art in engaging students with disabilities in computing activities.","title":"BPC-DP: Accessible Robotic Programming for Students with Disabilities (ARoPability)","awardID":"0940146","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["558854"],"PO":["561855"]},"159288":{"abstract":"The Massachusetts Institute of Technology, in collaboration with the University of Colorado at Boulder, proposes a project to introduce computation through e-textiles. Computer science in the United States is an overwhelmingly male discipline. Many of the the crucial factors in this gender imbalance are cultural; that is, the culture that has grown up around computer science has a variety of attributes that appeal more to males than females. In response, this project seeks to design an alternative cultural pathway into the subject -- a pathway that does not purport to change or even implicitly criticize the existing CS culture, but rather seeks to provide a very different culture through which new populations (and especially females) can become fascinated with computing. Specifically, this project will develop and disseminate tools for engaging people in computing through the medium of fabrics and electronic textiles (or e-textiles). The work will build upon ongoing efforts to create accessible, powerful tools and materials that allow users to design and build their own programmable interactive fashion. The types of projects that users undertake within this alternative culture of computer science are rich in content, but refreshingly nontraditional: they are tangible, colorful, dramatic, richly interactive, and beautiful. This project proposes to encourage the growth of this new culture via two complementary avenues of work: the development of a visual programming environment for the LilyPad Arduino (a toolkit developed by the PIs that enables people to build e-textiles) and the development, dissemination, and evaluation of an \"E-textiles in-a-Box\" kit for educators. This kit will be disseminated through the large network developed by the National Center for Women and Information Technology (NCWIT) and its effectiveness will be assessed by NCWIT's social science team. These efforts are crucial next steps in engaging a broad audience in e-textiles and -- via this engagement -- a new and diverse audience in computing.","title":"Collaborative Research: A Cultural Shift in Computer Science: Introducing Computation through E-Textiles","awardID":"0940484","effectiveDate":"2010-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["528007","523483"],"PO":["561855"]},"166670":{"abstract":"Eitan Tadmor of the University of Maryland is supported by an award from the Theory, Models and Computational Methods program and the Computational Mathematics program for activities related to a workshop entitled \"Quantum-Classical Modeling of Chemical Phenomena\" to be held on March 8-10, 2010. The Center for Scientific Computing and Mathematical Modeling at the University of Maryland is hosting the workshop. In addition to Tadmor , the organizing committee consists of Victor Batista (Yale), Shi Jin (University of Wisconsin), and Millard Alexander (Maryland). <br\/><br\/>The aim of the meeting is to bring together a group of experts to examine the current state of development of numerical techniques and to foster interdisciplinary research in the development of computational methods at the interface of quantum and classical dynamics. The list of invited speakers is multi-disciplinary, international and very diverse. The workshop organizers actively encourage participation from graduate students, postdocs, junior faculty and members of under-represented groups.<br\/><br\/>Further information may be found at http:\/\/www.cscamm.umd.edu\/programs\/qcp10\/","title":"A 2010 Workshop on Quantum-Classical Modeling of Chemical Phenomena","awardID":"1007674","effectiveDate":"2010-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"6881","name":"Theory, Models, Comput. Method"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["532079"],"PO":["563091"]},"165372":{"abstract":"Increasingly, the engineering of complex systems requires consideration of an intricate web of components and their interaction in diverse social and technical environments. Simulation can assist in designing and testing socio-technical systems by allowing the potential space of outcomes to be explored under given designs. Agent-based models have been developed as a method for building models of complex systems, with great success. Agents may be designed to represent system components and to specify the interactions between them in an incredible level of detail. While popular, the full potential of the methodology to support engineering of complex systems has not been reached, however, because of a set of key challenges. First, there exists a relative lack of robust methods for calibrating agent-based models to theory. Second, there is a paucity of reliable approaches for extracting coarse-grained, system level information as it emerges in agent-based simulations. Third, there is a dearth of schemes for handling uncertainty in the application of agent-based rules to system behavior. Fourth, computation of agent-based models is inefficient when agents are numerous in volume and richly-specified in behavior. Together, these impediments constrain the ability of agent-based modeling to enable prediction, to support decisions, and to facilitate the design, control, and optimization of complex systems. The main objective of this project is to broaden the extensibility of agent-based modeling beyond these constraints. This will be achieved by developing novel computational methods to fuse agent-based modeling, uncertainty measurement and quantification, and mathematics for pattern-extraction. <br\/><br\/>This project will expand the capabilities of agent-based modeling in supporting the design, engineering, and testing of complex systems. Our initial focus is to develop a prototype scheme that can be applied to complex socio-behavioral systems, but the project is of potential relevance across a diverse array of substantive areas. Indeed, one of our central aims is to provide the glue that can bridge diverse schemes for agent-based simulation across application areas. This could be incredibly useful in reconciling agent-based modeling into a larger ?ecology? of mathematical modeling and computation, fundamentally expanding the range of questions that can be posed and systems that can be explored in simulation, while better linking simulation to real-world dynamics.","title":"EAGER\/Collaborative Research: Accelerating Innovation in Agent-Based Simulations: Application to Complex Socio-Behavioral Phenomena","awardID":"1002469","effectiveDate":"2010-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["545921"],"PO":["564988"]},"168474":{"abstract":"Technical Committee on Parallel Processing (TCPP) acts as an international forum to promote parallel processing research and education, and participates in setting up technical standards in this area. Issues related to the design, analysis and implementation of parallel systems and solutions are of interest. These include design and analysis of parallel architectures and algorithms, and application development on parallel machines. TCPP sponsors professional meetings, brings out publications, sets guidelines for educational programs and coordinates academia, funding agency, and industry activities in the above areas.<br\/>This proposal applies for NSF support to allow 60 more US-based student travel awards to be split evenly among IPDPS-10 student authors, PhD forum presenter at IPDPS10, and the other TCPP sponsored conferences.","title":"Technical Committee on Parallel Processing (TCPP) Student Travel Awards","awardID":"1016907","effectiveDate":"2010-02-15","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["526127"],"PO":["565272"]},"159300":{"abstract":"The Massachusetts Institute of Technology, in collaboration with the University of Colorado at Boulder, proposes a project to introduce computation through e-textiles. Computer science in the United States is an overwhelmingly male discipline. Many of the the crucial factors in this gender imbalance are cultural; that is, the culture that has grown up around computer science has a variety of attributes that appeal more to males than females. In response, this project seeks to design an alternative cultural pathway into the subject -- a pathway that does not purport to change or even implicitly criticize the existing CS culture, but rather seeks to provide a very different culture through which new populations (and especially females) can become fascinated with computing. Specifically, this project will develop and disseminate tools for engaging people in computing through the medium of fabrics and electronic textiles (or e-textiles). The work will build upon ongoing efforts to create accessible, powerful tools and materials that allow users to design and build their own programmable interactive fashion. The types of projects that users undertake within this alternative culture of computer science are rich in content, but refreshingly nontraditional: they are tangible, colorful, dramatic, richly interactive, and beautiful. This project proposes to encourage the growth of this new culture via two complementary avenues of work: the development of a visual programming environment for the LilyPad Arduino (a toolkit developed by the PIs that enables people to build e-textiles) and the development, dissemination, and evaluation of an \"E-textiles in-a-Box\" kit for educators. This kit will be disseminated through the large network developed by the National Center for Women and Information Technology (NCWIT) and its effectiveness will be assessed by NCWIT's social science team. These efforts are crucial next steps in engaging a broad audience in e-textiles and -- via this engagement -- a new and diverse audience in computing.","title":"Collaborative Research: BPC-DP: A Cultural Shift in Computer Science: Introducing Computation through E-Textiles","awardID":"0940520","effectiveDate":"2010-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["469513"],"PO":["561855"]},"169641":{"abstract":"This award will support the dissemination of Dr. Liskov's research on symmetric cryptography, which was supported previously by award CNS-0845662. In particular it will pay for his graduate student to travel to the IACR Theory of Cryptography Conference and to the Eurocrypt Conference. In addition to supporting the timely dissemination of cryptographic research, the award will provide valuable educational experiences and training for a young scientist close to the completition of his Ph.D.","title":"Travel Grant: Principles of Design in Symmetric Cryptography","awardID":"1023157","effectiveDate":"2010-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[454038],"PO":["529429"]}}