{"147304":{"abstract":"This research addresses the central question with respect to avatars in computer-generated virtual worlds: How does the user negotiate among the many possible relationships between the self and the avatar? Virtual worlds form an integral part of the 3D web and as such play an increasingly important role in the evolution of our computer-mediated communication infrastructure. Avatars, which are the representation of the communicator in 3D web applications including email, chat and virtual worlds, are a cornerstone of these new media. A key affordance of avatars is embodiment, which not only gives communicators visible presence in situations and encounters, but also allows them to engage in practices of the body such as walking, sitting or gesturing. As such, the avatar serves as a cue for the communicator's identity and as a powerful visual complement to the more text-based media like instant messaging and email. However, unlike the non-verbal cues that a communicator's real-world body gives off, the cues of the virtual body can be intentionally manipulated and controlled by its owner. Furthermore, the avatar does not only interact with the intended target of the communication, but with the owner him\/herself. This complexity of the avatar-self relationship raises questions about what type of relationship to invoke for effective communication in educational, commercial and organizational settings, where the owner - not the avatar - is typically the target of communicative action.<br\/> <br\/>This study explores the types of avatar-self relationships that are enacted in virtual worlds, and the conditions under which different relationships become salient and why. Drawing on a sample of residents of Second Life, one of the largest virtual worlds, this research will rely on real-world, face-to-face interviews, as well as a photo-diary interview method for data collection. Categories of avatar-self relationships and a framework for understanding when they become salient and why will be developed using interpretive techniques and an emergent theory building approach that is informed by Erving Goffman's dramaturgical theory of identity negotiation. This broad theoretical approach is widely used in research on avatars and other forms of self-presentation, but the research methods to be employed in this project are innovative, giving this project the potential of contributing significantly to the development of a host of new hypotheses and theoretical advancements.<br\/> <br\/>As synthetic worlds and avatars are likely to become more prevalent in 3D web applications, we need to develop frameworks and language to describe and make sense of the increasingly intertwined nature of online and offline selves. This research on the avatar-self relationship makes potentially transformative inroads into our understanding of communicators' negotiation of the increasingly blurred offline-online and reality-virtuality boundaries.","title":"SGER: The Avatar-Self Relationship: An Exploratory Study of Identity Negotiation in Second Life","awardID":"0848692","effectiveDate":"2008-11-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[392452],"PO":["564456"]},"154246":{"abstract":"Many information workers are swamped with unfamiliar collections of text. One challenge is to obtain an accurate overview of a large text collection, such as the public comments collected in ''''''''notice and comment'''''''' rulemaking. No single tool currently provides a sufficiently diversified picture of such a corpus, and no adequate theory exists to help people explore and form a deep and nuanced understanding of such a text collection. This research seeks to develop a computational framework that allows further exploration of this problem from multiple, integrated perspectives. All the assembled perspectives will be brought together into a single overall supra-document structure that is dynamically constructed under user guidance. In this structure, hierarchical topic clusters will be cross-linked by opinion and argumentation links, using two classes of text analysis engines: one for topics and subtopics, and the other for argument structures. The research team will design, develop, build, and systematically test an overall text exploration framework, an application to support federal regulation writersone called the Rule-Writers Workbench. There is a strong collaboration with Federal government officials who will provide data and participate in user testing. The three PIs have successfully collaborated on a related project under previous NSF funding. <br\/><br\/>Intellectual Merit: This is a sustainable collaboration between computer science and political\/social science research, rooted in a challenging and important real world application and informed by years of end user research. Dynamic, user-driven subtopic definition and clustering algorithms coupled with<br\/>language modeling are an innovative yet reachable set of goals. The framework to be developed will be grounded in the humanities disciplines'' expertise in rhetoric, discourse structure, and subjectivity.<br\/><br\/>Broader Impacts: The Rule-Writers Workbench will allow federal government regulation writers to employ a suite of technical tools that perform independent analyses of public responses to proposed regulations, including near-duplicate detection and clustering, user-based topic selection from dynamically extracted keywords, opinion identification, and subtopic clustering. These capabilities will open new avenues for federal comment analysis.","title":"Collaborative Research III-COR: From a Pile of Documents to a Collection of Information: A Framework for Multi-Dimensional Text Analysis","awardID":"0917773","effectiveDate":"2008-11-15","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H233","name":"US FISH AND WILDLIFE SERVICE"}}],"PIcoPI":["491832"],"PO":["563751"]},"143456":{"abstract":"Privacy is an important concern in the digital age, yet the adoption <br\/>of privacy preserving technologies has lagged behind that of other<br\/>security technologies. This is, to a great extent, due to the lack of<br\/>practical, usable privacy preserving technologies. The wide adoption<br\/>of confidentiality and integrity technologies was triggered by a few<br\/>practical software tools, such as SSL and SSH. By contrast, practical <br\/>privacy preserving technologies still face considerable challenges.<br\/><br\/>The goal of this project is to develop two practical privacy<br\/>preserving technologies, which serve as a case study on unique<br\/>requirements and pitfalls of privacy preserving software.<br\/><br\/>Privacy preserving computation: Generic techniques are close to<br\/>practical for some functions of interest, but a tantalizing gap still<br\/>remains for many applications. The practicality gap widens further if<br\/>malicious adversarial behavior must be tolerated. This project focus<br\/>on new efficient methods to protect against malicious faults,<br\/>retro-fitting at the algorithmic level to gain new efficiencies at the<br\/>cryptographic protocol level, and new efficient methods to facilitate<br\/>the ongoing storage and processing of privacy-sensitive data.<br\/><br\/>Off-the-record communication: This project will design protocols for<br\/>off-the-record communication between group members. Each member can<br\/>verify the identity of the sender and ensure the confidentiality of<br\/>the message, but no subset of group members may conspire to implicate<br\/>the sender to any third party.<br\/><br\/>Broader impacts of this project are to inform the general public that<br\/>privacy is not a lost cause in the digital age, and to create public<br\/>appreciation and support for applied cryptography research.","title":"Practical Privacy Preserving Technologies","awardID":"0831547","effectiveDate":"2008-11-01","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":[382002,"502032"],"PO":["497499"]},"142849":{"abstract":"CBET-0828950<br\/>Miller<br\/><br\/>Combustion-generated soot particulates from land-based sources are now acknowledged to pose a significant health risk and have been the subject of stringent new EPA regulations. From the engine designer's standpoint, the concern about soot goes beyond these regulatory issues. High soot concentrations in combustor primary zones contribute to high thermal radiation loads on combustor liners. Soot coatings on liner surfaces drastically increase underlying metal temperatures. These issues are exacerbated by the high pressures at which new combustors are operated, because soot production is very sensitive to pressure. If soot and the problems associated with it are to be controlled, quantitative understanding of the soot growth and oxidation mechanisms is essential.<br\/>In this collaborative research award, groups at Yale and George Washington University are studying molecular-growth chemistry in forced, time-varying flames. Major species concentrations, small radical concentrations, velocity, and temperature are determined using a suite of laser-based techniques. Both major and trace hydrocarbon species are sampled using a novel pulsed microprobe coupled to a mass spectrometer. They are also performing new optical diagnostics to quantify the concentration of acetylene in regions inaccessible to probe sampling and to follow PAH molecular growth and aggregation. The experimental work will be complemented by time-dependent computations of flame structure that include molecular growth chemistry. The proposed work will provide critical insight into the subtle interplay between molecular growth chemistry and the time-temperature history experienced by a packet of fluid. The goal of the work is not only to obtain experimental data for a rigorous test of competing soot growth models, but also to guide the development of our intuitive understanding of the process. <br\/>Within the team, each PI leads specific project areas: Marshall Long coordinates the optical diagnostics activities, J. Houston Miller supervises the extractive sampling and line-of-sight optical diagnostic activities, and Mitchell Smooke leads the computational efforts. Data \"mining\" and interpretation proceed collaboratively.<br\/>An essential component of the proposed work is education of undergraduate and graduate students in chemistry and mechanical engineering. Results of this work will feed into educational outreach activities in their communities, including (1) the six-week Frontiers of Science program, designed to expose high school juniors and seniors to leading-edge scientific research, (2) the Yale-New Haven Futures in Science Research Fellowship, which supports a summer research collaboration between a New Haven high school student and a Yale graduate student or post-doc supervised by a Yale faculty member, and (3) the Piedmont Environment and Education Foundation, a newly-chartered nonprofit incorporated in the State of Maryland, established to promote environmental science educational programs for middle and secondary schools in the District of Columbia and suburban Maryland.","title":"Collaborative Research: Soot Formation in Time-Varying Nonpremixed Flames","awardID":"0828950","effectiveDate":"2008-11-01","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I435","name":"Defense Intelligence Agency"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1407","name":"COMBUSTION, FIRE, & PLASMA SYS"}}],"PIcoPI":["525311"],"PO":["517761"]},"150616":{"abstract":"The Second Young Investigators Summer Research Institute will be a continuing activity of the Consortium for the Science of Socio-Technical Systems (CSST). CSST was born out of a series of workshops sponsored by NSF involving over forty faculty members in diverse fields, such as social informatics, social computing, CSCW, computational social science, HCI, and information science. Workshop participants, recognizing the growing importance of research on the interplay of humans and technology, or socio-technical systems, proposed the CSST as a mechanism for promoting and supporting important research on social aspects of technological change. An identified high priority, even in advance of the formal creation of CSST, was initiation of an annual series of summer research institutes targeted at people entering the field of sociotechnical systems research. This proposal will support the second of these institutes to be held on the campus of the University of Michigan in July, 2009. The inaugural institute was very successful attracting 137 applications with a selected class of 31 participants and thirteen institute faculty. Student participants will include up to 30 advanced doctoral students and pre-tenure faculty doing research on socio-technical systems. Up to fifteen instructors will be drawn from senior faculty, including participants in the original NSF-supported workshops on sociotechnical systems. This project will support the travel, meals, and accommodations for all Institute participants.<br\/><br\/>Intellectual Merit<br\/>The focus of the Institute will be on participants' research programs (e.g., dissertation for doctoral students). The Institute provides both an opportunity for these programs to be shaped through intellectual exchange with experienced researchers as well as enhanced through collaboration with other young researchers. In addition, the Institute will help spread ideas about research on socio-technical systems within the US and around the world.<br\/><br\/>Broader Impact<br\/>The Institute will continue to bring together the best of the next generation of socio-technical system researchers. This allows them to create a social network both among themselves and with several senior researchers, which will play a major role in their professional development and in the evolution of the field of socio-technical systems research. The diversity of Institute participants (e.g., institutional, disciplinary, geographic, gender, minority group status), will broaden participant's perspectives at a critical stage in their careers.","title":"Second Young Investigators Summer Research Institute of the Consortium for the Science of Socio-Technical Systems","awardID":"0904080","effectiveDate":"2008-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["561666"],"PO":["565227"]},"147393":{"abstract":"This proposal seeks travel support funding for the 41st International Symposium on Microarchitecture (MICRO-41), a top-tier conference on microprocessor related research.<br\/>The requested funds will be solely used to provide travel support for graduates students to defray the costs of attending and participating in MICRO-41. The priority will be given to those students who will present their research at MICRO-41 or its joint workshops.","title":"Support for the 41st International Symposium on Microarchitecture","awardID":"0849060","effectiveDate":"2008-11-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["424003"],"PO":["565272"]},"146194":{"abstract":"This is a 12-month standard award to support a Doctoral Colloquium program at the American Medical Informatics (AMIA) 2008 Annual Symposium to be held in Washington, DC (November 8-12, 2008). This will bring together approximately 10 dissertation-stage doctoral students in the field of Health Care Informatics for one day of talks and interaction with 5 distinguished senior faculty mentors.<br\/><br\/>Although doctoral consortiums are common activities in other domains such as computer science, information sciences, and engineering, they are not well-known in the medical informatics community. Yet, there is a growing need to provide a forum for doctoral students to share their work and also network with other doctoral students and researchers. The goal of the consortium is to support the doctoral students through constructive remarks and feedback on their research from prominent researchers and interaction with other students. The consortium is interested in student participants from a broad range of disciplines and approaches that inform medical informatics, including computer science, information science, and engineering. <br\/><br\/>Intellectual Merit: The consortium provides a forum for students engaged in inter- and multi-disciplinary scholarship focusing on organizational and social issues surrounding healthcare technologies. It functions as a forum for expert and peer critique of the students' doctoral work with the goal of improving their dissertations. <br\/><br\/>Broader Impact: The consortium brings together people who might not engage with one another otherwise which exposes them to different scientific disciplinary research approaches and questions, fosters a supportive mentoring network for young researchers, and ultimately helps develop the next generation of scientists and educators in fields related to the development and use of technology in healthcare related fields.","title":"American Medical Informatics Doctoral Consortium","awardID":"0844465","effectiveDate":"2008-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559463"],"PO":["565227"]},"139682":{"abstract":"Wilderness search and rescue (WiSAR) is the task of finding and giving assistance to humans who are lost or injured in mountain, desert, lake, river, or other remote settings. Rapid coverage of large search areas and difficult terrain is critical; as the search radius increases, the probability of finding and successfully aiding the missing person decreases. Prior NSF-sponsored research established the hypothesis that mini (2-8 foot wing span), fixed-wing Unmanned Aerial Vehicles (UAVs) equipped with video cameras can support WiSAR personnel. In this project the PIs plan to extend that work, by addressing key human factors and technology obstacles that must be overcome to make such support practical and efficient. Through enhanced WiSAR-oriented UAV operator interfaces and visualization, the PIs will improve both the UAV's coverage of the search area by people without piloting skills and the searcher's detection of the missing person or other signs in the video. The design of these WiSAR systems will integrate the PIs' expertise in human-robot interaction, computer vision, visualization, and artificial intelligence. The project adopts a human-centered evaluation approach that uses both laboratory and field tests. Innovative aspects of the work include integration of video mapping, missing-person modeling, and human interaction to create prioritized search maps that are dynamically updated as information is acquired, and which can then be used to perform search planning based on this dynamic information, requiring real-time planning algorithms that can adapt to uncertainty and new information. The prioritized search maps and resulting plans can be used directly by WiSAR personnel, or integrated into the UAV operator?s interface, or allow WiSAR personnel to outline a plan and grant the UAV sufficient autonomy to optimize coverage subject to this outline. The PIs will also integrate multiple video sources (including infrared imaging), anomaly detection and tracking, and geo-registered video annotation in order to further assist WiSAR personnel in detecting, identifying, and communicating information about objects of potential interest in the video sources. These will be presented to WiSAR personnel in the form of interfaces designed for their separate roles: UAV operator, video searcher, incident commander, and field searcher, as well as integrated interfaces for individuals acting in multiple roles simultaneously. Finally, the PIs will extend this work to support video-equipped manned aircraft and ground search teams.<br\/><br\/>Broader Impacts: Each year, many people are lost or find themselves in jeopardy while hiking, boating\/kayaking, skiing, fishing, etc. WiSAR consumes thousands of man-hours and hundreds of thousands of dollars each year in Utah alone. Creating appropriate visualization algorithms and user interfaces to support planning, visualization, and UAV control should decrease the amount of time required to locate and offer assistance to missing persons, increasing the likelihood of successful rescue. The PIs plan to include in this project undergraduate students from nearby Utah Valley State College (UVSC), a school that does not yet have a graduate program and consequently has few opportunities for socially relevant, interdisciplinary undergraduate research.","title":"Supporting Wilderness Search and Rescue Personnel: Acquiring and Visualizing Aerial Imagery","awardID":"0812653","effectiveDate":"2008-11-01","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["521484",371283],"PO":["565227"]},"146240":{"abstract":"The Second Young Investigators Summer Research Institute will be a continuing activity of the Consortium for the Science of Socio-Technical Systems (CSST). CSST was born out of a series of workshops sponsored by NSF involving over forty faculty members in diverse fields, such as social informatics, social computing, CSCW, computational social science, HCI, and information science. Workshop participants, recognizing the growing importance of research on the interplay of humans and technology, or socio-technical systems, proposed the CSST as a mechanism for promoting and supporting important research on social aspects of technological change. An identified high priority, even in advance of the formal creation of CSST, was initiation of an annual series of summer research institutes targeted at people entering the field of sociotechnical systems research. This proposal will support the second of these institutes to be held on the campus of the University of Michigan in July, 2009. The inaugural institute was very successful attracting 137 applications with a selected class of 31 participants and thirteen institute faculty. Student participants will include up to 30 advanced doctoral students and pre-tenure faculty doing research on socio-technical systems. Up to fifteen instructors will be drawn from senior faculty, including participants in the original NSF-supported workshops on sociotechnical systems. This project will support the travel, meals, and accommodations for all Institute participants.<br\/><br\/>Intellectual Merit<br\/>The focus of the Institute will be on participants' research programs (e.g., dissertation for doctoral students). The Institute provides both an opportunity for these programs to be shaped through intellectual exchange with experienced researchers as well as enhanced through collaboration with other young researchers. In addition, the Institute will help spread ideas about research on socio-technical systems within the US and around the world.<br\/><br\/>Broader Impact<br\/>The Institute will continue to bring together the best of the next generation of socio-technical system researchers. This allows them to create a social network both among themselves and with several senior researchers, which will play a major role in their professional development and in the evolution of the field of socio-technical systems research. The diversity of Institute participants (e.g., institutional, disciplinary, geographic, gender, minority group status), will broaden participant's perspectives at a critical stage in their careers.","title":"Second Young Investigators Summer Research Institute of the Consortium for the Science of Socio-Technical Systems","awardID":"0844618","effectiveDate":"2008-11-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["498457","498457","561666","561666"],"PO":["565227"]},"147153":{"abstract":"Abstract<br\/><br\/>It is the objective of the two-day workshop to define a vision for future energy systems and to identify the key role of cyber technologies in shaping their performance. <br\/><br\/>THE INTELLECTUAL MERIT OF THIS PROPOSAL<br\/><br\/>This workshop is challenged with an agenda of conceptualizing frameworks to solving the design, planning and operating problems that plague electric power systems. The result is an infrastructure that functions both reliably and efficiently. The same frameworks would be useful for protecting electric power systems under malicious attacks, i.e., making them secure. The workshop must reflect a natural progression of the current ongoing research and the joint vision arrived by the workshop participants. Such novel frameworks require: (1) modeling of an electric power system as a single technical, economic and policy dynamic process, (2) advances in control engineering and systems theory to analyze the interdependencies of interest and to design near optimal feedback from the technical, economic and policy signals, in which optimality is measured in terms of efficiency and reliability, and (3) IT-based implementations of control algorithms operating on technical, economic and policy feedback to highly distributed and flexible sensors and actuators. The envisioned approaches must consider human decision makers as part of the system. The challenge is to conceptualize how generalized systems theory, combined with IT and the specific modeling of critical infrastructures has the potential to become a backbone of a flexible robust electric power system.<br\/><br\/>BROADER IMPACT OF THE PROPOSED ACTIVITY <br\/><br\/>The results of this workshop will be organized and made available as a Special Report to be used by academia, industry and government for pursuing future work in enabling today's electric power grids with cyber. As a result, both educational and research efforts will be more aligned with the future needs. In particular, the material will be made available to universities which are engaged in preparing future leaders in the area of electric energy systems. The educational needs will be discussed as a means toward implementing the vision put forward.<br\/><br\/>The expectation is that the workshop material would form the basis for badly needed technology transfer, in particular the deployment of cyber technologies into next generation electric power systems. The over-riding concept expected to emerge is that cyber technologies are essential for implementing tradeoff solutions with regard to cost, environmental impact and security.","title":"A Proposal for a Workshop on Designing Cyber for Future Energy Systems. To be Held in Washington DC, November 19-20, 2008","awardID":"0848223","effectiveDate":"2008-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"H184","name":"National Security Agency"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7607","name":"ENERGY,POWER,ADAPTIVE SYS"}}],"PIcoPI":["563201"],"PO":["435818"]},"144671":{"abstract":"Abstract<br\/><br\/>IIS - 0837958<br\/>Workshop: Coordinating EU-US Digital Library Education<br\/>Pomerantz, Jeffrey P. <br\/>University of North Carolina at Chapel Hill<br\/><br\/><br\/>This project requests funds to support a two-day workshop to be held at the University of North Carolina, Chapel Hill. The meeting is intended to develop and launch a coordinated international digital libraries curriculum project. The two-day collaborative workshop will bring together about 15 experts in information and computer science research and educational curriculum development. The objectives are to coordinate digital libraries education in the US and the EU, the strengths of which complement and inform each other and by doing so provide broader opportunities for students on both sides of the Atlantic and better prepare the next generation of researchers. Given the global nature of the Web and digital information generally, and the increasing globalization of e-science, this effort is central to preparing students and researchers to effectively use an international data infrastructure.","title":"Workshop: Coordinating EU-US Digital Library Education","awardID":"0837958","effectiveDate":"2008-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["408947"],"PO":["433760"]}}