{"187121":{"abstract":"Although reconfigurable computing (RC) devices have been widely shown to have significant performance and power advantages compared to other computing devices, mainstream usage of such devices has been resisted due to increased application design complexity caused by non-mainstream high-level synthesis, complex low-level debugging, lengthy compilation times often requiring hours or days, a lack of code portability, prohibitive device costs, among other challenges. To address these problems, this study introduces RC virtualization to reduce the semantic gap between high-level applications and physical RC devices with hundreds of thousands of fine-grained resources. Whereas physical RC devices must be fine grained for flexibility and cost effectiveness, the proposed virtual RC devices, which are implemented atop such physical devices, can be specialized to the needs of different application domains to hide physical device complexity. As a result, the proposed virtualization enables rapid RC compilation that can complete in seconds as opposed to hours. Rapid RC compilation in turn enables mainstream design methodologies for debugging. Virtualization also enables application portability across physical RC devices, similar to how virtual machines achieve portable software code, in addition to tool portability that enables third-party tools to target any RC system. Finally, by combining virtualization with high-level synthesis from standardized parallel languages for heterogeneous accelerators (e.g., OpenCL), this study enables mainstream RC usage by enabling the design flow used by other mainstream computing devices.","title":"CAREER: Design Virtualization for Mainstream Programming of Reconfigurable Computers","awardID":"1149285","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["507808"],"PO":["565255"]},"187187":{"abstract":"Recent advent of high-throughput technologies for measuring molecular interactions has yielded large collections of biological networks, which enable systematic studies of complex biological organisms. Since biological pathways with critical functions are often conserved across different organisms, comparative analysis of these networks can provide an excellent way of investigating the organization of biological networks, as well as tracking down novel pathways and studying their functions. <br\/>Intellectual Merit: This project aims to develop a solid mathematical framework for comparative network analysis and devise innovative techniques for comparing genome-scale biological networks. The main research objectives include: (1) develop a multi-state semi-Markov random walk (SMRW) model for probabilistic comparison of large-scale networks; (2) develop efficient algorithms for querying and aligning biological networks; (3) apply the developed algorithms to identify novel biological pathways and investigate their functions and their detailed mechanisms.<br\/>Broader Impact: The research activities in this project are closely integrated with a comprehensive educational plan, whose overall goal lies in enhancing students? learning experience through the integration of research and education. This goal is translated into a three-part educational plan: (1) develop a concept inventory (CI) for genomic signal processing and computational biology (called the CIGSP); (2) shift a graduate-level course on ?Probabilistic Graphical Models? to a problem-based format; (3) design a new undergraduate course on Probabilistic Models for Network Biology based on proven and emerging pedagogical approaches. The new concept inventory CIGSP will provide a valuable diagnosis\/assessment tool for enhancing education in genomic signal processing and computational biology, and it will be used in the PI?s courses, to design measurable educational objectives and evaluate the learning outcomes.","title":"CAREER: Models and Algorithms for Comparative Analysis of Biological Networks","awardID":"1149544","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":[502127],"PO":["565223"]},"187144":{"abstract":"While long-lived communities have been one of the key organizing principles of Web-based systems, there is widespread evidence of highly-dynamic, ad-hoc crowd formation in emerging real-time socio-computational systems. These crowds are dynamically formed and potentially short-lived, often with only implicit signals of their formation and evolution. The goal of this research project is to develop the framework, algorithms, and systems for lightweight crowd-oriented search and computation so that stakeholders can distill high-quality information from bursty social systems and actively engage with the crowds generating this information. First, the project provides the foundation for crowd-oriented search through new algorithmic advances for distributed crowd indexing and in an investigation of the design principles impacting crowd-oriented search. Next, the project develops self-tuning methods for assessing crowd quality, even with huge demands on efficiency and in the presence of limited evidence of crowd quality. Finally, the project explores methods for \"closing the loop\" in crowd-oriented search, so that crowds may become part of in situ human-computational systems. <br\/><br\/>The education and outreach efforts of the project are tightly linked to the research goals through leadership workshops, enhancements to the curricula, direct research training, and engagement with emergency response experts and major companies. Distilling high-quality information from bursty social systems and actively engaging with the crowds generating this information will result in improved real-time decision-making, impacting a wide range of stakeholders from areas such as epidemiology, law enforcement, government, finance, politics, among many others. Further information can be found on the project web page: http:\/\/faculty.cse.tamu.edu\/caverlee\/csc\/.","title":"CAREER: Real-Time Crowd-Oriented Search and Computation Systems","awardID":"1149383","effectiveDate":"2012-02-15","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[502038],"PO":["563751"]},"187398":{"abstract":"The University of Pennsylvania and Arizona State University will investigate how American Indian youth, communities, and pre-service teachers learn and design with computational textiles. Computational or e-textiles,textile artifacts that contain embedded computers or are computationally generated, are promising portals into youths' existing interests in new media and design and connecting them to computer science education by using indigenous communities' existing craft practices and thus strengthening school-community relationships. The EthnoEtextiles project expands e-textiles in new directions by integrating the following successful developments and NSF work: (1) a computational construction kit, the Lilypad Arduino, that can promote the type of technology fluency missing in students' creative explorations with technology; (2) teacher professional development approaches that encourage culturally relevant and reflective teaching with technology; and (3) workshop models that create connections among youth, members of their community, and their cultural heritage. The purpose is to develop relationships and workshop models for youth and teachers that can become a platform for larger systemic and sustainable initiatives in computer science education for American Indian youth, teachers, and community members. The proposed project will contribute to our growing understanding of teaching and learning with electronic textiles in computer science education and help diversify participation by reaching traditionally underserved communities of American Indian peoples.","title":"Collaborative Research: Planning grant: E2textiles: Ethno Electronic Textile Designs for Broadening Participation in Computing for American Indian Youth, Teachers, and Communities","awardID":"1150604","effectiveDate":"2012-02-15","expirationDate":"2014-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[502557],"PO":["560704"]},"187685":{"abstract":"Drexel University proposes the creation of a scaffolded web development tool called openHTML that exposes learners to an appropriate beginner's model of HTML and CSS architecture and syntax. In cooperation with Peoples Emergency Center in Philadelphia, the Freedom Rings Partnership, and Hartford University, the project staff will design learning experiences to address the needs of beginning web developers in formal classes as well as self-motivated learners in informal contexts like community centers. The planning grant will be used to support the development and pilot studies of beta technologies and educational materials. The project staff will use these activities as a context for design-based research to investigate the impact of formative computational experiences on learners' conceptual models of Web technologies, infrastructure, and computational concepts. The planned project builds on the successes of the PI and Co-PI in prior work on computational literacy, introductory computing experiences, and development of programming expertise; the initial planning stage lays the foundation for an ambitious, long-term design-based research agenda.<br\/><br\/>Widespread computational competency is a vital component of a competitive workforce and vibrant economy. By lowering the barriers to comfort and competence with computing, this project aims to 1) engage individuals who may not otherwise appear on the computer science education radar in creative computational activities, 2) improve the tools available to web development educators and learners, and 3) extend scientific knowledge about the development of early computational thinking skills.","title":"Planning Grant: openHTML - Scaffolded Web Development Toolkit to Support Elementary Computational Literacy","awardID":"1152094","effectiveDate":"2012-02-15","expirationDate":"2014-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[503162,"558322"],"PO":["560704"]},"187289":{"abstract":"Many domains in computer science, from data-mining to simulation to computational biology, focus heavily on irregular applications, which deal with complex algorithms that manipulate complex data structures. For example, to analyze large data sets, point correlation - a data mining algorithm - organizes data in a tree-like structure that is then manipulated to extract trends and patterns. As such algorithms become more pervasive, and, more importantly, the data sets they are applied to become much larger, writing high performance irregular applications has become critically important. However, the complexity of irregular algorithms makes writing high-performance applications very difficult: simple expressions of the algorithms do not perform well, and high-performance implementations are difficult to express. An attractive solution is to develop a set of tools that could take a simple expression of an algorithm and automatically transform the program into a higher performing version. This project aims to develop automated, robust and generally-applicable performance-enhancing techniques and transformations for irregular programs.<br\/><br\/>The chief obstacle to identifying and performing performance-enhancing transformations on irregular programs is the apparent lack of principles that unify irregular applications. However, this research argues that there are, indeed, such principles that can guide the development of transformations. By leveraging high-level structural properties of irregular algorithms, it is possible to automatically transform irregular programs to significantly improve their performance. This project pursues a set of interlocking efforts to build a framework to (i) analyze irregular programs, (ii) identify profitable and legal transformations, (iii) automatically restructure programs according to those transformations, and then (iv) tune the performance of the transformed applications to best fit the target execution platform.","title":"CAREER:Toward a locality-enhancing transformation framework for irregular programs","awardID":"1150013","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556631"],"PO":["565272"]},"194682":{"abstract":"This is funding to support a Doctoral Consortium (workshop) for approximately 12 graduate students, along with a panel of about 4 distinguished research faculty mentors. The event will take place in conjunction with the 2012 ACM Group Conference (GROUP 2012), to be held October 27-31, 2012, on Sanibel Island, Florida, and sponsored by the Association for Computing Machinery?s Special Interest Group on Computer-Human Interaction (ACM SIGCHI). The bi-annual GROUP conference is a leading international forum for the presentation and discussion of research and practice on organizational behavior, information systems, social informatics, human-computer interaction (HCI), and computer supported cooperative work (CSCW). It is attended by approximately 120 researchers and professionals from around the world; research reports published in the GROUP conference proceedings are competitively reviewed and widely cited.<br\/><br\/>The GROUP 2012 Doctoral Consortium (DC) will be a research-focused day-long meeting on Sunday, October 28, with follow-up events that take place during the conference's main technical program. Student participants will be later stage doctoral students from both the United States and abroad, who represent the various disciplines and subfields of interest to the conference. The goals of the workshop are to build a cohort group of young researchers who will then have a network of colleagues spread across the world, to guide and shape the work of the new researchers by having experts serve as mentors and give advice, to provide encouragement and support for the selection of GROUP research topics, to make it possible for promising new entrants to the field to attend a leading research conference and to illustrate for them the interrelationship and diversity of GROUP research, and in general to make the new entrants? experience at the GROUP conference enjoyable and rewarding, so that they will be encouraged to return and submit to future conferences in the series.<br\/><br\/>Broader Impacts: The GROUP conferences represent a critical link between the research communities supported by CISE\/IIS and the broader social, behavioral, and management sciences. Maintaining and fostering research dialog among these diverse disciplines will result in synergistic and transformative research collaborations. Further, developing young researchers who can effectively bridge two or more of the broader CISE\/IIS, social and management sciences is an important goal to ensure the future vitality of the IIS research community. The GROUP DC will bring together the best of the next generation of organizational systems, information systems, social informatics, and CSCW researchers. The social network among this next generation of researchers, and the relationships with senior researchers, created by the workshop will play a critical role in their enculturation into the profession. The organizers will be proactive in order to ensure that both students and faculty are a diverse group across multiple dimensions including nationality, scientific discipline, gender, institutional affiliation, and under-represented minority status.","title":"WORKSHOP: ACM Group 2012 Conference Doctoral Research Consortium","awardID":"1228614","effectiveDate":"2012-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["534247"],"PO":["565227"]},"187302":{"abstract":"Wearable health monitoring systems offer tremendous potential to improve our lives, yet a number of hurdles must be cleared before they become a reality. The processors and architectures that enable this technology demand a large amount of energy, requiring sizable batteries. The ultimate objective of this CAREER research is to create programmable architectures which require no battery and can rely on energy harvesting techniques. To achieve this objective, we seek to reduce power consumption of the processing units by more than two orders of magnitude. This power reduction is accomplished through novel, transformative methodologies to compose and configure programmable, ultra low power, granular decision-making architectures. New algorithms, tightly coupled with signal processing for power reduction in communication blocks are investigated. Research methods to activate and deactivate sensors with the granular decision making architecture attempts to further reduce the power consumption. The methodologies are validated and refined using two clinical case studies.<br\/><br\/>This project has the potential to dramatically improve the quality of health monitoring practice and medical research, empowering numerous applications that are not currently feasible. Growing demand for health care monitoring applications requires students, engineers and health care professionals to design, develop, deploy and operate wearable systems. This project provides a multidisciplinary platform to realize the educational objectives of developing wearable computers, involving high school students and teachers as well as undergraduate and graduate students. Outreach programs are offered through short courses and lectures to local undergraduate societies (SWE, Honors and IEEE), K-12 students, health-care professionals, and local industries.","title":"CAREER: CSR Ultra Low Power Architectures for Wearable Computing","awardID":"1150079","effectiveDate":"2012-02-15","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["558157"],"PO":["564778"]},"187665":{"abstract":"The Rochester institute of Technology -- in collaboration with Auburn University, Carnegie Mellon University, and TERC -- proposes the initial stages of a years-long iterative process to develop an evidence-based, pedagogically-sound computing trajectory for students in middle school through early college. The project is based on a novel three-stage model of programming instruction using the Microsoft Kodu, Alice, and Tekkotsu programming frameworks. It will address the questions:<br\/><br\/>-- Can the proposed three-stage model for programming instruction, accelerate student progress on mastering computational thinking?<br\/>-- Can students develop a deeper understanding of computer science concepts by learning to draw explicit analogies between realizations <br\/> of the same idea in different settings, i.e., in different software frameworks, or in Kinesthetic Learning Activities like CS <br\/> Unplugged?<br\/>-- How can programming environments be made more accessible to students with disabilities such as visual impairment, deaf\/hard of <br\/> hearing, mobility impairment (e.g., cerebral palsy), or learning and cognitive impairment (e.g., autism or ADD)?<br\/><br\/>The last question will be addressed in collaboration with Microsoft FUSE Labs on accessibility enhancements to Kodu, and continuing development of BridgIT, an alternative to Alice designed with accessibility in mind. <br\/><br\/>This planning grant will do preliminary work on these questions, collecting pilot data at a week-long summer camp for students, and a two-day workshop for K-12 teachers. The award will allow the PIs to refine their hypotheses, conduct pilot experiments, deepen their relationships with academic and industry partners, and formulate the detailed research plan needed for the eventual full proposal.","title":"Collaborative Research: Planning Grant: Computer Science for All (CS4ALL)","awardID":"1151981","effectiveDate":"2012-02-15","expirationDate":"2013-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[503115,"533925"],"PO":["561855"]},"192351":{"abstract":"This is funding to provide financial support for 10 graduate students from universities in the United States (or who are U.S. citizens) to attend the 2012 International Conference on Intelligent User Interfaces (IUI 2012), to be held in Lisbon, Portugal, on February 15-17, 2012, as participants in the doctoral session, presenters in the main conference, and attendees at the conference for general training purposes. Sponsored by ACM, the annual IUI conferences represent the growing interest in next-generation intelligent and interactive user interfaces; they are the premier forum where researchers from academia and industry, who work at the intersection of Human-Computer Interaction (HCI) and Artificial Intelligence (AI), come together to exchange complementary insights and to present and discuss outstanding research and applications whose goal is to make the computerized world a more amenable place. Unlike traditional AI the focus is not so much on making the computer smart all by itself, but rather on making the interaction between computers and people smarter. Unlike traditional HCI, there is a focus on solutions that involve large amounts of knowledge and emerging technologies such as natural language understanding, brain computer interfaces, and gesture recognition. To this end, IUI encourages contributions not only from computer science but also from related fields such as psychology, cognitive science, computer graphics, the arts, etc. IUI 2012 will be the 15th conference in the series; topics of interest this year include: Intelligent interactive interfaces, systems, and devices; Ubiquitous interfaces; Smart environments and tools; Human-centered interfaces; Mobile interfaces; Multimodal interfaces; Pen-based interfaces; Spoken and natural language interfaces; Conversational interfaces; Affective and social interfaces; Tangible interfaces; Collaborative multi-user interfaces; Adaptive interfaces; Sensor-based interfaces; User modeling and interaction with novel interfaces and devices; Interfaces for personalization and recommender systems; Interfaces for plan-based systems; Interfaces that incorporate knowledge- or agent-based approaches; Help interfaces for complex tasks; Example- and demonstration-based interfaces; Interfaces for intelligent generation and presentation of information; Intelligent authoring systems; Synthesis of multimodal virtual characters and social robots; Interfaces for games and entertainment; for learning-based interactions and for health informatics; Empirical studies and evaluations of IUI interfaces; New approaches to designing Intelligent User Interfaces. More information about the conference is available at http:\/\/iuiconf.org\/. <br\/><br\/>This year IUI is organizing a student Doctoral Consortium (workshop) for the first time to expand student attendance and training in this area (see: http:\/\/iuiconf.org\/doctoral_consortium.html). The Doctoral Consortium will be held as a day-long event on February 14, 2012, immediately preceding the conference, and is designed to give students exposure to their research community, including an opportunity to present their work to and receive constructive feedback from their peers as well as senior scientist mentors in the field. The students' work will also be featured during the main conference in the poster session, where they will gain additional experience explaining their work to others in the field. It is essential that our current generation of students receive good quality training in intelligent interactive interfaces, since such interfaces will be key components of future interactive systems in a variety of domains; therefore, the doctoral consortium is designed to encourage Ph.D. students to start building a professional support network of peers and mentors. The organizing committee has undertaken to proactively recruit student participants from schools that have not traditionally been well represented in the IUI community. Priority will be given to funding students representing different institutions (no more than 2 from any given institution); women, minority students, the disabled, and veterans all will be encouraged to participate.<br\/><br\/>Broader Impacts: This funding will enable attendance at this conference by students who might otherwise be unable to do so for financial reasons. It will enhance the educational experience of funded participants, by bringing them into contact with leading researchers in the field and by exposing them to the lively discussion during the course of the conference that often leads to opportunities for career advancement. The quality of the conference itself will be enhanced as well, thanks to a broadening of the base of institutions represented and increased diversity of participants. The rich exchange of ideas at IUI has previously proven to be a valuable source of ideas for future research, as well as leading to collaborative efforts; this funding will extend the opportunities for collabor","title":"Workshop: Support for Student Participation in the Intelligent User Interface 2012 Conference","awardID":"1212384","effectiveDate":"2012-02-15","expirationDate":"2012-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[515490],"PO":["565227"]},"193033":{"abstract":"This project supports the travel of U.S. doctoral student researchers to the premier international conference on autonomous agents and multi-agent systems and their participation in the Doctoral Mentoring Consortium held in conjunction with it. The Eleventh International Joint Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2012) will be held in Valencia, Spain, June 4-8, 2012. All students awarded stipends will participate in a Doctoral Mentoring Consortium in which they will present their research to other student researchers as well as experienced researchers and receive in-depth feedback from a group of invited senior researchers. Travel stipends will be awarded through an application process that includes submission of a two-page extended thesis abstract, a one-page personal research statement, a short CV, and a recommendation from the thesis advisor. In selecting students to be given stipends, the committee will consider resources available to them to attend the conference, their exposure to international research, and their level of participation in the conference (e.g., paper, poster, workshop presentation); it will also consider the diversity of the potential participants. The travel stipends will allow the selected students to present their research results and participate in valuable discussions that will likely shape the future of this critically important field. The AAMAS technical program is complemented with an array of workshops, tutorials, and other events. The wide variety and significance of the topics typically presented at AAMAS, in the technical and other programs, provide opportunities for students to share, exchange, and learn from each other.","title":"Doctoral Mentoring Consortium at the International Conference on Autonomous Agents and Multi-Agent Systems","awardID":"1216361","effectiveDate":"2012-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["561562"],"PO":["562760"]},"187226":{"abstract":"To overcome accessibility problems, people with disabilities have traditionally relied upon the support of others in their community. For instance, a volunteer may offer a few minutes of her time to read a blind person's mail aloud, or a fellow traveler may answer a quick question at the bus stop (e.g., \"Is that the 45 coming?\"). Professionals such as sign language interpreters and narrators of audio descriptions convert sensory information into alternative forms that enable a deaf student to participate in a conventional lecture and a blind person to enjoy a movie. Internet connectivity has dramatically expanded the pool of potential human supporters, but finding reliable assistance on demand remains difficult. The PI's goal in this project is to enable dynamic and diverse groups of people reachable via the Web (\"the crowd\") to interactively support people with disabilities. The crowd is whoever happens to be available, from paid workers recruited on burgeoning micro-task marketplaces, to friends and family recruited via existing social networks, to volunteers willing to give a few minutes of their time. While someone is always available, the crowd is dynamic and individual workers can be unreliable. Thus, developing interactive systems to support people with disabilities presents numerous challenges, including how to enable crowd support that is real-time and high-quality, how to design interfaces that provide effective feedback even when an individual's directions may not be followed, and how to support collaboration among individual crowd workers without subverting methods of ensuring reliability. To these ends, the PI will explore closed-loop crowd support with a number of applications. VizWiz Stream will enable blind users to engage in an interactive conversation with the crowd about their visual environment. AudioWiz Stream will provide nearly real-time transcription of aural speech. And Legion and Legion VM will enable the crowd to collectively assume control of the keyboard and mouse to complete a user-specified task on existing desktop interfaces (whereas research in human-computer interaction usually assumes either a single user or a group of users collaborating in the same virtual space each in control of a personal cursor, this project will advance a new model in which a diverse and dynamic group collectively acts as a single operator). These applications will inform a common model for closed-loop crowd support, and will be iteratively improved and evaluated in lab studies and field deployments with blind and deaf users.<br\/><br\/>Broader Impacts: Project outcomes will enable people with disabilities to overcome more accessibility problems independently and on demand. The PI will release the software tools developed as part of this research as open source code, thereby enabling other researchers to build on his results. Although initially intended for use by blind and deaf people, the tools will likely prove useful as well to people with other disabilities such as cognitive or motor impairments, and people without disabilities may want to outsource interactive tasks which they cannot do, do not want to do, or think the crowd may do better. The PI will conduct annual summer programs in which blind and deaf high school students will develop tools for closed-loop crowd support, and also serve as supporters for people with different disabilities; these activities may encourage some of the participants with disabilities to pursue careers in computing, and the undergraduate students who help develop and run these activities will gain personal exposure to accessible computing and the challenges people with disabilities face in computing that they will carry with them into their careers.","title":"CAREER: Closed-Loop Crowd Support for People with Disabilities","awardID":"1149709","effectiveDate":"2012-02-15","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["557943"],"PO":["565227"]},"194585":{"abstract":"The popularity of personal gadgets opens up many new services for ordinary users. Many everyday usage scenarios involve two or more devices \"working together\". (Emerging scenarios are beginning to involve sensors and personal RFID tags.) Before working together, devices must be securely \"paired\" to enable secure and private communication. <br\/><br\/>However, the human-imperceptible nature of wireless communication prompts the very real threat of Man-in-the-Middle (MiTM) attacks. Another challenge arises due to the lack of a global security infrastructure. Consequently, traditional cryptographic means alone are unsuitable, since unfamiliar devices have no prior security context and no common point of trust. Therefore, some human involvement in secure device pairing is unavoidable. At the same time, most devices have limited hardware and\/or user interfaces, thus complicating human involvement.<br\/><br\/>This project?s goals are three-fold: (1) design a set of pairing methods suitable for most common devices and a general user population, based on comprehensive and comparative usability studies, (2) develop secure pairing techniques for personal RFID tags, and (3) construct a set of user-friendly, scalable and secure methods for sensor initialization.<br\/><br\/>Benefits of this project will include accumulation of valuable expertise in designing truly usable security methods. Notably, the project expects to experimentally assess the value of usable security with respect to the general population. Furthermore, the need for, and the utility of, user-centric secure control of personal RFID tags and sensors will be demonstrated. Since device pairing is one of the very few areas where security directly involves and affects the average user, the greatest impact of proposed research is expected to be the broader participation in security practices and better appreciation of security and its benefits. The project also emphasizes industry outreach and technology transfer by working with manufacturers and industrial consortia.<br\/><br\/>In addition, students taking part in the project are expected to acquire currently uncommon skills at the cusp of Human-Computer Interaction, Usability and Cyber Trust.","title":"CT-ISG: User-Aided Secure Association of Wireless Devices","awardID":"1228236","effectiveDate":"2012-02-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["535221"],"PO":["562974"]},"192771":{"abstract":"This is funding to support a Doctoral Consortium (workshop) of approximately 25 promising graduate students from the United States and abroad, along with a panel of about 5 distinguished research faculty mentors. The event will take place in conjunction with the Academy of Management (AOM)'s 2012 Conference and will be held August 3-4 in Boston, MA. This is the leading international forum for the presentation and discussion of research about management and organizations, and is attended by approximately 6,000 professionals from around the world. More information about the conference is available at http:\/\/meetings.aomonline.org\/2012\/.<br\/><br\/>The Organizational Communication and Information Systems (OCIS) Doctoral Consortium is a research-focused meeting that has taken place annually at the AOM conference since 2000, and has helped to launch the careers of many outstanding researchers in organizational communication and information systems. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their research during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other OCIS research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on August 3-4, with follow up activities planned during the technical program of the conference (August 5-7). The OCIS conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The OCIS doctoral consortia have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars; many of today's leading researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual OCIS doctoral consortia traditionally bring together the best of the next generation of researchers in organizational communication and information systems, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Applications are encouraged from all doctoral students whose research is OCIS-related, regardless of the fields in which they are earning their degrees. While NSF funds will be used chiefly to support participation by students enrolled in graduate programs in the United States, some international participants may be supported as well in recognition of the fact that the OCIS field embraces educational and cultural traditions that vary in different parts of the world. The organizers will try explicitly to identify and include the broadest possible group of highly qualified participants, and in particular will consider gender in the participant selection process. As a consequence of these steps, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field.","title":"Travel Support for the Organizational Communication and Information Systems Doctoral Consortium","awardID":"1214862","effectiveDate":"2012-02-15","expirationDate":"2013-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["538337"],"PO":["564456"]},"187316":{"abstract":"The University of Pennsylvania and Arizona State University will investigate how American Indian youth, communities, and pre-service teachers learn and design with computational textiles. Computational or e-textiles,textile artifacts that contain embedded computers or are computationally generated, are promising portals into youths' existing interests in new media and design and connecting them to computer science education by using indigenous communities' existing craft practices and thus strengthening school-community relationships. The EthnoEtextiles project expands e-textiles in new directions by integrating the following successful developments and NSF work: (1) a computational construction kit, the Lilypad Arduino, that can promote the type of technology fluency missing in students' creative explorations with technology; (2) teacher professional development approaches that encourage culturally relevant and reflective teaching with technology; and (3) workshop models that create connections among youth, members of their community, and their cultural heritage. The purpose is to develop relationships and workshop models for youth and teachers that can become a platform for larger systemic and sustainable initiatives in computer science education for American Indian youth, teachers, and community members. The proposed project will contribute to our growing understanding of teaching and learning with electronic textiles in computer science education and help diversify participation by reaching traditionally underserved communities of American Indian peoples.","title":"Collaborative Research: Planning grant: E2textiles: Ethno Electronic Textile Designs for Broadening Participation in Computing for American Indian Youth, Teachers, and Communities","awardID":"1150150","effectiveDate":"2012-02-15","expirationDate":"2014-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["526230"],"PO":["560704"]},"187328":{"abstract":"Due to the culmination of the recent reapportionment of FCC frequency bands and the acceleration of wireless device complexity, simultaneous access to multiple diverse wireless frequency bands is becoming more of a reality. Naturally, the question arises: How can simultaneous access to a wide range of frequency bands with distinct propagation and communication capabilities improve current wireless network performance? In this CAREER research, a foundation is laid for exploiting multiple frequency bands for multihop wireless networks from per-link to network-wide decisions. To do so, this project uses experimental design, measurement analysis, analytical modeling, and embedded programming on an array of devices and testbeds from mobile phones globally reachable via application downloads to in-lab and in-the-field wireless infrastructures.<br\/><br\/>There are three key innovations to the work: 1) An experimental characterization for multiple frequency band propagation characteristics by leveraging mobile phone measurements and in-field trials on a number of frequency bands, 2) A network planning framework for scalable, multiband architectures that uses empirical and analytical models for capacity prediction of heterogeneous topological formations across a diverse set of frequency bands, and 3) Protocols that coordinate and adapt link parameters across multiple wireless frequency bands, guided by real-time measurements of channel variability, an understanding of environmental context, and on-line training based on historical performance. As a result of work, multihop wireless network researchers, developers, and infrastructure providers can leverage the framework to exploit multiple frequency bands in a broad class of network protocols, topologies, and environments via available experimental data, analytical model development, and protocol design.","title":"CAREER: Leveraging Simultaneous Access to Multiple Frequency Bands in Multihop Wireless Networks","awardID":"1150215","effectiveDate":"2012-02-15","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550846"],"PO":["557315"]},"187218":{"abstract":"This project starts with the assumption that software and hardware faults cannot be entirely prevented, and seeks to discover new mechanisms by which a computing system can recover from faults in its components and resume predictable operation in a timely manner. The focus is on embedded computing systems, such as those that control our transportation and power systems. One novel aspect of this work is that even low-level aspects of the operating system are assumed to be potentially faulty, and designed to recover upon fault. A \"Superglue\" component connection language and runtime support system provides a unified framework for fault detection, isolation, and recovery. The research includes investigations of mechanisms to track the state required to reconstruct a given part of a system if it should fail, and the policies to reconstruct this state in time that the impact of the recovery process on the physical world can be tolerated.<br\/><br\/>Success of this research will potentially benefit large segments of society. The physical infrastructure upon which many aspects of our life depend is increasingly reliant on software for control. The complexity of the software in these embedded systems, which interact with the physical world, is increasing with the complexity of the tasks performed and features required. With this mounting complexity the probability of faults increases, while our increasing dependency on these systems makes the consequences of failure more severe. Faults in computing systems may manifest as brief interruptions of service -- for example, the flickering of control panels -- or as massive system failures, in the worst case leading to loss of life. Therefore, the resilience and robustness of these computing systems is of critical importance.<br\/><br\/>The PI also will continue and expand his efforts in connecting this research with graduate and undergraduate education, including courses on robotics, and outreach to the Washington DC public schools.","title":"CAREER: A System for Resilient, Mission-Critical Embedded Computation","awardID":"1149675","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[502189],"PO":["564778"]},"193136":{"abstract":"This award provides support for U.S. researchers to participate in the Strategic Workshop on Information Retrieval, to be held in Lorne, Victoria, Australia in February 2012. The goal of the workshop is to explore and define long-range research issues of general and personal information management in the context of information that is constantly changing, that is in a diverse set of formats, and that is stored in numerous locations. This workshop brings together about 40 junior and senior researchers from around the world with expertise spanning the information retrieval, information science, and search communities to develop common understandings and goals of the long-term challenges and opportunities. The workshop will explore at least the following questions: (1) How can Information Retrieval algorithms be adapted to this new paradigm where information is distributed, multimedia, and dynamic? (2) In this setting, what are the key challenges that researchers, graduate students, and funding agencies should be aware of? (3) How can the successful evaluation models for Information Retrieval be extended to this setting where data availability and privacy are major challenges? (4) How should teaching about Information Retrieval be modified to reflect likely changes in the field? <br\/><br\/>This workshop is expected to yield research directions that will impact the information retrieval and science research and development communities as well as research groups that tackle problems arising within this context (e.g., machine learning, human computer interaction). The immediate beneficiaries of the workshop's publications will include graduate students, faculty members, industrial researchers, and developers of search-related technology. In addition, it is expected that general users of search tools will benefit from resulting advances in technology. Results addressing the questions above will be disseminated on a dedicated website (http:\/\/www.cs.rmit.edu.au\/swirl12\/) and will also be published in the widely distributed SIGIR Forum newsletter and its web site.","title":"Strategic Workshop on Information Retrieval","awardID":"1216764","effectiveDate":"2012-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["553228"],"PO":["563751"]},"193314":{"abstract":"As software engineers have developed new techniques to address the complexity associated with the construction of modern-day software systems, an equally pressing need has risen for mechanisms that automate and simplify the management of those systems after they are deployed, i.e., during runtime. This has called for the development of (self-)adaptive software systems, which are capable of modifying their behavior at runtime to achieve certain functional or quality of service objectives. The proposed research aims to develop an alternative approach to engineering adaptive software that uses a data mining approach to automatically derive models expressing probabilistic dependencies among the components of a system. These types of models are then used to ensure changes in the running software do not create inconsistencies that jeopardize the system?s functionality. The hypothesis guiding this research is that by monitoring a software system?s execution history (e.g., message exchange, method invocation) for a sufficiently long period of time, it is possible to infer a relatively accurate model of interactions and dependencies among the system?s components. The proposed approach will be realized via a suite of integrated tools. The research will be evaluated in both controlled laboratory setting, as well as several real-world applications that are representative of the kinds of systems that could benefit from this research.","title":"EAGER: CCF: SHF: Mining the Execution History of a Software System to Infer the Safe Time for its Adaptation","awardID":"1217503","effectiveDate":"2012-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["534008"],"PO":["564388"]},"193865":{"abstract":"The NAACL HLT conference is the major international conference in North America in the field of natural language processing. The goal of this grant is subsidize travel, conference, and housing expenses of students selected to participate in the NAACL HLT Student Research Workshop which will be held during the conference June 3-8 in Montreal, Canada. The workshop aims to attract papers both from authors who are in their early stages of academic work (possibly undergraduate and masters students) as well as from students who are approaching graduate and would like to present their thesis work. The goal is to help attract students from the first group to pursue further academic work, and to help students from the second group in their job search and career planning.<br\/><br\/>Papers from the student workshop are presented as posters during the main poster session of the conference. Senior researchers are assigned as mentors to each student and provide individual feedback. A general session on on how to review papers and what to expect from reviewers is held during a lunch slot. The workshop is organized and run by students.<br\/><br\/>The Student Research Workshop provides a valuable opportunity for the next generation of natural language processing researchers to enter the computational linguistics community. It allows the best students in the field to take their first important step toward becoming professional computational linguists by receiving critical feedback on their work from external experts, and by making contacts with other students and senior researchers in their field. The students who are involved in running and selecting papers for the workshop also gain valuable opportunities for professional growth and interaction with the researchers on the organizing committee of the main conference. The workshop contributes to the maintenance and development of a skilled and diverse computational linguistics and natural language processing research community.","title":"NAACL-HLT 2012 Student Workshop","awardID":"1220521","effectiveDate":"2012-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[519134],"PO":["565215"]},"192314":{"abstract":"The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing and computational linguistics. The ACL's annual conference is the major international conference in this field. This project is to subsidize travel, conference and housing expenses of students selected to participate in the ACL Student Research Workshop, which will take place during the main ACL conference on July 8-14, 2012 in Jeju Island, Korea. The Student Research Workshop accepts papers in two categories: thesis\/research proposal and general research papers. The thesis\/research proposal can have only one author who must be a student. The research papers can have multiple authors, with the first author being a student. The workshop is organized and run by students.<br\/><br\/>The Student Research Workshop provides a valuable opportunity for the next generation of natural language processing researchers to enter the research community. It allows the students in the field to take an important step towards becoming professional computational linguists by receiving critical feedback on their work from experts outside of their dissertation committee, and by making contacts with other students and senior researchers in their field. The students who are involved in running and reviewing for the student workshop also gain valuable opportunities for professional growth and interaction with the researchers on the organizing committee of the main conference. The ACL Student Research Workshop contributes to the maintenance and development of a skilled and diverse computational linguistics and natural language processing community.","title":"ACL 2012 Student Research Workshop","awardID":"1212280","effectiveDate":"2012-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563325"],"PO":["565215"]},"194724":{"abstract":"This is funding to support a Doctoral Consortium (workshop) for approximately 12 graduate students, along with a panel of 4 distinguished research faculty mentors. The event will take place in conjunction with the Seventh International Conference on the Theory and Application of Diagrams (DIAGRAMS 2012), to be held July 2-6, 2012, on the campus of the University of Kent, UK. Diagrams are wide-ranging and open-ended representations that include sketches, drawings, charts, pictures, 2D and 3D geometric models, and maps. They are a vital tool in human communication in areas such as art and science, as well as commerce and industry. A better understanding of how effective diagrams can be generated and used has the potential to produce transformative advances in these areas. DIAGRAMS is a bi-annual, international conference series that covers all aspects of research on the theory and application of diagrams. The goals of the interdisciplinary conference are to present and discuss (a) state-of-the-art research on computational, cognitive and socio-cultural theories, models and techniques of reasoning with diagrammatic representations, and (b) cutting-edge intelligent and interactive information technologies for using diagrammatic representations in supporting human reasoning. Research topics include understanding diagrammatic reasoning in humans, understanding the use of diagrammatic representation for communication, developing techniques for automated diagrammatic reasoning, and designing tools for use of diagrammatic representations. DIAGRAMS is the only conference that provides a united forum for all areas that are concerned with the study of diagrams. The conference series is overseen by the Diagrams Steering Committee with a rotating membership; more information is available at the conference website http:\/\/www.diagrams-conference.org\/2012. <br\/><br\/>The primary goal of the DIAGRAMS 2012 Doctoral Consortium is to increase the exposure and visibility of young graduate student researchers in these areas. The workshop will be a research-focused day-long meeting that affords participants an opportunity to present their work and get feedback from established researchers in the field, who will be present to comment on the young researchers' presentations in an informal and constructive environment. Each invited participant will be asked to give a short talk, which will be followed by discussion and critiquing. For some students, this may be their first opportunity to give a research talk outside their home institutions, which will help prepare them for future scholarly discussions.<br\/><br\/>Broader Impacts: DIAGRAMS 2012 will significantly increase our understanding of diagrammatic reasoning in humans and machines, and will add momentum to the development of new information technologies for the use of diagrammatic representations in support of human reasoning. The conference will help develop human research capital by enabling interactions between senior and junior researchers and by catalyzing new collaborations. The doctoral consortium will increase the exposure and visibility of young graduate student researchers in these areas, and help train them by providing early input from senior researchers in the field in an interactive and constructive environment. The social network among this next generation of researchers, and the relationships with senior researchers, created by the workshop will play a critical role in their enculturation into the profession. The organizers will be proactive in order to ensure that both students and faculty are a diverse group across multiple dimensions including nationality, scientific discipline, gender, institutional affiliation, and under-represented minority status.","title":"HCC: Doctoral Symposium at the Seventh International Conference on the Theory and Application of Diagrams","awardID":"1228772","effectiveDate":"2012-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[521583],"PO":["565227"]},"193305":{"abstract":"This workshop is organized to bring together leaders and scientists in a variety of different disciplines with complementary expertise including experts in behavior change theory, health and wellness systems, behavior measurement and measurement technology, engineering, computer science, and various types of \"persuasive\" interventions. The main objective of the workshop is to identify challenges in using computing and networking and information technology in support of behavioral change that would enable healthcare to be more proactive and preventive. <br\/><br\/> The proposed workshop plans to address a number of open fundamental issues at the intersection of networking, information technology and behavior modification. The workshop is striving to identify the fundamental barriers that currently hamper the use of networking and information technology, how they can be used to mediate processes enabling behavioral change, as well as new methods for the real-time assessment and modeling of behavior, affective states, and the environments in which these behaviors occur. <br\/><br\/>Reactionary \"sick-care\" systems that fail to prevent disease have become financially unsustainable. It is a global imperative that healthcare is transformed to a preemptive model that advances health \"up front.\" The global burden of disease is tightly related to conditions that are preventable and treatable through promoting changes in key human behaviors. The ability to change behaviors on a population scale, in an economically feasible way, is therefore likely to have a major impact on the cost of healthcare. In addition, healthy behaviors are typically associated with better quality of life and wellbeing.","title":"International Workshop on New Computationally-Enabled Theoretical Models to Support Health Behavior Change and Maintenance","awardID":"1217464","effectiveDate":"2012-02-15","expirationDate":"2014-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[517804],"PO":["564768"]},"187619":{"abstract":"The Rochester institute of Technology -- in collaboration with Auburn University, Carnegie Mellon University, and TERC -- proposes the initial stages of a years-long iterative process to develop an evidence-based, pedagogically-sound computing trajectory for students in middle school through early college. The project is based on a novel three-stage model of programming instruction using the Microsoft Kodu, Alice, and Tekkotsu programming frameworks. It will address the questions:<br\/><br\/>-- Can the proposed three-stage model for programming instruction, accelerate student progress on mastering computational thinking?<br\/>-- Can students develop a deeper understanding of computer science concepts by learning to draw explicit analogies between realizations <br\/> of the same idea in different settings, i.e., in different software frameworks, or in Kinesthetic Learning Activities like CS <br\/> Unplugged?<br\/>-- How can programming environments be made more accessible to students with disabilities such as visual impairment, deaf\/hard of <br\/> hearing, mobility impairment (e.g., cerebral palsy), or learning and cognitive impairment (e.g., autism or ADD)?<br\/><br\/>The last question will be addressed in collaboration with Microsoft FUSE Labs on accessibility enhancements to Kodu, and continuing development of BridgIT, an alternative to Alice designed with accessibility in mind. <br\/><br\/>This planning grant will do preliminary work on these questions, collecting pilot data at a week-long summer camp for students, and a two-day workshop for K-12 teachers. The award will allow the PIs to refine their hypotheses, conduct pilot experiments, deepen their relationships with academic and industry partners, and formulate the detailed research plan needed for the eventual full proposal.","title":"Collaborative Research: Planning Grant: Computer Science for All (CS4ALL)","awardID":"1151713","effectiveDate":"2012-02-15","expirationDate":"2013-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["527961"],"PO":["561855"]},"190207":{"abstract":"The project supports graduate student participation in the Sixth International Conference on Web Reasoning and Rule Systems (RR 2012) Conference and the Reasoning Web Summer School to be held in Vienna, Austria during September 10-12, 2012 and September 3-8, 2012 respectively, in Vienna, Austria. Specifically, the project provides funds to defray the cost of travel for students enrolled in doctoral programs at US institutions who might not otherwise be able to attend the conference or the summer school because of financial reasons. The recipients of student travel fellowships will attend and the Reasoning Web Summer School designed to introduce graduate students to current research topics and recent advances in web reasoning followed by the RR 2012 conference which includes a scientific program of talks and a doctoral consortium that provides a venue for the students to have one-on-one discussions and receive mentoring from some of the leading researchers in semantic web and semantic technologies. The project offers natural integration of research and education and contributes to the training of a new generation of researchers in semantic technologies, an area of growing importance and impact in not only Computer Science but also many application domains that rely on advances in knowledge representation and reasoning on the web e.g., information retrieval, e-science, e-commerce, e-government, e-health, among others. Additional information about the RR 2012 conference and the Reasoning Web Summer School can be found at: http:\/\/www.rr-conference.org\/RR2012\/.","title":"Student Travel Fellowships: 2012 Reasoning Web Summer School and the Web Reasoning and Rule Systems Conference","awardID":"1202841","effectiveDate":"2012-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["560895","560897","563585","561219"],"PO":["560586"]},"187182":{"abstract":"Monitoring the detailed characteristics of an operational cognitive radio network in white space is critical to many system administrative tasks. It faces unique challenges due to dynamic spectrum access policy, low-power primary users, wide spectrum, and radio agility. Towards reliable and efficient monitoring of cognitive radio networks in white space, this project develops mechanisms for monitoring the activity of low power primary users (wireless microphones) and secondary networks. There are two main thrusts in this project. The first thrust focuses on a novel approach for reliable and fast detection of wireless microphone systems by integrating acoustic sensing and RF sensing under low SNR and multi-user scenarios. The second thrust is on customizable efficient monitoring of the traffic and spectrum usage pattern in secondary networks with limited number of monitors through online learning and dynamic monitoring channel switching.<br\/><br\/>The research will open up a new avenue for reliable, fast, and low-complexity primary user (wireless microphone) monitoring in white space. It will promote the understanding of the data monitoring problem in dynamic spectrum access systems, and largely facilitate the operation and optimization of cognitive radio networks in white space. This project develops curricula and educates students. Materials of this project will be available online in the forms of tutorials, talks, publications, and software toolkits. Major results will be disseminated through presentations and publications in meetings, conferences and journals.","title":"CAREER: Towards Reliable and Efficient Network Monitoring in White Space","awardID":"1149500","effectiveDate":"2012-02-15","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[502117],"PO":["557315"]},"187193":{"abstract":"The PI's ultimate research goal is to empower people with severe speech and physical impairments so they can live their lives to the fullest extent independently and productively. To this end, he will in this project exploit and advance emerging brain computer interface (BCI) technology by rigorously developing macro-level dynamic models for the visual evoked potentials (VEP) in the brain measured by electroencephalography (EEG) in the context of BCI design. The models will enable a communication channel interpretation of the BCI and will allow analysis and design breakthroughs stemming from the application of information theory and digital communication concepts. Cortical dynamics and background processes will be modeled using a probabilistic dynamic framework at a spatiotemporal scale appropriate for BCI analysis and design. Model-based performance limits on bandwidth and calibration accuracy will then be determined, in order to develop better information coding techniques for optimal communication bandwidth (speed) utilization and better subject training and model calibration procedures for best accuracy return on investment of effort. Prototype real-time applications that operate at optimal or near-optimal performance levels utilizing the developed theoretical advancements for communication and control will be implemented, to enable access by and support independence for the target user groups. <br\/><br\/>Project outcomes will disrupt the trend of black-box BCI design by building dynamic system models for stimulus-to-EEG systems encountered in BCI applications, and treating them as stochastic communication channels in order to characterize signals accordingly and to employ information theoretic approaches to analysis and design. This novel theoretical framework will enable model-based quantitative characterization of BCI performance limits and will allow the design of optimal or near-optimal coding\/decoding strategies as well as improved calibration procedures that will have immediate impact on increasing bandwidth and intent detection accuracy, as well as calibration duration reduction in BCI systems - primary barriers between laboratory prototypes and real-world-worthy BCI products.<br\/><br\/>Broader Impacts: If successful this project will advance BCI technology to the next level, thereby revolutionizing human computer interaction and empowering persons with physical disabilities by enabling seamless control of computers and devices. The project will afford, through collaboration with the Center for Subsurface Sensing and Imaging Systems (CenSSIS) at Northeastern University as well as colleagues across departments and institutions, opportunities to both undergraduate engineering and non-engineering majors for enhanced learning and collaboration skills by immersing them in interdisciplinary cutting-edge research and design projects with societal impact. The PI will engage high school students and teachers in the research through his institution's Center for STEM Education. And he will inform the broader public of ongoing technological advances in the BCI field and raise disability awareness through collaboration with the Cahners ComputerPlace at the Boston Museum of Science.","title":"CAREER: Signal Models, Channel Capacity, and Information Rate for Noninvasive Brain Interfaces","awardID":"1149570","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["506513"],"PO":["565227"]},"187184":{"abstract":"In recent years, research in human-computer interaction (HCI) has generated a broad range of interaction styles that move beyond the desktop into new physical and social contexts. Key areas of innovation in this respect are tabletop, tangible, and multi-touch user interfaces. These interaction styles leverage users' existing knowledge and skills of interaction with the real, non-digital world; thus, they are often referred to as reality-based interfaces. Such interfaces offer a natural, intuitive, and often collaborative form of interaction that reduces the mental effort required to learn and operate a computational system. While these advances in HCI have been successfully applied to a broad range of application domains, little research has been devoted to investigating reality-based interaction in the context of scientific discovery. The PI argues that it is particularly important to study reality-based interaction in this context, where reducing users' mental workloads and supporting collaborative work could potentially lead to exciting scientific advances. For example, in a preliminary study of the workflow and computational tools employed by synthetic biologists, the PI found that members of this research community often experience difficulties in specifying, comparing, documenting, and sharing information - interactions that have previously been shown as critical for scientific discovery. She further observed that the limitations of current computational tools pose barriers for collaboration, information flow, and exploration. This lack of appropriate computational tools coupled with the inherent complexity of biological systems has limited progress to date, despite the enormous potential of synthetic biology to solve problems such as low-cost drug development and alternative energy production. In this project, the PI will investigate how reality based interfaces may be able to advance innovation in biological design. To address this question, she will develop and evaluate a suite of reality-based interfaces that support the design and assembly of novel biological systems, and which she expects will promote collaborative, effective, and safe workflow, facilitate exploration of alternative solutions, and reduce the mental workload associated with accessing and relating large amounts of information.<br\/><br\/>Broader Impacts: Project outcomes will include: design, implementation, and evaluation of a suite of reality-based interfaces for synthetic biologists; a set of design requirements for developing future such systems; a methodology for evaluating the efficacy of computer-supported cooperative work of scientists; novel techniques for fluid interaction with heterogeneous computational devices of different scale; and a set of design considerations and a participatory design process for supporting scientific discovery. The PI will train three female undergraduate researchers per year, who will be an integral part of her research team and will participate in an international science competition. The project will impact computing and science courses at the PI's institution (a women's college) and at collaborating institutions. In addition, this research will serve as a highly visible \"magnet\" project that attracts undergraduate and high-school students' attention to computer science research through outreach activities.","title":"CAREER: Advancing Innovation in Bio-Design through Reality-Based Interaction","awardID":"1149530","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["534174"],"PO":["565227"]},"186096":{"abstract":"This award will support student attendance at the IEEE Conference on Computational Complexity (CCC), which will take place June 26-28, 2012 in Porto, Portugal. CCC is the primary conference for research on computational complexity, i.e., the absolute and relative power of computational models under resource constraints.<br\/><br\/>In recent years, conference attendance has been around 100, and around 30% have been students. The conference's technical content and professional networking opportunities are particularly valuable to students. Because the next meeting is outside the U.S., students with accepted papers may have difficulty attending. This award will provide partial support to approximately ten student attendees to defray costs of registration fees, shared hotel rooms, and travel.","title":"CCF:AF Student Travel Support for the IEEE Conference on Computational Complexity 2012","awardID":"1143914","effectiveDate":"2012-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[499399,"565082"],"PO":["565251"]},"187670":{"abstract":"The Rochester institute of Technology -- in collaboration with Auburn University, Carnegie Mellon University, and TERC -- proposes the initial stages of a years-long iterative process to develop an evidence-based, pedagogically-sound computing trajectory for students in middle school through early college. The project is based on a novel three-stage model of programming instruction using the Microsoft Kodu, Alice, and Tekkotsu programming frameworks. It will address the questions:<br\/><br\/>-- Can the proposed three-stage model for programming instruction, accelerate student progress on mastering computational thinking?<br\/>-- Can students develop a deeper understanding of computer science concepts by learning to draw explicit analogies between realizations <br\/> of the same idea in different settings, i.e., in different software frameworks, or in Kinesthetic Learning Activities like CS <br\/> Unplugged?<br\/>-- How can programming environments be made more accessible to students with disabilities such as visual impairment, deaf\/hard of <br\/> hearing, mobility impairment (e.g., cerebral palsy), or learning and cognitive impairment (e.g., autism or ADD)?<br\/><br\/>The last question will be addressed in collaboration with Microsoft FUSE Labs on accessibility enhancements to Kodu, and continuing development of BridgIT, an alternative to Alice designed with accessibility in mind. <br\/><br\/>This planning grant will do preliminary work on these questions, collecting pilot data at a week-long summer camp for students, and a two-day workshop for K-12 teachers. The award will allow the PIs to refine their hypotheses, conduct pilot experiments, deepen their relationships with academic and industry partners, and formulate the detailed research plan needed for the eventual full proposal.","title":"Collaborative Research: Planning Grant: Computer Science for All (CS4ALL)","awardID":"1152003","effectiveDate":"2012-02-15","expirationDate":"2014-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[503130],"PO":["561855"]},"187582":{"abstract":"The Rochester institute of Technology -- in collaboration with Auburn University, Carnegie Mellon University, and TERC -- proposes the initial stages of a years-long iterative process to develop an evidence-based, pedagogically-sound computing trajectory for students in middle school through early college. The project is based on a novel three-stage model of programming instruction using the Microsoft Kodu, Alice, and Tekkotsu programming frameworks. It will address the questions:<br\/><br\/>-- Can the proposed three-stage model for programming instruction, accelerate student progress on mastering computational thinking?<br\/>-- Can students develop a deeper understanding of computer science concepts by learning to draw explicit analogies between realizations <br\/> of the same idea in different settings, i.e., in different software frameworks, or in Kinesthetic Learning Activities like CS <br\/> Unplugged?<br\/>-- How can programming environments be made more accessible to students with disabilities such as visual impairment, deaf\/hard of <br\/> hearing, mobility impairment (e.g., cerebral palsy), or learning and cognitive impairment (e.g., autism or ADD)?<br\/><br\/>The last question will be addressed in collaboration with Microsoft FUSE Labs on accessibility enhancements to Kodu, and continuing development of BridgIT, an alternative to Alice designed with accessibility in mind. <br\/><br\/>This planning grant will do preliminary work on these questions, collecting pilot data at a week-long summer camp for students, and a two-day workshop for K-12 teachers. The award will allow the PIs to refine their hypotheses, conduct pilot experiments, deepen their relationships with academic and industry partners, and formulate the detailed research plan needed for the eventual full proposal.","title":"Collaborative Research: Planning grant: CS4All: Computer Science for All","awardID":"1151542","effectiveDate":"2012-02-15","expirationDate":"2013-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[502937],"PO":["561855"]},"187142":{"abstract":"Complex networks such as human social groups, transportation networks and the World Wide Web are frequently represented as graphs. The goal of this project is to construct a new system that both conveniently and efficiently executes queries on collections of large graphs. To achieve this goal, the project develops data storage and processing techniques that can effectively use a server cluster.<br\/><br\/>The project's outcomes include (1) efficient data storage techniques that take advantage of commonalities between graphs, (2) methods that allow simple implementations of parallel graph processing solutions, (3) a framework that accelerates queries on multiple graphs by sharing computations across graphs, (4) techniques that store data on disks in a manner optimized for query execution, (5) methods that optimize query execution by appropriately distributing data over servers, and (6) techniques that mask server failures while balancing recovery speed and required cost.<br\/><br\/>This project has significant impacts on many application areas where it is critical to understand networks of various types. Examples include national security, social and political studies, transportation and marketing. Programming assignments and term projects based on this research are developed for undergraduate\/graduate courses on data management systems, distributed systems and social network analysis. This project also offers research opportunities to both high school and minority students through summer programs at the University at Albany, State University of New York. The software, experimental data and research papers that result from this project will be disseminated through the project website (http:\/\/www.cs.albany.edu\/~jhh\/research\/G_star\/).","title":"CAREER: G*: A Parallel System for Efficiently Processing Large Graphs","awardID":"1149372","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[502034],"PO":["563727"]},"187175":{"abstract":"Systems across the computing spectrum, from cellphones to supercomputers, are increasingly using a heterogeneous mix of general-purpose multicores augmented with programmable graphics processing units (GPUs). General-purpose multicores are easier to program but often less energy and area efficient, while GPUs are harder to program but more efficient on specific applications. Unfortunately, the two kinds of processors have radically different programming methodologies, instruction sets, microarchitectures, and VLSI implementations, and this heterogeneity significantly increases complexity at all levels of the computing stack. The tension between programmability, efficiency, and complexity is one of the key research challenges in computer engineering today. Overcoming this challenge will help ensure the continued increase in computational capability which has enabled tremendous advances in all corners of society.<br\/>While there have been some modest steps towards tighter integration between general-purpose multicores and GPUs, this project is developing a truly convergent architecture that elegantly unifies these two types of processors. At the heart of the project is a new explicit loop (XL) architectural design pattern that is based on the concept of explicitly encoding and executing a loop iteration space. The project is using a vertically integrated approach to investigate: (1) XL programming frameworks, compilers, and runtimes; (2) XL instruction sets that provide an effective software\/hardware interface for expressing explicit loops; (3) XL microarchitectures that are either optimized for instruction-level parallelism (ILP) or for data-level parallelism (DLP), as well as hybrid microarchitectures that can dynamically reconfigure the same underlying hardware resources to be either ILP or DLP focused; and (4) XL VLSI implementations that will enable accurate design-space exploration of performance, area, and energy implications.<br\/>This project can broadly impact the field of computer architecture by offering a novel approach for designing future computer systems that is able to improve programmability and efficiency while reducing both software and hardware complexity. The project also includes an ambitious educational outreach plan to increase high-school-student participation and undergraduate-student retention in computer engineering.","title":"CAREER: Explicit Loop Architectures for Efficiently Exploiting Instruction- and Data-Level Parallelism","awardID":"1149464","effectiveDate":"2012-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556706"],"PO":["366560"]}}