{"40947":{"abstract":"This project is entitled CMNet (Chinese Memory Net): U.S.-Sino Collaborative Research Toward a Global Digital Library in Chinese. It proposals to bring together select academic research and education partners in the United States, Taiwan and China to develop a sustainable digital library focusing on Chinese Studies. The objectives are to build the necessary multi-national collaborations and resources communities by bringing together existing efforts in these countries and to establish new processes and coordinated activities. By doing so the investigators seek to elucidate and prevent duplication of effort and emergence of fragmented, non-interoperable digital libraries resources in the area of Chinese Studies. Instead the goal is to define characteristics of interoperable systems in this area, to find potential solutions for multilingual language processing, and to develop commonly accepted standards of methods, protocols, tools and technologies within the evolving high bandwidth international networked environment.","title":"CMNet (Chinese Memory Net): U.S.-Sino Collaborative Research Toward a Global Digital Library in Chinese Studies","awardID":"9905833","effectiveDate":"2000-05-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["230874"],"PO":["433760"]},"48880":{"abstract":"Proposal Number: CCR-9988489<br\/>PI Name: Cleaveland, Walter R.<br\/>Institution: SUNY at Stony Brook<br\/>Title: Heterogeneous Specification Formalisms for Reactive Systems<br\/><br\/>This project will investigate heterogeneous, mathematically rigorous modeling<br\/>and analysis techniques for embedded software. The growing popularity of<br\/>embedded computer controllers in devices ranging from airplanes to <br\/>pacemakers to electric shavers points to the importance of cost-effective<br\/>methods supporting the software they run. Traditional specification<br\/>formalisms have emphasized homogeneous approaches in which all modeling and<br\/>analysis occur within one framework, such as Statecharts or temporal logic;<br\/>however, heterogeneous methodologies supporting multi-paradigm specifications<br\/>have strong practical motivations, and informal design notations such as UML<br\/>already provide superficial support for them. To enable heterogeneous systems<br\/>specifications to be analyzed in a mathematically rigorous manner, thereby<br\/>providing designers with feedback in advance of implementation, the project<br\/>will pursue these lines of inquiry: the development of a uniform theory of<br\/>operational and logic-based system specifications; the study of mechanisms for<br\/>composing component models given in disparate formalisms; the implementation<br\/>of automated tool support for verifying the correctness of heterogeneous<br\/>specifications; and the investigation of case studies involving avionics<br\/>systems and communication protocols. This research will enhance greatly the<br\/>capabilities of formal system modeling and analysis by providing a rigorous<br\/>basis for diverse embedded-software specification and verification<br\/>technologies to ``interoperate''.","title":"Heterogeneous Specification Formalisms for Reactive Systems","awardID":"9988489","effectiveDate":"2000-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["417615"],"PO":["564388"]},"47043":{"abstract":"Peter Chesson <br\/><br\/>DEB-9981926<br\/><br\/><br\/>Mathematical models of species competing in space and time will be<br\/>studied using a combination of analytical, simulation, and numerical<br\/>methods. Three specific sorts of natural community will form foci of<br\/>this work: annual plants with persistence seed banks (especially those<br\/>found in arid environments), perennial herbs that spread spatially by<br\/>vegetative means, and long-lived perennial organisms that do not have<br\/>vegetative spread but have multiple reproductive events in the life of<br\/>an individual (iteroparity). The research will examine how life-history<br\/>traits, such as those defining these different communities, interact<br\/>with environmental variation in space and time and affect coexistence of<br\/>species and therefore affect maintenance of species diversity. In<br\/>addition to the features distinguishing the above systems, important<br\/>factors are expected to be mode of dispersal of offspring, distance of<br\/>dispersal, and spatial and temporal scales of competition between<br\/>individual organisms. This work will extend to the spatial domain<br\/>previous findings on the role of temporal environmental variation and<br\/>its interactions with life-history traits on the maintenance of species<br\/>diversity.","title":"Theory for Community Dynamics in Spatially and Temporally Variable Environments","awardID":"9981926","effectiveDate":"2000-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1182","name":"POP & COMMUNITY ECOL PROG"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}}],"PIcoPI":["546359"],"PO":["499029"]},"48044":{"abstract":"EIA-9986052<br\/>Panda K. Dhabaleswar<br\/>Ohio State University<br\/><br\/>CISE Research Instrumentation: Network Computing Testbed for Interactive Visualization, Multimedia, and Metacomputing <br\/><br\/>The Department of Computer and Information Science at the Ohio State University will purchase a network computing testbed (consisting of a set of Quad SMP Pentium systems, Gigabit Ethernet and Myrinet interconnects for intra-cluster communication, ATM interconnect for intra-cluster and WAN connectivity, a RAID File system, a set of 3D accelerator boards, and a video wall), which will be dedicated to support research in computer and information science and engineering. The equipment will be used for several research projects, including in particular:<br\/><br\/>Scalable Communication and Synchronization Support on SMP Clusters for Metacomputing.<br\/><br\/>A High Performance Image-Based Warehouse Across Heterogeneous Environment<br\/><br\/>Parallel Visualization and Display of Tera-scale Data <br\/><br\/>Multimedia Processing and Networking on SMP Clusters","title":"CISE Research Instrumentation: Network Computing Testbed for Interactive Visualization, Multimedia, and Metacomputing","awardID":"9986052","effectiveDate":"2000-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["532951","561947","518376","196100",122802],"PO":["301532"]},"47087":{"abstract":"The profound effect that information technology is having on the global society and economy dictates the development of means to enable global access to the huge volumes of currently disorganized and relatively unstructured materials that are now available to all members of society for business and pleasure, teaching and scholarship. This project aims to define the dimensions of a core international infrastructure that can support the creation of a multi-lingual multi-word expression lexicon incorporating both morpho-syntactic and semantic information, and which will provide a base for building pivotal natural language applications aiming at management of, and universal access to, the vast quantity of information that is becoming available each day via the World Wide Web. In particular, the PI's aims are: To establish uniform standards for describing multi-word lexical entries at the levels of syntax and morpho-syntax and lexical semantics; To identify realistic objectives for the representation of phrasal expressions in a multi-lingual lexicon, in terms of size, scope, existing usable input, additional input and links to other lexical resources, and information types still to be acquired; To determine the type and dimensions of the information that will best serve the needs of critical NLP applications; To specify an overall architecture for a joint software and \"lingware\" development project; To specify the outline of a collaborative project to acquire and represent multi-word lexical entries for multiple languages; To explore the feasibility and dimensions of the eventual project by creating a small number of multi-word entries for support verbs, and including syntax and morpho-syntax; And to explore the possibilities of recognizing and acquiring a repertory of multi-word lexical units from corpora by means of partial parsing, statistics, etc. This research will lay the ground for development of a multi-lingual lexicon for multi-word expressions, an important and essential resource to support the future IT environment. In this way, the work will contribute directly to the creation of a universally accessible, multi-lingual and multi-cultural information infrastructure for individuals and organizations across the globe.","title":"XMELLT: Cross-lingual Multi-word Expression Lexicons for Language Technology","awardID":"9982069","effectiveDate":"2000-05-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X439","name":"DARPA-MULTI LINGUAL INFORM ACC"}}],"PIcoPI":["501442"],"PO":["565227"]},"50090":{"abstract":"This is funding to subsidize travel and housing expenses of students attending the 6th International Conference on Artificial Intelligence in Design, to be held June 26-29, 2000, at WPI. Design is an important research topic in engineering and architecture. It is the key to economic competitiveness and the fundamental precursor to manufacturing. However, our understanding of design as a process and our ability to model it are still very limited. This conference series aims to provide an international forum for the presentation and discussion of state-of-the-art, cutting edge research and developments in artificial intelligence in design. Held every two years, this conference is the premier one in the field, attracting about 150 participants from over 10 different countries. The current funding will provide up to 50% travel support for student attendees, and will afford them an important opportunity to present their research, to hear about the latest results and research thrusts, and to interact with peers in the international, interdisciplinary AI-in-Design community.","title":"Workshop: Support for Student Travel to AID","awardID":"0001792","effectiveDate":"2000-05-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["555866"],"PO":["565227"]},"48144":{"abstract":"9986368<br\/><br\/>This is a multi-disciplinary project to examine a variety of non-linear<br\/>wave processes in the ocean and atmosphere as well as attempting to <br\/>refine some of the numerical methods used to model the dynamics of <br\/>geophysical fluids. The former are problems relevant to both atmospheric <br\/>and oceanic sciences and include baroclinic wave packets, tropical <br\/>instability waves, and mesoscale (in the atmospheric sense) solitary <br\/>internal gravity waves. In addition, the PI will address computational <br\/>mathematics issues associated with some of the spectral and <br\/>spectral-element codes used in geophysical problems, particularly <br\/>the issues of filtering and compatibility conditions.","title":"Nonlinear Waves in the Ocean and Atmosphere and Numerical Algorithms","awardID":"9986368","effectiveDate":"2000-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1527","name":"LARGE-SCALE DYNAMIC METEOROLOG"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1610","name":"PHYSICAL OCEANOGRAPHY"}}],"PIcoPI":["472322"],"PO":["563981"]},"48871":{"abstract":"This project is on the design, analysis, and implementation of <br\/>algorithmic techniques for solving geometric problems that arise in <br\/>radiosurgery, radiation therapy, and other medical applications. <br\/>Radiosurgery is a minimally invasive surgical procedure that uses <br\/>a set of focused beams of radiation to destroy tumors. A key step <br\/>in radiotherapy and radiosurgery is to develop a treatment plan that <br\/>defines the best radiation beam arrangements and time settings to <br\/>destroy the target tumor without harming the surrounding healthy <br\/>tissues. At the core of radiation treatment planning is a set <br\/>of substantially non-trivial geometric optimization problems.<br\/>We seek to investigate a number of geometric optimization <br\/>problems arising in radiation treatment planning, such as beam <br\/>selection (including beam probing and its many variations), surgical <br\/>navigation and routing, sphere packing, beam shaping, image <br\/>segmentation, shape approximation, and beam source path planning.<br\/>This interdisciplinary research will draw diverse techniques from <br\/>computational geometry and other theoretical areas, such as operations <br\/>research and combinatorial optimization. Furthermore, this research <br\/>will provide a rich source of problems and new challenges that prod <br\/>further development of algorithmic techniques in these theoretical <br\/>areas. The planned research includes an important experimental <br\/>component. Educational activities on course development and student <br\/>training in the interdisciplinary area of computational medicine are <br\/>also part of the project.","title":"Geometric Problems in Radiosurgery, Radiation Therapy, and Other Medical Applications","awardID":"9988468","effectiveDate":"2000-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550624","518029"],"PO":["321058"]},"47672":{"abstract":"The goal of this research is the application of computer vision<br\/>techniques, in particular stereo vision techniques, to the domain of<br\/>image-based rendering (IBR) --- the problem of synthesizing novel<br\/>views of a scene based on existing images. The long-term goal is to<br\/>develop a system that builds an image-based scene representation from<br\/>a stream of input images, while actively selecting new viewpoints.<br\/>Specific topics of investigation will include: the development of new<br\/>performance measures for IBR methods; the development of new IBR<br\/>techniques based on stereo vision; the application of texture<br\/>synthesis techniques to occlusion issues; the utilization of visual<br\/>landmarks for calibration; and the development of on-line and off-line<br\/>algorithms for the selection of reference viewpoints.<br\/> Undergraduate students will be involved significantly in all<br\/>aspects of the research project, including implementation,<br\/>experimentation, authoring papers, and attending conferences. Other<br\/>students will benefit through the integration of current research<br\/>topics into the curriculum, and through use of the lab facilities<br\/>created in the context of the project. The PI's long-term educational<br\/>goals include developing non-traditional courses aimed at students not<br\/>ordinarily specializing in the sciences, and establishing contacts to<br\/>industry for a real-world perspective.","title":"CAREER: Image-Based Rendering using Stereo Vision","awardID":"9984485","effectiveDate":"2000-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["550972"],"PO":["317663"]},"47144":{"abstract":"People, governments, manufacturers, airlines, and others rely more and more on accurate and timely weather forecasting. An increased population, especially in areas prone to flooding or severe weather, requires pinpoint weather warnings and longer range predictions. This project will help operational weather forecasters in making decisions about severe weather situations by developing tools to visualize and analyze large data sets, including real-time weather observations. Staff of the National Severe Storm Lab also will participate, especially in the evaluation and testing of visual analysis and decision-support tools and in the insertion of those tools in operational software for forecasters and weather researchers. These tools will provide a framework for the future that can be used not only by weather forecasters but also by researchers. The weather prediction and warning capabilities built on the methods proposed here may ultimately result in many billions of dollars saved in lost products, equipment, and time. Lives, too, can be saved and injuries reduced.<br\/><br\/>Technically, the project will bring together, for the purposes of analysis and forecast decision-making, 3D time-dependent volumes from multiple overlapping Doppler radars, and simultaneous satellite information for the same and wider coverage areas. These will be combined with accurate terrain elevations, multiple image layers, maps, and other geospatial thematic data. This universal data collection will be organized for integrated visual analysis and made available for interactive navigation, exploration, and discovery by weather forecasters, researchers, and other users. These observational data will be displayed for the first time on accurate 3D terrain so that the correlation of landscape and weather can be revealed in detail, thus enabling new predictions of flood extents, inclusion of the effects of mountains on weather phenomena, and other new capabilities. To support fast, scalable visualization, a \"geo-layered volume\" will be introduced that will take advantage of the underlying terrain global quadtree organization and out-of-core paging structure. Hierarchical visual models will be developed within the geo-layered volume structure to produce several visual representation including volume rendering, isosurfaces, simple 3D time-dependent feature representations, and iconic annotations. A fast and scalable cluster-based feature analysis method will form a dynamic feature hierarchy also. This hierarchy will be used to produce levels of detail for the volume and isosurface visualization of the 3D time-dependent observational data. The visual analyses will be put in a decision-support framework. Since the analyses attach meaning and importance to the various observations, the observational data can be displayed in the right form for easy use. Important phenomena can be given visual forms that catch the eye, and more detail can be given to objects that the analysis says are important or to objects that the user looks at more closely.","title":"Integrating 3D Dynamic Meteorological Data and Algorithms into a Scalable Geospatial Framework","awardID":"9982299","effectiveDate":"2000-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"4200","name":"NAT CENTER FOR ATMOSPHERIC RES"}}],"PIcoPI":[120690,"439404",120692,"559125",120694],"PO":["551992"]},"48024":{"abstract":"EIA-9986010<br\/>Christoph Bregler<br\/>Stanford University<br\/><br\/>CISE Research Instrumentation: High-Speed Motion Acquisition<br\/><br\/>The Departments of Computer Science and Mechanical Engineering will purchase 2 high-speed multi-camera setups, a RAID videodisk, and 2 Pentium PC's and an animation software package. This equipment will be dedicated to the support of research in computer and information sciences and engineering. The equipment will be used for several research areas including, in particular, projects addressing:<br\/><br\/> Anterior Cruciate Ligament-Functional Biocmechanics<br\/> Human Motion Models for Tracking and Activity Interpretation<br\/> 3D Motion Acquisition for the Stanford Immersive Television Project<br\/> Animation of realistic and believable characters<br\/><br\/>The general thrust of these efforts is to develop high-quality acquisition and analysis techniques of human movements.","title":"CISE Research Instrumentation: High-Speed Motion Acquisition","awardID":"9986010","effectiveDate":"2000-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["483871","226146",122729,"513187","355388"],"PO":["557609"]},"49675":{"abstract":"In recent years, there has been a growing national awareness that the fast-paced development and deployment of information technology can transform society in paradoxical and\/or unintended ways. There is general agreement that more research is needed to identify, understand, anticipate, and address the scope and trajectory of these changes. One new and promising approach is to better understand how the design of information technologies can be linked to social outcomes. Instead of assuming that the design of information technologies is a simple engineering feat whereby value-neutral systems specifications are produced and then - given sufficient time, money and skilled labor - achieved in a particular artifact, the design process is better understood as one where various stakeholders can have conflicting goals and priorities and where trade-offs are constantly balanced. In addition, designers often have implicit (and sometimes incorrect) assumptions about users and how they will use a particular artifact. As a consequence, a variety of social values can come to be embodied in artifacts, resulting in both intended and unintended consequences. To begin to understand how this works in practice and how designers of IT can become more sensitive to their role in fostering certain outcomes, more interest in doing this kind of research needs to be generated. This proposed workshop on Value-Sensitive Design intends to: 1) further develop and refine a research agenda; and 2) stimulate research by cultivating a broad community of researchers. To insure that multiple perspectives and communities are represented, multi-disciplinary research \"teams\" (often faculty and graduate students) will be identified by the organizers and its steering committee and invited. Each of four broad knowledge areas will be included - designers, humanists, social scientists and technologists.","title":"Workshop on Value-Sensitive Design: Cultivating Research and Community","awardID":"0000567","effectiveDate":"2000-05-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["542095","440155"],"PO":["565227"]},"48487":{"abstract":"Based on the concept of Hocoka-the center of camp life, this project will develop a pilot-scale multimedia information database designed for distribution over Internet 2 formats. Illuminating a wide array of cultural convergence on the Northern Plains, the pilot project will develop a database featuring five demonstration entries: 1) American Indian Art of Oscar Howe; 2) The Wounded Knee Occupation (1973); 3) Pioneer Missionaries; 4) The Impact of Mining in Dakota land, and 5) Sacred Practices. Each of these entries is based upon visual images of museum artifacts, audio recordings from an extensive oral history collection, and textual material from special library collections. Participating in this project are several unique cultural resources that reside at the University of South Dakota: the Institute of American Indian Studies which houses the Oral History Center containing over 1,900 interviews of American Indians; the Oscar Howe Art Collection and Archives; the W. H. Over Museum; and the Herman P. Chilson Collection of Western Americana. Technical resources brought to bear on the project include the University of South Dakota Internet 2 project and the Center for Instructional Design and Delivery.","title":"SGER: Hocoka: From the Heart of the Nation to the Rim of the World","awardID":"9987412","effectiveDate":"2000-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["178169",124057],"PO":["433760"]},"47784":{"abstract":"Sensor development is an extremely costly and time-consuming process at the present time. Integrated sensors based on unique performance specifications and low volume needs are unavailable for robotics use despite the advancement in sensor technologies. The full potential of integrated sensors in robotics applications is not realized. The PI proposes to introduce an artificial hair cell, which is inspired by biological hair cell receptors, as a modular building block for a variety of sensors. The broad<br\/>objective is to establish a radical sensor architecture and a new approach for the efficient development of integrated sensors for robotics applications. Specific objectives of this research project are: (1) to establish the design principles, fabrication processes, and material expertise for individual hair cell sensors and to assess and optimize their mechanical characteristics; (2) to implement artificial hair cells in two<br\/>exemplary sensor systems - a gyroscopic and an artificial lateral-line<br\/>sensor for underwater robots. <br\/><br\/>Excellence in education will be vigorously pursued in the PI's career. During the period of this award, the PI plans to undertake fourinitiatives including (1) a new undergraduate\/graduate curriculum in the<br\/>area of micro electromechanical systems (MEMS); (2) a new MEMS class as an integral component of a joint Master of Engineering degree program to educate professionals; (3) an education outreach program that encourages high-school students to explore; (4) outreach activities. It is anticipated that these developments will significantly enrich and strengthen the educational programs in the University of Illinois and the community.","title":"CAREER: Biologically-Inspired Integrated Sensors for Robotics Applications","awardID":"9984954","effectiveDate":"2000-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["468846"],"PO":["335186"]},"48059":{"abstract":"In collaboration with the Dissertations Online project in Germany, this project will begin a joint effort to facilitate a distributed, multilingual digital library of doctoral theses and dissertations and promote the use of these materials to develop courseware and other knowledge resources for students, faculty and researchers. Of particular relevance is research regarding multilingual information retrieval, metadata, document markup (XML), natural language constructs, interoperability protocols, and multimedia capture and presentation. A goal of this research is to create an effective multilingual search system originally English\/German, but readily extensible to other languages, and suggest new means to create and test large-scale, federated, multilingual digital libraries.","title":"SGER: Core Research for the Networked University Digital Library (NUDL)","awardID":"9986089","effectiveDate":"2000-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["550462"],"PO":["433760"]},"50391":{"abstract":"EIA 00-02553<br\/>Mitchell, Helena<br\/>Clark Atlanta University <br\/><br\/>Special Project: Connecting Minority Educators by Enhancing Minority Participation in NECC 2000<br\/><br\/>This project supports the travel and registration of 115 K-16 educators<br\/>affiliated with selected Historically Black Colleges and Universities,<br\/>Minority and Minority Serving Institutions, to the National Educational<br\/>Computing Conference (NECC) to be held in June 2000 in Atlanta Georgia.<br\/>The NECC is one of the largest K-16 educational technology conferences that<br\/>attracts more than 8000 educators and 3000 exhibitor personnel. The<br\/>anticipated outcome of NECC attendance is the formation of a network of<br\/>educators in K-12 and higher education that would share ideas and knowledge<br\/>regarding the use of learning technologies in their classrooms. Through<br\/>coordinated, structured activities, this project will demonstrate increased<br\/>minority participation in NECC, increased use of technologies in targeted<br\/>K-16 schools, and increased benefits (e.g. panels, papers, programmatic<br\/>initiatives) from partnerships between K-12 schools and the selected higher<br\/>education institutions.","title":"Special Project: Connecting Minority Educators by Enhancing Minority Participation in NECC 2000","awardID":"0002553","effectiveDate":"2000-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["224406"],"PO":["329035"]},"43373":{"abstract":"This is the first-year funding of a three year continuing award. Research on recognition and generation of signed languages and the gestural component of spoken languages has been held back by the unavailability of large-scale linguistically annotated corpora of the kind that led to significant advances in the area of spoken language. A major obstacle to the production of such corpora has been the lack of computational tools to assist in efficient analysis and transcription of visual language data. In this project the PI and her team will develop the tools and techniques necessary to support efficient transcription of finely detailed phonological information and its integration with information provided by computational algorithms, so as to enable the creation of large-scale corpora annotated at the level of granularity essential for computer science research. Machine vision-based algorithms for semi-automation of several aspects of the transcription process will also be developed.<br\/><br\/>This research will result in the production and public dissemination of corpora that will include fine-grained linguistic annotations of ASL video data. The availability of these corpora and the refinement of computational tools for analyzing visual data will be invaluable for the linguistic study of signed languages and the gestural component of spoken languages. The corpora will be used in training computer models, thereby leading to advances in both recognition and generation of signed languages and gesture. The tools will have educational applications for the teaching of ASL and other signed languages. Ultimately, this research will have implications for human-computer interfaces, enabling users to interact with computers via sign language or via a combination of speech and gesture, and may also lead to alternate input mechanisms for disabled users as well as techniques for automatic recognition and classification of human actions.","title":"Essential Tools for Computational Research on Visual-Gestural Language","awardID":"9912573","effectiveDate":"2000-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["475203",109806,"472054"],"PO":["565227"]},"47576":{"abstract":"The performance of distributed information systems is becoming increasingly unpredictable. Past approaches to this problem either handle only a subset of root causes, or introduce new difficulties of their own. This project proposes fluid replication --- the automatic creation and placement of replicas in response to changing client demands and network capacities --- as a solution to this problem. These replicas are held on WayStations, which are infrastructural service nodes that can act as replica sites for both local and visiting users. The objective of this research is to construct four key mechanisms to enable fluid replication: an estimator for end-to-end network performance, a scalable scheme to locate WayStations, techniques for consistency management between WayStations and remote servers, and efficient client migration from one replica site to another. Prototypes of these mechanisms will be evaluated with standard workloads in both experimental and deployed networking testbeds. With these mechanisms, fluid replication promises to automatically match available resources to offered load. This reduces cost of administration, increases utilization of resources, and delivers improved performance to end-users.","title":"CAREER: Fluid Replication","awardID":"9984078","effectiveDate":"2000-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["530391"],"PO":["309350"]},"47059":{"abstract":"This project will extend the state of the art in evaluating optimization software. Beginning with a number of subclasses of continuous local optimization problems and progressing to global as well as suitable selected discrete optimization problems a careful evaluation and comparison of available implementations will be done. One essential part of this is the systematic collection and generation of test problems. Next, a group of programs will be chosen in each category and the issue of comparability, for example with respect to termination criteria, will be addressed. The results of applying codes to the test sets will be documented and published both on the web and in print. It is expected that this will lead, just as in the previous work, indirectly to an improvement of many of the programs by their authors. In addition, there will be direct improvements through the PI's experiences and suggestions. This work will complement related activities such as NEOS, netlib, etc. A second product of the proposed work is a guide in the form of a collection of webpages through which a prospective user of optimization methods is directly offered a concrete avenue, typically including appropriate software, to solve the problem at hand. Based on the success of the earlier work, the proposed research may be anticipated to have a substantial impact on both the production of high-quality software for modern architectures and the utilization of that software by the user community, both academic and non-academic.","title":"Performance Evaluation and Selection of Optimization Software","awardID":"9981984","effectiveDate":"2000-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["277357"],"PO":["551992"]},"47610":{"abstract":"Abstract:<br\/>---------<br\/>The demand for voice and data transmission over wireless channels is<br\/>increasing at a tremendous pace. Unfortunately, the characteristics of<br\/>the wireless channel (e.g., fading and interference) impose obstacles<br\/>for satisfying this demand. The single most effective technique to<br\/>accomplish reliable communication over a fading channel is ``diversity''<br\/>which attempts to provide the receiver with independently faded copies<br\/>of the transmitted signal. Channel coding may also be used to provide<br\/>(a form of time) diversity for immunization against the impairments<br\/>of the wireless channel. In addition, various diversity techniques may<br\/>be combined to further improve the system performance in a wireless<br\/>environment. Space-time coding which combines channel coding with space<br\/>diversity is a recent example of combining different diversity techniques<br\/>and has proven to be effective in providing high data rates over fading<br\/>channels. <br\/><br\/>This research involves development of new channel coding techniques<br\/>for the wireless link. In particular, coded modulation techniques for<br\/>multiple transmit and multiple receive antenna systems over block<br\/>fading channels are developed. A significant part of the research includes<br\/>development of turbo (based) coded modulation techniques as an alternative<br\/>to the current space-time codes. In addition, the investigators study the<br\/>use of multilevel codes and bit interleaved coded modulation schemes for<br\/>systems with antenna diversity. They conduct a theoretical performance<br\/>analysis of various coded modulation systems, develop code design<br\/>principles, and devise simpler and efficient decoding algorithms. In<br\/>addition, they consider practical issues including the evaluation of code<br\/>performance in the presence of interference.","title":"CAREER: Coding for Wireless Communications","awardID":"9984237","effectiveDate":"2000-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["486150"],"PO":["348215"]},"36567":{"abstract":"Over the past several years there has been an advent of a host of new programming methodologies and paradigms based on sophisticated features like concurrency and parallelism. These programming features and paradigms provide users with high levels of abstraction, enabling them to stay closer to the problem domains. Supporting these features causes a considerable increase in the interpretation\/compilation overhead, leading to complex and relatively slow implementations. Experience in the development and implementation of programming systems based on these new paradigms shows that one of the main sources of inefficiency is the repeated specialized searches that must be performed to realize the correct semantics at run-time. To limit inefficiency, existing languages and implementations restrict the expressiveness of the constructs.<br\/>The aim of this project is to study the search-related problems that arise in sequential and parallel implementation of advanced programming paradigms, with specific attention to logic programming and non-deterministic languages. The specific goals of this study are: (i) to abstract the key implementation aspects of these programming frameworks as problems of design and implementation of dynamic data structures;<br\/>(ii) to design efficient data structures for the resulting problems and analyze their complexity; and, (iii) to use the results from the complexity analysis to quantitatively evaluate the various implementation schemes described in the literature as well as to guide the design of efficient dynamic data structures and algorithms that will lead to optimal implementations.<br\/>Precise complexity measures of the solutions to these problems would allow system implementors to quantitatively compare different execution models, propose and develop optimal implementations, and talk about performance guarantees and system efficiency in a formal and mathematically precise fashion. These results would also be of importance to the users of these implementations, since they will allow them to understand the implementation-wise troublesome aspects of the language and to make better use of the capabilities that the language possesses. The results obtained in this research are expected to be directly applicable to the specific programming paradigms studied here. Furthermore, these results are expected to be transferable to other domains like constraint management and semantic networks, where efficient specialized tree and graph searches are key components of the execution models.","title":"Dynamic Data Structures in Advanced Programming Languages Implementation: Theory and Practice","awardID":"9820852","effectiveDate":"2000-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["490760","482838","561141"],"PO":["543507"]},"58600":{"abstract":"","title":"Improving the Cost-Effectiveness of WDM Optical Networks","awardID":"0096277","effectiveDate":"2000-05-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["562052"],"PO":["234222"]},"43245":{"abstract":"The vision of this proposed work is to create more versatile robots by using self-reconfiguration: hundreds of small modules will autonomously organize and reorganize as geometric structures to best fit the terrain on which the robot has to move, the shape the object the robot has to manipulate, or the sensing needs for the given task. To create flexible, robust, and autonomous robotic systems capable of such applications, a fundamental goal of this research is to develop a science-base for self-reconfiguring robotics. This is a considerable challenge, which we propose to meet through (1) new designs for reconfigurable systems and (2) new ideas on algorithmic planning and control that can confer autonomous reconfigurability. This kind of reconfigurable robotics science will greatly enhance the autonomous capabilities of distributed robot systems.<br\/><br\/>More specifically, the main goal for this proposed work is to develop a general algorithmic theory for self-reconfiguration, focused on (1) developing a theoretical basis for self-reconfiguration; (2)<br\/>developing centralized and distributed algorithms for self-reconfiguration planning; (3) developing locomotion algorithms that use self-reconfiguration and maintain the dynamic stability of the structure; and (4) developing applications of self-reconfiguration planning to self-repair. In addition, we plan to develop experiments to test these algorithms on a specific self-reconfiguring robot designed in our lab called The Crystal Robot. The experiments will be focused on general self-reconfiguration and its applications to<br\/>versatile locomotion and self-repair.","title":"Self-reconfiguration with Unit-Compressible Modules","awardID":"9912193","effectiveDate":"2000-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}}],"PIcoPI":["527733"],"PO":["234178"]},"47679":{"abstract":"CAREER: Codes on Graphs, Factor Graphs, and Iterative Algorithms<br\/><br\/>The primary focus of this research is the investigation of creative new<br\/>methods for reliable transmission of information in the context of modern<br\/>error-control techniques. Error-correcting codes are an essential part of<br\/>modern communication and storage systems and much of today's technology<br\/>would not be possible without them. This study is focused on graph-based,<br\/>iterative decoding algorithms, which, without doubt, are one of the most<br\/>significant coding-theoretic developments of the last decade. The goal of<br\/>the investigator's research is to develop a broad, analytical, and<br\/>constructive approach to research and education, unifying graphical<br\/>models, coding theory, and iterative algorithms. The interplay between<br\/>codes on graphs and other areas, like iterative graph-based algorithms,<br\/>system theory, and network information theory, is in the focus of this<br\/>investigation with the goal of discovering and utilizing fundamental<br\/>connections between these fields.<br\/><br\/>The central notion of this research is the framework of \"codes on graphs\"<br\/>and \"factor graphs\". Three main thrusts of research are present. The first<br\/>main thrust is directed towards the analysis and theoretical study of<br\/>iterative decoding algorithms in graphs with and without cycles. The main<br\/>tools for this research originate in recent successes in the analysis of<br\/>codes on graphs as the codelength approaches infinity, and in the notion of<br\/>pseudo-codewords for short codes on relatively simple graphs. Both<br\/>approaches are made viable by drawing heavily on the properties of the<br\/>underlying graph in the code construction.<br\/>The second main thrust involves problems arising from generalizations of<br\/>minimal realizations of codes on graphs. This work has important<br\/>ramifications to behavioral system theory, network information theory and<br\/>iterative decoding. The goal is to derive algorithms that achieve a<br\/>\"minimal\" realization of a code on a graph. A solution to this question is<br\/>closely related to important problems in network information theory and the<br\/>achievability of desired information flows in a given network topology.<br\/>The third objective of the investigator's study is aimed at jointly<br\/>optimized receiver functions in a graph-based iterative setup. Factor<br\/>graphs provide a natural and generic framework for the study of iterative,<br\/>belief propagation algorithms on graphical models. One of the most<br\/>exciting opportunities offered by the factor graph framework is the<br\/>possibility of incorporating a variety of different estimation tasks into<br\/>a joint optimization. The research focuses on opportunities to realize, in<br\/>jointly optimized subsystems, the gains that are essential for future<br\/>communication systems.","title":"CAREER: Codes on Graphs, Factor Graphs, and Iterative Algorithms","awardID":"9984515","effectiveDate":"2000-05-15","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["320975"],"PO":["564898"]},"46535":{"abstract":"This project entails the continued development and refinement of software suitable for the automated recognition and identification of individual dolphins from digital photographs of dolphin dorsal fins. The goal of the project will focus on improving the accuracy and reliability of the recognition process in existing computer vision software which provides an interface to a database of dolphin dorsal fin images. This project is part of the larger Digital Analysis of Whale Images on a Network (DARWIN) computer vision project at Eckerd College, an undergraduate institution. DARWIN currently provides a means for the storage and access of digital images of dolphin dorsal fins and associated observational data.","title":"DLI-2 Digital Analysis of Whale Images on a Network (DARWIN)","awardID":"9980031","effectiveDate":"2000-05-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["504532"],"PO":["433760"]},"54158":{"abstract":"PI: Errol L. Lloyd<br\/>Proposal Number: 0079454<br\/>Institution: University of Delaware<br\/>Title: Workshop Support: DIALM for Mobility<br\/><br\/><br\/>This award supports the 4th International Workshop on Discrete Algorithms and Methods for Mobile Computing and Communications (DIAL M for Mobility). This workshop is devoted for discrete algorithms and methods in the context of mobile and wireless computing and communications. The workshop is intended to serve as a forum for open discussions and lively debate, and to foster cooperation among practitioners and theoreticians.","title":"Workshop Support: DIALM for Mobility","awardID":"0079454","effectiveDate":"2000-05-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["528441"],"PO":["528421"]},"48625":{"abstract":"Information-based complexity (IBC) studies the complexity of solving problems for which only partial information is available. Many problems that IBC has successfully handled have been linear, i.e., the solution depends linearly on the input. However, many seemingly-linear problems have hidden nonlinearities. The Investigator proposes to study two such problems. The first is integration, which has several important nonlinear variants (such as Stieltjes and surface integrals); moreover, the integral depends nonlinearly on the domain of integration. The second is linear elliptic partial differential equations, for which there is a nonlinear dependence on the domain of definition and on the coefficients of the linear partial differential operator. Our goals include: determining the problem complexity, finding (nearly-) optimal algorithms), and determining whether adaptive information is better than nonadaptive information.","title":"Complexity of Problems with Hidden Nonlinearities","awardID":"9987858","effectiveDate":"2000-05-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[124456],"PO":["321058"]},"52553":{"abstract":"The research is concerned with techniques from statistical signal processing and information theory as they apply to communication systems with multiple goals. Such systems arise in multimedia communications networks like the Internet. The decomposition of data streams into different types is critical to finding information desired by a user among vast available sources, and it can also provide methods for displaying, rendering, printing, or playing the received signal that take advantage of its particular structure. Signal processing and coding theory have provided powerful mathematical models of information sources and algorithms by which these sources can be communicated and processed. Typically systems are designed as a collection of separate, unrelated, components. This can result in much less than optimal overall performance. Furthermore, it can hamper theoretical understanding of the fundamental limits on achievable performance.We treat the simultaneous design of mathematical models that account at once for information sources, data compression, and signal processing and apply to extracting information from the received data. Our emphasis is on image communication and processing. Because, the techniques draw heavily from demonstrably successful methods in speech coding and recognition they are natural for both signal types, individually or together.<br\/><br\/><br\/>The research involves a unified approach to data compression, statistical classification and regression, and density estimation. It is based on a novel combination of vector quantization, Gauss mixture models, measures of minimum discrimination information (relative entropy), and universal coding. Vector quantization provides both a theoretical framework and a method for implementation. Gauss mixture models are a flexible class by which to describe information sources. They can be fit to real data by clustering with respect to a minimum discrimination information measure of distortion. A primary objective is the development and application of conditional versions of rate-distortion extremal properties of Gaussian models in order to design robust algorithms for compression, classification, modeling, and combinations thereof. There are many open questions about relations among modeling, compression, and classification\/regression. Our goal is to provide answers to as many of them as possible and in so doing to contribute to understanding the interplay of modeling, signal processing, and coding. We describe optimized and implementable robust codes for compression and classification for a variety of information sources, especially for multimodal imagery. Part of our efforts are devoted to purely mathematical aspects of tree-structured regression, which is related to martingale theory and to the differentiation of integrals.","title":"Gauss Mixture Quantization for Image Compression and Segmentation","awardID":"0073050","effectiveDate":"2000-05-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["441541","215949"],"PO":["564898"]},"55600":{"abstract":"PI: James Crowley<br\/>Proposal Number: CCR-0085700<br\/><br\/>The Workshop on Challenges for Theoretical Computer Science will be held on Saturday, May 20, 2000 at<br\/>Portland State University during the Symposium on the Theory of Computing.<br\/><br\/>In this workshop, the participants will survey the many challenging directions open to theoretical computer<br\/>science at the beginning of the 21st Century. What are the areas in which theory can have, is having, might<br\/>have an impact? The Workshop will cover a full range of opportunities, from gaining new understanding of the<br\/>fundamental mechanisms and limitations of computing to impacting science, information technology, and<br\/>commerce. A report of the deliberations at the workshop will be prepared and distributed to the theoretical<br\/>computer science community and interested scientists and engineers.","title":"Workshop on Challenges in Theoretical Computer Science","awardID":"0085700","effectiveDate":"2000-05-15","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["563333"],"PO":["150516"]},"49628":{"abstract":"Computing the values of integrals is one of the fundamental problems of calculus and its applications; numerical integration solves this problem for complex functions that cannot be handled analytically. This project will significantly extend the ParInt 1.0 system for performing numerical integration developed under previous NSF support. It will add techniques that enable the system to handle integration problems with a variety of difficult characteristics (e.g. singularities, high dimensions, etc.). This includes the development of a hierarchical process structure for the computation of large collections of integrals (e.g. finite element problems), extrapolation techniques for singular problems, and Quasi-Monte Carlo techniques for solving problems of high dimensions (e.g. computational finance). Corresponding additions to the package's graphical interface will allow for easy use across research disciplines. In particular, visualization tools to help the user see why a problem is difficult (and suggest alternative formulations) and a server allowing users to submit integration problems remotely will be incorporated.","title":"Distributed Numerical Integration Algorithms and Application","awardID":"0000442","effectiveDate":"2000-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["279984","564591","490801"],"PO":["551992"]},"47725":{"abstract":"A two-pronged approach is proposed to add rigor to the current<br\/>state of software-engineering knowledge. The research component<br\/>focuses on the technical design of highly graphical interactive<br\/>systems, specifically the design decisions required to separate<br\/>a graphical user interface from an underlying computation.<br\/>Currently, the nature of design knowledge in this area is<br\/>heuristic and anecdotal. The research will clarify and extend<br\/>such knowledge to produce a deductive, synthetic theory of<br\/>composition in graphical interactive systems design.<br\/>Being synthetic, this theory creates new knowledge, specifically<br\/>the detailed modular design of separate, but composable,<br\/>user-interface and functional-core components. This knowledge<br\/>is synthesized from existing knowledge, specifically an<br\/>object-oriented model of the objects with which a user will<br\/>interact. Being deductive, this theory will be rigorous<br\/>and repeatable in sharp contrast with its technology-laden<br\/>predecessors. The theory exploits and generalizes prior<br\/>results in model-based user-interface generation and<br\/>hierarchical components. The education component exploits<br\/>and facilitates rigorous software-engineering knowledge to<br\/>enable precise measurement and improvement of learning in<br\/>undergraduate software-engineering courses. The<br\/>approach is founded on the use of cognitive objectives,<br\/>which have proved useful for course improvement<br\/>and curriculum design in other engineering disciplines.","title":"CAREER: The layering problem in graphical user-interface design","awardID":"9984727","effectiveDate":"2000-05-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["332348"],"PO":["564388"]},"47738":{"abstract":"The role played by magnetic storage systems is becoming increasingly important as computing systems accelerate their transformation from \"number-crunching\" devices to \"information appliances\". However, the technology has advanced so far that the inadequacies of the state-of-art are becoming apparent. The first of these is the lack of understanding of the science behind the architecture of a device that delivers optimal performance\/cost ratio. The second inadequacy is the lack of coordination of the various levels of hardware and software in a storage system. The third is that the file system designers have not yet recognized the emergence of the ubiquitous consumer devices as one of the network storage research issues. This research explores two critical questions: how to provide very low latency I\/O and how to manage ubiquitous network storage. Low latency is achieved by a combination of innovations in architecture of the devices themselves and exploiting the interactions between these devices, file systems, and applications. Ubiquitous storage management is achieved by leveraging the emergence of ubiquitous connectivity and a peer-to-peer architecture. By addressing the issues of performance and functionality of magnetic storage systems, the proposed research contributes to the science underlying a crucial backbone of the information infrastructure.","title":"CAREER: Low Latency I\/O and Ubiquitous Storage","awardID":"9984790","effectiveDate":"2000-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["218116"],"PO":["180163"]},"48839":{"abstract":"This project proposes the development of reduced models for large-scale<br\/>linear time invariant (LTI) systems of the form<br\/><br\/> dx\/dt = Ax + Bu, y = Cx<br\/><br\/>through low rank approximation of certain system Grammians. Complex systems <br\/>of this form arise in circuit simulation; they also arise through spatial <br\/>discretization of certain time dependent PDE control systems.<br\/><br\/>A new approach to model reduction will be studied, that will address some <br\/>fundamental difficulties with existing dimension reduction techniques. <br\/>These issues are central to the potential development of robust and widely <br\/>applicable software. We intend to develop a computational methodology that <br\/>will:<br\/><br\/>(1) Provide rigorous bounds on the response error of the reduced system; <br\/>(2) Naturally preserve fundamental system properties such as stability;<br\/>(3) Be fully automatic once a desired error tolerance is specified. <br\/><br\/>We propose to investigate subspace projection methods of Krylov and <br\/>non-Krylov type. Our primary goal will be to develop implicit restarting<br\/>methods that will iteratively produce low rank approximations to <br\/>controllability-, observability-, and cross-Grammians which are near best <br\/>approximations of reduced rank to the full Grammians.<br\/><br\/>The methods proposed will provide balanced partial realizations of large <br\/>state space systems. Our computational experience with model problems <br\/>indicates that the Hankel singular values of many systems decay extremely <br\/>rapidly. Hence very low rank approximations to the system Grammians are <br\/>possible and accurate low order reduced models will result. <br\/><br\/>We expect to find important applications in circuit simulation and in <br\/>the control of systems governed by partial differential equations,<br\/>particularly parabolic equations subject to boundary control. There is <br\/>great potential in such problems for extensive dimension reduction. This <br\/>will enable the design of real-time controllers for complex systems.","title":"Projection Methods for Balanced Model Reduction","awardID":"9988393","effectiveDate":"2000-05-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["551029","551030"],"PO":["321058"]},"52658":{"abstract":"Recently, there has been growing interest in the development of medical imaging modalities based on light, as opposed to more conventional modalities based on ultrasound, X-ray computed tomography (CT), or magnetic resonance (MRI). Imaging based on light has the advantages of being non-invasive, safe, and requiring only inexpensive instrumentation. Conventional wisdom holds that light can not pass through tissue, but in fact, near infra-red light does pass through tissue and can therefore, in principle, be used to form images of the interior of the tissue. However, light passing through tissue is highly scattered, so that an image can not be calculated using conventional methods. This research is concerned with the development of new computational algorithms that can be used to form three-dimensional images from measurements of scattered light. These methods, known collectively as optical diffusion tomography, have the potential to provide safe, inexpensive, and portable imaging instruments.<br\/><br\/><br\/>Practical realization of optical diffusion imaging requires that a difficult non-linear inverse problem be solved in a computationally tractable manner to yield accurate images. In this research, new multigrid optimization methods are developed which have the potential to dramatically speed reconstruction. These new methods are applied in a Bayesian framework and use novel techniques to model the regions containing voids, opaque tissue, or fluorescence imaging agents. Moreover, optical diffusion tomography is representative of a broader class of important inverse problems; so that the methods developed in this research have application in problems ranging from image registration and motion estimation to environmental sensing and non-destructive evaluation.","title":"Multigrid Optical Diffusion Tomography","awardID":"0073357","effectiveDate":"2000-05-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["518523",134270,"258813"],"PO":["564898"]},"43319":{"abstract":"For many years, the de-facto standard method for representing geometric shapes in a computer has been non-uniform rational B-splines (NURBS). However, NURBS have some well-known limitations. One of them is the surface intersection problem: if you intersect two NURBS surfaces, the result cannot be represented exactly as a trimmed NURBS surface for reasons that can be proven using algebraic geometry. This project will explore ways of converting NURBS surfaces into non-uniform Catmull-Clark surfaces (NURCC) without data-loss, and how to express the intersection of two NURCCs as a single NURCC. A second problem with NURBS is that they cannot seamlessly represent shapes with arbitrary topological complexity. This project will explore how to represent the union of two or more NURBS surfaces as a single continuous NURCC surface.","title":"Geometric Modelling Using Non-Uniform Catmull-Clark Surfaces","awardID":"9912411","effectiveDate":"2000-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[109667],"PO":["321058"]}}