{"184481":{"abstract":"This workshop will get leading researchers from the areas of coding theory, complexity theory and sparse approximation together in order to foster collaborations among these communities. Efficient and effective transmission, storage, and retrieval of information on a large-scale are among the core technical problems in the modern digital revolution. Even areas of science and technology that traditionally generated and analyzed small ``analog'' data sets, such as biology, now routinely handle much larger, discrete data with sophisticated algorithmic processing. The massive volume of data necessitates the quest for mathematical and algorithmic methods for efficiently describing, summarizing, synthesizing, and,increasingly more critical, deciding when and how to discard data before storing or transmitting it.<br\/><br\/>Such methods have been developed in two areas: coding theory, and sparse approximation (SA) (and its variants called compressive sensing (CS) and streaming algorithms). These areas provide techniques for handling large data sets that contain a small number of interesting or anomalous items. Coding theory is a well established field. On the other hand, while significant progress on the SA problem has been made, much of that progress is concentrated on the feasibility of the problems and certain algorithmic solutions. A systematic understanding of the computational complexity of SA problems is sorely lacking. The workshop organizers aim to develop a general computational theory of SA and CS (as well as related areas such as group testing). This goal can be achieved only by bringing together researchers from a variety of area including coding theory which has much to offer. <br\/><br\/>The workshop will bring the coding theory, complexity theory and sparse approximation communities together. The workshop will potentially lead to fundamental progress in all the three areas. The graduate students and postdocs in the respective fields will be significant beneficiaries. The small size of the workshop and the format of the lectures series will allow them not only to listen to these researchers but also to interact with them in a small setting. We have several tutorial talks planned in coding theory and sparse approximation. The talks will be video-taped and lecture material will be posted on the workshop website.","title":"Workshop on Coding Theory, Complexity Theory and Sparse Recovery","awardID":"1134643","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["507959"],"PO":["565251"]},"182062":{"abstract":"The International Conference for Supercomputing (ICS) brings together experts from diverse fields, including parallel application writers, libraries and tools developers, compiler developers, computer architects, and programming languages experts. The conference solicits papers on all aspects of research, development, and application of large-scale, high-performance experimental and commercial systems. In 2011 the conference will be held May 31 - June 4, 2011 in Tucson, Arizona.<br\/>It is proposed to offer up to 10 NSF-sponsored student travel and junior faculty (without travel support) grants for a total budget of $10,000. Applications will be solicited via email mailing lists, personal contacts, and the conference web site. The selection process will consider the applicant?s level of participation in ICS, followed by how closely the student?s research interests match areas covered by ICS.","title":"Student Travel Support for the 25th International Conference on Supercomputing","awardID":"1120528","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[487796],"PO":["565272"]},"184042":{"abstract":"Ongoing technological revolutions continually bring forth new research challenges and myriad research communities within Computer Science usually respond to them on their own. It has been generally recognized that we need tighter collaboration across these communities: researchers from different communities working jointly \"in the field,\" constantly informing each other, inventing in their respective areas in response to their experience in the field, and forging systems and solutions that are simultaneously validated by both algorithmic and systems communities. Such an experience will produce algorithms that are practical as well as powerful, and systems and applications that are efficient and effective, without working to make independent research threads meet ex post. We believe that the time is appropriate for \"Algorithms in the Field.\" We propose to initiate discussions and collaborations on understanding the challenges and promises of algorithmic foundations in various CS fields, and further establish the vision of algorithmic foundations forged in these fields in practice. The development of successful examples will increase awareness that collaborations across the subdisciplines should be customary, and not exceptional. The main goal of the workshop is to provide a working vision for such examples of Algorithms in the Field, and a prioritization of near term goals and directions for scientific investigation.","title":"Workshop on Foundations of Algorithms in the Field","awardID":"1131447","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["507886"],"PO":["562944"]},"178234":{"abstract":"This project will explore some technical problems in the area of \"crowdfunding:\" inducing members of the public to contribute small amounts of money at a time to fund projects. Crowdfunding web sites are an instance of a commonly studied problem called a \"matching marketplace:\" a central place where two types of people come to be matched according to some criteria. Other examples of this are job websites, where employers and employees come to be matched (find jobs), and online dating sites. Crowdfunding exhibits a \"complementarity:\" a project cannot start until enough people donate money. One person's donation is not enough to support a project, but if a person waits for others to donate first, valuable projects may be left unfunded. Many real-world matching marketplaces involve complementarities, including couples finding jobs together and a project manager trying to put together a team that works well together.<br\/><br\/>This project brings together ideas from both computer science and economics. Both disciplines study matching problems, but neither has found a completely satisfactory solution in the presence of complementarities. In economics, the most common solution is a \"deferred acceptance\" mechanism, which breaks down when dealing with complementarities. Computer scientists frequently use \"recommender systems\" that make recommendations to people to help improve matches. But it isn't even clear what should be recommended when there are complementarities. This research will develop an understanding of the role of complementarities in both of these types of solutions, and apply insights across fields to design better methods of matching.<br\/><br\/>The project will test these ideas in the real world by developing a crowdfunding system. This system will provide a test bed for new algorithms and mechanisms. It will also support a vibrant community of students by helping them to fund small creative projects that develop important skills. Crowdfunding is increasingly being applied to fund high-quality professional journalism (on sites such as Spot.Us), and improved crowdfunding systems have the potential to be a new funding source for this struggling industry. This research project will also train both undergraduate and graduate students in the conduct of interdisciplinary research.","title":"ICES: Small: Socio-Technical Design of Crowdfunding Websites","awardID":"1101266","effectiveDate":"2011-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":["562836"],"PO":["565251"]},"185473":{"abstract":"CAREER: A Networking Approach to Host-based Intrusion Detection<br\/>Proposal# 0844144<br\/>Raheem A. Beyah<br\/>Georgia State University<br\/><br\/>Award Abstract<br\/>Day by day, threats to the cyber infrastructure are becoming more complex and, in response, so too are defense mechanisms. One approach to securing nodes is to place a defense mechanism (e.g., intrusion detection system) on the node. This brings many challenges, with the most significant being that potential vulnerabilities in the defense mechanism can provide an additional avenue through which the host can be compromised. To address these challenges, this research investigates completely decoupling the defense mechanisms from the host, while continuing to provide insight about malicious activity as if the defense mechanisms resided on the host. This requires the development of new algorithms and the application of various techniques (e.g., statistical, machine learning, signal processing) to extract from a node?s network traffic characteristics that enable the inference of the state of its hardware components. Over the course of this project, a combination of experimentation and simulation will lead to the development of empirical and analytic models. The models will be used to develop network-based defense systems that provide capabilities similar to those provided by mechanisms traditionally considered host-based. This work leverages the concept of information leakage to bridge the computer architecture, computer networking, and network security fields. This project also seeks to broaden participation of groups traditionally underrepresented in the areas of science, technology, engineering, and mathematics (STEM). Accordingly, through a summer academy, the PI is actively engaging underrepresented middle school students by using current technology to convey abstract computer architecture and computer networking concepts.","title":"CAREER: A Networking Approach to Host-based Intrusion Detection","awardID":"1140230","effectiveDate":"2011-05-25","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["560166"],"PO":["565327"]},"174121":{"abstract":"Transformative research is needed to realize qualitative improvements in the modeling of climate. The investigators are carrying out an interdisciplinary program of direct statistical approaches to climate modeling that has the potential to dramatically improve our understanding of how different climate processes interact over short and long time scales and small and large spatial scales. The program lays the foundations for a new class of climate models that may complement or even eventually replace existing climate models. It has two parallel tracks. First, the investigators are developing methods for the direct computation of climate statistics that may eventually replace conventional numerical simulations, leading to computationally more efficient climate models. Second, they are developing improved representations of low clouds and an improved understanding of cloud interactions with large-scale circulations, leading to more accurate climate models and reducing the currently large uncertainties in the representation of clouds in them. <br\/><br\/>The methods for the direct computation of climate statistics are based upon cumulant expansions in which fast modes are integrated out. This refocuses attention on the evaluation and understanding of low-frequency modes, which dominate climate variability. Improved representations of low clouds are developed based on probabilistic closures of cloud and subgrid-scale dynamics, which can be systematically improved in accuracy. These are integrated into a general circulation model (GCM) that couples the clouds to the large-scale flows, allowing a systematic study of their interactions. The work extends past work on the direct computation of statistics in relatively simple models of geophysical flows to GCMs of increasing complexity and realism, while improving the accuracy of the statistical methods and of the GCMs themselves.","title":"Collaborative Research: Type 1 -- LOI02170139: Direct Statistical Approaches to Large-Scale Dynamics, Low Cloud Dynamics, and their Interaction","awardID":"1048575","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7552","name":"COFFES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8012","name":"CR, Earth System Models"}}],"PIcoPI":["481598"],"PO":["564898"]},"185022":{"abstract":"This grant supports American students and researchers to participate in the USA-Sino Summer School in Vision, Learning, and Pattern Recognition. The event brings together a high-quality team of leading American and Chinese researchers in computer vision and multimedia to offer a one-week educational and cultural exchange program to students and junior scholars from both US and China. The summer school provides a venue for the participants to explore a variety of aspects and applications on how to address the challenges in large-scale visual data\/media acquisition, processing\/computing, understanding, and search. The international interactions can foster new understanding and new collaborations in science, education, and culture.","title":"3rd USA-Sino Summer School in Vision, Learning, Pattern Recognition, VLPR 2011","awardID":"1137687","effectiveDate":"2011-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[496425],"PO":["564316"]},"177311":{"abstract":"This project centers on the design of technologies than can help teachers and students to effectively enact the kinds of complex, challenging instructional designs that characterize modern science pedagogy. While considerable effort has gone into the development of technologies to support learners who are seated at computers, this project will address the largely unexplored domain of embodied, whole-class science inquiry activities that are largely unmediated by traditional one-to-one technologies. The project focuses on \"embedded phenomena\" instructional units in which elementary school students conduct investigations of persistent, room-sized simulated phenomena over multi-week periods. Through a series of iterative design studies, the project will build and evaluate technology-based supports for teachers and students addressing three critical goals: (a) improving students' abilities to conduct accurate and reliable scientific investigations, (b) ensuring the regular and meaningful participation of all classroom students in collaborative investigations, and (c) helping students to effectively integrate, manipulate, and represent the results of their collective scientific work. The new technologies developed in the project will serve as foundational building blocks for a flexible, sustainable learning technology infrastructure supporting ambitious STEM instruction.<br\/><br\/>Broader impacts: The project will help students and teachers, particularly in the elementary and middle school grades, to overcome barriers to engaging in innovative but complex pedagogical forms that have the potential to transform science education. It will promote high-fidelity enactment of science practices, help to ensure that opportunities for participation are distributed throughout classes of students, and inform the design of new pedagogical approaches. The tangible products of the project-including new technologies, new instructional units, and evaluations of their effectiveness in supporting STEM learning-will be made broadly available to teachers, learning researchers, and technology developers.","title":"HCC: Medium: New Technology Supports for Learning in Embodied Science Inquiry Contexts","awardID":"1065275","effectiveDate":"2011-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["552899","552897"],"PO":["565342"]},"178323":{"abstract":"Computational mechanism design (CMD) seeks to understand how to promote desirable outcomes in multi-agent systems, despite private information, self-interest and limited computational resources. CMD finds application in many settings; e.g., in the public sector for wireless spectrum and airport landing rights, in Internet advertising, in expressive sourcing in the supply chain, in allocating resources in computational systems. A key concept is strategyproofness: the mechanism's outcome should be robust against manipulations through misreports of private information held by participants.<br\/><br\/>In meeting the demands for CMD in these rich domains, we often need to bridge from the theory of economic mechanism design to the practice of deployable, computational mechanisms. The broad goal of this project is to leverage scalable, heuristic optimization algorithms, making them applicable in settings with self-interest. Rather than seeking provably optimal but possibly inapplicable mechanisms (either without complexity considerations, as in economic theory, or with worst-case complexity considerations, as is commonplace in theoretical computer science), we propose a new computational agenda.<br\/><br\/>Provable guarantees are often unavailable when search algorithms are applied to real-world optimization problems. Still, heuristic search algorithms are widely employed, and find good empirical success. We seek something analogous to this for settings in which inputs are distributed to participants, each self-interested and willing to misreport inputs in order to improve the outcome in their favor. Rather than looking for optimal mechanisms amongst the class of polynomial-time algorithms, we seek to employ search algorithms with excellent empirical performance despite worst-case exponential run-time (if run-to-completion.)<br\/><br\/>Specific topics of interest include: (a) automatic self-correction, to apply online sensitivity analysis to automatically correct the outcome of an algorithm, allowing the algorithm to be coupled with payments and made strategyproof; (b) metrics for approximate strategyproofness, to enable design without solving for equilibrium; and (c) automatic generation of payment rules through the use of machine learning, by imposing appropriate structure on the hypothesis space.<br\/><br\/>Successful progress will provide new and fundamental methodologies with which to develop incentive-aligned mechanisms (e.g., for resource and task allocation) that enjoy excellent empirical properties and are able to scale to real-world domains. The theory of mechanism design has already provided broad societal impact, in enabling the auctioning of public resources such as wireless spectrum and power generation capacity, and in driving revenue to internet businesses by enabling efficient advertising. A new framework for heuristic mechanism design will enable a new generation of mechanisms for large-scale coordination and resource allocation amongst people, firms and organizations, with the promise of broad applications to electronic commerce (including mobile commerce), cloud computing, and across the supply chain.","title":"ICES: Small: Heuristic Mechanism Design","awardID":"1101570","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":["541779"],"PO":["565251"]},"184560":{"abstract":"CISE\/CNS\/CSR PEC 7354 Org Code 05050000 $25,000 <br\/>There is an urgent need for curricular guidance on parallel and distributed computing (PDC) due to rapid technological changes and mass marketing of multicores and general-purpose graphics processing units. Educators struggle to decide the right balance between theory and practice, and to choose from the diverse set of models of computation, languages, software and hardware platforms, and tools. <br\/><br\/>The working group that has participants from various institutions has deliberated upon various topics and subtopics, and released a preliminary version of the curriculum in December 2010. A competition for granting Early Adopters status was held in Spring-11. The proposing instructors will be employing and evaluating the proposed curriculum in their courses. The primary task ahead is to organize a follow-up curriculum workshop (EduPar-11 at IPDPS) to bring together early adopters and other experts, collect feedback from the early adopters and the community, revise the preliminary version of the curriculum, and hold a second round of competition for Fall-11 for early adopter status.","title":"A Curriculum Initiative on Parallel and Distributed Computing - Workshop on Parallel and Distributed Computing Education (EduPar-11) and Early Adopter Program","awardID":"1135124","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["526127"],"PO":["565251"]},"184595":{"abstract":"With hundreds of millions of users worldwide, social networks provide incredible opportunities for social<br\/>interactions, entertainment, learning, and political and social change. Hence, there is a growing interest in understanding information diffusion over online social networks. Because many social interactions currently take place in online networks, social scientists have access to unprecedented amounts of information about social interaction. Prior to the advent of such online networks, these investigations required resource-intensive activities such as random trials, surveys, and manual data collection to gather even small data sets. Now, massive amounts of information about social networks and social interactions are recorded. This wealth of data can allow social scientists to study social interactions on a scale and at a level of detail that has never before been possible. However, Social scientists are not traditionally trained in techniques to deal with the massive amounts of data produced by online social networks. Computer scientists that specialize in databases and knowledge discovery have experience with querying and analyzing enormous amounts of data in a scalable fashion, but they may not be aware of the types of information that are most relevant to understanding social processes. Moreover, it is often necessary to alter theories and models developed in research of traditional social networks to incorporate new features of interactions in online networks, or even develop entirely new models of social processes. To create and validate these new models requires familiarity with social science techniques for modeling of social interactions, as well as knowledge of techniques for modeling and analysis of complex networks that can scale to the size of millions or even billions of users.<br\/><br\/>The project brings together an interdisciplinary team consisting of computer scientists with expertise in databases and data mining, network modeling and analysis, and social media led by Dr. Divyakant Agrawal at the University of California-Santa Barbara to develop computational approaches to model and predict a number of important phenomena in social networks: information diffusion, opinion formation, etc. The team is developing new algorithms and analytical and computational tools that can effectively cope with the massive size of social networks and the data produced within such networks. These tools are being designed account for the complex nature of human behavior by incorporating the spatial, temporal, and relationship-based aspects of social interactions. The long-term goals of this project are to develop tools that help better understand social interactions in online networks, to develop reliable and scalable models to predict the outcomes of such social processes, and to create applications that can shape such outcomes. The project advances the current state of the art in: Querying and analysis of massive datasets, Modeling and analysis of complex networks, and Analysis of social media and social interactions, including in particular, the interplay between multiple simultaneous information diffusion processes. This is a high-risk, potentially high payoff research effort due in part to the challenges associated with obtaining and analyzing data from social networks and social media. In order to model social network entities and interactions, the research team needs access to datasets from online social networks to build, verify and validate models. Similarly, discovering information, knowledge, and user behavior in online social networks require access to social network datasets. In general, acquiring such datasets is a significant challenge due to privacy issues and the proprietary nature of many social network sites. <br\/><br\/>This Early Concept Grant for Exploratory Research (EAGER) project provides a rich set of data repository and evaluation metrics for conducting large-scale investigations involving social networks and social media. The project addresses the data challenge by assembling large data sets from weblog postings and Twitter messages from millions of users, as well as appropriately anonymized data that capture the interactions between participants in social networks such as Facebook. The broad dissemination of the resulting datasets and tools will lower the barrier to (and reduce the risk associated with) entry into Social Informatics and Computational Social Sciences for researchers with diverse backgrounds and expertise. The resulting datasets and tools are likely to stimulate fundamental advances in several subdisciplines within Computer Science including algorithm design, network modeling and analysis, and data mining and knowledge discovery (among others). The project provides unique opportunities for broadening the participation of underrepresented minorities and women in Computer and Information Sciences, and especially those motivated by real-world applications in soc","title":"NSF EAGER: Data-Driven Framework for Analyzing User Interactions in Social Media","awardID":"1135389","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[495030,"500153","560612","536696",495034],"PO":["565136"]},"175377":{"abstract":"CAREER: Interactive Physically Based Animation and Optimal Control Using Model Reduction<br\/><br\/>Jernej Barbic, Computer Science Department, University of Southern California<br\/><br\/>Abstract<br\/><br\/>Many dynamical systems in nature are reasonably well-understood in terms of their underlying equations, but are very slow to simulate with detailed models. For example, the Finite Element Method (FEM) has been used extensively to simulate human tissue, automobile and airplane mechanical components, architectural structures, or characters in a computer game. Real-world systems are, however, very complex, which normally requires large computer processing power for their simulation, control and optimization. This research investigates systematic approaches to approximate complex physics with simple, yet mathematically principled models. The resulting fast simulation and control can make medical training more immersive, computer games more entertaining, and CAD\/CAM faster and more reliable. More generally, this work applies to any system governed by differential equations, with broader applications in robotics, aeronautics, and defense systems. In addition to developing new publicly available coursework material, educational activities include releasing a large C++ computer graphics\/animation codebase to the world under an open source license, and visits to high schools in under-deserved areas of Los Angeles where students are exposed to the benefits of careers in science and engineering.<br\/><br\/>The investigators tackle material and geometric complexity using model reduction, an approach where full equations of motion are approximated by a projection to a properly selected low-dimensional space. While model reduction of nonlinear systems has been previously employed in computer graphics and other disciplines, the existing algorithms often lack flexibility, are not adaptive in space or time, and can only provide smooth, low-dimensional output, even if the unreduced output is known to be complex. The investigators study how to overcome these limitations, using techniques from Lagrange mechanics, multi-resolution analysis and nonlinear optimization. The ultimate goal is to accelerate physics to the point where fusion of physics and design becomes possible for large, complex systems of computer graphics and engineering practice.","title":"CAREER: Interactive Physically Based Animation and Optimal Control Using Model Reduction","awardID":"1055035","effectiveDate":"2011-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[470246],"PO":["565227"]},"177303":{"abstract":"The research goal of this grant is to provide a scientific foundation for the economic implications of software modularization activities during software development and maintenance. A difficult question during software development is when to perform software code refactoring to restructure the code to achieve better modularity for the purpose of improving reducing complexity, improving code readability, and achieving other, so-called nonfunctional properties. The costs of modularization activities such as refactoring is significant and immediate, and the benefits are largely invisible, intangible, and long-term. However, delaying refactoring causes modularity decay, which is blamed for significantly reduced productivity, operational failures and even canceled projects. Knowing when to refactor is a long-standing, important and difficult question. This research will conduct extensive empirical studies to establish quantitative relationships between software project parameters and software modularity decisions. Based on the empirical data, the project will develop modularity violation detection techniques to locate modularity debts and evaluate a proposed modularization activity by combining Monte Carlo simulation based on Datar-Mathews option valuation method. These scientific foundations for economic decision-making will lead to a better understanding of the costs and benefits of modularization activities, with a goal of providing tools that will better support such decisions. The research will be performed by an interdisciplinary team of researchers with expertise in software engineering and economics.","title":"SHF: Medium: Collaborative Research: An Economics-Based Framework for Assessing Software Modularization Decisions","awardID":"1065242","effectiveDate":"2011-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["497764"],"PO":["564388"]},"177336":{"abstract":"Millions of users are accessing a portion of billions of Web pages and other content on the Internet on a daily basis. While the networking research community and the public in general are well-aware of the net neutrality problem, i.e., how to develop regulatory policies and auditing mechanisms to prevent Internet Service Providers from discriminating against various applications, very little effort is invested in enabling content neutrality. In particular, it is not a secret that almost every browsing click we make is collected by either Web- or ISP-based 'information collectors and aggregators', and that our profiles are used for online advertising. Still, no public auditing mechanisms, capable of detecting and informing end users about such practices, exist in this emerging area. Take search engines as another example. How does one know that information available on these services is not biased (or will become biased in the future) for commercial, political, or any other reason? More generally, no public auditing systems are capable of monitoring the scope and effectiveness of advertising or spam campaigns on the Internet. The PIs argue that all these questions fundamentally affect fairness at all levels, information credibility, and user privacy, all of which have significant relevance for the future development of the Internet and beyond.<br\/><br\/>The PIs will build a set of methodologies and tools unified in a system capable of (i) enabling auditing mechanisms for the Web advertising domain, (ii) monitoring search engines? services and revealing their neutrality, and (iii) independently determining a Web site's popularity and checking for the truthfulness of advertised popularity. Further, the PIs plan to deploy the developed system on the PlanetLab wide area network testbed to perform long term monitoring of content neutrality in the Internet.<br\/><br\/>Broader Impact: By informing the public of how online advertisers and search engines behave, the auditing system will enable fair competition and preclude monopolies, oligopolies, or collusions, eventually helping to improve online information credibility and user privacy. Even if no bias nor privacy-violating practices were to exist in today's Internet (unfortunately, the PI's preliminary results show that this is not the case), the auditing system and methodologies will always be a barrier for anyone who would believe that applying such approaches might be done without public knowledge and repercussions. By exposing biased content behavior, the auditing system will be capable of revealing discriminating acts that can happen for commercial, social, political, religious, or any other reason, ultimately facilitating the development of free and open society. The PIs will design and disseminate easy-to-use browser extensions and plug-ins that will be capable of assisting end users in detecting content neutrality violations. Education is an integral part of this award. The insights and tools derived from this project will be integrated into the current undergraduate and graduate curricula.","title":"NetSE: Medium: Collaborative Research: Auditing Internet Content for Credibility, Fairness, and Privacy","awardID":"1065456","effectiveDate":"2011-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["550994"],"PO":["565090"]},"181692":{"abstract":"This is funding to support a Doctoral Consortium (workshop) of approximately 8 promising graduate students from the United States and abroad, along with a panel of about 5 distinguished research faculty mentors. The event will take place in conjunction with the 7th International ACM Symposium on Wikis and Open Collaboration (Wikisym 2011), which will be held October 3-5 2011.in Palo Alto, CA. Wikisym is the leading international forum for bringing together researchers, practitioners, and entrepreneurs working on open collaboration. The topic of open collaboration is the study of the forms of collaboration found in open source software and communities such as Wikipedia, Yahoo! Answers, Slashdot,and Digg. Such systems have shown the power to be gained from creating technologies that enable large distributed groups of people to collaboratively create artifacts of lasting value. The Wikisym conference is attended each year by approximately 100 people from around the world. Its proceedings are published in the ACM Digital library and are considered archival work in the field.<br\/><br\/>The Doctoral Consortium is a research-focused meeting of a group of 8-15 selected Ph.D. candidates and a panel of four distinguished research faculty that takes place at the Wikisym conference. The Doctoral Consortium will take place on October 2nd, preceding the event. The Doctoral Consortium Chair is Loren Terveen (University of Minnesota, USA). The WikiSym Doctoral Consortium has been successful for the past three years in attracting an international and interdisciplinary student constituency. It helps new researchers develop peer relationships and relationships with experienced researchers and practitioners. It also offers these new researchers expert feedback and allows them to attend and participate in the leading international conference focused on open collaboration.<br\/><br\/>Broader impacts: The annual Wikisym doctoral consortia traditionally bring together the best of the next generation of researchers in open collaboration, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Applications are encouraged from all doctoral students whose research is Wikisym-related, regardless of the fields in which they are earning their degrees. Participation is encouraged from a broad range of relevant disciplines and approaches, including (but not limited to) computer science, sociology, psychology, anthropology, information science, cognitive science, rhetoric, communications, and economics. While NSF funds will be used chiefly to support participation by students enrolled in graduate programs in the United States, some international participants may be supported as well in recognition of the fact that the Wikisym field embraces educational and cultural traditions that vary in different parts of the world. The organizers will try explicitly to identify and include the broadest possible group of highly qualified participants. As a consequence of these steps, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field.","title":"Wikisym Doctoral Consortium","awardID":"1118379","effectiveDate":"2011-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["518491"],"PO":["565342"]},"184981":{"abstract":"The 8th Association for Computer Machinery (ACM) Creativity & Cognition Conference (C&C 2011), to be held November 3-6, 2011 at the Georgia Institute of Technology, will convene a diverse group of researchers working in the areas of creativity, cognition, and computational thinking. As information technology is increasingly prevalent in creative thinking and problem solving activities, there is a growing need to study and understand creativity and computing through synergistic cross-disciplinary methods and models to advance computer science and information technology, cognitive science, engineering, design, the arts and education. The ACM C&C 2011 conference theme is Creativity and Technology: to understand human creativity in its many manifestations, to design new interactive techniques and tools to augment and amplify human creativity, and to use computational media technologies to explore new creative processes and artifacts in all human endeavors.<br\/><br\/>Mentoring and involving young scholars is the key to seed and encourage interests and interactions across diverse disciplinary boundaries in the field of creativity and cognition. The C&C 2011 Graduate Student Symposium is a full-day event for a group of twelve young scholars, in the areas of study that contribute to understanding creativity and cognition. The symposium is a forum to discuss and receive feedback and guidance from a panel of senior researchers and practitioners in a supportive setting. The recruitment of a diverse set of student participants is critical to broadening the participation and research perspectives discussed during the symposium. To attain this goal student eligibility for the symposium includes promising senior-level undergraduates. The symposium leaders have also put into place a proactive plan to recruit participants from minority-serving and undergraduate institutions. Graduate Student Symposium papers are included in the conference proceedings to integrate their research into the larger canon of research presented at the conference.","title":"Workshop: Graduate Student Symposium at ACM Creativity & Cognition (C&C 2011) Conference","awardID":"1137527","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[496304],"PO":["565227"]},"178536":{"abstract":"The IEEE INFOCOM Conference on Computer Communications will be held in Shanghai, China from April 10 to April 15, 2011. This flagship technical conference is a premier venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners in the field. Attending conferences such as INFOCOM is of great importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field. This proposal requests funds to support approximately fourteen graduate students in the United States to attend this premier conference. Women and under-represented minorities will be encouraged to attend.<br\/><br\/>Intellectual Merit: The intellectual merit of the proposal resides in encouraging and supporting graduate student attendance to INFOCOM 2011. This will continue the tradition of the previous INFOCOM conferences as a premier venue for bringing together academia, industry, and government to share newest developments in communications. Besides technical paper presentations, the conference offers a wide range of technical activities including workshops and work-in-progress sessions. Its rich program exposes participants to new ideas and cutting-edge research and allows for interaction between researchers from all over the world.<br\/><br\/>Broader Impact: This project integrates research and education of graduate students through exposure to a premier technical meeting in computer networks and communications. Students will have the opportunity to attend high-quality presentations and interact with senior researchers as well as peers in the field. The proposed student participation is expected to have a positive impact on the students' research interests and quality. The project will also promote diversity by encouraging and enabling women and other under-represented minorities to participate. Furthermore, the truly international flavor of INFOCOM is well-known and reflected in the composition of the Technical Program Committee (TPC) as well as in the authors of the submitted and accepted papers. As such, it cultivates international research interactions and presents a real opportunity to students to increase their breadth of ideas, research approaches, and technical perspectives.","title":"Student Travel Support for IEEE INFOCOM'2011; Shanghai, China","awardID":"1102556","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[478666],"PO":["565090"]},"184544":{"abstract":"This is funding to support a workshop for 20 promising graduate students from the United States whose research covers aspects of Technology-Mediated Social Participation (TMSP). Technology-mediated social participation is generated when social networking tools, blogs and microblogs, user-generated content sites, discussion groups, problem reporting, recommendation systems, and other social media are applied to national priorities such as health, energy, education, disaster response, environmental protection, business innovation, or community safety. Although social media are transforming society, many universities have been slow to integrate these novel technologies and social structures into their curricula and research. Two previous NSF-supported TMSP Workshops have outlined an agenda for research and education in this area, which was published in a serious of journal articles appearing in a special issue of IEEE Computer. To increase research and education in TMSP, this workshop brings together an interdisciplinary group of graduate students to listen to presentations by leaders in the field, learn new research skills, and learn from each other by sharing the diverse research streams that focus on social media.<br\/><br\/>The TMSP \"webshop\" will include 20 graduate students from such fields as sociology, anthropology, communications, psychology, journalism and humanities as well as from information studies, information systems, human-computer interaction and computer science. Effort will be taken to ensure gender balance, strong representation from ethnic minority groups, and cross-disciplinarity. Students will apply by submitting a one page statement of why they wish to attend the workshop along with their curriculum vitae. During the three-day workshop, students will attend presentations from an interdisciplinary group of distinguished leaders in the field and engage in other research and community-building activities. <br\/><br\/>Intellectual Merit: There is a growing recognition that social media technologies can bring profound benefits for national priorities such as disaster response, community safety, health\/wellness, energy sustainability, and environmental protection. However substantial research is needed to scale up participation, raise motivation, control malicious attacks, limit misguided rumors, and protect privacy. The TMSP workshop will foster new ideas, tools and theories in this area through intense multidisciplinary discussion. Topics to be covered share (1) a close linkage to compelling national priorities; (2) a scientific foundation based on established theories and well-defined research questions (privacy, reciprocity, trust, motivation, recognition, etc.); and (3) computer science research challenges (security, privacy protection, scalability, visualization, end-user development, distributed data handling, network analysis of community evolution, cross network comparison, etc.). <br\/><br\/>Broader impacts: The workshop will raise awareness of the importance of technology-mediated social participation as a distinct area of study, foster new interdisciplinary projects, raise the prominence of researchers and educators who are invited to speak, and promote greater understanding of the discipline among leading graduate students across the United States. The workshop will also help new researchers develop relationships with peers and experienced researchers and practitioners. Specific outcomes will include resources such as bibliographies, links to websites, video and slides sets from speakers and carefully crafted lists of courses, conferences, and journals. These resources will be helpful to researchers and educators who seek to expand their work in Technology-Mediated Social Participation.","title":"Webshop 3.0: Technology-Mediated Social Participation","awardID":"1135022","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["561428","560696","527290","527291","527292"],"PO":["550147"]},"184797":{"abstract":"This project is to hold a two-day workshop in Arlington, Virginia on May 23-24, 2011. The purpose of the workshop is to exchange ideas, methods, success stories, cautionary tales, and future directions regarding academic collaboration between US and China institutions. The goal of the workshop is to foster investigating new avenues to encourage and enable meaningful collaborative research projects in computing to leverage the newly found and expected future growth of research and education capabilities in China. The main participants of the workshop will be US-based academic scholars. The workshop will also invite scholars based in China, as well as officials of NSF and other government agencies. The intellectual merit of this workshop is twofold. First, the workshop, through exchange of experiences, participants will gain further insightful understanding of the Chinese education structures and research programs, and their differences from those of the US. Second, the participants will identify research fields and methods to engage CISE researchers in China. Ultimately, the workshop will lead to more engagement of CISE researchers in China and improve our education and research programs at our home institutions. The broader impacts of the workshop are reflected in the hope that more collaborations between US-based and China-based CISE researchers will benefit the faster advancement of CISE research and education, and benefit the academic communities of both countries. More specifically, the broader impacts of the workshop include potential for strong growth in the number and scale of collaborative projects between US and Chinese researchers. The workshop will also bring together more diverse teams to bear on critical research problems across International borders. Finally, the increase in US-China collaborations will serve as an effective channel for academics to share educational tools and experiences while integrating research results into local curricula.","title":"Workshop on Effective Engagement and Collaboration of US CISE Researchers with Their Counterparts in China","awardID":"1136500","effectiveDate":"2011-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560388"],"PO":["543481"]},"178209":{"abstract":"Situations in which a decision maker has less information relevant for her decision than does some other agent occur in most areas of economic activity. In such situations, the less informed decision maker would like to obtain information from the more informed agent, or a group of agents. This award funds research on the properties of various mechanisms that can be used to elicit such information, both in the case of a single informed agent and in the case of multiple partially informed agents.<br\/><br\/>The first part of the project studies the single-agent case, the origins of which go back to the literature on scoring rules. While most of the past work has focused on eliciting either the full information about the distribution of the random variable or only the information about its mean, the project's goal is to generalize this theory to the elicitation of any set of characteristics of the distribution, such as, e.g., the mean and the variance, the quantiles, confidence intervals, etc., and to provide a full characterization of sets that can be elicited on their own using a limited number of questions and those that cannot.<br\/><br\/>The second part of the project studies multi-agent mechanisms in a one-period setting. Each informed agent makes a prediction only once, though unlike the single-agent case, the payment that the agent receives now depends not only on his prediction and the outcome, but also on the predictions of other agents. The goal is to provide a full axiomatic characterization of static mechanisms that satisfy several desirable properties, and analyze the performance of such mechanisms.<br\/><br\/>The third part of the project considers dynamic, multi-period market mechanisms, in which strategic agents observe each other's actions, learn from them, and adjust their forecasts accordingly. The research into the properties of such mechanisms is important both for the design of new market-based information elicitation mechanisms (such as, e.g., prediction markets operated by companies like Hewlett-Packard, Electronic Arts, and Google to forecast demand and other variables) and for understanding the informational properties of financial markets that already exist. In particular, this subproject bridges a gap between the non-strategic literature on the informativeness of prices in rational expectations equilibria and the fully strategic literature on the behavior of traders in dynamic market models.<br\/><br\/>The broader impact of this award has several components. The results of this research will be included in the courses taught to graduate students in economics, finance, computer science, and operations research. The research itself will involve students from these disciplines exploring the role of information in markets and single-agent settings, its aggregation and elicitation, and other related issues. Finally, this research has potential for a direct impact on the practical design of information elicitation mechanisms, such as, e.g., corporate prediction markets or information exchanges that allow traders to buy and sell information.","title":"ICES: Small: Information Elicitation and Aggregation in Market Mechanisms","awardID":"1101209","effectiveDate":"2011-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":[477811,477812],"PO":["565251"]},"181499":{"abstract":"Fourier analysis, where we decompose a complex function into a sum of simple oscillations, is used in virtually every form of digital technology, from JPEG compression to voice recognition. In computer science, Fourier analysis has led to new algorithms for \"pseudorandom numbers,\" i.e., numbers with no apparent pattern, which are useful both in cryptography and in algorithms for estimating functions and confirming computational claims. Fourier analysis also plays a key role in Shor's quantum algorithm for factoring, which breaks RSA public-key cryptography, and in proofs that some problems are hard to solve with certain kinds of parallel algorithms or circuits.<br\/><br\/>Profs. Moore and Russell will use the more powerful tool of nonabelian Fourier analysis to obtain new results in these areas. In particular, they propose new ways to \"derandomize\" algorithms, replacing random numbers with pseudorandom ones. They will study the extent to which rich, high-dimensional structures can be embedded in low-dimensional spaces with only a small amount of distortion, and prove that certain problems require a long time even for quantum computers to solve. Finally, they will study whether some alternatives to RSA, such as the McEliece cryptosystem based on error-correcting codes, will remain secure even if and when quantum computers are built. Thus their research has important impacts on algorithms, security, and cryptography. They teach courses that train students from Physics and Computer Science to work at the boundary between these disciplines, and their outreach activities include bringing this material to high school and middle-school teachers.","title":"AF: Small: Collaborative Research: Representation-theoretic techniques for pseudorandomness and lower bounds","awardID":"1117427","effectiveDate":"2011-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[486281],"PO":["565157"]},"176947":{"abstract":"The three year REU Site program \"ESCAPE: Experimental Study on Computer Architecture and Performance Evaluation\" at the University of Texas at San Antonio (UTSA) will focus on research for computer architecture, VLSI design and performance evaluation. Our program will include courses and seminars for the REU participants to learn the necessary infrastructure for research on computer architecture and microprocessor design. Students will perform literature surveys and design projects with faculty members. REU participants will then focus on research projects with guidance from faculty mentors. Key areas include: (1) workload reduction to reduce simulation time; (2) effective power estimation techniques using hardware and software; (3) benchmark creation for emerging workloads; (4) resource sensitivity analysis with respect to performance and power consumption; (5) development of branch prediction schemes; (6) leakage power reduction techniques; and (7) cache replacement techniques. The proposed research projects are critical issues in processor design and system-on-chip design. The findings from the REU program will help to identify new ways to improve processor performance. The proposed research topics for the REU site will benefit both industrial microprocessor design labs and academic institutes.<br\/><br\/> The REU team will aim to recruit at least 50% of the participants from underrepresented minorities, women, and students with disabilities. All research projects and reports from the REU participants will be posted on the REU web site. All REU participants are encouraged to continue working with their REU Site faculty mentors to write and publish papers in the subsequent semesters. Our overall goal is to motivate the participant undergraduate students to pursue research careers in computer architecture and microprocessor design or in science and engineering more broadly, and to take their first steps toward becoming independent researchers.","title":"REU Site: ESCAPE: Experimental Study on Computer Architecture and Performance Evaluation","awardID":"1063106","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["442096",474417,"442096",474419],"PO":["564588"]},"179918":{"abstract":"This award partially supports a series of three national and international Frontiers of Engineering (FOE) Symposia organized by the National Academy of Engineering: Japan-America FOE (June 6-8, 2011, in Tsukuba, Japan), U.S. FOE (September 19-21, 2011, in Mountain View, CA), and European Union-U.S. FOE (November 3-5, 2011, in Irvine, CA). Each symposium focuses on four topical areas. Topics for 2011 include additive manufacturing, engineering sustainable buildings, neuroprosthetics, semantic processing, robotics, smart grid, bio-inspired materials, massive data management, future cities\/sustainable cities, advanced manufacturing, and biology and computing.<br\/><br\/>Between sixty and one hundred outstanding, early-career scientists and engineers participate in each symposium. Sessions consist of presentations by speakers on leading edge research, emerging technologies, and opportunities for collaboration across science and engineering fields. The symposia foster interdisciplinary and international collaborations and serve as a reference point for many of the emerging frontiers in research and innovation in the U.S. Presentations from the U.S. FOE seminar will be posted on the NAE FOE web site.","title":"2011 Frontiers of Engineering Symposia (U.S., Japan-America, and European Union-U.S.)","awardID":"1108785","effectiveDate":"2011-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0704","name":"Division of EMERGING FRONTIERS IN RES & IN","abbr":"EFRI"},"pgm":{"id":"7633","name":"EFRI RESEARCH PROJECTS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1491","name":"BIOTECH, BIOCHEM & BIOMASS ENG"}}],"PIcoPI":["543859"],"PO":["565007"]},"180854":{"abstract":"20th ACM International Symposium on High Performance Distributed Computing (HPDC) seeks to increase student participation in symposium and the field. The proposed funding would support the travel of eligible US students to the symposium. Recipients would be able to attend the main conference, workshops, and tutorials. Travel grants will encourage the research interests and the involvement of students in the field who are not well funded and those who are just beginning their participation in the field or are interested in entering it. A special effort will be made to reach out to women and under-represented minorities.","title":"Student Travel Support for ACM HPDC 2011","awardID":"1114379","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[484603],"PO":["565272"]},"180789":{"abstract":"The Dynamic Spectrum Markets Workshop will be held on June 2-3, 2011, at Northwestern University. This workshop will bring together experts in wireless networking, wireless communications, economics and public policy to address the design and deployment of dynamic markets for improving the utilization of wireless spectrum. Topics to be covered in the workshop include the technical advances that could better facilitate spectrum markets, the technical restrictions that should be placed on spectrum users, and the type of market mechanisms that are appropriate for running such a market. The expected outcome of the workshop would be to establish a multidisciplinary research agenda for designing future dynamic spectrum markets, and contribute to the development of techniques for enhancing the access to radio spectrum and better supporting current and new applications. Participants will be selected based on an open call for white papers as well as there being invited participants.","title":"Dynamic Spectrum Markets Workshop to be held on June 2-3, 2011, at Northwestern University","awardID":"1113845","effectiveDate":"2011-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560216","560218"],"PO":["557315"]},"184706":{"abstract":"This project involves supporting students to attend the ACM Sigmetrics conference to be held in San Jose, CA in June 2011. Sigmetrics is the premier conference in the area of performance modeling and it is important to expose students to this conference, particularly in an environment where students tend to shy away from mathematical modeling. The students will be chosen based on a open competition and preference will be given to students who don't have any existing support or belong to underrepresented groups.","title":"Travel Support for ACM SIGMETRICS Conference 2011; San Jose, CA June 7-11","awardID":"1136204","effectiveDate":"2011-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["522280"],"PO":["535244"]},"173618":{"abstract":"The workshop \"Terahertz-to-Infrared Probes in Molecular and Materials Sciences\", which will be held on April 14th and 15th, 2011 in Arlington, VA, will provide a forum for leading experts to assess the need within the materials research, biophysical and biochemical research communities for advanced terahertz-to-infrared light sources. The workshop will include a mix of presentations and discussion, centered around the following five topics 1. Complex bio-molecular dynamics. 2. Molecular spectroscopy in the gas phase. 3. Terahertz-to-infrared microscopy\/nanoscopy, nanoscale phenomenon, surface interactions, etc. 4. Condensed matter I - frequency domain spectroscopy 5. Condensed matter II - non-linear and ultrafast phenomena. The workshop will assess the potential broader impacts that could result from the development of advanced terahertz-to-infrared light sources, both in terms of the research that they will enable, and in terms of technical education in areas that are vital to the nation?s continued scientific competitiveness. The conference will give preference to women and minority scientists and is co-funded by the Physics, Chemistry Divisions, the Division of Materials Research in the Mathematical and Physical Sciences Directorate, and by the Molecular and Cellular Biosciences Division in the Directorate for Biological Sciences.","title":"Applications of Terahertz-to-Infrared Probes in Molecular and Materials Sciences, Arlinton, VA","awardID":"1045354","effectiveDate":"2011-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"7246","name":"PHYSICS OF LIVING SYSTEMS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1743","name":"NATIONAL FACILITIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1938","name":"CHEMICAL INSTRUMENTATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1144","name":"Biomolecular Dynam,Struc,Func"}}],"PIcoPI":["545604"],"PO":["564661"]},"177194":{"abstract":"Millions of users are accessing a portion of billions of Web pages and other content on the Internet on a daily basis. While the networking research community and the public in general are well-aware of the net neutrality problem, i.e., how to develop regulatory policies and auditing mechanisms to prevent Internet Service Providers from discriminating against various applications, very little effort is invested in enabling content neutrality. In particular, it is not a secret that almost every browsing click we make is collected by either Web- or ISP-based 'information collectors and aggregators', and that our profiles are used for online advertising. Still, no public auditing mechanisms, capable of detecting and informing end users about such practices, exist in this emerging area. Take search engines as another example. How does one know that information available on these services is not biased (or will become biased in the future) for commercial, political, or any other reason? More generally, no public auditing systems are capable of monitoring the scope and effectiveness of advertising or spam campaigns on the Internet. The PIs argue that all these questions fundamentally affect fairness at all levels, information credibility, and user privacy, all of which have significant relevance for the future development of the Internet and beyond.<br\/><br\/>The PIs will build a set of methodologies and tools unified in a system capable of (i) enabling auditing mechanisms for the Web advertising domain, (ii) monitoring search engines? services and revealing their neutrality, and (iii) independently determining a Web site's popularity and checking for the truthfulness of advertised popularity. Further, the PIs plan to deploy the developed system on the PlanetLab wide area network testbed to perform long term monitoring of content neutrality in the Internet.<br\/><br\/>Broader Impact: By informing the public of how online advertisers and search engines behave, the auditing system will enable fair competition and preclude monopolies, oligopolies, or collusions, eventually helping to improve online information credibility and user privacy. Even if no bias nor privacy-violating practices were to exist in today's Internet (unfortunately, the PI's preliminary results show that this is not the case), the auditing system and methodologies will always be a barrier for anyone who would believe that applying such approaches might be done without public knowledge and repercussions. By exposing biased content behavior, the auditing system will be capable of revealing discriminating acts that can happen for commercial, social, political, religious, or any other reason, ultimately facilitating the development of free and open society. The PIs will design and disseminate easy-to-use browser extensions and plug-ins that will be capable of assisting end users in detecting content neutrality violations. Education is an integral part of this award. The insights and tools derived from this project will be integrated into the current undergraduate and graduate curricula.","title":"NetSE: Medium: Collaborative Research: Auditing Internet Content for Credibility, Fairness, and Privacy","awardID":"1064595","effectiveDate":"2011-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["550250","475349"],"PO":["565090"]},"178294":{"abstract":"One of the foundational tasks for the emerging interaction between computer science and economics is to incorporate \"computation\" into classic economic theories. As results have emerged, it has become clear that many of the standard economic models involve solving, in the worst-case, computationally hard problems. These results are often viewed as harsh critiques of the economic models, since it seems unreasonable to model agents as solving computationally hard problems. However, economists have, in general, resisted such critiques. The core of the current proposal is that this resistance stems not from a refusal to consider computational restrictions, but instead from a different perspective on the models themselves -- an \"empirical\" perspective as opposed to an \"algorithmic\" perspective. Specifically, an algorithmic view of the model assumes the model is fixed and literal and then proceeds to ask about the demands placed on the agents by the model. In contrast, an empirical view of the model does not presume agents actually follow the model, only that the model provides a way to explain the observed behavior, i.e., the data. A model still loses credibility if the agents must solve computationally hard problems; however, standard worst-case complexity is no longer the relevant concept. This proposal seeks to formalize and study this empirical view of how to incorporate computation into economic models. This new view is strongly motivated by the revealed preference literature in economics, which seeks to understand how generally a model is applicable. Our proposed empirical view of computational complexity adds to revealed preference theory the constraint that the instance revealed does not require agents to solve any computationally hard problems. Thus, the question becomes: Do computational constraints have empirical consequences for economic models? We propose to address this question across a range of classic economic models, including consumer choice theory, Walrasian (general) equilibrium theory, Nash equilibrium theory, and the theory of stable matchings.<br\/><br\/>This proposal sets an ambitious goal, and it is one that presents true opportunities for interdisciplinary dialogue. Such a dialogue presents an opportunity to rethink traditional economic models with an eye toward computation, which will shed a new light on the predictive power of the foundational theories of economics. In addition to the research components of this work, the PIs have a history of, and will continue to, facilitate the increasing interaction of computer science and economics through a variety of educational activities including (i) teaching new interdisciplinary courses at the undergraduate and graduate levels, (ii) advising interdisciplinary research at the undergraduate, graduate, and postdoctoral levels, and (iii) organizing annual joint workshops with other universities in southern California and with industry partners.","title":"ICES: Small: A Revealed Preference Approach to Computational Complexity in Economics","awardID":"1101470","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":[478013,"550593"],"PO":["565251"]},"177295":{"abstract":"The research goal of this grant is to provide a scientific foundation for the economic implications of software modularization activities during software development and maintenance. A difficult question during software development is when to perform software code refactoring to restructure the code to achieve better modularity for the purpose of improving reducing complexity, improving code readability, and achieving other, so-called nonfunctional properties. The costs of modularization activities such as refactoring is significant and immediate, and the benefits are largely invisible, intangible, and long-term. However, delaying refactoring causes modularity decay, which is blamed for significantly reduced productivity, operational failures and even canceled projects. Knowing when to refactor is a long-standing, important and difficult question. This research will conduct extensive empirical studies to establish quantitative relationships between software project parameters and software modularity decisions. Based on the empirical data, the project will develop modularity violation detection techniques to locate modularity debts and evaluate a proposed modularization activity by combining Monte Carlo simulation based on Datar-Mathews option valuation method. These scientific foundations for economic decision-making will lead to a better understanding of the costs and benefits of modularization activities, with a goal of providing tools that will better support such decisions. The research will be performed by an interdisciplinary team of researchers with expertise in software engineering and economics.","title":"SHF: Medium: Collaborative Research: An Economics-Based Framework for Assessing Software Modularization Decisions","awardID":"1065189","effectiveDate":"2011-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["498101"],"PO":["564388"]},"174150":{"abstract":"Transformative research is needed to realize qualitative improvements in the modeling of climate. The investigators are carrying out an interdisciplinary program of direct statistical approaches to climate modeling that has the potential to dramatically improve our understanding of how different climate processes interact over short and long time scales and small and large spatial scales. The program lays the foundations for a new class of climate models that may complement or even eventually replace existing climate models. It has two parallel tracks. First, the investigators are developing methods for the direct computation of climate statistics that may eventually replace conventional numerical simulations, leading to computationally more efficient climate models. Second, they are developing improved representations of low clouds and an improved understanding of cloud interactions with large-scale circulations, leading to more accurate climate models and reducing the currently large uncertainties in the representation of clouds in them. <br\/><br\/>The methods for the direct computation of climate statistics are based upon cumulant expansions in which fast modes are integrated out. This refocuses attention on the evaluation and understanding of low-frequency modes, which dominate climate variability. Improved representations of low clouds are developed based on probabilistic closures of cloud and subgrid-scale dynamics, which can be systematically improved in accuracy. These are integrated into a general circulation model (GCM) that couples the clouds to the large-scale flows, allowing a systematic study of their interactions. The work extends past work on the direct computation of statistics in relatively simple models of geophysical flows to GCMs of increasing complexity and realism, while improving the accuracy of the statistical methods and of the GCMs themselves.","title":"Collaborative Research: Type 1 -- LOI02170139: Direct Statistical Approaches to Large-Scale Dynamics, Low Cloud Dynamics, and their Interaction","awardID":"1048701","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7552","name":"COFFES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8012","name":"CR, Earth System Models"}}],"PIcoPI":["544312"],"PO":["564898"]},"178352":{"abstract":"Automated market makers are algorithmic agents that provide liquidity within markets. They provide a vehicle to create markets - for trade, risk hedging, speculation, or information aggregation - that might not otherwise exist. This project applies to binary-payout markets: prediction markets, weather insurance, sports betting, important options markets, credit default swaps, etc. Research on automated market makers will enable new kinds of markets: combinatorial markets, markets with continuous event spaces, and decision markets (where a principal uses a market to decide on a course of action). The project will also study how to better facilitate trade in existing markets. The PI plans to develop better liquidity-sensitive market makers in a novel framework. He also plans to study settings in which the market maker has a good prior over event likelihoods and to test how sensitive a market maker - even with a perfect prior - should be to unbalanced exposure risk. Finally, the PI plans to test a range of market makers on data from widely-traded options contracts. This will validate the approach beyond prediction markets.<br\/><br\/>In regular prediction markets, the increased liquidity from automated market making improves predictions; in combinatorial ones, it enables the market. One of the most popular uses of prediction markets is internal markets for corporations. Better prediction markets mean that companies will perform better. Prediction markets can be anonymous, enabling people who may be outsiders in traditional deliberative processes to have considerable weight in decision making, as long as they have quality insights.<br\/><br\/>The markets to which the research potentially applies range all the way to the world's largest markets. Even small improvements from this research can thus have vast economic benefits. Better market making increases liquidity, so the social welfare in the system increases due to better allocations. The research focuses on making the market mechanisms better rather than making any one trader's strategy better; thus the benefits will be distributed broadly among market participants. Replacing human market makers with automated ones also has other advantages: higher speed, no human errors, and avoidance of intentional misbehavior. The proposed work will increase the adopters' competitiveness; the first adopters will likely be US based, yielding US competitiveness in particular.","title":"ICES: Small: New and Better Markets via Automated Market Making","awardID":"1101668","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":["561267"],"PO":["565251"]},"176196":{"abstract":"Dr. Sharad Mehrotra and an interdisciplinary team of collaborators at the University of California at Irvine (UCI) will develop I-sensorium, to serve as a \"living laboratory\" to support research in several related areas of cyber-physical systems: including theoretical foundations and underlying principles of building sentient systems; engineering, software, and systems level challenges; and novel application contexts where such sentient systems can be used. I-Sensorium will serve as a testbed for exploring and testing novel sentient technologies. I-Sensorium augments Responsphere, an existing UCI crisis response test-bed with state-of-the-art storage and computational infrastructure to acquire and process continuous streams of sensory data from Responsphere sensors. The I-Sensorium software will leverage multiple ongoing research projects at UCI on large-scale, heterogeneous sensor databases, sensor middleware platforms for querying and analysis of heterogeneous sensor data, and an event representation system for multi-media data, to provide a high level programming environment for the I-Sensorium allowing a broad group of researchers to participate and benefit from its creation. <br\/><br\/>The development of I-Sensorium offers opportunities for research-based education and training in many aspects of cyber-physical systems. The infrastructure as well as the sensor data acquisition enabled by it presents research challenges and opportunities in sensor data management, machine learning, computer vision, event modeling, among others. Interactions with industrial partners and government agencies are expected to lead to advances in the applications of cyber-physical systems in real-world settings. Education and outreach efforts are aimed at broadening the participation of women and members of underrepresented groups in computer science and engineering. Further information about this project can be found at: http:\/\/www.i-sensorium.org","title":"II-EN: UCI Irvine Sensorium","awardID":"1059436","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["543631",472187,"515756","499298"],"PO":["565136"]},"184194":{"abstract":"Computational creativity is a young, highly interdisciplinary field incorporating insights and results from cognitive science, artificial intelligence, design, human computing interaction, mathematics, art and linguistics among others. As a result, there is still a significant communication gap amongst contributors to the field. The International Conference on Computational Creativity seeks to bridge this gap by creating a unified forum for discussion and exchange of ideas, and the workshop session is designed to foster broad participation and act as a forum for new participants in the conversation. The award will facilitate this participation by providing travel support for participants that would like to join the conversations who will not present peer reviewed papers, but who would be benefited by exposure to established computational creativity researchers. In addition, it will further this cooperation by funding mentoring activities that pair established researchers with workshop participants.","title":"Workshop: International Conference on Computational Creativity: Broadening Participation","awardID":"1132362","effectiveDate":"2011-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[493953],"PO":["565227"]},"175163":{"abstract":"This research investigates shared representations, flexible learning techniques, and efficient multi-category inference methods that are suitable for large-scale visual recognition. The goal is to produce visual systems that can accurately describe a wide range of objects with varying precision, rather than being limited to identifying objects within a few pre-defined categories. The main approach is to design object representations that enable new objects to be understood in terms of existing ones, which enables learning with fewer examples and faster and more robust recognition.<br\/><br\/>The research has three main components: (1) Designing appearance and spatial models for objects that are shared across basic categories; (2) Investigating algorithms to learn from a mixture of detailed and loose annotations and from human feedback; and (3) Designing efficient search algorithms that take advantage of shared representations. <br\/><br\/>The research provides more detailed, flexible, and accurate recognition algorithms that are suitable for high-impact applications, such as vehicle safety, security, assistance to the blind, household robotics, and multimedia search and organization. For example, if a vehicle encounters a cow in the road, the vision system would localize the cow and its head and legs and report ``four-legged animal, walking left'', even if it has not seen cows during training. The research also provides a unique opportunity to involve undergraduates in research, promote interdisciplinary learning and collaboration, and engage in outreach. Research ideas and results are disseminated through scientific publications, released code and datasets, public talks, and demonstrations for high school students.","title":"CAREER: Large-Scale Recognition Using Shared Structures, Flexible Learning, and Efficient Search","awardID":"1053768","effectiveDate":"2011-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[469791],"PO":["564316"]},"177275":{"abstract":"Computer-Integrated Medicine (CIM) is a new and rapidly growing area with high global appeal. Work in CIM is multi-national and inter-disciplinary. International research exchange is thus essential in creating state-of-the-art CIM systems, and in supporting CIM research programs.<br\/><br\/>The goal of this International Research Experiences for Students project is to create a bilateral international research exchange program on computer-integrated medicine (CIM) between the Technical University of Munich (TUM) Graduate School in Information Science and Health (GSISH) and the Johns Hopkins University (JHU) Center for Computer-Integrated Surgical Systems and Technology (CISST-ERC). Our vision is to develop a joint research and education activity that merges team research projects with cohort-focused education and organized cultural and socialization experiences, thereby creating a wide-ranging and long-term collaborative research program between our institutions. Both the TUM and JHU are national leaders in CIM, with networks of research collaborations that span their respective continents. The proposed IRES support will provide the ?missing link? in our existing faculty interactions and unilateral student exchange, to bind the networks of the two institutions into one larger transatlantic network on a more systematic and sustainable level. <br\/><br\/>We have developed the exchange to focus on the development of a cohort experience for students with an innovative educational and research mentoring environment. Our collaboration will focus on four research projects that exploit the inherent synergies of JHU and TUM. They are: 1) Automated surgical skill modeling and workflow analysis; 2) Video reconstruction and registration for advanced surgical visualization; 3) Software systems for information-enhanced surgery; and 4) Medical robotics devices and systems for microsurgery. Each of these projects is led by both TUM and JHU faculty, and takes advantage of complementary skills at each institution. <br\/><br\/>Our project will emphasize the development of research networks that the students will be able to take advantage of after the exchange ends, leading to long-term international cooperation. The focus on graduate students in the exchange provides a longer time horizon for the networks, and the eventual inclusion of undergraduates in the exchange will cement the transatlantic research community in this growing area of important interdisciplinary research.<br\/><br\/>This project is supported by NSF's Office of International Science and Engineering (OISE) and the NSF Directorate for Computer & Information Science and Engineering (CISE), Divisions of Information and Intelligent Systems (IIS) and Robust Intelligence (RI).","title":"International: A US-Germany Research Collaboration on Systems for Computer-Integrated Healthcare","awardID":"1065092","effectiveDate":"2011-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7727","name":"IRES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["531055"],"PO":["537967"]},"181180":{"abstract":"This project provides support for promoting student research on symbolic computation and computational mathematics at the 17th International Conference on Applications of Computer Algebra (ACA 2011), which is hosted by Lamar University and held in Houston, Texas, on June 27-30, 2011. In the past several years there has been a dramatic increase in the use of algebraic and symbolic computation in engineering, science and education. The ACA series of annual conferences is devoted to stimulating and enhancing this important progress through international meetings that emphasize theoretical research and algorithm design for software development, as well as the applications of algebraic and symbolic computation in engineering, physical and medical sciences, pure and applied mathematics, and education. <br\/><br\/>The ACA conferences traditionally work to ensure the future vitality of the application fields of algebraic and symbolic computation by facilitating development and nurturing of a community of capable graduate students and entry-level scientists. Through keynote speakers, talks, themed workshops, timely and topical tutorials, this conference provides mechanisms for graduate students and young scientists to meet each other in a scientifically rigorous setting. With researchers coming from all around the world, this conference makes a broad impact on both the algebraic and symbolic computation research community and the user community. Leading software companies such as MapleSoft and Wolfram Research have been regularly attending ACA meetings.","title":"Computer Algebra Research Student Support for the 17th International Conference on Applications of Computer Algebra (ACA 2011)","awardID":"1115922","effectiveDate":"2011-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[485507,"563805"],"PO":["565251"]}}