{"100320":{"abstract":"The new variants of known problems (like traveling salesman, binary space partitions for space subdivisions, and geometric dilation) are being studied in order to produce new techniques and address key issues in algorithm design and approximation. Besides that, they are likely to have other implications. For example, the study of geometric dilation may provide better ways of designing transportation networks, and efficient ways for upgrading existing ones. The theoretical study of metamorphic systems is necessary for understanding their capabilities and for developing algorithms that control them. An important aspect of this research is advancing the integration of techniques from different areas --- discrete and combinatorial geometry, geometric graph theory, graph theory, topology, linear programming --- in the design of geometric algorithms. <br\/><br\/>This research deals with algorithmic questions from the areas of computational geometry and robotics, grouped in three directions. The problems in the first category are in the area of geometric network optimization where the focus will be new variants of the classic traveling salesman problem that have emerged in the last decade, such as those with neighborhoods and the angle restricted tour problem. These efforts are aimed at understanding the differences between various classes of regions, which make some instances harder to approximate than others. A second research direction deals with cutting techniques applied to two important problems: binary space partitions and stock cutting algorithms. A third category includes fundamental questions generated by the study and analysis of metamorphic robotic systems, a relatively new research direction in robotics. Two basic capabilities of metamorphic systems are researched: reconfiguration and locomotion. Development of such systems is regarded as very promising, due to their versatility and high degree of fault tolerance. An important aspect of this research is advancing the integration of techniques from different areas --- discrete and combinatorial geometry, geometric graph theory, graph theory, topology, linear programming --- in the design of geometric algorithms.","title":"CAREER: Algorithmic issues in geometric network optimization, binary space partitions, and metamorphic systems","awardID":"0444188","effectiveDate":"2005-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["442582"],"PO":["565157"]},"102520":{"abstract":"The ongoing flood of unique data generated by satellite based instruments, such as NASA's Moderate Resolution Imaging Spectroradiometer (MODIS) systems, creates a general problem for data and archival systems that must manage it. Flowing in at roughly 1TB a day (approaching 2 PB over 4 years), MODIS data's high value requires that it be reliably preserved in long-term archival storage, yet at the same time, its current international user community wants it to remain continuously available for wide area access. The combination of massive data volumes, most of which must be stored near line, and a highly distributed user base, some of whom demand ad hoc or even interactive access, exacerbates the long standing technical and managerial mismatch between deep archival storage and wide area networks. This planning project will bring together leaders of the MODIS archive community with Computer Science researchers pioneering a new approach to wide area data management. The purpose of the MAAP project is to plan a fundable trial demonstration of a distributed service platform for providing fast, flexible, and efficient access to all MODIS archive data for a global research, education and policy planning community. In order to deal with the logistical challenges of managing massive data in networked environments, this project will explore a new common storage service, the Internet Backplane Protocol (IBP), which applies the Internet design philosophy to create a network service that can scale with the network. This technology has already been implemented in a well tested collection of middleware and has been deployed in a global testbed with over 400 nodes and 40TB of storage. A<br\/>variety of application communities, including large scale content distribution, distributed data mining, and<br\/>remote visualization of imaging data already use this technology. To create a successful MAAP demonstration, the team will directly engage with the scientific and management teams of the NASA-USGS Land Processes Distributed Active Archive Center (LP-DAAC).","title":"Planning a Globally Assessible Archive of MODIS Data","awardID":"0456017","effectiveDate":"2005-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V753","name":"LIB CONGRESS-DIGITAL PRESERVAT"}}],"PIcoPI":["530745",270323],"PO":["371077"]},"101563":{"abstract":"Abstract<br\/>CNS-0451293<br\/>PI: Ran Libeskind-Hadas<br\/>Institution: Harvey Mudd College<br\/><br\/>Title: REU Site: Harvey Mudd REU Site on Artificial Intelligence, Systems, and Optical Networking<br\/><br\/>This project creates a new Research Experience for Undergraduates site focused on the areas of artificial intelligence, systems, and optical networking. Cohorts of undergraduate students from the greater Los Angeles area participate in a ten-week summer research program at the host institution. The project includes mentorship by the experienced computer science faculty members, weekly presentations and seminars, and laboratory visits and other professional development opportunities.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications. The students participate in a full range of research activities from preparing research literature reviews to production and dissemination of research results.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The participating faculty members are committed to engaging women and under-represented minority students in their research. The partnership with nearby campuses in the California State University system should enable recruitment of a diverse set of students who might not have access to similar experiences on their own campuses. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learni","title":"REU SITE: Harvey Mudd REU Site on Artificial Intelligence, Systems, and Optical Networking","awardID":"0451293","effectiveDate":"2005-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["561152"],"PO":["564181"]},"105776":{"abstract":"The IEEE International Symposium on Information Theory (ISIT) is held annually at sites alternating between North America and abroad. The 2005 ISIT will be held at the Adelaide Convention Centre in Adelaide, Australia from September 4th to the 9th. ISIT has a strong tradition of participation by junior researchers that has helped it maintain its reputation as a leading forum for new ideas. This proposal requests support for the travel expenses of junior participants from the U.S., such as graduate students, research associates, and new assistant professors. These participants would be individuals whose papers have been selected for presentation at the symposium, but who lack funds and would not be able to attend without travel support. It is proposed that the co-chairs of the symposium, Alex Grant and Rodney Kennedy, make the awards. The total amount requested is $30,000, based on 30 awards averaging $1000 each.","title":"2005 IEEE International Symposium on Information Theory Travel Support; Adelaide, AU; September 4-9, 2005","awardID":"0514114","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["560179"],"PO":["348215"]},"102961":{"abstract":"This research explores a theoretical question that has potentially important implications for protein folding simulations. Drug design (for example, blocking the action of a deadly virus) would be significantly faster if researchers could predict computationally the folding of a protein from its sequence of amino acids, rather than having to explore options *in vitro*. However, progress on this \"protein folding problem\" has been slow because of the vast number of different ways a long protein can fold. These different ways are abstractly collected into a \"space\" of possible folding paths. The investigator and his collaborators proved a geometric theorem that, under some simplifying assumptions, implies that this space of possibilities is significantly smaller than previously thought.<br\/><br\/>The goal now is to show that this reduction holds without those simplifying assumptions. In particular, the reduction in the dimensions of the space depends on the existence of \"locked\" polygonal chains (which model protein backbones). It is known that there do exist such locked chains with arbitrary link lengths, but it is an unsolved problem whether locked chains exist when all links have about the same length, which tracks the situation for proteins. If this question can be answered positively, the next step will be to exploit the dimension reduction to accelerate protein folding simulations, and thereby reduce the drug-design cycle time. The research is conducted at a women's college, and all five of the investigator's student collaborators are female undergraduates in areas with significant national under-representation of women: they are computer science, mathematics, and engineering majors. Several are headed to graduate school, and their training on this grant serves as invaluable preparatory experience.","title":"Can Protein Chains Lock?","awardID":"0500290","effectiveDate":"2005-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[271511],"PO":["321058"]},"108847":{"abstract":"Drs. B. Popescu and J. Kovacevic, and A.P. Petropulu have organized a panel with topic 'Women in Signal Processing', to take place at ICASSP 2005. <br\/><br\/>We propose to invite a group of local young girls (K-12) to attend the panel. We feel that this would be a nice setup for young girls to be exposed to the field of Signal Processing and meet women who have made careers in this field. Panel members will meet with the girls and their teachers before the panel and talk to them about signal processing and its applications in everyday life.<br\/><br\/>We will get in touch with schools in the Philadelphia area and invite a group of girls and their teachers. The requested amount will cover food for the attendees, transportation expenses, a honorarium for the teachers who will help organize the effort.\"","title":"Support for K-12 female students to attend ICASSP-2005","awardID":"0531008","effectiveDate":"2005-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["526916"],"PO":["564898"]},"100850":{"abstract":"The purpose of this project is to develop probabilistic language models that efficiently integrate denotational semantic information into syntactic and phonological stages of recognition for use in spoken language interfaces to sensor or robotic agents. This integration is intended to allow information about the meanings or denotations of words in the agent's current environmental context to influence the probability estimates it assigns to hypothesized analyses of its input, before any recognition decisions have been made, so that the interfaced agent can favor in its search those analyses that \"make sense\" in its representation of the current state of the world. Since these models can be trained on the same kinds of examples that may be used to establish word meanings in the agent's lexicon, it is expected that they will be easier to adapt to changing domains than those relying exclusively on word co-occurrence statistics in fixed corpora.<br\/><br\/>A recognizer based on this model will eventually serve as a testbed for evaluating spoken language interfaces to networked scout robots in search and rescue applications and mobile manipulation robots in home care tasks or materials handling applications in joint projects with other members of the Artificial Intelligence Robotics and Vision Lab, as well as in applications that require navigating digital road maps or other geographic data in joint projects with members of the Spatial Databases group at the University of Minnesota. This model will also be adapted as a framework for teaching natural language processing concepts, providing students with a broader context in which various processing components may fit together, and inviting students to consider innovative solutions to natural language processing problems that cross the boundaries among traditional components.","title":"CAREER: Integrating denotational meaning into probabilistic language models","awardID":"0447685","effectiveDate":"2005-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[266072],"PO":["565215"]},"101730":{"abstract":"Abstract<br\/>CNS-0452235<br\/>PI: Yu-Dong Yao<br\/>Institution: Stevens Institute of Technology<br\/><br\/>Title: REU Site: Integrated Software Radio and Radio Frequency Test Bed for Wireless Research in Dynamic Spectrum Access<br\/><br\/>This project creates a new Research Experience for Undergraduates site focused on wireless research in dynamic spectrum access. The research aims to increase spectrum utilization significantly for both military and commercial applications. Students develop software defined radio frequency transmitters and receivers, develop and integrated test bed, and conduct research using the test bed. The project involves collaboration between the host institution and Jackson State University, with half the students and one mentor coming from Jackson State. Undergraduate students participate in a ten-week summer research program at the host institution. The project includes mentorship by experienced computer science faculty members, weekly presentations and seminars, laboratory visits and other professional development opportunities.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications. The research related to dynamic spectrum access techniques may significantly improve the spectrum utilization for future wireless networks.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The project develops strong collaborative ties between the host institution and Jackson State University that will enable the students to continue their research and professional growth after the summer experience. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Integrated Software Radio and Radio Frequency Test Bed for Wireless Research in Dynamic Spectrum Access","awardID":"0452235","effectiveDate":"2005-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["409087",268156],"PO":["564181"]},"105910":{"abstract":"A Systems Approach to Genomic Signal Processing: <br\/>Signal Extraction to Regulatory Intervention<br\/><br\/>The Human Genome Project recently announced the sequencing of the human genome with enormous potential implications such as customized medicine. New analytic methods and computational technologies are needed to fulfill this promise. This study focuses on the development and integration of signal processing approaches for aiding the diagnosis and treatment of diseases such as cancer. The massive amount of data generated by high-throughput microarray technology provides a gateway to the discovery of key genes and gene combinations that explain specific diseases on a mechanistic level, to the classification of diseases on a molecular level, and to the development of optimal therapeutic strategies for various diseases. This study is concerned with (i) developing signal processing based solutions to individual sub-problems that arise in functional genomics; and (ii) ensuring that these solutions can be pieced together to provide solutions to the original overall problems of disease diagnosis and therapy.<br\/><br\/>Microarray-based genomic signal processing can be broadly broken into five categories: signal extraction, clustering, classification of phenotypes (diagnosis), modeling genetic regulatory networks, and developing strategies for regulatory intervention (therapy). There tends to be a natural hierarchy among the five categories which are, therefore, studied from a systems perspective to ascertain the manner in which processing, analysis, and estimation on one level propagates through the system to affect downstream analyses, and how the subordinate issues within a category interact among each other. These questions are addressed within a unified theoretical framework, their solutions are applied to real biological problems, and a large body of integrated software to facilitate further investigation and application is developed.","title":"A Systems Approach to Genomic Signal Processing: From Signal Extraction to Regulatory Intervention","awardID":"0514644","effectiveDate":"2005-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["559864","331729","516912","549853"],"PO":["564898"]},"108704":{"abstract":"The annual IEEE International Conference on Computer Vision (ICCV), sponsored by the IEEE Computer Society, is one of the best events in terms of quality and quantity in the areas of computer vision, and has served as a forum gathering international researchers for presentation and discussion of emerging technologies. This project is to support about 35 U.S. researchers to participate in the 2005 ICCV that will be held in Beijing, China October 15-21, 2005. The primary objective is to help U.S. researchers participate in this key international conference, who could not otherwise attend the Conference. U.S. researchers will maintain a highly competitive position in research by presenting research results, discussion, and exchange information with researchers from all over the world. This project strongly supports minority group researchers and students who would need financial support for their participation in the 2005 ICCV.","title":"Group Travel Grant to 2005 IEEE International Conference on Computer Vision in Beijing, China October 15-21, 2005","awardID":"0529738","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["515737"],"PO":["317663"]},"102688":{"abstract":"ABSTRACT<br\/><br\/>PI: James Rawlings <br\/>Institution: University of Wisconsin<br\/>Proposal Number: 0456694<br\/>Title: Distributed model predictive control of large-scale networked systems<br\/><br\/>The control of large complex networked systems may be accomplished by applying local modeling and control techniques to its smaller, more manageable constituent subsystems. Because there is little cooperation between the local controllers, they can interact in unexpected ways, not considered in the design phase. As a result, the full system may display fragility and even instability in the face of unmodeled disturbances. An excellent illustration of this phenomenon was the failure of the North American power system in August 2003.<br\/><br\/>The PIs plan to develop new methods for the control and optimization of large, complex, networked systems. They will design these methods to be more robust than existing methods in the presence of large disturbances and component or subsystem failure, with performance approaching that of a fully centralized methodology. At the same time, these methods will be implementable in practical settings, by taking advantage of the currently deployed subsystem models and controllers, and avoiding the onerous modeling requirements and organizational\/institutional obstacles associated with a centralized control methodology. The key to the approaches will be communication of information between subsystems, and cooperation between their controllers. The forecasts produced by model predictive control techniques provide rich information about future behavior of each subsystem. In some situations, sharing of this information between subsystems is itself sufficient to achieve almost all of the potential benefits of centralized control. In more tightly coupled systems, more extensive cooperation is required. One form of cooperation is to give the subsystem controllers a common objective-a straightforward modification if the subsystems already use model predictive control. If the subsystems currently use PID or some other low-level control scheme, it is not difficult to first replace these controllers with model predictive controllers before applying the techniques developed in this research. Cooperation can also involve sharing of information between subsystems, possibly more than once within a single sample period, with local reoptimizations performed after each exchange of information. A crucial component of the project will be the design of robust and rapidly converging optimization schemes that perform most of their computations locally within each subsystem and exchange limited information between subsystems.<br\/><br\/>To ensure industrial relevance and impact, the PIs have established collaborations with six industrial partners to demonstrate these new approaches on two economically significant application classes: electric power networks and large-scale, integrated chemical plants exchanging raw materials and products. They plan to collaborate with the industrial partners to test and refine the proposed methods, to demonstrate the benefits with actual industrial operating data, and to transfer the technology into practice. Testing and implementation of the proposed methods will provide a vital educational experience for the graduate students supported by the project.<br\/><br\/>The broader impact lies in the opportunity to demonstrate methods that increase the reliability of critical infrastructures that are composed of many highly interacting subsystems. Infrastructure of this type is already becoming pervasive in highly technological societies, and the need for improving the reliability of this infrastructure is increasingly urgent.","title":"Distributed Model Predictive Control of Large-scale, Networked Systems","awardID":"0456694","effectiveDate":"2005-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7368","name":"SCI TESTBEDS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1403","name":"PROCESS & REACTION ENGINEERING"}}],"PIcoPI":["523876","517079","544751"],"PO":["565229"]},"104646":{"abstract":"This award supports a symposium that will extend knowledge on the computational and methodological challenges related to the collection and analysis of vast amounts of data originating from eCommerce transactions. For example, eBay, the largest and most well known online auction, hosts several million auctions a year. Researchers can access these data using web-data collection technologies, such as web spiders. Standard statistical tools are designed for data of much smaller size and often do not scale up. Traditional statistical models also do not take into account the dynamics and concurrency of events happening in a marketplace as large as the Internet. Thus, it is critical at this juncture to bring together Information Systems researchers who study eCommerce with statistical researchers who are producing new models and methods for large-scale data computations. The goal of this symposium is to contribute to the modernization and enhancement of empirical research methods for eCommerce and the digital society at large.","title":"First Interdisciplinary Symposium on Statistical Challenges and Opportunities in Electronic Commerce Research; May 22-23, 2005; College Park, MD","awardID":"0508712","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["317911",276288],"PO":["564456"]},"107529":{"abstract":"The University of Texas, El Paso has been funded to support two planning workshops focused on developing strategies for an Alliance of Hispanic-Serving Institutions. Ten institutions currently participate in this alliance that aims to coordinate and strengthen sustained efforts to bring more Hispanic students into computing education and research. The Alliance broadly aims to address development issues for education, faculty, and research. These workshops will enable them to discuss Alliance responses to upcoming initiatives, including the new CISE initiative to Broaden Participation in Computing (BPC).","title":"Alliance of Hispanic-Serving Institutions: Request for Planning Funds","awardID":"0522275","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["559621"],"PO":["561855"]},"100940":{"abstract":"0448178 <br\/>Mahesh Viswanathan <br\/>U of Illinois @ Urbana<br\/><br\/>TITLE: CAREER: Next Generation Model Checking <br\/><br\/>This research addresses the need to increase the reliability of software by continual analysis. One important approach to ensuring system correctness is model checking, in which the verification task is largely automatic and requires minimal user input. Though model checking has been successfully applied in practice, there are a couple of challenges that have limited its applicability. First, the representation of the system that the model checker analyzes is typically very large for most practical systems; this is often called the state space explosion problem. The second is that model checkers analyze a formal model of system which is often unavailable or difficult to construct. In this project, the PI plans to address these challenges by integrating ideas from computational learning theory and randomized algorithms to develop model checking algorithms with provably formal guarantees that can analyze black box systems within available computational resources.","title":"CAREER: Next Generation Model Checking","awardID":"0448178","effectiveDate":"2005-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["553664"],"PO":["564388"]},"102612":{"abstract":"This award will help to support a workshop on nanoscale forces and interfacial phenomena to be held in Cancun, Mexico around January 2006. Organized by Dr. Norma Alcantar of the U. of South Florida and Dr. Phillip A Pincus of the U. of California-Santa Barbara, together with international partners Dr. Tomas Viveros of the Universidad Autonoma Metropolitana in Iztapalapa, Mexico, Dr. Suzanne Giasson, of the University of Montreal, and Dr. Roger Horn of the University of South Australia, the workshop will involve representatives from approximately 42 universities worldwide and international student participation. <br\/><br\/>The meeting will bring together scientists that are international leaders in measuring and analyzing surface forces and interfacial phenomena to provide a substantive training experience for students, postdoctoral researchers and investigators who are at early stages in their career. It will feature a discussion of critical issues facing colloid and interface science. Students and postdoctoral researchers will present their work in poster sessions. Ultimately, the workshop aims to foster collaborations at multiple levels (interdisciplinary and internationally) to attack complex problems that connect the nanoscale world to the macroscopic world. The Office of International Science and Engineering and the Directorates of Engineering and Mathematical and Physical Sciences are sharing in the funding of this activity.","title":"U.S.-Mexico Workshop: Bridging Nanoscale Forces and Interfacial Phenomena to the Macroscopic World; Mexico; Cancun, Mexico, January 2006","awardID":"0456436","effectiveDate":"2005-05-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}}],"PIcoPI":["449907","478274","472002","434385","528317"],"PO":["531406"]},"102513":{"abstract":"Information is one of the biggest assets for most enterprises. In today's information age, almost every enterprise decision is based on a detailed analysis of data recorded in diverse sources ranging from structured databases to the World Wide Web. To ensure that data retrieved from different sources is used appropriately and within context, it is imperative that the provenance of the data be recorded and made available to its users. Provenance refers to the knowledge that enables a piece of data be interpreted correctly. It is the essential<br\/>ingredient that ensures that users of data (for whom the data may or may not have been originally intended) understand the background of the data. This includes elements such as, who (person) or what (process) created the data, where it came from, how it was transformed, the assumptions made in generating it, and the processes used to modify it. This research team will investigate the semantics of data provenance and will develop an ontology to represent the semantics of data provenance, including the development of ways to automate the capture of provenance. Using new product design and development as the real world domain, a partnership will be formed with a large defense contracting company, viz., Raytheon Missile Systems, located in Tucson, Arizona, to investigate these research issues. A testbed will be created to capture and use provenance and evaluate the system's utility using a well defined set of metrics. Raytheon has committed considerable resources in the form of personnel and access to software as needed for this research.<br\/><br\/>The intellectual merit of this proposal stems from the theoretical framework for understanding and representing the semantics of data provenance. This is considerably different from existing work on provenance which has mainly explored the 'where' and 'why' of provenance. This work will pave the way for understanding the extent to which provenance can be automatically captured.<br\/><br\/>The project has the potential for broader impacts on society. Most importantly, the development of techniques to represent, capture and deploy provenance has the potential to revolutionize the Department of Defense product development industry and other domains as well. The ultimate goal is to enable the development of autonomic and interoperable enterprise data management systems.","title":"Investigating Data Provenance in the Context of New Product Design and Development","awardID":"0455993","effectiveDate":"2005-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V753","name":"LIB CONGRESS-DIGITAL PRESERVAT"}}],"PIcoPI":["550174"],"PO":["371077"]},"100974":{"abstract":"Efficient usage of bandwidth and\/or energy is necessary for the success of a majority of ad-hoc and sensor network applications. This project focuses on the development of distributed bandwidth\/energy optimization algorithms that require only local network topology or state information, and yet guarantee a performance close to the global or local optimum. More specifically, this project involves the development of distributed node wakeup, medium access control, routing and flow control algorithms that optimize (exactly or approximately) the throughput or lifetime of the network, while posing minimal overhead of communication on the individual nodes. The project objectives also include understanding the fundamental trade-offs between optimization accuracy and communication complexity, so that the appropriate level of accuracy can be chosen based on the network and application characteristics.<br\/><br\/>The questions considered in this project are crucially important for the efficient management of ad-hoc and sensor networks in a wide range of application scenarios, including environmental data gathering, military and relief operations, and health monitoring. Moreover, although the project is focused only on large-scale ad-hoc and sensor networks, the results of this research are expected to influence a larger body of science and engineering, including optimization theory, stochastic control and distributed algorithms. The expected outcomes of this project also include a publicly available simulation tool, a junior museum exhibit, and a graduate level course on distributed optimization methods in networking. A conscious effort will be made towards engaging women and other under-represented groups in the research and educational programs related to this project.","title":"CAREER: Local Information Based Distributed Optimization of Resources in Large-Scale Adhoc and Sensor Networks","awardID":"0448316","effectiveDate":"2005-05-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["531799"],"PO":["557315"]},"102526":{"abstract":"Increasingly, intellectual content is 'born digital', as a consequence of which the digital library and digital archival communities find themselves faced with unique preservation challenges, challenges that call for comprehensive digital preservation lifecycle management processes. These processes, in turn, need to be unobtrusive, with minimal impact on content production and dissemination. In order to make it as easy as possible for content creators to preserve their content for the long-term, preservation processes should be integrated into the content production lifecycle. This project will demonstratef a software technology that will comprise such a preservation environment for a video collection that includes other related multi-media content such as audio, transcripts, annotations, related and introductory Web pages, and descriptive, technical, and rights metadata currently being captured in a FileMakerProTM database. The proposal is to take an existing video production workflow that is currently being used for producing and Web-casting video content in a small-scale studio setting, and to integrate it with a digital preservation life-cycle management process that will enable the digital content to be archived for long-term preservation. The collection, 'Conversations with History', is produced at the University of California, Berkeley, edited by University of California, San Diego TV (UCSD-TV), and broadcast and Web-cast through UCTV.<br\/><br\/>The major research and development challenge to address the development and automation of preservation processes that comprehend the accession, description, organization, and preservation of the video collection and associated content. The automation of these processes requires the integration of workflow systems that are used in active production with preservation systems, and the tracking of the execution of the preservation processes for completion and error recovery. The system will demonstrate an effective preservation methodology by 1) ensuring that preservation 'of last resort' is available for at-risk multi-media collections of critical lasting importance; 2) ensuring that preservation is available for collections that will expand and evolve over time, while managing evolution in the underlying software technologies; and 3) demonstrating a standard reference model for digital preservation lifecycle management that can be integrated into active production workflows.<br\/><br\/>INTELLECTUAL MERIT: A report from the April 2002 workshop sponsored by the NSF and the Library of Congress states 'Solutions are urgently needed to prevent further loss of valuable digital information - these problems are urgent - action is needed now, not some time in the future'. The proposed demonstration of digital preservation lifecycle management addresses this critical problem by showing that current software systems provide the required functionality, can be implemented at scale, and can preserve at-risk collections. The demonstration will show an ingestion model and collection management for multi-media material, in which preserved intellectual capital is easily accessible, and research results, educational material, and new knowledge can be incorporated smoothly over the long term. The system integrates digital library, data grid, and persistent archive technologies, with the goal of providing a fundamental building block for long-term collection management and preservation.<br\/><br\/>BROADER IMPACT: The NSF Cyberinfrastructure program, the Library of Congress National Digital Information Infrastructure and Preservation Program (NDIIPP), and the National Archives and Records Administration (NARA) Electronic Records Archive all are actively concerned with the preservation of data. The demonstration of the ability to extract material from a production environment and import the<br\/>material into a scalable preservation environment is essential for making preservation viable. The demonstration of publication, preservation, federation, and analysis will serve as a proof of preservation<br\/>concepts to a broad community including humanists, social scientists, scientists, engineers, students, and<br\/>the general public. The extension of the demonstration project into a production facility will enable other<br\/>public and at-risk digital content to be preserved. The preservation architecture will support federation of<br\/>existing digital libraries and preservation environments, enabling the expansion of the facility to all<br\/>communities. It will provide a replicable model that will demonstrate a system that can contribute to a<br\/>scalable prototype for a truly national preservation backbone.","title":"Digital Preservation Lifecycle Management: Building A Demonstration Prototype for the Preservation of Large Scale Multimedia Collections","awardID":"0456055","effectiveDate":"2005-05-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V753","name":"LIB CONGRESS-DIGITAL PRESERVAT"}}],"PIcoPI":["562621","554652",270345,270346],"PO":["371077"]},"102537":{"abstract":"This three-year award will provide a group of six U.S. graduate students and a faculty advisor from Brown University with support for annual summer research visits to the University of Paris VI (Universite Pierre et Marie Curie) and University of Paris VII. The purpose is to introduce students to mathematical research in analysis, partial differential equations, number theory and scientific computing. The summer program is led by David Gottlieb of Brown University and Yvon Maday of the University of Paris VI. <br\/><br\/>Intellectual Merit<br\/><br\/>The goal of this international research and education effort is to engage students in mathematics research within the context of active research collaborations between Brown University and French mathematicians. U.S. and French faculty members will develop programs in scientific computing (high order accuracy methods for time dependent problems), functional analysis, and number theory. <br\/><br\/>Broader Impacts<br\/><br\/>The proposed project will provide research training to graduate students and advance their careers through new connections to leading French mathematicians. Designed for second year Ph.D. students, the summer program incorporates opportunities to engage students in a wide variety of mathematics research. After this initial experience in France, U.S. students become eligible to participate in a joint Ph.D. program between Brown University and the University of Paris VI. This component is a significant and unique aspect to summer research abroad. Students continue their connections with France until completion of their Ph.D. with the possibility of maintaining their collaboration with French colleagues through their career.","title":"IRES: Research Experiences: Brown University Mathematics and Applied Mathematics Students in Paris VI","awardID":"0456114","effectiveDate":"2005-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1281","name":"ANALYSIS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["271916","271916","387213"],"PO":["564152"]},"102516":{"abstract":"Many proposed digital preservation models require personal sacrifice for public good.For example, some proposed long-term storage systems require the contribution of X megabytes of storage today for the promise of Y megabytes of persistent storage (X<<Y). Examples of such systems include the Intermemory, Freenet, Free Haven, and PAST. Despite having many theoretically attractive features, these systems have not found<br\/>widespread acceptance. While some systems require an ever-increasing user growth and participation that is more like a Ponzi (\"pyramid\") scheme than a sustainable model for preservation, the main reason is there is little immediate incentive for users to incur a personal, short-term cost for a group, long-term benefit. <br\/><br\/>Intellectual merit<br\/><br\/>This proposal fits somewhere between refreshing (copying the bits to different systems) and migration (transferring data to newer system environments). The research team will look at ways to refresh the data at new locations, but since no assumptionsare made about the target environment, the approaches to be investigated could be used for migration as well. A number of digital preservation models that rely on shared, existing infrastructure will be assessed. The premise is that if archiving can be accomplished within a widely deployed infrastructure whose operational burden is shared among many partners, the resulting system will have only an incremental cost and be tolerant of dynamic participation. The project will consider:<br\/>- network news transfer protocol (NNTP or \"Usenet news\")<br\/>- reliable IP multicast<br\/>- simple mail transfer protocol (SMTP or \"email\")<br\/><br\/>Through shared infrastructure, the individual cost for participation is kept low and aggregate system functionality is not greatly impacted by participants joining and leaving. The models primarily focus on creatively utilizing existing Internet protocols and systems in order to decrease the deployment and maintenance burden for participating organizations and will not \"automatically\" preserve data, but rather<br\/>should make it easy for those who wish to do so.<br\/><br\/>Broader impacts<br\/><br\/>Lowering the barrier for participation in preservation activities is a direct result of using shared infrastructure. Decoupling preparation and transmission from reception, storage and refreshing allows the participation of various partners, including geographically distributed, underrepresented groups and late arriving participants. Preservation can more easily be incorporated in classroom educational activities because participants can join and leave without explicit registration or direct impact on the system. Current preservation systems, such as LOCKSS, can be discussed in the classroom, but they do not lend themselves to pedagogical participation in the \"live\" system. Similarly, organizations can now view preservation opportunities (and associated costs) as a continuum and not a binary choice of \"doing\" or \"not doing\" preservation.","title":"Shared Infrastructure Preservation Models","awardID":"0455997","effectiveDate":"2005-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V753","name":"LIB CONGRESS-DIGITAL PRESERVAT"}}],"PIcoPI":["527258","478206"],"PO":["371077"]},"108907":{"abstract":"The proposed research is to develop a new actuation methodology well suited for the emerging generation of robots conceived to operate in human environments, and to conduct a comprehensive experimental study of validation and evaluation of the distributed macro mini actuation (DM2) methodology from the point of views of safety and performance. The methodology of DM2 addresses both the safety and performance characteristic of a robot. The DM2 approach employs a pair of actuators, connected in parallel and distributed to the different joints of the robot. The effective inertia of the overall robot is substantially reduced by isolating the reflected inertia ofthe actuator while greatly reducing the overall weight of the manipulator. Performance is maintained with small actuators collocated with the joints. The key novelty in this approach lies in an actuation synthesis that introduces, in addition to the conventional analysis of continuous torque magnitude needs, the actual requirements in actuator frequency responses in robot control. Of particular interest is the analysis of impact forces in a three dimensional collision between a robot and its surroundings. Two safety standard measures will be used to quantify the improvement in safety in terms of reduction of impact force. In addition, the robot performance characteristics will be evaluated against traditional low-impedance design.<br\/><br\/>The effort proposed in this project has the potential to greatly contribute to accelerating the research and technology development in various aspects and application areas of human-friendly robotics. Such applications include robotic prosthetic and assistive devices, as well as traditional areas of robotic assembly and automation. This area can be expanded to environments and tasks, which require close human-robot interaction, greatly increasing the range of manufacturing and assembly tasks available for robotic augmentation. Finally, complex systems, such as human-like robotic systems, will require inherent safety to be acceptable to the public at large. The research activities and much of the underlying analysis and concept validation in this project will provide an important training and development opportunities to graduate students and during the summer quarter to undergraduate students as part of university sponsored summer research programs. Educational and outreach opportunities are provided through the Stanford Robotics Laboratory. The research results and hardware demonstrations are presented as part of formal course work at Stanford as well as part of the Laboratory outreach efforts to alumni, industry, and secondary school organizations.","title":"SGER: Experimental Validation of a Human-Friendly Robot Testbed","awardID":"0531297","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["562786","457716"],"PO":["335186"]},"107708":{"abstract":"The proposal requests NSF support for a limited scope NSF workshop on this topic, in the style of<br\/>other NSF workshops in targeted areas of emerging interdisciplinary research. The goal of the <br\/>proposed NSF workshop on Programmed Self-Assembly will be restricted to study (rather than conduct <br\/>new research) the research challenges, applications, and opportunities to NSF in the areas of Self-Assembly with respect to Self-Assembly methods that allow for Programmability.<br\/><br\/>Intellectual Merit<br\/>Self-assembly is a key emerging interdisciplinary topic of essential importance to<br\/>existing programs within NSF, and would be very positively impacted by a workshop<br\/>centering on the (largely until now unexplored) topic of Programmed Self-Assembly. The<br\/>proposed workshop will consider scientific challenges to developing Self-Assembly<br\/>methods that relate to or utilize computational methods, provide programmability and are<br\/>applied to scales ranging from molecular to micro to even larger scales.\\<br\/><br\/>Broader Impact <br\/>This NSF workshop will be interdisciplinary at its core, with participants from<br\/>Chemistry, Biochemistry, Physics, Material Science, Electrical Engineering, Computer<br\/>Science, and Mathematics. It will impact both the research community in Nanoscience as<br\/>well as other disciplines engaged in the study of self-assembly at larger scales. It will also<br\/>benefit the NSF to allow for the identification of targeted research opportunities and<br\/>challenges. To insure involvement by graduate students, a number of their travel and<br\/>local expenses will be supported. The PI and his institution Duke University purely as a<br\/>service make the proposal to the community - there will no overhead charged on any<br\/>aspect of this Workshop.","title":"EMT: NSF Workshop on Programmed Self-Assembly","awardID":"0523558","effectiveDate":"2005-05-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["550822"],"PO":["521045"]},"100914":{"abstract":"CAREER: Vertically Integrated Program Analysis for Embedded Software<br\/><br\/>In recent years, a great deal of progress has been made towards tool<br\/>support for developing embedded software. Tools solve a variety of<br\/>difficult problems, for example by automating error-prone<br\/>implementation tasks, by eliminating redundant and inefficient<br\/>constructs, and by guaranteeing the absence of certain classes of<br\/>errors, such as race conditions or out-of-memory exceptions. This<br\/>NSF CAREER research is about Vertically Integrated Program Analysis and<br\/>Transformation (VIPAT), a new way to look at embedded software tools:<br\/>as a collection of building blocks that can be connected together in<br\/>different ways to support novel analyses and transformations. The<br\/>existing tools become mechanisms that are controlled by a high-level<br\/>policy. VIPAT is based on two main ideas. First, the vertical<br\/>integration of tools that operate at various levels of abstraction,<br\/>which permits high-level transformations to be precisely targeted at<br\/>parts of a system whose low-level resource usage is worst. Second, a<br\/>clean separation between mechanism and policy, enabling effective<br\/>reuse of existing tools in new situations. This research is a step<br\/>towards a world where meaningful static guarantees about program<br\/>behavior can be made, and where software can be automatically<br\/>specialized to meet platform- and application-specific requirements<br\/>such as time and energy constraints. The high-level vision is<br\/>\"fearless reuse\": developers should spend less time worrying about<br\/>resource usage and potential failure modes of components that they<br\/>reuse.","title":"CAREER: Vertically Integrated Program Analysis for Embedded Software","awardID":"0448047","effectiveDate":"2005-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["550238"],"PO":["561889"]},"98071":{"abstract":"Logic is the mathematics of choice for describing and reasoning about digital systems. The mechanized application of logic to artifacts of practical importance is still in its infancy and will ultimately represent a major development in the history of applied mathematics and computer science. This research aims to (a) increase the automation and scalability of a particular mechanical theorem-proving system (ACL2), (b) demonstrate how such a system allows an untrusted contractor to deliver a trusted artifact, and (c) produce a trustworthy, industrial-strength certification tool.<br\/><br\/>The work will enable untrusted contractors to deliver relatively isolated but still-critical software packages. As more infrastructure is codified, larger hierarchical trusted systems can be built with this paradigm. The work further automates the validation process and will lower the effort required to attain high assurance that a delivered system meets specified requirements. Undergraduate and graduate teaching of this technology continues to enlarge the formal methods workforce. ACL2 is freely distributed at the source-code level, with extensive documentation, and annual workshops are held to distribute the community's acquired knowledge.","title":"Trusted Certification Tools","awardID":"0429591","effectiveDate":"2005-05-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T508","name":"DARPA-CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T951","name":"DARPA - CYBER TRUST PHASE III"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V901","name":"DARPA-NSF CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V933","name":"DARPA-CYBER TRUST PROGRAM"}}],"PIcoPI":["428590","503869"],"PO":["529429"]},"100927":{"abstract":"In sensor networks comprised of energy- and complexity-limited inexpensive sensors, the underlying information field is distributed, endowed with certain dynamics in terms of physical movement (for example: seismic, acoustic waves traveling over a geographical region) and delay-sensitive that warrant real-time reconstruction. Further, in such multi-terminal settings, ``bit'' is not the universal currency of information, as the separation of multiuser compression and communication is sadly suboptimal. In this<br\/>project these two issues are addressed by considering a new dynamic compression model and a new multi-partite graph-based architecture for distributed transmission of delay-sensitive information.<br\/><br\/>In this new compression model the information available at certain nodes is changing as a function of time. This model is referred to as source coding with feedforward. This induces a completely new dynamism in<br\/>the information compression problem. Further, in the architecture for transmission of distributed information considered in this project, multi-partite graphs are used as a discrete interface between distributed compression and distributed communication. This leads to a modular design of multi-terminal sensor-based information processing systems. Using these mechanisms, the goal of this project is to <br\/>realize a self-organizing sensor network enabled with a new architecture that is capable of performing more efficient representation, communication and real-time reconstruction of distributed and delay-sensitive complex information fields than possible by any system today. This research effort is complemented by an educational effort to train young engineers to become skilled in construction, management and development of such massively complex information systems. The specific issues considered in this project are development of project work in the courses, integrated undergraduate education and research effort, and curriculum development with a course on distributed signal processing and communication.","title":"CAREER: New Architectures for Distributed Compression and Communication of Delay-Sensitive Information in Sensor Networks","awardID":"0448115","effectiveDate":"2005-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["485560"],"PO":["564898"]},"109140":{"abstract":"This award supports the travel, subsistence and registration expenses of 25 student participants in the Fourth International Joint Conference on Autonomous Agents and Multi-Agents Systems (AAMAS), being held July 25-29, 2005 in Utrecht, the Netherlands. This conference is entirely devoted to all aspects of research and application of agents technology, an important area of computer science research in domains such as information retrieval, user interfaces, electronic commerce, robotics, computer mediated collaboration, computer games, ubiquitous computing, social simulation, education, and training. Participation in this conference will allow a diverse group of students, representing a wide range of research areas and methodologies, to present their research to the agents' community. In addition, special mentoring activities are planned for them.","title":"AAMAS-05 Student Travel Grant; July 25-29, 2005; Utrecht, the Netherlands","awardID":"0532590","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["362927"],"PO":["564456"]},"98057":{"abstract":"0429505<br\/>Stephen D. Brookes<br\/>CMU<br\/><br\/>A Resource-Sensitive Framework for Concurrent Programs<br\/><br\/>This project will develop a trace-theoretic denotational semantic framework and a concurrent form of separation logic, for compositional reasoning about the behavior of concurrent programs which share access to mutable state. Such programs are widespread, for instance in Java applications. Pointers are difficult to reason about, and concurrency makes the problem harder. Unlike previous models, our semantics will detect the potential for races, such as an attempt by one process to write on a piece of state used by another<br\/>process. Races cause unpredictable, possibly irreproducible, behavior, and our semantics will treat a possible race as a catastrophe. This semantics will be used in validating logics and advancing methodologies for the design of correct race-free parallel programs.","title":"A Resource-Sensitive Semantic Framework for Concurrent Programs","awardID":"0429505","effectiveDate":"2005-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["451067"],"PO":["564388"]},"95396":{"abstract":"This project will extend previous work on a decision theoretic approach for designing satisficing multiagent systems so that it is practical to apply the approach to large-scale, real-world sensor networks. The approach is based on distributed Bayesian networks and decentralized Markov decision processes. In terms of intellectual merit, this research addresses a critical need for formal techniques to support the design of multiagent systems. Approximate, satisficing approaches can reason about the appropriate tradeoffs between information quality and resource usage and, thus, reduce barriers to building large-scale sensor networks, as well as other large-scale multiagent systems. In terms of broader impact, the project could ultimately have a substantial positive societal impact by encouraging the development of sophisticated, large-scale sensor networks. Such large-scale sensor networks have numerous military and civilian applications. They can be used to enhance security and safety, as well as to make computerized systems more autonomous and flexible.","title":"Collaborative Research: Distributed Interpretation in a Communication-Limited Environment","awardID":"0414945","effectiveDate":"2005-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[250152],"PO":["564456"]},"108294":{"abstract":"IIS-0527109<br\/>Ben Shneiderman <ben@cs.umd.edu><br\/>University of Maryland - College Park <br\/>Creativity Support Tools Workshop <br\/><br\/>The Workshop on Creativity Support Tools, to be held in June 2005, focuses on the discussion of the design of software tools that promote, accelerate, and facilitate creativity in sciences, engineering, medicine, knowledge work, humanities research, the arts, and beyond. The workshop will bring together 25 - 30 leading researchers from various relevant disciplines such as computer science, information systems, and psychology from academic, corporate and government research programs, and will also include artists, architects and other creative individuals. The intellectual merit of this workshop and ensuing work is the common understanding how the various constituent groups can work together to (1) accelerate the process of disciplinary convergence, (2) promote rigorous research methods, and (3) increase the ambitiousness of research programs. The broader impact of the workshop stems from the fact that creativity is a key determinant of scientific, engineering, medical, cultural, and economic advancement. Therefore, improved creativity support tools are likely to bring benefits to many fields, and can raise the pace and quality of creative work in many areas. Workshop results will be distributed via the workshop web site (http:\/\/www.cs.umd.edu\/hcil\/CST) and publications in relevant newsletters, journals and conferences.","title":"Creativity Support Tools Workshop","awardID":"0527109","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["527292"],"PO":["563751"]},"108581":{"abstract":"This is funding to support this year's student design competition (SDC) which will be part of the 25th annual RESNA conference to be held June 23-27 in Atlanta, Georgia. RESNA is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. Comprised of over 1,000 individual and 200 institutional members - researchers, manufacturers, clinicians, suppliers, professionals and end-users of technology devices and equipment - the organization has as its purpose to improve the health and participation of people with disabilities in mainstream society. To this end, RESNA supports those individuals engaged in research, development, education, advocacy and the provision of technology through a number of programs and activities, which in addition to the annual conference include a credentialing program for assistive technology practitioners, suppliers and rehabilitation engineering technologists, as well as sponsored projects. RESNA serves as the ANSI-designated national body for development of voluntary standards for products used by persons with disabilities.<br\/><br\/>The first Student Design Competition (SDC) was held in 1980 as part of the inaugural RESNA conference. Since then, a total of 120 designs have been identified as winning entries, chosen from over 500 submissions by students from over 100 different universities. Many of the student designers are now leaders in service, research, and educational areas related to technology for people with disabilities. Partial support for past SDC has been provided by nationally recognized disability organizations such as Easter Seals and Paralyzed Veterans of America, as well as by a subsidiary of the Johnson & Johnson Company. NSF funding will enable this year's competition to be significantly expanded and enhanced, to include more entries and support for more design teams, including those from minorities, women, and individuals with disabilities. A call for participation will be sent out to major colleges and universities with engineering and design schools, including Historically Black Colleges and Universities. Undergraduate and graduate students are eligible to submit entries. A team of 5 judges will pre-select entries with the final selections made at the RESNA Conference. Fifteen teams will be invited to attend the conference with 5 teams ultimately selected as the final winners. A half-day session will be held in which the 15 teams will make presentations before the judges and public audience at the conference. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. Judges will make final decisions based on criteria using numeric scoring. After the judging contest, students will have an opportunity to exhibit and talk about their projects at the Exhibit Hall opening. <br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a unique forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. In its new and expanded format, the SDC will now be even better positioned to foster innovation and creativity, with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. Unique in its primary focus on undergraduates, the event will provide participants with experience and skills that assist them to be successful in their engineering and design careers, and will further encourage, support and mentor students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields.","title":"Student Design Competition - Technology for People with Disabilities","awardID":"0528607","effectiveDate":"2005-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["559082"],"PO":["565227"]},"99415":{"abstract":"CCF-0438806<br\/>Jeffrey Mark Siskind<br\/>Purdue University<br\/>Algorithmic Differentiation of Functional Programs<br\/><br\/><br\/>Automatic Differentiation (AD) is an established enterprise that seeks to take the derivatives of functions specified as imperative programs through symbolic manipulation rather than finite differencing. A framework for applying AD techniques to modern functional-programming languages, instead of imperative<br\/>programs, will be investigated. This framework will treat AD operators as higher-order functions that map function objects to function objects. These operators will be compositional and will apply to more general functions than the maps between real vectors to which traditional AD transformations are limited. This framework offers several advantages:<br\/><br\/>- a callee can perform the necessary AD rather than insisting that callers provide appropriately transformed functions, making it practical to compositionally build an efficient library of functions based on derivatives <br\/>- higher-order derivatives can be constructed naturally, without special mechanisms<br\/>- gradients can be taken through processes that themselves involve AD-based optimization or approximate iterate-to-fixedpoint operators such as PDE solvers<br\/><br\/>The proposed work will have broad impact in such diverse fields as engineering design, scientific computing, and machine learning, where researchers regularly need to take derivatives of complex programs. It has intellectual merit as it offers a novel synthesis of the differential calculus with the lambda calculus.","title":"SoD: Algorithmic Differentiation of Functional Programs","awardID":"0438806","effectiveDate":"2005-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":[262219],"PO":["564388"]},"109850":{"abstract":"This award will help to support a workshop on nanoscale forces and interfacial phenomena to be held in Cancun, Mexico around January 2006. Organized by Dr. Norma Alcantar of the U. of South Florida and Dr. Phillip A Pincus of the U. of California-Santa Barbara, together with international partners Dr. Tomas Viveros of the Universidad Autonoma Metropolitana in Iztapalapa, Mexico, Dr. Suzanne Giasson, of the University of Montreal, and Dr. Roger Horn of the University of South Australia, the workshop will involve representatives from approximately 42 universities worldwide and international student participation. <br\/><br\/>The meeting will bring together scientists that are international leaders in measuring and analyzing surface forces and interfacial phenomena to provide a substantive training experience for students, postdoctoral researchers and investigators who are at early stages in their career. It will feature a discussion of critical issues facing colloid and interface science. Students and postdoctoral researchers will present their work in poster sessions. Ultimately, the workshop aims to foster collaborations at multiple levels (interdisciplinary and internationally) to attack complex problems that connect the nanoscale world to the macroscopic world. The Office of International Science and Engineering and the Directorates of Engineering and Mathematical and Physical Sciences are sharing in the funding of this activity.","title":"U.S.-Mexico Workshop: Bridging Nanoscale Forces and Interfacial Phenomena to the Macroscopic World; Mexico; Cancun, Mexico, January 2006","awardID":"0537115","effectiveDate":"2005-05-24","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}}],"PIcoPI":["528317"],"PO":["531406"]},"106055":{"abstract":"A fundamental problem in science and technology concerns the recovery of an object---a digital signal or image---from incomplete measurements. The examples of such situations are numerous, ranging from the sampling of continuous signals in signal processing, to the measurement of the two-dimensional frequency spectrum of an image as in biomedical imaging. In Magnetic Resonance Imaging (MRI) for instance, one would like to reconstruct high-resolution images from heavily undersampled frequency data as this would allow image acquisition speeds far beyond those offered by current technologies. In all these applications, there are many more unknown signal values than available observations, a situation which a priori seems desperately hopeless.<br\/><br\/>In many instances, the object we wish to recover is known to be structured in the sense that it is sparse or compressible. This means that the unknown object depends upon a smaller number of unknown parameters, with only a few significant entries in some fixed representation. This premise radically changes the problem, making the search for solutions feasible. The research involves a systematic effort to exploit and extend a mathematical breakthrough which shows that it is surprisingly possible to reconstruct such signals<br\/>accurately, and sometimes even exactly, from a limited number of measurements. There are three main outcomes: the development of a coherent and comprehensive knowledge of what can and cannot be<br\/>expected from reconstruction strategies based upon incomplete information; the development of flexible and convenient algorithms able to handle large scale problems; the deployment of the resulting new concepts and tools into targeted applications. The initial applicative focus is in the field of Magnetic Resonance angiography, and on the design of a brand new generation of encoding schemes.","title":"Signal Recovery from Highly Incomplete Data","awardID":"0515362","effectiveDate":"2005-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["438963","565105"],"PO":["564898"]},"105132":{"abstract":"This award supports a workshop that will extend discourse on learning in communities. The goal is to bring together a wide range of perspectives and approaches to learning in communities to articulate the state of the art and to define an agenda for research and technology infrastructures. The current discourse on community learning encompasses communities of practice, learning communities, community networks, communities of interest, learning organizations, learning-by-doing, cognitive apprenticeship, subjugated learning, collaborative\/cooperative learning, situated cognition, design as inquiry, knowledge management, lifelong learning, informal learning, case-based learning, and learning cultures. Workshop papers will constitute a special joint issue of the Journal of Computer-Supported Cooperative Work and the Journal of Computer-Supported Collaborative Learning.","title":"Workshop on Learning in Communities; August 15-17, 2005; University Park, PA","awardID":"0511198","effectiveDate":"2005-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["549541"],"PO":["564456"]},"95358":{"abstract":"This project will extend previous work on a decision theoretic approach for designing satisficing multiagent systems so that it is practical to apply the approach to large-scale, real-world sensor networks. The approach is based on distributed Bayesian networks and decentralized Markov decision processes. In terms of intellectual merit, this research addresses a critical need for formal techniques to support the design of multiagent systems. Approximate, satisficing approaches can reason about the appropriate tradeoffs between information quality and resource usage and, thus, reduce barriers to building large-scale sensor networks, as well as other large-scale multiagent systems. In terms of broader impact, the project could ultimately have a substantial positive societal impact by encouraging the development of sophisticated, large-scale sensor networks. Such large-scale sensor networks have numerous military and civilian applications. They can be used to enhance security and safety, as well as to make computerized systems more autonomous and flexible.","title":"Collaborative Research: Distributed Interpretation in a Communication-Limited Environment","awardID":"0414711","effectiveDate":"2005-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["485591"],"PO":["564456"]},"109114":{"abstract":"The University of Illinois at Urbana-Champaign was funded to hold two informational meetings on the new CISE Broadening Participation in Computing (BPC) initiative. In order to have the most impact, BPC aims to build broad Alliances of institutions and organizations that will design and carry out comprehensive programs that address underrepresentation in the computing disciplines. These Alliances will join academic institutions of higher learning with secondary schools, government, industry, professional societies, and other not-for-profit organizations. The purpose of these meetings is provide participants with information about the program, and to enable them to meet for dissemination of information about successful programs and to establish connections that will lead to the formation of larger Alliances. The first meeting is an in-person meeting on April 13, 2005 in Baltimore, MD and the second is an Access Grid, virtual meeting on April 20, 2005.","title":"Workshop:Informational Meetings on Broadening Participation in Computing and General NSF Proposal Guidelines","awardID":"0532419","effectiveDate":"2005-05-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["320601"],"PO":["561855"]},"108884":{"abstract":"This is funding to support approximately 40 attendees in a workshop to be held at the University of Maryland Inn and Conference Center on April 14-15, 2005. Participants will be a mixture of researchers who are developing representations of the semantics of a text, and those developing applications such as machine translation and summarization systems, as well as knowledge-based inferencing and analysis applications such as Social Network Analysis. The goal of the meeting is to create a representation that would serve as input to these applications. Workshop participants will model the problem as an extended exercise in extracting information elements from a \"document\" (that is, from language communication which may have been written or spoken). There are two broad questions that attendees hope to answer: (a) what are the elements of knowledge that can be derived from a document, and (b) can the representation, and hence, the annotation, be laid out in terms of iterative layers, the accumulation of which would represent the sum of the knowledge? Thus, the workshop outcome will be creation of a \"road map\" for building up representations over the long term, which will get richer as the community learns to exploit more of the information content.<br\/><br\/>Broader Impacts: The government has an interest in using a unified representation rather than a set of individual representations. The Intelligence Community, DARPA, and NSF have funded a number of efforts towards the annotation of meaning representations in the past few years; this workshop is an attempt to pull this expertise together to produce a unified approach.","title":"Semantic Annotation Planning Meeting","awardID":"0531176","effectiveDate":"2005-05-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["334102"],"PO":["565227"]},"108984":{"abstract":"This award supports a workshop that will set the foundations for the next phases of large-scale, multi-agent systems research from two directions. First, it will build on strengths, specifying the most critically needed and most promising new, integrative theories, models, and practices for designing and implementing large-scale distributed systems, by extending multi-agent paradigms. Second, it will explore new directions, visions and models for post-multi-agent systems in very large interconnected networks and infrastructures. The aim of the workshop is to develop a 10-year research plan for multi-agent systems.","title":"International Workshop on Research Directions in Multiagent Systems","awardID":"0531746","effectiveDate":"2005-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["503214"],"PO":["564456"]},"106146":{"abstract":"The University of South Florida is funded to support a workshop on increasing the participation of persons with disabilities in Computer Science education and research. Participants will include Computer Science researchers with disabilities, people with experience in working with students with disabilities, and people working on assistive technology. Participants will discuss a variety of issues including priorities for students, current legislation, partnering with existing organizations, awareness, training for educators, and overcoming low expectations and confidence. This workshop ties in well with the new CISE initiative on Broadening Participation in Computing (BPC).","title":"Broadening Participation: A Workshop to Foster Participation of Disabled Persons in Computer and Information Science and Engineering","awardID":"0515808","effectiveDate":"2005-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[280018,"365324"],"PO":["561855"]},"95349":{"abstract":"Many people have always wanted machines to talk to them, but most have strong preferences for particular voices. Current techniques in speech synthesis can build voices that sound very close to the original speaker, capturing the style, manner and articulation of the source voice. However such systems require many hours of carefully recorded speech and expert tuning to reach an acceptable level of quality. An exciting new alternative method for building synthetic voices is voice transformation. This method uses an existing recorded database and converts it to a target voice using as little as 10-20 sentences. This technique offers the potential to make speech synthesizers talk in whatever voice desired, with significantly less effort required than previous techniques.<br\/><br\/>This project offers a new direction in voice transformation. Current transformation techniques concentrate on a spectral mapping of the voice, i.e., converting the properties of the speech signal. Instead we use the underlying positions of the vocal tract articulators (i.e., the position of the teeth, tongue, lips, velum), which give rise to the spectral output of the voice. Using new statistical modeling techniques we can successfully predict the positions of a speaker's articulators from the speech signal. Then in the virtual vocal tract domain map between speakers and regenerate the speech for the target voice.<br\/><br\/>This work enables the easy construction of new synthetic voices allowing personalization of speech output. It increases our knowledge of the speech generation process and characterizes what make a voice personal.","title":"TRANSFORM: flexible voice synthesis through articulatory voice transformation","awardID":"0414675","effectiveDate":"2005-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["396893"],"PO":["565215"]},"102043":{"abstract":"This award supports an REU program at Texas Christian University (TCU), which would involve 4-6 undergraduate students in 10 weeks of workshops and research in Physics or Astrophysics. The inclusion of astrophysics is the first of its kind in Texas. The main goal of the program is to provide a memorable and potentially career-defining experience for student participants. The TCU REU program will include: (1) final oral research presentations by participants to other students and faculty of the College of Science and Engineering; (2) final written student research reports to be posted on the TCU REU web page; (3) Friday afternoon discussions in which all the students and mentors meet to discuss their weekly progress; (4) field trips to local high-tech industries; and (5) a series of talks about \"Ethics in Science\", and workshops on research presentations and career planning. The expectation is that participants will give post-summer presentations of research at a professional science conference. Follow-up data on career paths and graduate school admissions will be collected from participants having completed the program as part of an effort to sustain relationships between mentors and participants. TCU has a reputation for providing a nurturing learning environment with a low student-to-faculty ratio. The targeted participant of the REU program is the \"research-deficient\" individual who may otherwise never have considered participating in a research program, due to lack of opportunity, intimidation, etc. To inform and encourage such students to apply to the program, recruiting efforts will be focused on regional colleges and universities which either offer limited or no undergraduate research opportunities (such as community and 4-year colleges), or which have a large minority student population. Existing connections with local universities in the latter category will facilitate the ability to recruit minority students. Aggressive recruiting efforts will help develop and nurture lasting relationships with the local university community, resulting in a strengthening of the infrastructure for research and education in the North Texas region. This award is co-funded by the Divisions of Physics and Materials Research.","title":"A Physics and Astrophysics REU Site at TCU","awardID":"0453577","effectiveDate":"2005-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"7222","name":"OFFICE OF SPECIAL PROGRAMS-DMR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["564111","394467",268998],"PO":["561720"]},"105256":{"abstract":"The PI hypothesizes that communication between the deaf and hearing communities can be augmented through the use of a mobile one-way sign language translator. His preliminary prototype of such a translator, dubbed Telesign, uses a body-worn computer, a speaker in the brim of the hat, a head-up, hands-free micro-display for user feedback and editing, and a variety of sensors (e.g., a camera embedded in the user's hat, wireless accelerometers worn in wristbands, and the Acceleglove accelerometer\/potentiometer system). His first step in this project will be to compare different methods of communication between a deaf and hearing (non-signing) individual - including writing (current practice), typing on mobile devices, a gesture driven sign-by-sign one-way translator, and a phrase-level one-way translator - both to provide a measure for the performance obtained with existing communication technologies and to establish the baseline for future evaluation of Telesign. These methods will be evaluated by speed (propositions conveyed per second and time to task completion), perceived workload (NASA Task Load Index), and clarity of English generation. The PI will then significantly extend the Telesign prototype, by bringing speech recognition techniques to bear on sign language recognition by adapting his Georgia Tech Gesture Toolkit (GT2K), a publicly available hidden Markov model (HMM) toolkit for gesture recognition, for these tasks. The PI will also research sensing techniques, such as visual tracking of the hands in a mobile environment, in order to create reasonable prototypes for sign translation testing over an extended time. Finally, the PI will define research-grade tasks that can be used to evaluate the performance of computer enhanced communication aids for the deaf (both existing techniques and the new improved Telesign system).<br\/><br\/>Broader Impacts: Everyday communication with the hearing community poses a major challenge to the millions of people with hearing loss. Most hearing people do not know sign language, and know very little about deafness in general. This project attempts to lower the communication barrier between the deaf and hearing populations, by researching aids for language production. However, everyday use of a successful communication aid may also help a signer learn more about the structure of written and spoken English, in much the same way that everyday interactions help students learn a foreign language. This research couples Georgia Tech students with consultants and subjects from the Atlanta Area School for the Deaf (a K-12 state school), exposing some of the nation's top student engineers and scientists to the deaf community, and vice versa. Deaf academics and native signers from the deaf community will be recruited actively as members or the research team, which will also help disseminate the research as it becomes viable.","title":"Telesign: Towards a One-Way American Sign Language Translator","awardID":"0511900","effectiveDate":"2005-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["517810"],"PO":["565227"]},"109117":{"abstract":"The growth of the Internet has led to rapid developments in network servers for services such as web content, streaming media, and networked storage. Network servers provide data in many different forms to end-users. Thus their input\/output (I\/O) units are critical to performance. However, there is a bottleneck in the communication interfaces between the host CPU and the I\/O. This causes inefficiencies at both the hardware and software levels. The goal of this research is to improve these communication interfaces to allow server performance to scale with network links of 10 Gigabits per second and beyond.<br\/><br\/>This approach utilizes network processors and programmable network interfaces to streamline data communication in network servers. While modern host CPUs have exploited instruction-level parallelism (ILP) and data caches to improve performance, tasks such as TCP\/IP networking are not known to be well suited to these techniques. In contrast, the streaming data and connection-level concurrency of TCP\/IP maps naturally to the cacheless, multithreaded and multiprocessor cores of network processors, motivating the offloading of a high-performance TCP\/IP network stack to such devices. Cooperative computation and storage between the host CPU and the network interface also allows for copy-avoidance on network receive and for reducing costly interrupts by offloading TCP protocol processing from the host to the network interface. The new workloads developed during this research also motivate system-level architectural enhancements for both the host processor and the network processor.<br\/><br\/>All software and tools produced through this research will be transferred to the community through open-source distribution. The results of the research are being introduced into courses targeted at freshmen and sophomores to introduce systems-level concepts in computer engineering starting from basics such as bits and transistors and culminating in micro-architecture and systems topics.","title":"CAREER: Streamlining Data Communication in Network Servers","awardID":"0532448","effectiveDate":"2005-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["517389"],"PO":["550859"]},"105740":{"abstract":"This one-year SGER project will explore mathematical models for the application of structure from motion methods to acoustic video imagery. Computer sonar processing has been dominantly limited to classical single frame methods for scene\/target detection, segmentation, classification and identification by exploiting 2-D texture or object\/shadow shape cues. Little, if any, work has explored the potential use of multiple views for 3-D target reconstruction, which is becoming rather important as high-frequency acoustic cameras producing high-resolution video in low visibility conditions are becoming increasingly more available. The specific goals are to explore sonar projection and motion models in the formulation of various 3-D shape and motion estimation methods, derivation of model-based solutions, identification of some promising approaches for devising computer video analysis and interpretation techniques, and more generally developing a better understanding of the complexities in the processing of sonar data. The research project's broader impacts comprise establishing the foundation to realize critical capabilities in automated underwater mapping, image-based positioning and navigation of<br\/>unmanned underwater vehicles, vehicle guidance and control, target classification and recognition, etc., eventually enabling more effective and efficient day-today deployment of underwater imaging platforms for a range of diverse applications, including benthic scientific research and exploration. Furthermore, technical developments will lead to 1) enhancing the sonar video technology for optimum performance as predicted by analytical results, and 2) promoting collaboration between vision and sonar communities with more diversified approaches that are necessary to establish sonar video processing as a more mature discipline.","title":"SGEER: Exploratory Research on Analyzing Forward-Scan Sonar Video Imagery by Computer Vision Techniques","awardID":"0513989","effectiveDate":"2005-05-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":[279003],"PO":["317663"]},"108733":{"abstract":"PROPOSAL TO SUPPORT STUDENT ATTENDANCE AT THE ACM SYMPOSIUM ON SOLID AND PHYSICAL MODELING<br\/><br\/>Abstract<br\/><br\/>In June 2005, MIT is hosting and co-sponsoring the International Convention on Shapes and Solids (website: http:\/\/deslab.mit.edu\/SM-SMI-2005\/). This Convention comprises two prestigious symposia that are being held consecutively, namely, the annual Solid and Physical Modeling Symposium (June 13-15), and the annual Shape Modeling International Conference (June 15-17). The first of these conferences, the ACM Symposium on Solid and Physical Modeling (SPM '05), website http:\/\/www.solidmodeling.org\/spm.html, is the subject of this proposal. It is co-sponsored by the Association for Computing Machinery Special Interest Group on Computer Graphics (ACM SIGGRAPH) and is an annual international forum for the exchange of recent research in applications of spatial modeling and computations in design, analysis and manufacturing, as well as in emerging biomedical, geophysical and other areas. The second conference, the IEEE International Conference on Shape Modeling and Applications (SMI '05), website http:\/\/www.shapemodeling.org\/, is co-sponsored by the Institute of Electrical and Electronic Engineers Computer Society (IEEE-CS) and provides a forum for the dissemination of new computational techniques for modeling and processing digital representations of shapes and their properties to a diverse community of experts across a wide range of areas. The two conferences have an excellent international reputation and they attract very high quality papers.","title":"Support for Student Attendance at the ACM Symposium on Solid and Physical Modeling; June 13-15, 2005; Cambridge, MA","awardID":"0529916","effectiveDate":"2005-05-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["317581"],"PO":["532791"]},"108700":{"abstract":"This is funding to support a doctoral consortium for 10-14 promising graduate students from the United States, along with distinguished research faculty, and up to 5 non-U.S. students (who will be invited to participate without financial support), which will take place in conjunction with the 2005 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC'05), to be held September 21-24 in Dallas, Texas, and sponsored by the IEEE Computer Society. Our society has evolved into two distinct classes: the information haves and have-nots. Recent advances in mobile computing and multi-sensory technologies provide great opportunities for reducing the gap between the haves and have-nots by enhancing access to information technology for the latter group, but there are significant challenges as well. Only if computers, hand-held devices, and the Web are easily accessible by all will universal end-user programming be possible. But easy access implies a need to look beyond traditional keyboard and mouse interaction styles. Thus, the focus of this year's VL\/HCC doctoral consortium, the third to be funded by NSF in this series, is on how designers of digital devices and environments can better address universal access issues through multiple modes of interaction. Participants in this event will explore multimodal and multimedia interaction between human and computers, between human and the Web, and between human and human. The event will bring together and build community among young researchers working on different aspects of the research problem, whether their \"home\" research community is in computer science, sociology, or education. The workshop will emphasize to attendees (both the graduate students immediately involved and general conference participants) the crosscutting nature of research relevant to this pressing research problem, which has received too little prior attention. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Extended abstracts of the students' work will be published in the conference proceedings, which has wide print and electronic distribution. The conference steering committee will evaluate the workshop outcome, and the results will be made available to the organizers of possible similar future events.<br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other.","title":"WORKSHOP: VL\/HCC'05 Doctoral Consortium","awardID":"0529723","effectiveDate":"2005-05-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":[287416],"PO":["565227"]},"101001":{"abstract":"NSF-0448502<br\/><br\/>Samudrala, Ram<br\/>University of Washington<br\/><br\/>This integrated platform consists of a \"hands-on \"protein modelling course at the University of Washington,a web-based \"graded \"protein modelling tutorial and course,and a collaborativ e .ort to evaluate the e .ectiveness of modelling software in teaching the principles of protein structure.<br\/>Understanding how protein sequence determines tertiary structure is one of the fundamental unsolved problems in molecular biology. The approach combines knowledge about known pro-<br\/>tein structures using rigourous statistical frameworks as well as the physics of the interactions that occur within proteins to provide insight into this process.The development of automated algorithms and tools to predict structure from sequence will complement the existing structural genomics projects,aid in functional studies of proteins important for human health and socio-economic development,and will be of use to the general research community to pose and answer ever more precise biological questions.The resulting publicly available resource will become an integral part of any biologist 's workbench for both research as well as learning and teaching.<br\/><br\/>Development of automated algorithms for protein structure prediction requires<br\/>expertise in several scienti .c disciplines,including computing science,mathematics,physics,chemistry,and biology.The problems that need to be solved generally involve exploration of large search spaces and finding objects of interest within those spaces,as well as managing the large amount of data produced and making predictions from analysis of the data.The research has significance in not only answering biological<br\/>questions,but is also relevant for solving problems of a similar nature in other scientific disciplines.","title":"CAREER: Accurate and Automated Protein Structure Prediction","awardID":"0448502","effectiveDate":"2005-05-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[266389],"PO":["565136"]},"102013":{"abstract":"The REU in the Machine Intelligence Laboratory (MIL) in the Department of Electrical and Computer Engineering at the University of Florida (UF) will focus on the design and construction of autonomous robots and machine learning. The student activity builds on the success of our previous REU sites, our NSF-ILI sponsored Intelligent Machines Design Laboratory (IMDL), and the research activities of the MIL. Our undergraduate activities have resulted in large numbers of undergraduate-authored research papers, future graduate thesis topics, and concepts for potential consumer-friendly robotic products. Each of the twelve undergraduate participants will design and construct two autonomous robot platforms: one personal robot (which the participant can take back to their home institution) and a larger autonomous platform as a part of a group project. Participants will study, research, develop and test machine learning algorithms by implementing them in their two autonomous agents. REU participants will be carefully guided by two faculty members and a graduate teaching assistant in the process of development and testing of novel machine learning paradigms, propelling them into the midst of state-of-the-art research in autonomous robots and machine learning.","title":"REU Site: Research Experience in Design and Construction of Autonomous Robots and Machine Learning","awardID":"0453459","effectiveDate":"2005-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[268906,268907],"PO":["433760"]}}