{"41739":{"abstract":"Information retrieval has been viewed as an individual activity. This project investigates information retrieval in collaborative situations. It defines collaborative information retrieval (CIR) as any activity that collectively resolves an information problem taken by members of a work team, and investigates the manifestations of CIR in work settings. Guided by a work-centered conceptual framework for the evaluation and design of information systems, the study follows three steps: (1) creating a model of CIR through field observations and analyses of information seeking behavior of four work teams; (2) validating and generalizing the model through a survey; and (3) examining technological developments and organizational changes that might enhance CIR. As the first study of its kind, the project explains how information is acquired, shared and used in work situations. As a result, (1) issues in knowledge management in organizations are addressed and (2) the development of technologies that support, facilitate, and enhance teamwork is guided. On the theoretical side, the project extends an existing conceptual framework to include teamwork and thus, (1) creates a new analytical tool that informs other studies about CIR, and (2) enriches other conceptual constructs both in information retrieval and in collaborative work.","title":"Collaborative Information Retrieval","awardID":"9908138","effectiveDate":"1999-08-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["467745","289998"],"PO":["495796"]},"44918":{"abstract":"Proposal CCR-9972571<br\/>Title: Kan: A Platform for Reliable Distributed Objects<br\/>PI: Ambuj K Singh<br\/><br\/>The goal of the project is to design and implement<br\/>a distributed object-oriented system for supporting large and <br\/>complex parallel and distributed applications. <br\/>The system supports a simple, yet powerful, programming model with the<br\/>following language features: asynchronous <br\/>method calls, concurrent threads, guards, nested transactions, <br\/>and objects that can be migrated and replicated transparently. <br\/>The system achieves efficiency and scalability through dynamic <br\/>runtime optimizations such as an adaptive thread pool,<br\/>thread inlining, monitoring of object access patterns,<br\/>and dynamic clustering and granularity.<br\/>The system is resilient to node failures; this is attained<br\/>through low-overhead algorithms for logging and recovery.<br\/>Investigating weaker notions of object consistency <br\/>that allow reduced communication between processors<br\/>is another goal of the project.<br\/>Shared whiteboards, electronic<br\/>commerce, and parallel scientific programs are some of the <br\/>targeted applications.<br\/>The project will lead to a better understanding of scalable, <br\/>fault-tolerant distributed systems.","title":"Kan: A Platform for Reliable Distributed Objects","awardID":"9972571","effectiveDate":"1999-08-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["536697"],"PO":["209879"]},"41839":{"abstract":"The 4th AAAI Doctoral Consortium, to be held as a workshop on July 18-19, 1999, immediately preceding the AAAI-99 conference in Orlando, Florida, will provide a unique opportunity for a group of PhD students to discuss and explore their research interests and career objectives together with a panel of established researchers. The consortium has the following objectives:<br\/><br\/> * To provide a setting for mutual feedback on participants' current research, and<br\/> guidance on future research directions<br\/> * To develop a supportive community of scholars and a spirit of collaborative<br\/> research<br\/> * To support a new generation of researchers with information and advice on<br\/> academic, research, industrial, and non-traditional career paths<br\/> * To contribute to the conference goals through interaction with other researchers<br\/> and participation in conference events.<br\/><br\/>The Doctoral Consortium will be held concurrently with other workshops preceding the AAAI'99 conference. It is expected that it will attract a diverse group of student participants who reflect a wide range of topic areas and methodologies within artificial intelligence, and who have settled on their thesis directions but who still have significant research left to do. Selection will be based on clarity and completeness of the submission packet, stage of research, advisor's letter, and other evidence of promise such as published papers or technical reports. Participants' thesis summaries will be published in the AAAI-99 conference proceedings. NSF funds will be used to provide student participants with a travel reimbursement of $750. Participants will also receive complimentary conference registration. The organizing committee for the workshop consists of: Janyce M. Wiebe, Chair, New Mexico State University; Mary P. Harper, Purdue University; Evangelos E. Milios, Dalhousie University; Vibhu O. Mittal, Just Research and Carnegie Mellon University; Leora Morgenstern, IBM T.J. Watson Research; and Loren Terveen, AT&T Labs. Panelists will include: Bonnie Holte Bennett , University of St. Thomas; Claire Cardie, Cornell University; Russell Greiner, University of Alberta, Mary P. Harper, Purdue University; Evangelos E. Milios, Dalhousie University; Raymond J. Mooney, University of Texas at Austin; Leora Morgenstern, IBM T.J. Watson Research; and Nils J. Nilsson, Stanford University.","title":"Workshop: 1999 SIGART\/AAAI Doctoral Consortium, Orlando, Florida","awardID":"9908433","effectiveDate":"1999-08-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["409250"],"PO":["565227"]},"39151":{"abstract":"9900307 Basili, Victor<br\/>This research focus on developing techniques to analyze software documents for defect detection. More especifically, mutation testing and document reading techniques will be tailored to detect defects in software formal specifications and source code at Brazilian and American academia and industries. This family of software analysis technologies will be empirically validated in controlled experiments, and packaged in tailorable and reusable software engineering laboratory packages. The goals of this work are: (1) to create software analysis technologies that can be successfully used for defect detection in software specifications and code, and develop empirical methods that can be followed to continually improve those techniques in different environments and cultural settings; (2) to develop evaluation methods that can be used to compare diverse software defect detection technologies in academic and industrial settings; (3) to expand the software analysis technology base, creating new laboratory packages that can be adapted and reused by other software engineering researchers, based upon their own environmental and cultural needs","title":"NSF-CNPq Collaborative Reserach to Develop, Validate, and Package Analysis Techniques for Software Defect Detection","awardID":"9900307","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["262266"],"PO":["564388"]},"39592":{"abstract":"9901553<br\/>Gao, Guang R.<br\/>University of Delaware<br\/><br\/>CISE Postdoctoral Associates in Experimental Computer Science: Experimental<br\/>Evaluation of Active Caches for Fine Grain Multi-Threading Systems<br\/><br\/>This research will investigate the effect of active cache memories on computer system performance. An active cache is capable of controlling complex data transformations and data movements under the direction of a programmer or compiler. This study, performed through system simulation, requires designing active caches, proposing performance models for the caches, and developing compiler mechanisms to support the percolation model of execution.<br\/><br\/>A percolation model of execution has been proposed in which the application requests that some data transformations be performed and that the transformed data be transferred to a higher level in the memory hierarchy. A thread becomes ready for execution when the data that it needs has percolated. The active caching mechanism is necessary in systems in which the latency to fetch a piece of data in a lower level of the memory hierarchy is much higher than the time required to process the data.<br\/><br\/>The effectiveness of caches that actively percolate data closer to the processing unit before the execution of a piece of code starts is being proposed. This model is different from traditional pre-fetching because it<br\/>is not based in any prediction mechanism: the instructions requesting the percolation of a data block are inserted into the code either under the programmer direction or through compiler technology. It is expecedt that the experimental study that demonstrates the viability of this idea will spur further research in the area of active hardware system components.","title":"CISE Postdoctoral Research Associates in Experimental Computer Science: Experimental Evaluation of Active Caches For Fine Grain Multi-Threading Systems","awardID":"9901553","effectiveDate":"1999-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["475422"],"PO":["564318"]},"43091":{"abstract":"This award is to Allied Technology Group for Proposal Processing, Data Entry Support, and Special Assistance for the Multilingual Information Access and Management Initiative and the Human Computer Interaction Program.","title":"Proposal Processing, Data Entry Support, and Special Assistance for the Multilingual Information Access and Management Initiative and Human Computer Interaction Program","awardID":"9911806","effectiveDate":"1999-08-27","expirationDate":"2000-05-26","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["126623"],"PO":["565227"]},"45181":{"abstract":"EIA-9973428<br\/>Fermuller, Cornelia M.<br\/>University of Maryland<br\/><br\/>CISE\/POWRE: Enhanced Vision ---Eyes from Eyes<br\/><br\/>The focus of this research is on designing and constructing new ways of assembling a set of video cameras in order to collect images whose analysis will provide accurate models of shape and action, such as human movements. The research is motivated by examining the wide variety of eye design in the biological world and obtaining inspiration for an ensemble of computational studies that relate how a system sees to what that system does (that is relating perception to action.) This, coupled with the geometry of multiple views points to new ways of constructing powerful imaging devices which suit particular tasks in robotics, visualization, video processing, virtual reality and various computer vision applications.","title":"POWRE: Enhanced Vision---Eyes from Eyes","awardID":"9973428","effectiveDate":"1999-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["531850"],"PO":["173164"]},"36491":{"abstract":"The research objective is to identify strategies and learning techniques for automated agents that will be able to participate successfully in auctions and negotiations. Auctions and negotiations can be used to resolve conflicts in a wide variety of multi-agent domains. Our main application domain will be electronic commerce. We will also continue to develop our simulation of document allocation in distributed information servers. These agents have insufficient information upon which to base strategic decisions. Thus, we propose<br\/>to identify learning methods for agents participating in auctions. We will use well known learning techniques and will focus on the questions: how accurate are the agent's expectations based on the learned information? and how does the learning process influence the negotiation and the auction outcome? Finally, human-computer experiments will be conducted focusing on the extent to which the information collected and evaluated by automated agents will be accessed and utilized by human participants in auctions. The significance of this research lies in its contribution to the development of autonomous agents capable of reaching mutually beneficial agreements efficiently in complex environments characterized by uncertainty and incomplete information. Our results will be particularly applicable to the emerging areas of electronic commerce and digital libraries.","title":"Negotiation and Cooperation in Multi-Agent Environments","awardID":"9820657","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["379377","333993"],"PO":["565227"]},"49460":{"abstract":"","title":"CAREER: Turning Automation into a Team Player: The Development of Multisensory and Graded Feedback for Highly Automated (Flight Deck) Systems","awardID":"9996448","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["289648"],"PO":["246649"]},"47062":{"abstract":"With the advent of extremely small, low power devices and wireless communications technologies, we are experiencing an explosion in the number of extremely small, mobile, portable devices. This award supports expenses of researchers to participate in a joint NSF\/DARPA\/NIST workshop on research direction in smart environments which maximize the benefit of such distributed and ubiquitous computing capabilities. The workshop will be held in the special purpose smart environment of Classroom 2000 at Georgia Tech. The results of the workshop will be an extended report on research directions intersecting areas of HCI, distributed computing, embedded software development, and networking.","title":"Inter-Agency Workshop on Smart Environments, Atlanta, Georgia","awardID":"9981995","effectiveDate":"1999-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["563803"],"PO":["125800"]},"39472":{"abstract":"This project is developing a new dynamic supply current-based alternative<br\/>to Iddq test for the next generation of ICs. The methods being investigated<br\/>are primarily based on a recently developed test metric, the energy<br\/>consumption ratio (ECR). Research on the project is being conducted on<br\/>three tracks: algorithmic-test, manufacture-test and self-test. The<br\/>algorithmic track develops test generation and fault simulation algorithms<br\/>for ECR test that target the detection of specific modeled faults. The<br\/>focus is on faults that are hard to detect with or escape traditional<br\/>methods. The manufacture test track focuses on the development of<br\/>fault-independent test methods for ICs. The objective is to develop methods<br\/>to use ECR-based test similar to those used in practice for Idd test. The<br\/>focus is on characterizing the defect coverage achievable with ECR test and<br\/>identifying test conditions which optimize defect coverage. The aim of the<br\/>self-test track is to develop a built-in self-test architecture for ECR<br\/>test. A robust dynamic current sensor is being designed and evaluated..","title":"Research on Practical Transient Test Techniques","awardID":"9901191","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[100136],"PO":["562984"]},"39384":{"abstract":"9900957 Hudak, Paul<br\/>Functional Reactive Progamming, or FRP, is an approach to programming hybrid systems in a declarative style using two particular abstractions: a continuous (functional) model of arbitrary behaviors, and a discrete (reactive) calculus for user and process interaction. FRP is a generalization of the fundamental ideas underlying two domain-specific languages that we have previously worked on: Fran, a language for functional reactive graphics and animation, and Frob, a language for functional robotics. We believe that FRP can provide a unified framework for rapidly and reliably creating hybrid software systems ranging from simple behavioral loops to large systems involving complex control strategies and multiple interacting modules. The objectives of this research are to further develop the ideas in FRP, study the principles underlying FRP, and explore ways to analyze, transform, and ultimately implement, domain-specific languages based on FRP. The research will emphasize the use of techniques common in the programming language semantics community. Amongst the issues to be investigated are: denotational as well as operational semantics for a small reactive language with continuous behaviors, an implementation synthesized from first principles (i.e. correct with respect to a specification), and practical ramifications of using numerical methods to simulate continuous behaviors.","title":"Principles of Functional Reactive Programming","awardID":"9900957","effectiveDate":"1999-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["541946"],"PO":["150697"]},"43070":{"abstract":"This is an award to IIS-9911741, Allied Technology Group, for \"Proposal Processing and Data Entry Support for the Digital Libraries Initiatve- Phase 2\".","title":"Proposal Processing and Data Entry Support for the Digital Libraries Initiative-Phase 2 Program","awardID":"9911741","effectiveDate":"1999-08-27","expirationDate":"2000-05-26","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["126623"],"PO":["433760"]},"45292":{"abstract":"EIA-9973834<br\/>Plale, Beth<br\/>Georgia Institute of Technology<br\/><br\/>CISE\/POWRE: Applying Database Techniques to Management of Large Data Flows in Scientific Applications<br\/><br\/>This project supports the PI's research activities as a Postdoc at Georgia Institute of Technology. To address the problem of large data flows and incompatibility between components, the PI is proposing a general middleware scheme called active streams: an approach for controlling data flow by injecting computational components directly into a data flow. A computational component implements one or more event-action rules, in the style of active databases, where a set of events triggers a rule action. To summarize the goal of the project is an architecture , abstractions, and algorithms for middleware components that are efficient in the internal query evaluation, and responsive to changes in the environment.","title":"POWRE: Applying Database Techniques to Management of Large Data Flows in Scientific Applications","awardID":"9973834","effectiveDate":"1999-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["565242"],"PO":["564181"]},"45072":{"abstract":"This research involves the investigation of state-of-the-art 3D image processing architectures and techniques along with their potential uses and applications. The investigation has applications in a number of areas such as System Modeling\/Understanding, Verification and Validation, Predictive Engineering, and Potential Advances in Diagnosis and Treatment of Visually Impaired. Because of the number of different areas of application, there is a potential for bringing together researchers in computer science,<br\/>electrical engineering, and Optometry<br\/>(for biomedical applications).<br\/><br\/><br\/>Included in this study are the differences among various visualization techniques such as 3D Image Interpolation, 3D Image Extrapolation, and 3D Model Reconstruction & Rendering. The results of this research are used to determine the limitations in the various techniques as well as investigate novel applications where these technologies will provide further understanding.","title":"Mrpg","awardID":"9973091","effectiveDate":"1999-08-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[114575],"PO":["564898"]},"45193":{"abstract":"EIA-9973465<br\/>University of Oklahoma<br\/>POWRE: A Transaction Management Technique for Nomadic Multidatabases<br\/>Gruenwald, Le<br\/><br\/>This project allows the PI to venture into the new research areas of mobile databases and mutlidatabases that are recently determined to be of extreme importance for future database research. The proposal addresses development of a pre-serialization transaction management technique for the mobile multidatabase environment that addresses disconnection and migration. Further, the PI proposes development of an analytical model and a simulation model that will be used to compare the performance of the proposed technique to that of other techniques found in the literature, and to provide guidelines to assist both users and designers.","title":"POWRE: A Transaction Management Technique for Nomadic Multidatabases","awardID":"9973465","effectiveDate":"1999-08-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["562677"],"PO":["557609"]},"39990":{"abstract":"Abstract<br\/> <br\/>The backbone infrastructure for the emerging broadband integrated services digital network (B-ISDN) will primarily employ optical fiber technologies due to the extremely high capacities of these channels. An attractive alternative, and in some cases companion, to optical fiber for giga-bit per second communications is radio frequency (RF) for line-of-sight wireless communication. Such channels, including both terrestrial and satellite, have many potential advantages over optical fiber counterparts. They can be deployed over a wide range of geographical areas; are flexible and can easily be expanded; allow rapid deployment in remote environments including military, disaster relief, and emergency medical applications; and finally, can act as a back-up for optical fiber-based networks. While \"high-integration\" implies single-chip solutions in applications where silicon technologies can meet system speed requirements, \"high-integration\" in electronics for giga-bit communication systems means the minimization of total chip and component count; i.e., a result minimizing overall board space. Typically, more than one integrated circuit (IC) technology will be involved. <br\/><br\/><br\/>This research involves the investigation of signal processing partitioning and the development of integrated circuits utilizing various IC technologies including InP, GaAs, and silicon to implement highly-integrated portable modems for giga-bit per second throughput over wireless RF terrestrial and satellite channels. A focus of this research is the development of circuit approaches to implement the IF-to-baseband processing in the analog domain. An analog solution can potentially result in a much lower power consumption than a digital implementation. BPSK and QPSK receiver structures will be examined and methods <br\/>to maximize integration and minimize power consumption will be studied. An end goal of this research is to develop a working prototype link including RF, IF, baseband, and error control functions with a throughput on the order of a giga-bit per second and a bit-error rate (BER) on the order of 10E-12.","title":"Integrated Circuits for Broadband Line-of-Sight RF Communication Systems","awardID":"9902802","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[101335,"118395"],"PO":["564898"]},"38681":{"abstract":"This project involves development of a new reconfigurable computing architecture, called MorphoSys, through close collaboration among researchers and students at University of California, Irvine (UCI) and the Federal University of Rio de Janeiro (UFRJ). This unique architecture combines a reconfigurable Single Instruction Multiple Data (SIMD) coprocessor with a RISC core microprocessor on the same chip. Moreover, in order to address the special needs of image\/signal processing applications, the MorphoSys architecture includes a unique image data buffer for efficient data streaming. Behavioral level simulation of the M1 chip has shown the architecture to be quite promising for a variety of applications (MPEG-2 and ATR), achieving performance much more superior to the standard general purpose microprocessors and close to specialized ASIC-based solutions.<br\/><br\/>The UCI and UFRJ researchers have been working closely for the development of the behavioral model of M1 chip. The UFRJ research group has designed the RISC core that is used for controlling the SIMD coprocessor in M1. This block is considered one of the most complex components of the chip requiring custom-made as well as synthesizable circuits. It is proposed that UFRJ group handle the physical design of the RISC core, while the UCI group completes the remaining blocks of the M1 chip that is estimated to have more than 1.5 million transistors. <br\/><br\/>Along with physical design, the other objectives for collaboration between the two groups at UCI and UFRJ include development of programming and testing environment for M1, mapping and performance evaluation for a wide range of applications, and design of second version of the MorphoSys architecture. We visualize that this collaboration will enhance the educational experience of students both at UCI and at UFRJ in Brazil, by providing them an opportunity to work in a competitive, target-oriented, multi-cultural environment using the latest technology.","title":"CISE-NSF-CNPq Collaboration Research","awardID":"9877171","effectiveDate":"1999-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["444397","472357"],"PO":["197478"]},"39792":{"abstract":"Computational geometry concerns the design and analysis of algorithms for problems involving large amounts of geometric data. This project seeks simpler and more efficient algorithms for fundamental problems in computational geometry that have applications in computer graphics, computer vision, databases, and statistics. The problems to be studied include geometric optimization, construction of basic geometric structures, and the design of data structures for processing geometric queries. The problems will be approached using randomization, approximation, and techniques for correcting pessimistic worst-case analyses.","title":"Towards Simpler Algorithms in Computational Geometry","awardID":"9902027","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[100900],"PO":["179846"]},"58460":{"abstract":"","title":"Collaborative Research: Network Browser Security and Human Values: Theory and Practice","awardID":"0096131","effectiveDate":"1999-08-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["542095"],"PO":["163103"]},"36471":{"abstract":"People have considerable experience using 3D graphics in scientific visualization, but very little understanding of exactly what aspects of those 3D graphics give us the most perceptual benefit. As a consequence, we do not understand how to optimize and improve our use of this tool. In this project, the PIs will perform human-subject tests to test the effectiveness of various depth cues on the perception of 3D scenes, and to quantify the difference in effectiveness between perceptual depth cues in synthetic scenes and in \"real\" scenes as presented by physical models. The findings will have significant implications for interactive computer graphics and scientific visualization in general, and for virtual reality in particular, where much effort and money are being invested to generate realistic synthetic scenes without any rigorous scientific knowledge of what the most convincing realistic-scene cues really are. This project should supply some of the answers.","title":"Understanding the Differences in Shape Cognition Between Physical and Virtual Scenes","awardID":"9820594","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["443223","553725"],"PO":["565227"]},"39650":{"abstract":"Proposal Title - Feedback Control Real-Time Scheduling<br\/>PIs - J. Stankovic, S. Son and G. Tao<br\/><br\/>Abstract<br\/><br\/>Despite the significant body of results in real-time scheduling, many<br\/>real world problems are not easily supported. While algorithms such as<br\/>Earliest Deadline First, Rate Monotonic, and the Spring scheduling<br\/>algorithm can support sophisticated task set characteristics (such as<br\/>deadlines, precedence constraints, shared resources, jitter, etc.), they<br\/>are all \"open loop\" scheduling algorithms. Open loop refers to the <br\/>fact that once schedules are created they are not \"adjusted\" based <br\/>on continuous feedback. While open-loop scheduling algorithms can <br\/>perform well in static or dynamic systems in which the workloads can <br\/>be accuratedly modeled, they can perform poorly in unpredictable dynamic <br\/>systems, i.e., systems whose workloads cannot be accurately modeled. <br\/>Unfortunately, many real-world complex systems are dynamic and <br\/>unpredictable. In addition, most scheduling paradigms assume that<br\/>timing requirements are known and fixed, while in real systems timing <br\/>requirements are more flexible. For example, instead of a single <br\/>fixed deadline for a task, a deadline range might be acceptable to <br\/>the physical system. If this range was passed to the scheduling system, <br\/>more robust scheduling could be possible.<br\/><br\/>We propose to develop the<br\/>beginnings of a new scheduling paradigm, which we call feedback<br\/>control real-time scheduling. Feedback control real-time scheduling will<br\/>define error terms for schedules, monitor the error, and continuously adjust<br\/>the schedules to maintain stable performance. Feedback control real-time<br\/>scheduling will be able to deal with dynamic systems that are both resource<br\/>insufficient and with unpredictable workload. It can also be integrated <br\/>with flexible real-time requirements. We plan to base this new paradigm <br\/>on the theory and practice of control theory, adaptive control theory, <br\/>and stochastic control. In this proposed research we will begin by <br\/>integrating practical feedback control techniques into scheduling <br\/>algorithms. These scheduling algorithms regard the computer system <br\/>as a control system with the scheduler as the controller. The<br\/>outcome from this beginning study<br\/>should include a practical scheduling algorithm, plus some<br\/>experimental evidence to use in the long-term endeavor of creating <br\/>a theory and practice of feedback control scheduling. Such results will <br\/>apply to many real world systems including real-time database applications, <br\/>defense applications, agile manufacturing, and distributed multimedia. <br\/>The results would be that these systems meet significantly more deadlines <br\/>thereby improving the productivity of a manufacturing plant or an on-line <br\/>real-time database system. General principles developed in this research <br\/>should also be applicable to feedback scheduling in non-real-time systems. <br\/>This could improve the throughput and performance of general timesharing <br\/>systems.","title":"Feedback Control Real-Time Scheduling","awardID":"9901706","effectiveDate":"1999-08-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550342","309127","301560"],"PO":["250083"]},"38594":{"abstract":"Abstract<br\/> <br\/>IIS-9876904<br\/>Ben-Arie, Jezekiel<br\/>University of Illinois<br\/>$76,672 - 12 mos.<br\/><br\/>Unified Object and Image Representation in 3D Frequency Domain<br\/><br\/>The proposed research is to develop a frequency domain object representation and related methodology for several major vision problems. Specifically, a volumetric frequency domain object representation (VFR) introduced by the PI will be used, which encapsulates both viewer centered and object centered representations. The VFR includes a continuum of the views of the objects as 2-D slices of the original representation. This view representation is based on the Fourier Slice Theorem. Previous frequency domain representations were developed for two dimensional images and did not consider the three dimensional object structure. Conventional 2-D frequency domain or spatial domain image representations for vision tasks is limited to 2-D interpretation. On the other hand, the proposed approach considers the full three dimensional object structure and therefore can handle diverse problems such as viewpoint or<br\/>illumination independent recognition, articulated 3-D motion, etc. The VFR includes not only a continuum of object appearances but also 3-D structural information. Thus, 3-D object structure can be derived from single images. Pose invariant and illumination invariant object recognition can be implemented using the VFR by directly indexing into a complex (real and imaginary) volumetric eigenvector space. Two approaches are proposed for motion estimation. The result would be either a temporal sequence of 3-D poses which explicitly define the motion or a 3-D motion flow field. This 3-D approach avoids the problems of 2-D flow fields, especially in the estimation of 3-D rotational motions where the actual motion vectors exhibit themselves as projections onto the image plane. It is also planned to extend the VFR model towards several vision applications, such as image segmentation based on 3-D structure, pose invariant and illumination invariant object and face recognition, 3-D surface recovery from single image and articulated motion recognition.","title":"Unified Object and Image Representation in 3D Frequency Domain","awardID":"9876904","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["402665"],"PO":["234178"]},"39353":{"abstract":"This research is on embedded systems design tools for building custom<br\/>application-specific instruction processor (ASIP) architectures that are no<br\/>bigger, or no more complex than necessary. Developing an ASIP, not only<br\/>requires hardware design, but also requires the use of a set of evaluation<br\/>tools such as an assembler, compiler and simulator. This investigation uses<br\/>a processor description to serve as a common starting point for the<br\/>development of these tools, as well as for hardware synthesis. The ISDL<br\/>language, being developed at MIT, for exactly this purpose is being used in<br\/>developing a complete software development environment, as well as hardware<br\/>generation. The simulator is used to obtain clock cycle estimates on<br\/>application code, and to evaluate the overall architecture performance.<br\/>Synthesis of processor datapaths enables hardware generation and provides<br\/>accurate, cycle-time estimates. To support software compilation, a<br\/>retargetable assembler, code generator and optimizer will be developed that<br\/>receive as input both a machine description in ISDL, and the program to be<br\/>compiled onto the described machine. New optimizations to produce code of<br\/>the highest quality in a reasonable amount of time are being evaluated. The<br\/>base of our retargetable compiler is SPAM, an embedded compiler framework<br\/>that has been developed by researchers at MIT, Princeton and UNICAMP,<br\/>Brazil. In many cases, application code is not written in high-level<br\/>programming languages, and it is necessary to deal with assembly or legacy<br\/>code. Thus automatic methods for optimized binary-to-binary translation are<br\/>being investigated. To do this, the legacy binary\/assembly code is<br\/>decompiled to intermediate forms used by our compiler infrastructure and<br\/>then using the optimizing compiler technology to generate high-quality<br\/>assembly for the target architecture.","title":"NSF-CNPq Collaborative Research on Design Environments for Application-Specific Programmable Processors","awardID":"9900881","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["213414"],"PO":["562984"]},"38275":{"abstract":"This research focuses on (1) the development of efficient and radically<br\/>simpler-to-use device CAD for MEMS by employing meshless finite cloud<br\/>methods (2) the development of mixed continuum (based on meshless<br\/>computational methods) and atomic scale approaches for accurate analysis of<br\/>mixed-technology MEMS and (3) the development of efficient parallel<br\/>algorithms for implementation of the device modeling tools on distributed<br\/>memory parallel computers.","title":"Career: Integrated Computational MEMS (IC MEMS)","awardID":"9875671","effectiveDate":"1999-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["539633"],"PO":["562984"]},"39750":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Internet Technologies \" announcement, NSF 98-104. It provides support for two years to address tools and methodologies for network protocol interoperability testing, with special emphasis on multicast protocols. Collaborators include but are not limited to Cisco Systems, 3COM, and Nortel Networks.","title":"MINT: Multicast Protocol Interoperability Testing","awardID":"9901934","effectiveDate":"1999-08-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["553707"],"PO":["182196"]},"39794":{"abstract":"The focus of this research is the development and implementation of <br\/>efficient algorithms for several problems involving optimal placement of <br\/>polygonal annulus regions with respect to a set of points. The optimality <br\/>criteria may be either maximizing the numbers of points contained by a <br\/>fixed sized annulus, or minimizing the size of the annulus necessary to <br\/>contain a fixed number of points. The annulus placement problems are <br\/>motivated by applications in geometric tolerancing, mobile robot <br\/>localization using range finding, and pattern matching problems arising in <br\/>computer vision. We are interested in both scaled and offset annulus <br\/>regions, translation and rotation, convex and simple polygons, and <br\/>off-line and on-line variants of the problem.","title":"Annulus Placement Problems: Geometric Algorithms and Applications","awardID":"9902032","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["465537","531309"],"PO":["321058"]},"39398":{"abstract":"9901011 Zhang Shao<br\/>The main objective of this research is to design and develop a typed common intermediate format (named FLINT) for multiple advanced programming languages. FLINT is based on an extended variant of the polymorphic lambda calculus Fomega. Although advanced languages can be very different in semantics, they all have a mathematically rigorous type system. FLINT provides a common compiler backend that can be quickly adapted to generate compilers for new languages. With its unified type system, FLINT serves as a great platform for reasoning about cross-language interoperations. Previous work on FLINT was done in the context of ML. This proposed research will extend FLINT to support other language features such as classes and objects in Java, type dynamic in Scheme, lazy evaluation and type classes in Haskell, and various system-programming primitives in C and Modula-3. The goal is to achieve safe, principled, and fine-grain language interoperation between different advanced languages and with C and assembly code.","title":"Typed Common Intermediate Format","awardID":"9901011","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550517"],"PO":["397849"]},"58440":{"abstract":"","title":"An Integrated Processor Management Scheme for Parallel Computers","awardID":"0096111","effectiveDate":"1999-08-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550540"],"PO":["250083"]},"45152":{"abstract":"9973328<br\/><br\/>The main objectives of this research are the construction and study of finite element approximations to steady-state and transient problems of mechanics and engineering, including convection-diffusion-reaction problems, Stokes and Navier-Stokes equations, equations of linear elasticity, and the construction, analysis, and testing of fast methods for solving the resulting discrete systems. The emphasis will be on the development of new accurate, robust and efficient computational techniques. Approximation strategies involving standard Galerkin finite element methods, least-squares methods, and mixed finite element methods will be studied especially from the standpoint of their accuracy, stability, and efficient implementation. The solution techniques which will be developed will emphasize preconditioning via domain decomposition or multigrid\/multilevel methods. Local grid refinement and error control coupled with multilevel solution methods will be used in ground water and petroleum applications.<br\/><br\/>Technological development is becoming increasingly dependent on large scale scientific computation. Such computations are often limited by accuracy of the numerical method and the amount of computational effort required for its solution. The research funded by this proposal will provide better numerical methods and new techniques for the efficient solution of the resulting system of linear and non-linear equations. Such advances will improve our ability to accurately model more complex processes (devices) as well as our ability to understand complex systems such as the behavior of a contaminant in a multi-component groundwater system.","title":"Construction of Accurate, Robust and Efficient Numerical Techniques for Partial Differential Equations","awardID":"9973328","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["306096","450789","517220"],"PO":["562372"]},"39652":{"abstract":"Bharat Bhargava<br\/>CCR-9901712<br\/><br\/><br\/>An adaptable system can gracefully reconfigure based on its environment during execution. A series of experiments are being conducted that will lead in the development of policies for adaptability at the application, system, and network layer to meet the quality of service requirements. The impact of system constraints in determining the quality of service that can be guaranteed to the user is investigated. The adaptability guidelines and mechanisms that will be implemented in the application and system software are being identified. How adaptability impacts in meeting the quality of service requirements in different applications is evaluated. The focus is on two fundamentals research problems: Adaptability mechanisms and infrastructure and Adaptable quality of service provision and control for distributed systems. This will lead toward developing expert rules\/guidelines for system adaptability and its impact on various applications. This will allow the research on the behavior of system software and its impact on various emerging applications such as electronic commerce. Digital libraries, and video conferencing systems. This research will allow experiments with advanced system services, protocols, techniques and their experimental evaluation. This knowledge is applicable to various system software used in collaborative computing, distributed file systems, multimedia application, and real-time processing.","title":"Experiments in Adaptable Distributed Systems","awardID":"9901712","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["540775"],"PO":["241298"]},"46197":{"abstract":"This project addresses the needs of the legally blind to interact with information systems that utilize graphical user interfaces (GUIs). The research focuses on the study of descriptive animated icons and the development of a framework to enable GUI developers to more effectively address the icon recognition process utilized by the legally blind when designing interface layout and functionality. In an initial study the PIs will determine optimal sizes for icons, animated as well as non-animated, that are perceived by individuals whose visual acuity is in the range of 20\/200 to 20\/800. This study will result in a heuristic that will allow them to describe the means by which legally blind computer users interact with a GUI. The PIs will then design a library of animated icons which will serve as a foundation in the development of GUIs that are accessible to the legally blind. A proof-of-concept application will be developed and evaluated using this technology, in order to provide information on how to properly integrate animated icons into a GUI to achieve the stated goals. The PIs expect the icon library developed as part of this project to be applicable to a wide variety of application domains, and that the use of properly sized, descriptive animated icons in GUIs will help the increasing legally blind population to access information in electronic form.","title":"Animated Icons as an Assistant During Interaction Between a Graphical User Interface and the Legally Blind\/Partially Sighted","awardID":"9978183","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["558321","527961"],"PO":["565227"]},"38156":{"abstract":"Solutions to complex scientific simulations based on partial differential equations use discrete meshes to represent the physical (continuous) domain. Similarly, computer rendering of complex scenes uses these meshes for radiosity calculations. Existing heuristic-based methods do not produce meshes that dependable for 3-dimensional real-world problems that include moving or complex surfaces, or that exhibit anisotropic (direction-dependent) behavior. This project will design, analyze, and implement mesh generation algorithms for these domains that are practical and, where possible, provably good. The technical approach to this task is to use optimization-based smoothing and topological transformations. For anisotropic problems, the project will also develop a firm theoretical basis footing for extending Delaunay triangulations to the anisotropic case. Finally, in three dimensions the project will pursue a firm understanding of constrained Delaunay tetrahedralizations and algorithms for their construction.<br\/><br\/>This project will also be active in integrating research with education. It will contribute to curriculum development and course design in support of a new Computational Engineering Science program being initiated within the College of Engineering at UC Berkeley. This effort will include courses and texts in mesh generation and conjugate gradient-like solvers.","title":"CAREER: Dynamics, Domain Conformity, and Anisotropy in the Theory and Implementation of Unstructured Mesh Generation","awardID":"9875170","effectiveDate":"1999-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["408891"],"PO":["551992"]},"38398":{"abstract":"9876242 Ramakrishnan, C. R. <br\/>Tabled resolution for logic programs addresses the major shortcomings of Prolog-style resolution, namely, weak termination, repeated subcomputations, and weak semantics for negation. Tabled logic programming enables development of many applications at a high level without sacrificing efficiency. For instance, techniques used for program analysis and verification, such as model checking and abstract interpretation, can be implemented using tabling by treating the semantic equations as logic rules. This project focusses on (i) exploiting the power of current tabled resolution systems to construct high-performance program analyzers and model checkers for systems specified in various process languages and properties specified using different temporal logics; (ii) extending tabling methods to constraint logic programs, thereby tackling new applications, such as verification of infinite-state and real-time systems; and (iii) integrating deductive strategies (traditionally used by theorem provers) into model checkers by combining tabled resolution with program transformation techniques. This combination offers novel solutions to problems such as verification of parameterized systems, analysis of security vulnerabilities of computer systems, and scheduling in workflow systems. The project plans to incorporate research results into the classroom by adding a two-week unit on program analysis to a Compiler Design course, and developing new courses on computer security and program transformations.","title":"CAREER: Tabled Logic Programming for Verification and Program Analysis","awardID":"9876242","effectiveDate":"1999-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["477226"],"PO":["564388"]},"39399":{"abstract":"9901017 Betty Cheng<br\/>This project bridges the gap between formal and informal approaches to embedded systems development by formalizing part of the Unified Modeling Language (UML), an object-oriented modeling notation that is quickly becoming the de facto standard. Three of the UML notations, use cases, class diagrams, and state diagrams will be investigated; these three models sufficiently represent embedded-systems requirements. Through formalization, the models can be integrated into a single specification that can be analyzed for consistency, concurrency properties (e.g., deadlock, liveness), and constraint satisfaction. In choosing the representations, an assessment will be made as to how they can be analyzed using simulation, model checking, and a combination of these approaches. The specifications will also be assessed to determine how well they can be used to construct automated design transformations that refine the diagrams into design-level specifications. The investigations will yield a framework for systematically and rigorously developing<br\/>embedded systems, where informal requirements are formalized and refined with design information to obtain the corresponding implementation. A prototype will be developed to support the graphical construction of the models, generate the corresponding specifications, and provide access to the analysis tools. The formalizations will be applied to increasingly complex case studies to ensure that the approach is applicable to real projects from industry.","title":"Object-oriented Development and Analysis of Embedded Systems","awardID":"9901017","effectiveDate":"1999-08-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["332348","543568"],"PO":["564388"]},"58441":{"abstract":"","title":"CAREER: An Integrated Video-Based Storage System with Guaranteed Performance","awardID":"0096112","effectiveDate":"1999-08-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[150157],"PO":["180163"]},"39620":{"abstract":"9901636<br\/>Samet, Hanan<br\/>University of Maryland<br\/><br\/>CISE Postdoctoral Associates in Experimental Computer Science: Incremental<br\/>Nearest Neighbor Algorithms for Similarity Retrieval in Multimedia<br\/>Databases and Medical Applications<br\/><br\/>Similarity search is a very important operation in multimedia databases and other database applications involving complex objects. The similarity between two objects is represented with a distance metric. Two existing approaches for handling similarity search are addressed. The first is based on mapping to low-dimensional geometric space (making use of data structures such as the R-tree), while the second directly indexes the objects based on distances (making use of data structures such as the M-tree). For both approaches, the development of new incremental algorithms for nearest neighbor search are being investigated. The algorithms will have the property of reporting their result one-by-one in order of<br\/>similarity, with as little effort as possible expended to produce each new result object. The incremental aspect provides significant benefits in situations when the number of desired neighbors is unknown in advance. The application of the algorithms to problems in fields such as multimedia databases, medical application, as well as others, are being investigated.","title":"CISE Postdoctoral Rsch Associates in Experimental Computer Science: Incremental Nearest Neighbor Algorithms for Similarity Retrivai in Multimedia Databases and Medical Applications","awardID":"9901636","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["551003"],"PO":["564318"]},"39774":{"abstract":"This research focuses on the development, analysis and implementation of fast and memory-efficient algorithms <br\/>for solving several matrix computation problems arising from information retrieval and data mining. The singular value decomposition (SVD) of large and\/or sparse matrices plays an essential role in this research: it is used, on the one hand, for dimension reduction to achieve high algorithmic efficiency, and on the other for noise reduction to improve retrieval accuracy. The emphasis is on exploring the intrinsic structures of the matrices arising from those applications to develop fast algorithms for their SVD computation. <br\/><br\/>Specifically, the goals of this research are 1) the development of theoretical foundation for latent semantic indexing (LSI) and related spectral analytical methods for information retrieval, hypertext link analysis and data mining; <br\/>2) the development and implementation of high performance algorithms for partial SVD and sparse low-rank approximation computation that can scale to very large text corpora and databases.<br\/>A subspace-based statistical model has been previously developed to represent the <br\/>relations between terms and latent concepts. This model has led to a \"low-rank-plus-shift\" structure that is approximately satisfied by the cross-product of the term-document matrices. <br\/>This structure gives rise to a more accurate updating scheme for LSI and it also leads to a highly parallel divide-and-conquer method for computing the partial SVD of large sparse term-document matrices. <br\/>This project will 1) further develop our subspace-based model and gain deeper understanding of the <br\/>effectiveness of partial SVD and their sparse variations in text retrieval, link analysis and data mining <br\/>applications; 2) further explore the low-rank-plus-shift structures of the term-document matrices and link matrices <br\/>to develop fast and memory-efficient numerical algorithms for the computation of their partial SVD in linear time; <br\/>3) explore other efficient heuristics for finding dense bipartite subgraphs used in Web link analysis and data mining applications; and 4) test the algorithms on text corpora generated from WWW and large commercial databases.<br\/><br\/>No computation of SVD on the order of several million has been attempted before, and LSI, data mining applications and link analysis for WWW provides a perfect platform to investigate algorithmic issues and parallel implementation issues for large-scale computation. This research attempts to integrate theoretical investigation based on statistics and matrix perturbation theory, algorithmic development using computational linear algebra methodologies, and experimentation on real-world text corpora and large datasets obtained from WWW search engines and large commercial databases.","title":"Large-Scale Matrix Computation Problems in Information Retrieval and Datamining","awardID":"9901986","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["549456"],"PO":["321058"]},"39433":{"abstract":"This research focuses on developing modeling, analysis and vector<br\/>generation techniques for some of the emerging deep submicron defects.<br\/>Specifically, this project is developing techniques to model the excessive<br\/>power supply noise, the interconnect crosstalk faults and the resistive<br\/>short and open faults as statistical delay faults. The results of the<br\/>modeling process are being used to select target delay faults for test<br\/>evaluation and test generation. This project further investigates vector<br\/>generation techniques for the selected target delay faults. The tests not<br\/>only activate and propagate the faults but also cause various worst-case<br\/>noises such that the propagation delay along the sensitized path is<br\/>maximized. Furthermore, DFT requirements and rules for eliminating or<br\/>reducing the probability of having certain noise faults and for simplifying<br\/>vector generation for these faults are being explored.","title":"Test Techniques for Deep Submicron Devices","awardID":"9901099","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["287642"],"PO":["562984"]},"49377":{"abstract":"","title":"On-line Avoidance of Monitoring Intrusion in Distributed Systems","awardID":"9996362","effectiveDate":"1999-08-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["549718"],"PO":["250083"]},"40192":{"abstract":"Multi-carrier based communication systems have the advantage of better exploitation of the channel bandwidth, and hence simple receivers design. As a result they find broad applications in wireline as well as wireless environments. Examples are the high-rate digital subscriber line (HDSL), digital audio broadcasting (DAD) and digital terrestrial television broadcasting (DTTB). Additionally, the use of multi-carrier techniques in wireless PCS has been considered in the IMT-2000 (third generation mobile communication systems) standardization process. For multi-user application, these systems are referred to as Multi-Carrier Code Division Multiple Access (MC-CDMA).<br\/><br\/>The performance of MC-CDMA is limited by multiusers interference (MUI). Optimal multi-user detection accomplishes MUI cancellation by exploiting the knowledge of all users' signatures. Due to complexity of the optimum multi-user detector, various sub-optimum detectors structures have been considered. In a multicarrier modulated system it is advantageous to use closely spaced subcarriers, but not without high sensitivity of performance to frequency offset. The latter might be caused by Doppler shift as result of mobile movement, as well as from a mismatch between the carrier frequencies at the transmitter and receiver. In addition, the constellation of the desired signal at each subcarrier is rotated. This in turn results in inter-rail interference between the I- and Q-rails, which further reduces the carrier to interference ration (CIR). It was found that, in contrast to DS-CDMA, for MC-CDMA the conventional full dimensional decorrelator is dependent on the channel, prompting the use of an adaptive detector, which will be examined in this research. Additionally, where MC-CDMA is considered for downlink, the investigators will use, a novel reduced complexity detector which does not require the knowledge of the other users' codes, but instead, uses a so-called compound code to represent all the interferers. This effectively reduces the complexity to a 2 x 2 detector, which is equivalent to the complexity of a full-dimensional detector in the case of only two active users. The investigators will also develop an adaptive detector that has he capability to correct the effects of a frequency offset utilizing a bootstrap based adaptive signal separator.","title":"Adaptive Schemes for Multi-Carrier Based Communications Systems","awardID":"9903381","effectiveDate":"1999-08-15","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["316235"],"PO":["223414"]},"44141":{"abstract":"Abstract<br\/><br\/><br\/>IIS-9970061<br\/>Cole, Ronald A. & Macon, Michael W. <br\/>University of Colorado Boulder<br\/>$99,683 ($49,842 from HCI and $49,841 from EIA) in FY99 - 12 mos.<br\/><br\/>Advancing Human Language Technology in Brazil and the United States Through Collaborative Research on Spoken Language Systems<br\/><br\/> This is the first year funding of a two-year continuing award. This project entails collaborative research and technology transfer leading to a Brazilian Portuguese version of the CSLU Speech Toolkit, an integrated software platform for learning about, researching and developing spoken language systems. We will mentor researchers from two universities in Brazil via collaborative workshops\/training sessions and collaborate to advance the state-of-the-art of spoken language technology. Our goal is to extend the toolkit's capabilities to include Brazilian Portuguese speech recognition and text-to-speech synthesis and use these technologies to develop systems for information access and language training. This will entail creation of suitable language resources (lexicons, corpora), development of software infrastructure, and basic research to improve the underlying technology. We will then share our knowledge, software, and language resources by distributing the toolkit and language resources at no cost to academic institutions throughout the United States and Brazil to spur growth in this area of research and, in the long term, improve access to information by the citizens of both Brazil and the U.S.","title":"NSF-CNPq Collaborative Research: Advancing Human Language Technology in Brazil and the United States Through Collaborative Research on Spoken Language Systems","awardID":"9970061","effectiveDate":"1999-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551122","140250"],"PO":["564456"]},"44285":{"abstract":"The objective of this work is to enable high pay-off technologies for high-end parallel computing of database applications. The work involves exploring the next-generation distributed shared-memory (DSM) architectures on which to run high-performance memory-resident parallel databases. The architecture proposed has a radically new node and system organization based on processor-in-memory (PIM) chip technology. It includes intelligent memory for databases, support for reconfigurability and hardware support for speculative execution of queries.<br\/><br\/>This research also explores, for this architecture, novel algorithms to parallelize database queries, lay out and map database data and code, and schedule database threads. These algorithms, which also exploit some hardware support, are designed to be cache-conscious and, therefore, exploit deep memory hierarchies. A subset of the algorithms are to be implemented in a real parallelizing compiler (Polaris) and tested on a real parallel database that will be rewritten for scalability (Postgres95). The rewritten Postgres95 code will be made available to other academic researchers for their use.","title":"New Architectures for New Applications: PIM NUMAs for Commercial Workloads","awardID":"9970488","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["485665"],"PO":["197478"]},"45286":{"abstract":"EIA-9973797<br\/>Hassoun, Soha<br\/>Tufts University<br\/><br\/>CISE\/POWRE: Functional and Physical Co-Analysis in Timing Verification<br\/><br\/>This is exploratory work in innovative timing analysis that considers the interaction among the physical, functional, and timing aspects of a circuit. The proposed approach is based on developing a novel gate delay model, the dynamically bound delay model, that can accurately capture delay variations due to physical, functional, and timing interactions. The PI will also investigate timing analysis algorithms that complement the model. The novel delay model and comparable algorithms will allow analyzing and verifying the temporal behavior of large sequential circuits while co-analyzing the layout and functional effects. The research will be utilized to advance the PI's academic and research career.","title":"POWRE: Functional and Physical Co-Analysis in Timing Verification","awardID":"9973797","effectiveDate":"1999-08-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0601","name":"Division of edDATA NOT AVAILABLE","abbr":"EDNE"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["539728"],"PO":["564181"]},"38653":{"abstract":"Descriptive Complexity measures the richness of a language or sentence needed to describe a given property. The languages are variants of first-order logic and their targets are finite, ordered structures. There is a profound relationship between the traditional computational complexity of a problem and the descriptive complexity of the problem. Indeed, all major complexity classes have been shown to have natural descriptive characterizations.<br\/><br\/>This research broadens the connections and extends the knowledge of complexity. The following three areas are being pursued: (1) Dynamic Complexity, (2) Model Checking and (3) Tradeoffs in Descriptive Complexity.","title":"Applications of Descriptive Complexity","awardID":"9877078","effectiveDate":"1999-08-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["485266"],"PO":["543507"]},"38345":{"abstract":"This project is a new approach to system-on-a-chip design, called deconstruction. The approach starts with an existing prefabricated, parameterized, reference design in silicon, composed of hundreds of Intellectual Property (IP) blocks, and then deconstructs it into the desired system by setting parameters. In contrast, the current approach is to construct a desired system by combining IP and then generating silicon. This approach has serious verification limitations. The techniques being developed focus on making deconstructed systems competitive with constructed systems in terms of design metrics like power, performance and size. The emphasis is on two issues relating to flexibility in reference designs: (1) Formalizing the notion of parameterized reference designs, consisting of a sound parameter classification scheme, and a precise method of specifying such parameters, and (2) Developing models and algorithms for parameter optimization, requiring system-level models of power and performance metrics from which metric values can be rapidly computed. Such optimization is being achieved by developing techniques based on cost ranges, rather than single cost values, to evaluate candidate solutions.","title":"CAREER: IP-Based Embedded Systems Design","awardID":"9876006","effectiveDate":"1999-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["450944"],"PO":["562984"]},"39368":{"abstract":"9900918 Hannan, John J.<br\/>This research studies the formal specification, analysis, and implementation of type-based deductive systems and algorithms for optimizing compilers of higher-order languages. Type theory and deductive systems are important tools used in the design and specification of programming languages, but these tools have not been extensively used in the design and implementation of optimizing compilers for languages. Instead, control-flow analyses have provided the primary basis for many optimizations in compiler for higher-order languages. This research seeks to advance the state of compiler optimizations based on types and deductive systems, complementing the work on control-flow analyses. Specific activities include: (1) developing new, type-based deductive systems specifying new and existing compiler optimizations\/translations; (2) developing a general theory of deductive systems and related algorithms for compiler optimizations, and a prototype implementation based on this theory; and (3) constructing an experimental implementation of an optimizing compiler based on using these results. Together, these objectives serve to advance the state of higher-order language implementations by studying the theoretical and practical application of type-based optimizations on these languages, complementing existing technologies.","title":"Deductive Systems and Optimizing Compilers for Higher-Order Languages","awardID":"9900918","effectiveDate":"1999-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[99886],"PO":["150697"]},"45561":{"abstract":"EIA-9974968<br\/>Grimshaw, Andrew S.<br\/>University of Virginia<br\/><br\/>Next Generation Software: Supporting Complex Application Requirements in Metasystems <br\/><br\/>The proposed work addresses two critical problems facing metasystems applications designers: a lack of a sufficient set of tools by which to structure their applications, predict performance, and make scheduling decisions; and a lack of application-level fault-tolerance techniques. This proposal will address these problems by building upon our past experiences with Legion, which is an architecture for designing and building system services that provides to users the illusion of a single virtual machine with secure shared objects and shared name spaces. The single virtual machine may consist of hundreds of distributed and heterogeneous resources in multiple administration domains.<br\/><br\/>IDAEMA (Integrated Design, Analysis, and Execution of Metasystems Applications) is a multi-stage advice and performance prediction tool for metasystems. During application design, IDAEMA uses a library of cataloged research results based on application characteristics and high-level application requirements to provide analysis and advice regarding how to structure the program. This advice provides multiple views that describe the implications of design choices on application requirements, software engineering costs, and predicted performance-from advice in how to get started programming in a metasystems environment to code templates and existing components upon which to base the functionality of the application. At run-time, IDAEMA uses static and dynamic information about the hardware and software of the target metasystem in combination with the application user's security, fault-tolerance, predictability and cost requirements to provide assistance and performance prediction at multiple levels of abstraction and resolution. Our approach to fault-tolerance is based upon our use of the RFE model (Reflective Graph and Event) and the conviction that no single fault-tolerance mechanism is appropriate for all applications. Instead application must be free to use a variety of different techniques, all in the same system. RGE provides a flexible, configurable mechanism for attaching arbitrary computation in the form of program graphs to events. Exoevents, Exoevent Interests, and Exoevent Interest Sets are used to dynamically configure application-specific fault-tolerance techniques. Together, these two components provide new flexibility and predictability for metasystems application development and execution. IDAEMA and the RGE model are validated through proposed modifications to Legion in combination with collaborators at NPACI site developing applications that include a coupled ocean-climate model and a full-scale simulation of an integrated system for intelligent processing of materials.","title":"Next Generation Software: Supporting Complex Application Requirements in Metasystems","awardID":"9974968","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["433584","466826"],"PO":["301532"]},"58420":{"abstract":"","title":"Next Generation Software: Active Debugging Information for Multi-Language, Multi-Platform Debugging","awardID":"0096091","effectiveDate":"1999-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["386750"],"PO":["301532"]},"39787":{"abstract":"This project is to design robust and efficient computational kernel software for solving large sparse unstructured linear systems on high performance computers. Such large scale problems can only be solved by iteritive techniques. The iterative techniques under our consideration include multilevel preconditioning techniques and algebraic multigrid methods. Our goal is to unify these two groups of methods and to take advantage of both and avoid the disadvantages of either.<br\/>We will investigate, design, and test algebraic preconditioners that offer the scalability of multigrid techniques, the parallelism of domain decomposition methods, and the robustness of incomplete LIU preconditioners.<br\/><br\/>We will also use a factored sparse approximate inverse technique to replace standard iterative schemes in algebraic multigrid methods. Such an approach may increase the robustness of our methods and improve their parallelism. Graph partitioning of submatrices is to be used to balance loads among processors. The proposed research will result in a software package that may be used by researchers and engineers as kernel software in large scale numerical simulations and<br\/>computations.<br\/><br\/>The general purpose high performance iterative solvers from this research project are expected to make significant impact in the field of applied scientific computing. The results of the research will make a clear judgment concerning the relative advantages and disadvantages of algebraic multigrid methods and multilevel incomplete LU preconditioning methods. The research has applications in aerospace, semiconductor, reservoir simulation, combustion, ocean\/climate modeling, and pollution tracking","title":"A Fully Algebraic Multigrid Software Package for Automated Solution of Unstructured Sparse Linear Systems on High Performance Computers","awardID":"9902022","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["495104","94260"],"PO":["179846"]},"41492":{"abstract":"The Virtual Design Team (VDT) computational organization simulation framework uses Jay Galbraith's (1973) \" information-processin\" (IP) view of knowledge-work to simulate project organizations performing relatively routine engineering tasks. To model the impact of exceptions in routine engineering work, VDT simply adds work volume to predefined activities in a fixed organization structure. This abstraction has proven remarkably successful for modeling product development tasks, but breaks down for less routine service tasks. To address this shortcoming, multiple kinds of stochastic exceptions must dynamically modify both the work process and performing organization. This extended IP framework will be able to model and simulate the inherent uncertainty of service work and the more dynamic organizational structures of service organizations. Validation of the extended IP model involves a rigorous, stepwise approach of testing reasoning, representation and usefulness, through a set of virtual computational experiments employing progressively more complex models. Finally, retrospective and prospective empirical validation experiments will be carried out in two domains: health care organizations and engineering maintenance organizations. This research will greatly extend the range of applicability of computational organizational models, and will enhance our ability to design more effective organizations and information technologies for service work--currently nearly 80% of all US employment.","title":"Simulation Models of Dynamic Work Processes and Organizations","awardID":"9907403","effectiveDate":"1999-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V050","name":"NSA-WORLD RENOWNED EXPERTS FRO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V463","name":"NSA-MEIDS PROJECT"}}],"PIcoPI":["555560"],"PO":["563727"]},"58455":{"abstract":"","title":"Architectures for Emerging Applications","awardID":"0096126","effectiveDate":"1999-08-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["551063"],"PO":["180163"]},"36565":{"abstract":"This project is focused on two areas. The first is applying techniques developed for randomized algorithms to traditional matrix problems that have to be solved for very large matrices. In particular, the problem of finding an approximation to a given matrix having a fixed rank. If the matrix is the adjacency matrix of a graph, connection has been developed between such approximations and certain partitions of the vertex set of the graph. The second area is approximation algorithms for convex sets.","title":"Randomized Algorithms for Matricies, Graphs, and Convex Sets","awardID":"9820850","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["320878"],"PO":["543507"]},"38633":{"abstract":"Abstract<br\/><br\/>IIS-9877033<br\/>Thrun, Sebastian<br\/>Carnegie Mellon University <br\/>$69,602 - 12 mos.<br\/><br\/>STATISTICAL METHODS FOR COOPERATIVE MULTI-ROBOT MAPPING<br\/><br\/>This is the first year funding of a three year continuing award. This project will devise a new family of statistical algorithms that enable teams of mobile robots to jointly acquire maps of indoor environments. The majority of successful mobile robot applications to<br\/>date rely on maps; yet, the problem of automatically acquiring such maps with one or more robots remains largely unsolved. To build such maps, three sources of uncertainty must be overcome: uncertainty in sensing (e.g., with range finders), uncertainty in robot odometry, and uncertainty in the initial poses of the different robots relative to each other. In addition, robots must integrate information gathered distributedly, and they must coordinate their exploration strategies.The research is based on a unifying statistical framework, recently devised by the PI and others. This framework poses the problem of building maps as a maximum likelihood problem, of finding the most likely map given the data acquired by a team of robots. It uses efficient statistical techniques (specifically Dempster's EM algorithm) for likelihood maximization. The project goes beyond previous work in several aspects: First, it will address the problem of team-based map acquisition, where robots have to determine their relative location to each other in order to build a single map. This will be achieved by introducing additional degrees of freedom into the basic statistical framework. Second, maps will be represented by conjunctions of atomic object shapes (eg, rectangles, circles or segments thereof), instead of grids or similar non-iconic representations. To estimate the total number, sizes and poses of such<br\/>objects, the project will apply fast, sampling-based algorithms. Third, the project seeks to devise algorithms that enable teams of robots to collaboratively explore an environment. This will be achieved by methods for maximizing information gain, as measured by expected relative entropy. Finally, this project will pursue explorative research on learning maps in dynamic environments. If successful, this project is expected to lead to a new, more robust and scalable family of algorithms for mobile robot mapping.","title":"Statistical Methods for Collaborative Multi-Robot Mapping","awardID":"9877033","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["353783"],"PO":["234178"]},"38666":{"abstract":"Abstract <br\/><br\/>IIS-9877127<br\/>Zhu, Song-Chun<br\/>Ohio State University<br\/>$115,872 - 12 mos.<br\/><br\/>Learning Probability Models for Surface Appearance and Shape by Minimax Entropy Principle<br\/><br\/>This is the first year funding of a three year continuing award. The research in this project is aimed at three important problems in visual learning. 1). Studying a mathematical theory for visual learning. 2). Learning realistic probability models for textures, object shapes, clutter, and texton flows, which are essential constructing components of natural scenes. 3). Developing fast algorithms for model inference and model verification. Central to the research is the minimax entropy learning theory, proposed by the PI, the co-PI, and Mumford in 1997. The minimax entropy learning theory is capable of exploring the intrinsic structures (or regularities) underlying the observed imagery and patterns. The outcomes of this learning theory are statistical models of the visual patterns for textures, object shapes, clutter, and texton flows. The learned models can be used in the Bayesian framework as likelihood functions and prior probabilities, which are essential for the success of Bayesian image analysis paradigm in applications such as image segmentation, perceptual organization, and object recognition. The PI and Co-PI have achieved good preliminary results, and together, they form an effective interdisciplinary team to conduct the research.","title":"Learning Probability Models for Surface Appearance and Shape by Minimax Entropy Principle","awardID":"9877127","effectiveDate":"1999-08-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["456867"],"PO":["234178"]},"39645":{"abstract":"Proposal Number: CCR-9901696<br\/><br\/>Title: Evaluating Adaptive Mobile Systems<br\/><br\/>PI: Mahadev Satyanarayanan, Carnegie Mellon University<br\/><br\/>This proposal addresses the broad area of operating system support for quality-of-service(QOS) resource management. It specifically targets systems that exploit this resource management strategy to achieve adaptive behavior in mobile computing. Building on techniques for adaptation recently identified by the research community, the proposed work will develop the critical understanding and the experimental tools and techniques needed to compare the merits of alternative approaches to adaptation. It is likely that the insights offered by such evaluation will lead to the development of new techniques for adaptation. Further, the resource that has dominated attention so far in the research community is network bandwidth. The proposed work will broaden the scope of adaptation to include battery power. Overall, this work will help develop a well-validated and well-accepted set of design principles for mobile computing systems.","title":"Evaluating Adaptive Mobile Systems","awardID":"9901696","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["475390"],"PO":["209879"]},"49446":{"abstract":"","title":"Feasibility Analysis in Safety-Critical Shared Resource Systems","awardID":"9996434","effectiveDate":"1999-08-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["518412"],"PO":["250083"]},"39788":{"abstract":"Proposal Number : CCR-9902023<br\/>TITLE : SCALAR : Scalable Architecture for Replication on the Web<br\/>PI: Peter Scheuermann<br\/>Project Summary:<br\/><br\/>The wide use of the World-Wide Web and the ease of access to the Internet<br\/>are changing <br\/>drastically our requirements in distributed systems. The exponentially<br\/>growing scale of use of the <br\/>Web is stressing the capacity of the Internet and leads to poor performance<br\/>and low reliability of <br\/>Web service. Replication is one of the major techniques that have been<br\/>proposed to overcome these problems.<br\/><br\/>This project will focus on the development of a prototype system that will<br\/>provide a scalable <br\/>architecture for replication on the Web. A new client\/server architecture<br\/>that will allow for user-transparent geographic replication is<br\/>investigated. In this system, the clients are downloaded as <br\/>signed applets to commercially available browsers. Web servers that support<br\/>servlets can be<br\/>directly extended with servlets, otherwise with server-side proxies that<br\/>support servlets. Unlike <br\/>other proposed Web architectures, both clients and servers take active<br\/>roles in this architecture.<br\/>Server machines determine the documents to be replicated\/migrated and best<br\/>locations for the <br\/>documents, while client machines choose the best server to submit their<br\/>requests based on estimates of the servers' prior response times. Heuristic<br\/>algorithms based on clustering techniques<br\/>will be developed in order to determine sets of documents that be<br\/>beneficially migrated\/replicated as a unit.","title":"SCALAR: Scalable Architecture for Replication of Data","awardID":"9902023","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["406694"],"PO":["309350"]},"39205":{"abstract":"This research examines how household computing and the<br\/>Internet are changing the social and psychological well being of the<br\/>American family, and compares the influence of these new technologies<br\/>on households with that of older ones--telephones and<br\/>televisions. The research objectives are (1) to determine whether the<br\/>early results showing that use of the Internet decreases psychological<br\/>and social well being generalizes across samples, Internet services, and<br\/>time, (2) to identify mechanism for these effects, and (3) to compare<br\/>the impact of different patterns of household information technology<br\/>use. Data will come from a national three-wave, panel survey, allowing one<br\/>to examine how the amount of television, telephone, computing, and<br\/>Internet people use at one time predict later changes in their social<br\/>involvement and psychological well being at a subsequent time. The<br\/>survey will be supplemented with a quasi-experiment, in which a subsample<br\/>of respondents who have computers but no Internet access will be<br\/>randomly assigned free Internet access instead of a cash payments to<br\/>participate in the survey. Results will have implications both for<br\/>emerging policy debate about universal access to the Internet and for<br\/>the design of socially responsible Internet services.","title":"Telephones, TV and the Internet: The Impact Information Technology in the Home Has on Social Involvement and Psychological Well-Being","awardID":"9900449","effectiveDate":"1999-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["255294",99474,"519226","560995","565238"],"PO":["495796"]},"44430":{"abstract":"CCR-9970893 Khoshgoftaar, Taghi M.<br\/>Discovering Software Process Measures Using Genetic Programming is a research project that is developing automated methods for finding algorithms that measure novel and useful attributes of software development processes using genetic programming. A cost-effective strategy for assuring high quality software is to target enhancement activities to those modules that are most likely to have faults. When the methods being developed by this project are applied to a software development project, the resulting software process metrics will be novel, specialized for the development organization, and useful for predicting software quality. Genetic programming is a promising technology that is well-suited to searching for novel combinations of algorithmic elements that satisfy complex criteria. This project's contributions to the state of the art are empirical exploration of data stored by feature tracking systems and problem reporting systems to discover software process metrics that are useful as independent variables in software quality models, an automated method for goal-driven discovery and measurement of specialized software process metrics using genetic programming, and a demonstration of the application of genetic programming to a new domain, namely, software measurement. This improvement in the state of the art will enable software developers to achieve practical, cost-effective process improvement guided by predictions from software quality models at a new level of accuracy and robustness.","title":"Discovering Software Process Measures Using Genetic Programming","awardID":"9970893","effectiveDate":"1999-08-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[112972,112973],"PO":["564388"]},"45794":{"abstract":"Constructing and maintaining web sites is more difficult than one would like, and the tools for browsing are often not flexible enough. The PI will investigate the use of constraints to enable authors to capture the essential properties of the layout, in a way that allows flexible display for a variety of browser types and output media. The viewer will be able to impose constraints as well, for example on desired browser width or minimum font size. Some of these constraints may be requirements, and others preferences. The appearance of the final document will in effect be the result of a negotiation between author and viewer that is carried out by solving the combined sets of constraints from each. A second area of investigation will be the use of constraints to describe dynamic information, for example animations for process visualization; again, the final animation will be the result of solving the combined constraints from author and viewer. This research will be driven by a set of real-world examples arising from an ongoing interdisciplinary research project on land use, transportation, and environmental modeling. In addition to being of intrinsic interest, this application is intended to be an archetypal example of using the internet to further civic participation by diverse stakeholders using complex information sources. This project will yield a qualitative leap in the power and flexibility of the world wide web for complex and varied authoring and viewing tasks. Web authors should be able to focus on the semantic content of their documents rather than on visual formatting; viewers will be able to choose from a wider range of devices and viewing preferences, while still seeing well-formatted information","title":"Using Constraints to Enable Flexible Access and Interaction on the Web","awardID":"9975990","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["440155"],"PO":["246649"]},"42285":{"abstract":"9909512<br\/>Shriver, Bruce D.<br\/>Kelly, Ann Marie<br\/>IEEE Computer Society<br\/><br\/>Special Project: IEEE Computer Society International Design Competition<br\/><br\/>This project, the \"IEEE Computer Society International Design Competition\" (CSIDC) is planned as a substantive design competition for teams of undergraduate students in computer science, computer engineering, and related fields. The competition is being managed by the CSIDC Committee of the IEEE Computer Society. The competing teams are tasked with design and implementation of a selected prototype system that addresses a common problem. Teams are made up of three-to-five full-time undergraduate students who attend the same college or university. Each team receives a project kit, which consists of a number of hardware and software components, given by co-sponsoring technology companies. Teams work under the supervision of a faculty advisor over a three to four month period.<br\/><br\/>The projects are judged according to the team's ability to achieve the design objective; the creativity of the project; the project's usability, marketability, and maintainability; the choice of trade-offs made; and other factors. The detailed judging criteria are published in advance of the competition and each project is judged by one of several three-person evaluation teams. Each evaluation team evaluates five submissions and identifies the top two to a nine-person judging panel. The panel selects the top ten teams who advance to the Finals. The top five winners and five honorable mentions receive monetary awards.<br\/><br\/>This grant provides partial funding to assist with the costs of administering and running the competition for its first two years. It is planned that the project will become self-sufficient in future years.","title":"Special Project: IEEE Computer Society International Design Competition","awardID":"9909512","effectiveDate":"1999-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["128207",107078],"PO":["329035"]},"58400":{"abstract":"","title":"CAREER: Multiresolution-Based Adaptive Image\/Video Communications: An Integrated Approach","awardID":"0096071","effectiveDate":"1999-08-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["521731"],"PO":["564898"]},"36533":{"abstract":"Multivariate computation arises naturally in the contexts of computational algebra, computational algebraic geometry, and computational number theory. It also arises in a variety of domains including robotics, computer vision, solid modeling, automatic geometric theorem proving, and coding theory. The confluence of interest from these research areas has made it all the more important to investigate efficient methods for multivariate algebraic computation.<br\/><br\/>The works on effective Hilbert irreducibility theorem in the 1980's paved the way for designing provably efficient randomized algorithms for the fundamental problems of multivariate factorization and GCD. The theorem also laid the foundation for the novel black-box approach due to Kaltofen and Trager, as well as a related approach using straight-line programs. The geometric ideas inherent in the Hilbert irreducibility theorem and the related theory are yet to be fully exploited from an algorithmic point of view beyond their applications to multivariate factorization and GCD. The goal of this research is to utilize these ideas as the basis of efficient randomized algorithms for more general multivariate computational problems. On the one hand, effective Hilbert irreducibility will be extended as the basis of randomized reductions in a more general geometric setting. On the other hand, the black-box approach will be explored as a general paradigm for the construction of efficient algorithms for multivariate computations. The objectives are: (1) To design randomized algorithms that are substantially more efficient than the existing algorithms, and (2) To apply the results to computational number theory and computational algebraic geometry, with further application to cryptography and coding theory, and other areas as well. The investigation will initially center around a set of problems that involve multivariate polynomial systems including: solving a system of multivariate polynomials; decomposing an algebraic set defined by a system of multivariate polynomials into irreducible components; computing the degree of each component of an algebraic set; sampling<br\/>random points on a component of an algebraic set; deciding if a polynomial vanishes on a algebraic set; and determining the local dimension at a point of an algebraic set. These problems provide a fertile ground for the investigation and they have many interesting applications which will also be explored in this project.<br\/><br\/>This research will likely impact the theory and practice of multivariate computations and lead to a deeper understanding of the usefulness of randomization in the context of algebraic and geometric computations.","title":"Efficient Randomized Algorithms for Multivariate Algebraic Computations","awardID":"9820778","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["316715"],"PO":["543507"]},"58555":{"abstract":"","title":"Deformable Smooth Surface and Volume Design","awardID":"0096229","effectiveDate":"1999-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["478348"],"PO":["179846"]},"69478":{"abstract":"","title":"Computational Geometry and Biomolecular Docking","awardID":"0196366","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["478348","506211"],"PO":[179846]},"46158":{"abstract":"This project continues and expands upon the PIs' prior work on a writing tutor designed to aid deaf students in acquiring written English, in which natural language processing techniques are combined with an understanding of how the structure of sign language (both its visual elements and its semantics) may affect written English to help identify English writing errors and to improve corrective feedback. In the current proposal, the PIs plan to investigate the integration of an animated signing agent into the tutoring system framework laid out in their earlier research. To this end, they will examine and develop tutoring strategies that incorporate the use of a visual signed modality. Although they are not proposing to develop the animated sign agent itself (that being the work of others), they are interested in determining how the addition of such an agent might affect the tutoring capabilities of the system. Important issues involve capturing the structure of tutoring dialogues, as well as making principled choices between the textual and signed modalities within a dialogue. Strategies for delivering a mixed-modal tutorial dialogue will also be considered, e.g. for situations where some of the tutoring will be signed but may need to refer to either static text on the screen or to textually delivered tutorial material. In addition, the PIs propose an ongoing series of exploratory and evaluation studies to determine which modalities should be incorporated and how they should be presented. Through this process, the PIs expect to discover which individual aspects of the project need improvement before they are integrated into the overall system. The immediate impact will be in the area of natural language generation and, in particular, multi-modal generation. Understanding of how to integrate information from various modalities in a tutoring context will be enhanced. In the long term, it is hoped that development of the PIs' writing tutor will positively impact the literacy skills of people who are deaf.","title":"Investigating Multi-Modality Tutoring: Toward Computer-Based Written English Support for Deaf Children","awardID":"9978021","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["166424",117699],"PO":["565227"]},"49447":{"abstract":"","title":"CISE PostDoc: A Compositional Approach to Vision-Based Manipulation","awardID":"9996435","effectiveDate":"1999-08-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["531055"],"PO":["297837"]},"35873":{"abstract":"All-wireless and, possibly, all-mobile communication networks are likely to operate in the future for both commercial and military applications, as a result of increasing pressure for communication while<br\/>``on the move.'' Such networks differ from traditional ones in fundamental ways since they may not share the fixed, ``wired'' communication infrastructure. They are refereed to as ``multihop wireless networks\".<br\/>They may arise as alternative means of providing personal communication services, or as specialized networks that are ``stand-alone'' or are weakly coupled to the general infrastructure. The researchers propose to study the fundamental principles of operation and design that are unique to these networks,<br\/>and to develop a prototype design for a bi-level (two tier) multihop architecture that will be based on these principles.<br\/><br\/>Specifically, the researchers plan to address the following questions and to study the associated performance trade-offs that pertain mostly to layers 2-4 in the networking architecture:<br\/>a) what routing algorithms are well-suited to variable connectivity environments?<br\/>b) what address and mobility management methods are appropriate? how are they coupled to routing in this context?<br\/>c) what multicasting methods are possible?<br\/>d) what should be the role of power management as a network control parameter to conserve battery energy?<br\/>e) what are the fundamental trade offs between ``push\" and ``pull\" communications in asymmetric network architectures?<br\/>f) what is the best utilization of path diversity for reliability and efficiency under channel impairment conditions?<br\/>g) what resource allocation approaches are appropriate?<br\/><br\/>By leveraging other support, the researchers intend to implement some control policies developed as a result of this investigation in an existing network testbed, and use this experience as an aid in developing a design model for multihop wireless networks. This testbed exists in the Hybrid Networks Laboratory of the Institute for Systems Research at the University of Maryland and leverages the existing equipment and human<br\/>resource facilities available at the lab.","title":"Control & Performance Trade-offs in Multihop Wireless Networks","awardID":"9818913","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["501350","158256",90253],"PO":["234222"]},"39548":{"abstract":"9901407 <br\/>Donald, Bruce Randall <br\/>Dartmouth College <br\/><br\/>CISE Postdoctoral Research Associates in Experimental Computer Science Challenges in Micromanipulation: Massively Parallel MEMS Algorithms and Systems<br\/><br\/>As improvements in fabrication technology for MEMS (MicroElectoMechanical Systems) increase the availability and diversity of micromachines, engineers are defining a growing number of tasks to which they may be put. The idea of carrying out tasks using large coordinated systems of MEMS units motivates the development of automated, algorithmic methods for designing and controlling these groups of devices. The research focuses on algorithms and systems that enable MEMS to perform distributed manipulation tasks, taking on the challenge of design, control, and programming of massively-parallel arrays of microactuators.<br\/><br\/>New algorithms and MEMS for massively parallel distributed manipulation are being developed. This entails the design, fabrication, and control of new MEMS devices, together with the design, construction, and programming of new control systems, algorithms, and software for task-level manipulation. Algorithms and systems are being developed for part orientation, singulation, sorting, and posing. The primary focus of this research is to extend the theory of programmable vector fields to exploit sensor feedback, and investigate closed loop control algorithms, on-line algorithms, and distributed, local control of ciliary arrays. A current quasi-static vector field model is being extended to a full dynamic model. The effect of control uncertainty and error to develop motion planning paradigms that are effective under uncertainty are also being investigated. This should result in a more realistic and robust geometric theory of planning and manipulation, which is being tested by implementing algorithms on physical MEMS array devices. Finally, the application of massively-parallel micro-robotic systems to biomedical systems and human augmentation is being explored.","title":"CISE Postdoctoral Research Associates in Experimental Computer Science: Challenges in Micromanipulation: Massively Parallel MEMS Algorithms and Systems","awardID":"9901407","effectiveDate":"1999-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["213293"],"PO":["564318"]},"45213":{"abstract":"EIA-9973531<br\/>Riskin, Eve A.<br\/>University of Washington<br\/><br\/>CISE\/POWRE: Strategies to Add Redundancy for Graceful Degradation of Image and Video Quality over Lossy Packet Networks<br\/><br\/>This project will develop, analyze, and apply new algorithms to assign unequal erasure protection (UEP) to progressive data to provide graceful degradation against packet loss. If severe packet loss occurs, the most important data would be received by the decoder instead of the less important data. These new algorithms will be practical in that they will lead to improved image and video quality at the receiver in cases of high packet loss rates. Our new algorithms will have practical use in many arenas including the Internet and wireless communications.","title":"POWRE: Strategies to Add Redundancy for Graceful Degradation of Image and Video Quality Over Lossy Packet Networks","awardID":"9973531","effectiveDate":"1999-08-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["549399"],"PO":["173164"]},"45103":{"abstract":"Many real-world signals and images are naturally processed in a multiscale fashion, just as we move away from an object to view its general appearance and zoom in to see its fine details. The multiscale data representation of the wavelet transform naturally matches important signal and image singularity structures such as edges, ridges, bursts, textures, and other transients. This project focuses on characterizing these key structures using wavelets. The resulting new signal and image processing algorithms will impact a<br\/>diverse range of important problems, from the management of computer network traffic in the next-generation Internet to seamless handling of complicated data such as documents containing both text and images.<br\/><br\/>Since wavelets form a basis, they can reproduce arbitrary functions, from highly structured real-world signals and images to completely unstructured noise. In linguistic terms, the wavelet vocabulary can<br\/>be too expressive. To perform useful modeling of real-world signals and images, the vocabulary's scope must be narrowed by imposing a set of constraints -- a grammar -- that capture the salient structures of<br\/>singularities. While much research has concentrated on developing new wavelet vocabularies, the most important current challenges to wavelet-based processing lie in grammatical modeling. This project<br\/>studies a new statistical approach to multiscale modeling designed to match singularity-rich data. Grammars under consideration include efficient and trainable probabilistic graphs (hidden Markov tree models) and multiplicative pyramidal cascades. New grammar design is being guided by a detailed study of the fine structure of singularities using Besov spaces and multifractal analysis. From these new models follow new algorithms for signal and image estimation, detection\/classification, segmentation, fusion, and synthesis.","title":"Multiscale Signal and Image Processing using Singularity Grammars","awardID":"9973188","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["497441"],"PO":["564898"]},"39813":{"abstract":"This project intends to advance the state of the art in applying parallel computing to branching algorithms. The term \"branching algorithm\" refers to any method built on the basic principle of branch-and-bound search for numerical optimization, including branch-and-bound, branch-and-cut, and branch-and-price methods.<br\/><br\/>The software platform for the work will be PICO, a C++ class library package already being developed in cooperation with Sandia National Laboratories. The main goals for the continued development of PICO are:<br\/><br\/>SCALABILITY: the software should scale efficiently up to hundreds or thousands of processors. While systems this large are rare today, and some of the \"hype\" surrounding them has quieted, a robust trend towards greater parallelism continues in the computer hardware industry. The project intends to develop <br\/>technology that will continue to be useful as systems with more highly parallel CPU's become available.<br\/><br\/>SYSTEMS PORTABILITY: the package should be adaptable, by changing its run-time parameter configuration, to varying communication\/computation speed ratios. It should be usable on hardware from any vendor offering standard parallel software <br\/>tools (C++ and MPI).<br\/><br\/>APPLICATIONS PORTABILITY: the basic parallel search engine will be applicable to a wide variety of branching algorithms without duplication of the fundamental programming effort. The same core code should be able to manage parallel search applied to any branching algorithm, including relatively advanced methods like <br\/>branch and cut. <br\/><br\/>OBJECT ORIENTATION: extensible, object-oriented software design should help achieve the portability goals.","title":"Adaptable and Scalable Techniques for Branching Algorithms","awardID":"9902092","effectiveDate":"1999-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485348"],"PO":["321058"]},"36568":{"abstract":"CCR-9820855<br\/>Yao<br\/><br\/>Abstract:<br\/><br\/>The intrinsic complexity of computational problems will be studied, with an emphasis on communication questions and quantum computing. Topics to be explored include complexity theories for multiparty communications, probabilistic communications, quantum communications, quantum circuits, etc. Other subjects to be investigated include various complexity questions for algebraic decision trees. It is expected that techniques from combinatorics, probability theory, and topology will provide the main mathematical tools for this project.","title":"Complexity Studies in Communications and Quantum Computations","awardID":"9820855","effectiveDate":"1999-08-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["257042"],"PO":["543507"]},"49416":{"abstract":"","title":"Hardware Multicast Routing Techniques for Scalable Parallel Computers","awardID":"9996401","effectiveDate":"1999-08-15","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550540"],"PO":[126363]},"39648":{"abstract":"Luiba Shrira<br\/>CCR- 9901699<br\/>Brandeis University<br\/><br\/>Cooperative caching techniques have been successfully used to improve the performance of distributed file systems and the Web. By replacing more expensive access to a \"far away\" data with a more efficient access to a \"near by\" cached copy, and by coordinating the content of caches, these techniques improve the overall system performance and scalability.<br\/><br\/>Cooperative caching techniques have bot been used for transactional object systems. A principal goal of the proposed work is to design, implement and evaluate cooperative caching techniques for transactional object storage systems. These techniques will enable construction of wide-area storage systems that will provide applications with the reliability and consistency guarantees of transactions, the flexibility is user-defined objects, and still be scalable.<br\/><br\/>A major contribution of this work will be a set of new transactional cooperative cache consistency protocols for wide-area environment, global cache coordination protocols that adapt to object granularity, and security techniques that protect objects in cooperative caches. The technique will be incorporated into the Thor object storage system. This work encompasses both early research and development and prototyping.","title":"Support for Scalable Transactional Applications on the Global Internet","awardID":"9901699","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550086"],"PO":["241298"]},"39417":{"abstract":"This project is concerned with automated geometry diagram constructing or geometric constraint solving, which is to draw a declaratively-described diagram or an engineering drawing automatically. This kind of work is central to much of the current work of developing intelligent and parametric CAD systems and interactive constraint-based graphic systems.<br\/><br\/>Successful methods of automated geometry theorem proving and discovering which have been developed in recent years will be extended to methods of automated geometry diagram constructing, which in turn will be applied to the areas of intelligent CAD (computer aided design) and CAI (computer aided instruction).<br\/><br\/>New techniques for geometry constraint solving will be developed to advance the state of the art for CAD research and to provide better CAI systems. New automated reasoning techniques will be explored for developing faster and more powerful automated diagram constructing methods by using more geometry predicates, introducing new drawing tools, and extending the 2D method to 3D. The basis of the proposed research is the work on automated generation of human-readable proofs in geometry. The global propagation method for automated generation of construction steps of geometry diagrams shows that the proposed work is feasible and may lead to significant improvement of the performance of CAD systems. <br\/><br\/>Various optimization techniques, such as global optimization methods and multi-objective optimization methods will be used to develop more stable, flexible, and powerful numerical methods of geometric constraint solving.<br\/><br\/>New symbolic computation techniques will be used to enhance the power of constraint solving systems in certain special cases. These techniques include block triangulation and elimination theories based on vector and geometric invariants.<br\/><br\/>Finally, integration techniques will be studied and used to build more practical and intelligent CAD and CAI systems by incorporation all the above methods.","title":"Automated Geometry Reasoning and Diagram Constructing","awardID":"9901062","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["181052"],"PO":["321058"]},"46106":{"abstract":"As next generation high performance networks are deployed and it becomes practical to move large amounts of data over the internet, scientists and engineers will have the ability for the first time to analyze and mine remote and distributed data in casual way.<br\/><br\/>Data mining in the semi-automatic discovery of patterns, associations, changes, and anomalies is large data sets. Traditionally, in a broad sense, statistics had focused on the assumption-driven analysis of data, while data mining has focused on the discovery analysis of data. By discovery-driven, the proposers mean the semi-automatic search for interesting patterns and models.<br\/><br\/>This project will develop software tools, performance monitoring tools, network services and network protocols for distributed data analysis and data mining using emerging high performance networks. The project director proposes to test the technologies that are developed using a global testbed being built called the Terabyte Challenge Testbed (TCTB). Today over twenty scientists from seven institutions over three continents are working in the TCTB. The project director proposes to substantially expand the TCTB with this proposal to demonstrate the practically of distributed data mining.","title":"The Terabyte Challenge: Developing Software Tools and Network Services for Mining Remote and Distributed Data Over High Performance Networks","awardID":"9977868","effectiveDate":"1999-08-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V764","name":"ARMY-TERABYTE CHALLENGE"}}],"PIcoPI":["533353"],"PO":["547712"]},"39605":{"abstract":"9901589 <br\/>Rus, Daniela <br\/>Dartmouth College <br\/><br\/>CISE Postdoctoral Research Associates in Experimental Computer Science: Postdoctoral Research in Self-Reconfiguring Robots<br\/><br\/>The vision of this work is to create more versatile robots by using self-reconfiguration: hundreds of small modules autonomously organizing and reorganizing as geometric structures to best<br\/>fit the terrain on which the robot has to move, the shape the object the robot has to manipulate, or the sensing needs for a given task. Large collections of mini robots, fabricated using rapidly evolving robotic technology will perform useful coordinated work, including small scale actuation and repair, transport of small artifacts, active manipulation of surface properties, etc.<br\/><br\/>To create flexible, robust, and autonomous robotic systems capable of such applications, a fundamental goal of this research is to develop a science-base for self-reconfiguring robotics. This is a considerable challenge, which is being met through (1) new designs for reconfigurable<br\/>systems and (2) new ideas on algorithmic planning and control that can confer autonomous reconfigurability. This kind of reconfigurable robotics science will greatly enhance the autonomous capabilities of distributed robotic systems.<br\/><br\/>More specifically, the central challenges for this work are to (1) design and build simple modules that can self-reconfigure in three dimensions; (2) build distributed robot systems using these modules; (3) develop and implement centralized as well as distributed planning algorithms and<br\/>control systems that allow a set of modules to self-reconfigure as any desired static or dynamic geometric structures; (4) analyze the dynamic stability and fault tolerance of self-reconfiguring structures during motion; and (5) demonstrate the applicability of this technology through experiments in versatile locomotion and manipulation, and self-repair.","title":"CISE Postdoctoral Research Associates in Experimental Computer Science: Postdoctoral Research in Self-Reconfiguring Robots","awardID":"9901589","effectiveDate":"1999-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["527733"],"PO":["564318"]},"39748":{"abstract":"The objective of this project is to further develop and implement powerful symbolic algorithms<br\/>for the investigation of integrability, through the calculation of conservation laws,<br\/>higher-order symmetries, and recursion operators of nonlinear partial differential equations (PDES) and differential-difference equations (DDEs).<br\/>Based on the concept of scaling invariance, the implemented algorithms will allow one to compute explicitly conserved densities, Hamiltonians, generalized symmetries, and cosymmetries. On the operator side, the algorithms can be used to compute the recursion operator and its conjugate, and the symplectic and cosymplectic (Hamiltonian) operators. The envisioned product is a comprehensive symbolic package in Mathematica syntax that will complement and build on previous software to compute invariants and symmetries for PDEs and DDEs.<br\/>In addition, the project further develops symbolic software to compute exact solutions of PDEs and DDEs. The solution methods are based on multi-linear homogenization techniques. Once implemented, the software will allow the user to compute closed form solutions, such as soliton solutions and homoclinic and heteroclinic orbits, for large classes of nonlinear PDES. The extension of the method to DDEs will be investigated.<br\/>The software will be written in Mathematica syntax. The packages will be entirely symbolic and produce analytical output. The development of novel mathematical techniques, in addition to the refinement and generalization of existing methods and algorithms, is an essential part of the proposed work. A comparison with existing algorithms will also be carried out.<br\/>The aim is to provide high-quality symbolic software to researchers working on various aspects of integrability in soliton theory, dynamical systems, and mathematical physics. Specifically, our solvers and integrability testers are useful for the analysis of nonlinear PDEs and DDEs that arise in networks, elastic media, chemical kinetics, material sciences, biosciences, fluid dynamics, plasma physics, and nonlinear optics.","title":"Symbolic Software for the Study of Integrability of Nonlinear Partial Differential and Differential-Difference Equations","awardID":"9901929","effectiveDate":"1999-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["408491"],"PO":["321058"]},"39649":{"abstract":"Proposal Number: CCR-9901700<br\/><br\/>PI: Ravi Sandhu<br\/><br\/>Project-summary-paragraph<br\/><br\/>Authorization must be a cornerstone of effective security in<br\/>distributed computing. Moreover, in large-scale systems authorization<br\/>must itself be scalable. This project will conduct a holistic<br\/>investigation by looking concurrently and synergistically at<br\/>architecture, mechanisms, and models for scalable authorization.<br\/>These three aspects are intertwined and mutually dependent, so<br\/>decisions made in one impact the choices in others. Yet they can be<br\/>profitably separated for scientific study. The project will develop<br\/>and refine a set of architectures for enforcement and administration,<br\/>and analyze their relative advantages and disadvantages. It will<br\/>develop a systematic analysis of techniques for binding identity and<br\/>authorization information, and the pros and cons of mechanisms based<br\/>on different binding means. The third prong of the project will<br\/>develop decentralized models for management of authorizations. This<br\/>project will undertake theoretical and conceptual basic research<br\/>augmented by selected proof-of-concept experiments to validate the<br\/>theory.","title":"Scalable Authorization in Distributed Systems","awardID":"9901700","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["483863"],"PO":["209879"]},"40111":{"abstract":"Abstract<br\/><br\/>Filtering, prediction, and smoothing are basic signal processing operations. They are all extremely important and are implemented in every radio and TV set, CD player, modem, telephone receiver, and practically any device that extracts information by processing data. Most of the research on these operations in the past has been related to \"easy\" problems, which are tractable and amenable to nice mathematical analyses. In reality, however, there are many situations where the standard methods of signal processing do not work well and require an altogether different, more general approach. This project is developing methods and techniques for a very wide range of difficult problems that arise in such situations. The areas that will benefit from the results of this research include communications, radar, sonar, seismology, robotics, financial engineering, and control. <br\/><br\/>This research involves work with dynamic nonlinear and non-Gaussian models. The applied methodology is Bayesian, and the main role is played by the concept of sample filters. Their role is to propagate filtering densities, which are represented by samples drawn from these densities The method is implemented by generating samples from predictive densities, followed by drawing samples from posteriors. Sampling from the posteriors is challenging and will be implemented by perfect samplers. These are based on Markov chain Monte Carlo sampling and the concept of coupling from the past. Perfect sampling is a new concept, and not many results about it are available. It is even more so in the context of sampling from continuous spaces. Therefore, a significant component of the research will be on constructing efficient samplers that will fit the needs of the addressed application. The scope of work also includes performance analyses of the developed sample filters, work on case dynamic models, and development of general guidelines for the new filters.","title":"Sequential Signal Processing by Markov Chain Monte Carlo Sampling","awardID":"9903120","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["563567"],"PO":["564898"]},"41211":{"abstract":"9906590<br\/>Stoecklin, Sara <br\/>Williams, Diedre D. <br\/>Florida A & M University<br\/><br\/>Software Engineering Research and Education Laboratory (SEREL)<br\/><br\/>This award contributes to strengthen Florida A & M University objectives:<br\/>Increase participation of minority students in research activities to stimulate students' interest in advanced degrees in computing and software engineering.<br\/>Strengthen instructional and research capabilities of the CIS Department.<br\/>To meet these objectives, academically promising students are recruited and tracked for participation in scholarships, internships, workshops\/conferences, faculty mentored research, and pre-graduate school enrollment activities. Serel, a focal point for stimulating student research, will be enhanced with networks, computers, and server capabilities to further research in software engineering. The award will also be used to prepare the CIS Department for CSAB accreditation. Software Engineering methods, techniques, and tools will be developed further to:<br\/>Predict execution times of code segments by examining object code generated<br\/>Extend UML with Real-Time Architecture Specification (RAS) and Real-Time Computational Tree Logic (RTCTL)<br\/>Adapt spoken language dialogues allowing linguistic knowledge to evolve the dialogues<br\/>Build a system prototype to \"compute with words\" that provides users the freedom, to use their natural language protocols<br\/>Develop testing techniques and tools<br\/>Develop methods and algorithms for information retrieval from structured un-structured data sources using ontological knowledge domains <br\/><br\/>While increasing the participation of women and minorities in graduate education, the project will facilitate, enhance, and intensify research in CISE areas. Through this effort, FAMU is expected to develop further its computer and information science and software engineering research capabilities involving minority students in greater numbers, paving the way for the conferring of more doctoral degrees to under-represented groups, particularly African Americans and women in Computer Information Science and Engineering. It is hoped that through these efforts, the nation might find a successful model that will help in building a better racially and ethnically balanced technological enterprise for the benefit of its present and future generations.","title":"MII: Software Engineering Research and Education Laboratory","awardID":"9906590","effectiveDate":"1999-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[104320,"255940"],"PO":["297837"]},"36602":{"abstract":"A Proposal for Research on Markov Chains, Approximate Counting and Finite Metric Spaces<br\/><br\/> Alistair Sinclair<br\/> University of California, Berkeley<br\/><br\/>This project contains three loosely related themes: computational applications of Markov chains, approximate counting, and algorithmic apects of finite metric spaces.<br\/><br\/>During the past decade, the so-called \"Markov chain Monte Carlo method\" has emerged as a powerful algorithmic paradigm, with applications in such areas as approximate counting, statistical physics and combinatorial optimization. The PI is pushing ahead with these applications, in the following three directions:<br\/><br\/>Development of new techniques based on multicommodity flow to analyze geometric Markov chains (where the state space is the set of integer points inside a convex body).<br\/><br\/>Investigation of techniques such as Chebyshev acceleration, which can potentially modify a Markov chain so as to substantially speed up its convergence.<br\/><br\/>Improved understanding of newly emerging connections between the rapid mixing property of certain Markov chains on the configurations of physical systems and the thermodynamic properties of those systems.<br\/><br\/>In parallel with recent activity aimed at classifying NP-hard optimization problems according to their degree of approximability, the PI is contributing to a similar classification of #P-hard counting problems. Specific aims here include:<br\/><br\/>Investigation of novel algorithms for the central problem of approximating the permanent. <br\/><br\/>Development of approximation-preserving reductions between counting problems so that, for example, a class of problems that are equivalent to the permanent can be constructed.<br\/><br\/>Finite metric spaces provide a clean and elegant paradigm that captures (and often streamlines) several previously ad hoc algorithmic ideas. The third part of the project involves a systematic study of finite metrics, and specifically:<br\/><br\/>The design of new techniques for l1 embedding, both in the general case (to achieve a distortion within o(log n) of optimal) and for special metrics (such as those supported on planar graphs). This has algorithmic applications to, among others, the central problem of approximating the sparsest cut in a network.<br\/><br\/><br\/>Development of improved techniques for embeddings into low-dimensional spaces. These have applications to algorithms for ubiquitous problems such as nearest-neighbor searching and clustering.<br\/><br\/>Approximation of complex metrics by simpler ones. This would allow existing algorithms that work well for simple metrics (such as trees) to be applied more widely.","title":"A Proposal for Research on Markov Chains, Approximate Counting and Finite Metric Spaces","awardID":"9820951","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["450995"],"PO":["543507"]},"45556":{"abstract":"EIA-9974960, <br\/>Rappaport, Theodore<br\/>Virginia Polytechnic Institute<br\/><br\/>Next Generation Software: A Collaborative Problem Solving Environment for Modeling of Broadband Wireless Communication Systems.<br\/><br\/>This project proposes to develop a collaborative problem-solving environment to support engineers who will design and analyze the wireless communication systems of the future. Broadband wireless systems are essential for the success of the Next generation Internet and future generations of portable multimedia communicators. However adequate design and analysis tools for supporting these environments do not exist.<br\/><br\/>This project will pull together researchers from the Mobile and Portable radio research Group and the Problem-Solving Environments group at VT to collaborate in building a comprehensive design and support system, the Site-Specific System Simulator for Wireless Communications. This project is aimed to support fundamental problem solving in broadband wireless communications systems, and will be used not only for the design of wireless systems, but also validation of new wireless communications modeling approaches. It is also expected to serve as a testbed for developing collaborative problem solving environments.<br\/><br\/>Among the research milestones proposed here include:<br\/><br\/>A. Develop methods to automatically perform and analyze simulations of wireless networks<br\/>B. Implement knowledge-based recommender system for selecting specific models<br\/>C. Fuse high-fidelity simulation with more abstract simulation results to minimize simulation effort<br\/>D. Integrate the recommender system in a larger design optimization loop <br\/>E. Develop visualization techniques to aid the simulations and analysis <br\/>F. Implement an integrated software environment for collaborative design<br\/>G. Validate and test the methods and tools developed above","title":"Next Generation Software: A Collaborative Problem Solving Environment for Modeling of Broadband Wireless Communication Systems","awardID":"9974956","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["536668","346629","550857","498314"],"PO":["301532"]},"46898":{"abstract":"This is a one-year standard award. This proposal requests funds to support a workshop to promote Western Hemisphere collaboration in computer science and engineering to solve regional and global problems. The meeting, to be jointly sponsored by the National Science Foundation and the Organization of the American States, will be held in Manzanillo, Colima, Mexico between August 10-12, 1999. The workshop will bring together leading computer science and engineering researchers and representatives of federal agencies from 34 Western Hemisphere countries (Canada, United States and Latin American and Caribbean nations). The participants will discuss benefits and barriers to Western Hemisphere collaboration, identify projects that will serve as research testbeds for solving regional and global problems, and propose collaboration models to their success. The proposed workshop is expected to produce specific recommendations to establish a new multinational program to support Western Hemisphere collaboration in computer science and engineering.","title":"Workshop: Western Hemisphere Collaboration in Computer Science and Engineering","awardID":"9981367","effectiveDate":"1999-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551122"],"PO":["565227"]},"36635":{"abstract":"This project is concerned with the design and analysis of simple and efficient algorithms for a number of basic problems arising in parallel and distributed computing. Problems related to caching, scheduling and sorting are considered.<br\/><br\/>Efficient caching strategies are critical to the performance of virtually any computing system, be it sequential, parallel, or distributed. As a consequence, such strategies have been intensively studied for decades. Unfortunately, the time-tested techniques that successfully optimize cache performance in many existing systems do not seem to scale well to complex wide-area networks such as the Internet. Two major goals of this project are to develop suitable abstract models of such complex networks, and to design simple and efficient caching strategies for these abstract models.<br\/><br\/>Efficient scheduling of dynamically generated tasks is a central problem in parallel computing. Scheduling determines when and where to execute each task and can dramatically affect performance. Traditionally, such scheduling decisions are left to the programmer, an approach that allows for the possibility of optimal performance, but makes parallel programming difficult. The work-stealing algorithm is a simple and provably efficient \"automatic\" task-scheduling method. However, the practical utility of such a scheduler depends critically on the amount of overhead that it incurs. This project explores methods for improving the performance of distributed data structures as the concurrent deque used in the work-stealing algorithm.<br\/><br\/>Two sorting-related problems are addressed in this project. The first is concerned with the analysis of a simple periodic scheme for sorting on a two-dimensional mesh. The scheme is well-suited for VLSI implementation and is conjectured to achieve optimal average-case performance. The second sorting-related problem is concerned with the analysis of a simple randomized n-imput circuit that is conjectured to map the inputs to the outputs according to a near-uniform random permutation. Such a circuit has a number of applications in cryptography and in the design of efficient routing networks.","title":"Parallel and Distributed Algorithms for Caching, Scheduling, and Sorting Problems","awardID":"9821053","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518067"],"PO":["543507"]},"36207":{"abstract":"EIA-9819892<br\/>Karimi, Hassan<br\/>Novak, Joan H.<br\/>MCNC-North Carolina Supercomputing Center<br\/><br\/>This is a planning grant to explore possibilities for geospatial data mining, conflation, searching, and extraction techniques for integrated air, water and land environmental modeling activities in a distributed environment. The long-term goal is to be able to model the transportation and ultimate effect of nutrients and chemicals. EPA would be the primary partner agency (with some involvement of the US Geological Survey), and the Neuse River basin watershed in North Carolina would be the context.","title":"Digital Government: Geospatial Data Mining Techniques for a Multimedia Integrated Modeling System","awardID":"9819892","effectiveDate":"1999-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["118057",91170],"PO":["371077"]},"39606":{"abstract":"9901592<br\/>Lynch, Nancy A<br\/>Massachusetts Institute of Technology<br\/><br\/>CISE Postdoctoral Research Associates in Experimental Computer Science: Support for Developing Highly Available Distributed Applications<br\/><br\/>The focus of this research in highly available distributed algorithms and systems is on group<br\/>communications services and their applications. Group communication technology is becoming commonly exploited in academia and industry, and the significance of the group communication paradigm is becoming widely acknowledged. The goals of the work are to 1) construct a comprehensive framework for the construction of groupware and computer supported cooperative work applications, based on the group communication paradigm, 2) model complex distributed systems formally, focusing on group communication systems, and implement algorithms and communication protocols in a way that would allow verification of the actual implementation, and 3) understand more of the inherent limitations of fault tolerant distributed systems and the tradeoffs involved in building such systems.","title":"CISE Postdoctoral Research Associates in Experimental Computer Science: Support for Developing Highly Available Distributed Applications","awardID":"9901592","effectiveDate":"1999-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["517826"],"PO":["564318"]},"45865":{"abstract":"9977071<br\/>Vasquez, Ramon E. <br\/>Rodriguez, Domingo <br\/>University of Puerto Rico at Mayaguez<br\/><br\/>A Program for Research in Computing and Information Sciences and Engineering (PRECISE)<br\/><br\/>PRECISE expects to significantly strengthen the current environment in Computing and Information Science and Engineering (CISE) through more diverse, competitive, and sustainable research. The award will contribute to implement the multi-campus Ph.D. model as an academic program. While increasing the participation of women and minorities in graduate education, the project will facilitate, enhance, and intensify research in CISE areas.<br\/>The project will reinforce and support the following research groups: <br\/>Scientific Computing Group, <br\/>Software Sciences and Engineering Group, and<br\/>Automated Information Processing and <br\/>Digital Systems Implementation Group. <br\/><br\/>These groups conform the core of the CISE multidisciplinary research environment, foster the formation of new multidisciplinary groups, and partner with industry, government, and universities in research projects of mutual interest. A Computing Research Seminar will be established as a formal forum for the discussion of common grounds of CISE areas, and the presentation of frontier research. A Computer Research Laboratory will be developed to support the proposed research and training activities. <br\/><br\/>Through this effort, the University of Puerto Rico at Mayaguez is expected to develop further its computing science and engineering research capabilities involving minority students in greater numbers, paving the way for the conferring of more doctoral degrees to under-represented groups, particularly Hispanic and women in Computer Science and Engineering. It is hoped that through these efforts, the nation might find a successful model that will help in building a better racially and ethnically balanced technological enterprise for the benefit of its present and future generations.","title":"MII: A Program for Research in Computing and Information Sciences and Engineering (PRECISE)","awardID":"9977071","effectiveDate":"1999-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["255932",116621,"414667","444649"],"PO":["539087"]},"45557":{"abstract":"EIA-9974960<br\/>Valerie Taylor<br\/>Northwestern University<br\/><br\/>Next Generation Software: A Performance Modeling Framework for the Analysis of Complex Applications and Systems<br\/><br\/>This proposal aims to develop a performance framework (Prophesy) that facilitates the development of very-fine as well as coarse-grain analytical performance models of applications, to allow understanding of how realist, large applications and computer system features interact and affect performance. Furthermore the project will develop an algebra which will identify how elementary performance models of system components and application algorithms should be composed to reflect the performance of the application executing on parallel machines, Grids or GiBs platforms.<br\/><br\/>The project will test the developed methods in three production class applications, a scientific application including a visualization component, an application using AMR algorithms, and an ASCI class application. Among the hardware architectures to be modeled, the complex HTMT architecture is included in this study. <br\/><br\/>The resulting will make some important advances in the system level hardware-software codesign. Specifically the proposed work will benefit computing system designers, application designers, and compiler developers in building their respective class of systems.","title":"Next Generation Software: Prophesy: A Performance Modeling Framework for the Analysis of Complex Applications and Systems","awardID":"9974960","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["541641"],"PO":["301532"]},"45579":{"abstract":"EIA-9975053 <br\/>Kane Kim<br\/>University of California-Irvine<br\/><br\/>Next Generation Software: TMO Based modeling and Design of Reliable Next-Generation Complex Software.<br\/><br\/>The Time-triggered Message-triggered Object (TMO) structuring scheme that has been formulated by the PI's in recent years is intended to facilitate component based real-time distributed software engineering in a form which software engineers in the vast business software field can adapt to, with small efforts. It is a syntactically simple and natural extension, but semantically powerful extension of the conventional object structuring approaches.<br\/><br\/>In the proposed research, the PI's intend to render the TMO-based RT distributed computing application software engineering methodology in a more versatile form and validate the effectiveness of the methodology in real application environments, via a systematic university-industry collaborative experimental study.<br\/><br\/>Among the milestones in the project include establishing: <br\/>Formalized TMO-structured modeling techniques for hierarchical multi-level specification, design and analysis of complex distributed systems<br\/>C++ and Java based tools for TMO-structured RT and distributed programming and expression of high level abstractions<br\/>Middleware models of commercial level RT OS systems<br\/>Techniques and tools for analysis and timeliness-guarantees of TMO component based software systems<br\/>Techniques for dynamic optimization of mobile software components<br\/>Techniques and tools for visualization of real-time simulations<br\/>Demonstration and validation of all the techniques and tools developed in the project.","title":"Next Generation Software: TMO Based Modeling and Design of Reliable Next-Generation Complex Software","awardID":"9975053","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["217949","296371","486136"],"PO":["301532"]},"38507":{"abstract":"EIA-9976640<br\/>Marcionini, Gary<br\/>Liddy, Elizabeth D.<br\/>University of North Carolina @ Chapel Hill<br\/><br\/>Digital Government: Citizen Access to Government Statistical Data<br\/><br\/>This proposal will conduct research to improve the location\/retrieval, reading, navigation and manipulation of tabular statistical data from Federal agencies. These data cover many different domains (e.g., health, labor, transportation), of interest to professionals in the field and to citizens. This work will be accomplished through collaboration with the Bureau of Labor Statistics, the Energy Information Agency, the National Center for Health Statistics and the Bureau of Census. In addition to the Federal agencies, the partnership includes researchers from the University of California at Berkeley, Syracuse University, the University of Maryland and Textwise, a commercial company.","title":"Digital Government: Citizen Access to Government Statistical Data","awardID":"9876640","effectiveDate":"1999-08-15","expirationDate":"2001-10-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0403","name":"Division of SCIENCE RESOURCES","abbr":"NCSE"},"pgm":{"id":"8806","name":"INFO & TECHNOLOGY SVCES PRGM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["361079","527292","531548","165198"],"PO":["371077"]},"39618":{"abstract":"This research is on embedded systems design tools for building custom<br\/>application-specific instruction processor (ASIP) architectures that are no<br\/>bigger, or no more complex than necessary. Developing an ASIP, not only<br\/>requires hardware design, but also requires the use of a set of evaluation<br\/>tools such as an assembler, compiler and simulator. This investigation uses<br\/>a processor description to serve as a common starting point for the<br\/>development of these tools, as well as for hardware synthesis. The ISDL<br\/>language, being developed at MIT, for exactly this purpose is being used in<br\/>developing a complete software development environment, as well as hardware<br\/>generation. The simulator is used to obtain clock cycle estimates on<br\/>application code, and to evaluate the overall architecture performance.<br\/>Synthesis of processor datapaths enables hardware generation and provides<br\/>accurate, cycle-time estimates. To support software compilation, a<br\/>retargetable assembler, code generator and optimizer will be developed that<br\/>receive as input both a machine description in ISDL, and the program to be<br\/>compiled onto the described machine. New optimizations to produce code of<br\/>the highest quality in a reasonable amount of time are being evaluated. The<br\/>base of our retargetable compiler is SPAM, an embedded compiler framework<br\/>that has been developed by researchers at MIT, Princeton and UNICAMP,<br\/>Brazil. In many cases, application code is not written in high-level<br\/>programming languages, and it is necessary to deal with assembly or legacy<br\/>code. Thus automatic methods for optimized binary-to-binary translation are<br\/>being investigated. To do this, the legacy binary\/assembly code is<br\/>decompiled to intermediate forms used by our compiler infrastructure and<br\/>then using the optimizing compiler technology to generate high-quality<br\/>assembly for the target architecture.","title":"NSF CNPq Collaborative Research on Design Environments for Application-Specific Programmable Processors","awardID":"9901628","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["561979"],"PO":["562984"]},"38529":{"abstract":"EIA-9876707<br\/>Nusser, Sarah M.<br\/>Covert, George F.<br\/>Iowa State University<br\/><br\/>Digital Government: A Framework for the Dissemination, Use, and Storage of Geospatial Images for Field Data Collection<br\/><br\/>This project has two components; 1) a planning process for a later proposal partnering the researchers with the Natural Resources Conservation Center of the US Department of Agriculture, and 2) several small workshops to foster information exchange between GIS experts, the computer\/information science research community, and Federal agencies with related interests. The general focus is to develop a framework by which multidimensional spatial data can be collected, analyzed, and distributed in a networked environment. The domain area of Federal statistics is a vehicle for exploring technologies that have the potential to be applied in other departments and domains.","title":"Digital Government: A Framework for the Dissemination, Use and Storage of Geospatial Images for Field Data Collection","awardID":"9876707","effectiveDate":"1999-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["530846","450918","121252","376530"],"PO":["371077"]},"40003":{"abstract":"This research aims to unite broadband communications with wireless access thus making possible un-tethered access to a wide range of broadband communications services, such as interactive multimedia communications, high resolution image or large file transfer, and high resolution video teleconferencing. This is done through millimeter wave radio technology and small high-gain antennas. This technology is termed next-generation local multi-point distribution system (NG-LMDS). This is intended to be a cost-effective competitor to all wire-line proposed alternative methods of broadband distribution. Broadband wireless access will afford potentially enormous bandwidth on demand to people. It has the potential to simplify access to interactive business, information and entertainment services by subscribers in fixed locations.<br\/><br\/>Establishment of a local wireless access network which integrates the most advanced millimeter-wave radio technology, coupled with asynchronous transfer mode Wireless Access Point (WAP) will provide homes, schools and businesses with the benefits of choice as regards the expanding list of broadcast and bi-directional multimedia communications services. The research structure involves:<br\/><br\/>Statistical analysis of interference in an ATM-LMDS cellular configuration.<br\/><br\/>Design of fixed-cellular ATM-LMDS architectures; with minimum interference by taking advantage of high-gain antennas, frequency-segmentation and polarization interleaving. <br\/><br\/>Analysis of spectral-efficiency in frequency reuse ATM-LMDS cellular architectures. <br\/><br\/>Extending the dynamic range of adaptive-coding by combining it with adaptive modulation in ATM-LMDS cellular architecture.<br\/><br\/>Investigating the influence of feedback channel impairments and transmission delay on the performance of adaptive rate systems in preserving an end-to-end Quality-of-Service in ATM-LMDS wireless loop.<br\/><br\/>Analysis of delay and throughput in ATM-LMDS fading channel, using adaptive rate coding techniques. <br\/><br\/>Assessing effects of adaptive transmission rate on the interference level of ATM-LMDS cellular architecture.","title":"Broadband Wireless ATM Local Loop Using Millimeter Wave-Band","awardID":"9902846","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["509240"],"PO":["223414"]},"45569":{"abstract":"EIA-9975015 <br\/>Plank, James S.<br\/><br\/>University of Tennessee-Knoxville<br\/><br\/>Next Generation Software: Logistical QoS through Application-driven Scheduling of Remote Storage<br\/><br\/>The research in the proposed project (Logistical Computing and Internetworking - LoCI) is aimed at developing middleware that can provide reliable, flexible, scalable and cost-effective delivery of data with quality of service.<br\/><br\/>The proposal aims to develop new approaches to enable these capabilities, among which is the proposed logistical QoS, to provide much more flexible control of message buffering without requiring difficult end-to-end guarantee requirements. This can be accomplished by developing techniques like data staging, by moving data in advance and storing them close to the receiver, and the proposed project will investigate such notions of the logistical network computing.<br\/><br\/>The proposal will develop such approaches and techniques and use existing tools and protocols to implement and test these ideas, such as the Internet Backplane Protocol, the Network Weather Service, NetSolve, and the Application Level Scheduling systems that the PI and his co-PI's have developed over the years. The effort will result in middleware support more readily exploited by the applications.","title":"Next Generation Software: Logistical QoS through Application-Driven Scheduling of Remote Storage","awardID":"9975015","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["558550","530745","450864","402357"],"PO":["301532"]},"41962":{"abstract":"Proposal Number: CCR-9974980<br\/>Title: Improving Hugs: Haskell as a Research Tool<br\/>PI's: Tim Sheard and Mark Jones, Oregon Graduate Institute<br\/><br\/>The programming language Haskell has emerged as the standard lazy<br\/>functional language, and offers strong typing, higher-order features, and<br\/>parametric polymorphism. The Hugs interpreter is a simple, easily ported,<br\/>implementation of Haskell. This project will enhance Hugs, focusing on<br\/>issues of usability and integration with the high-performance Glasgow<br\/>Haskell Compiler.<br\/><br\/>The project improves the Hugs interpreter in several ways:<br\/><br\/>Integration with GHC runtime system:<br\/>By completing the integration of the Glasgow Haskell Compiler run-time<br\/>system with the Hugs interpreter, a fully interoperable system capable<br\/>of executing a mixture of compiled and byte-code interpreted code will<br\/>be constucted.<br\/><br\/>Declarative debugging: <br\/>The project will investigate the problem of tracing the computational steps<br\/>of a lazy functional program, at a level of abstraction consistent with the<br\/>programmers view of the program.<br\/><br\/><br\/>Better Error Reporting:<br\/>The project investigates how to improve the type error debugging<br\/>process by building improved type inference systems into<br\/>Hugs, capable of reporting both where and why type errors have<br\/>occurred.<br\/><br\/>Successful integration with the GHC run-time system has numerous<br\/>benefits. It allows the Hugs interpreter to access the existing GHC<br\/>features including compiled preludes and libraries, while maintaining<br\/>the small footprint and ease of use of an interpreter. Completion of<br\/>the project will greatly increase the size and complexity of the<br\/>problems to which the Hugs interpreter can be applied.","title":"Group Travel for U.S. Participants in the 6th International Symposium on High Performance Computer Architecture","awardID":"9908701","effectiveDate":"1999-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["485665"],"PO":[106255]},"34504":{"abstract":"Though the cost of storing and transmitting information continues to decrease, such reductions seem only to stimulate demand for information and, consequently, for further developments in data compression. The first goal of this research is to advance the theory and practice of quantization as a lossy data compression methodology, for sources such as speech, images, video and music. Synchronization is a key issue in data compression systems that operate in environments where decoding may begin at an arbitrary point in the compressed stream of bits, or where the compressed stream may be corrupted by insertion, deletion or substitution errors. The second goal of this research is to develop a theory of data synchronization<br\/>that takes into account the users need to know the time indices of the data, as well as its values.<br\/><br\/>The quantization theory to be developed will increase the qualitative and quantitative understanding of how the performance of lossy compression systems relates to their complexity, with the goal of enabling better systems to be designed. The methodology is largely, but not exclusively, based on high resolution theory techniques and concepts. The focus is primarily on vector quantization, both as a practical technique and as a paradigm for studying fundamental issues.<br\/>Though synchronization methods have been much developed, there is no theory for the analysis and design of synchronization codes that, in addition to permitting the decoder to synchronize with the encoder, enable it to produce estimates of the time indices of the data it decodes. This research will develop such a theory. It will focus on optimizing the tradeoffs among coding efficiency (rate), resynchronization delay, and the production of timing information. The application of such methods to coding for channels with insertion, deletion and substitution errors will also be investigated.","title":"Theory of Quantization and Synchronization with Timing","awardID":"9815006","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["381337"],"PO":["223414"]},"44437":{"abstract":"9970907 Susan Horwitz<br\/>Java programmers have the security of knowing that errors like out-of-bounds array indexes or attempts to dereference a null pointer will be detected and reported at runtime. Java also provides security via its strong type system; for example, it is not possible to treat a pointer as if it were an integer or vice versa, and run-time type checks ensure theccorrectness of down-casting. C and C++ programmers count on tools like Purify to help find out-of bounds array accesses and bad pointer dereferences. However, those tools do not provide help with errors that involve bad run-time types. This research involves the design and implementation of a tool to provide new kinds of run-time checks based on type information. The goal of the tool is to help C\/C++ programmers find errors in their programs that manifest themselves as bad run-time types, in the same way that Purify helps programmers find errors in their programs that manifest themselves as bad run-time memory accesses.","title":"Debugging Via Run-Time Type Checking","awardID":"9970907","effectiveDate":"1999-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["331999"],"PO":["397849"]},"41215":{"abstract":"9900660<br\/>Adjouadi, Malek<br\/>Barreto, Armando<br\/>Pasztor, Ana<br\/>Martinez, Maria<br\/>Roig, Gustavo<br\/>Florida International University (FIU)<br\/><br\/>Development of an Institutional Infrastructure with Special Focus on Human-Computer Interfaces and Information Processing<br\/><br\/>This award enables the establishment of a multidisciplinary educational infrastructure with key innovations in engineering that promote an environment with effective learning strategies based on bridging instructional activities with research facilities. The award drives an ambitious program that focuses on FIU's strengths in the areas of human-computer interface research to include those persons with disabilities; key aspects of information processing (image and signal), including real-time applications; hardware-software integration; distributed processing, and data structures. A supplemental instruction component is included to tackle head-on the failure rates in those SEM \"high risk\" courses (failure rates exceeding 30%), which are critical foundations for Computer Science and Engineering. Within the proposed infrastructure, a comprehensive pipeline is established to attract more students in engineering and to redress at FIU the national trend showing limited graduation rates in Computer Science and Engineering. The project also addresses the recruitment and retention of students from groups traditionally underrepresented in Computer Science and Engineering, namely women, Hispanics and African Americans. In addition to these educational enhancements, the impact of the project will be extended through expected research results in distributed processing, and image and signal processing, particularly in their application to human-computer interfaces for individuals with disabilities.<br\/><br\/>Through this effort, Florida International University is expected to develop further its computing science and engineering research capabilities involving minority students in greater numbers, paving the way for eventual conferring of more doctoral degrees, not only to Hispanic students, but also to African American, and disabled students. It is hoped that through these efforts, the nation might find a successful model that will help in building a better racially and ethnically balanced technological enterprise for the benefit of its present and future generations.","title":"CISE MII: Institutional Infrastructure in Support of Computer and Software Engineering with Special Focus on Human-Computer Interface Research and Information Processing","awardID":"9906600","effectiveDate":"1999-08-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["420405","558105","256830","435839","159459"],"PO":["557609"]},"41414":{"abstract":"Abstract <br\/><br\/>IIS-9907141<br\/>Sarkar, Sudeep<br\/>University of South Florida<br\/>$73,407 - 12 mos.<br\/><br\/>The Role of Learning in Perceptual Organization of Complex Images<br\/><br\/>This is the first year funding of a three year continuing award. <br\/>Perceptual organization is the ability to efficiently group low-level<br\/>primitives, such as pixels or edge segments or regions, so as to form<br\/>object hypotheses with minimal domain knowledge. This process is an<br\/>essential link between the noisy low-level segmentation processes and<br\/>the sophisticated, computationally expensive, object recognition<br\/>processes. This work will address three major scientific issues<br\/>related to perceptual organization in computer vision: (i) How to<br\/>efficiently form large groups of extended low-level primitives by<br\/>assembling small groups of features (grouplets)? The concept of graph<br\/>spectra is an ideal mechanism for this purpose. (ii) How to encode<br\/>the dependency of grouping parameters on image statistics? Joint<br\/>probability distributions encoded as Bayesian networks offer an<br\/>efficient abstraction. (iii) What is the role of learning in<br\/>perceptual organization? The specific roles of learning explored would<br\/>be threefold: (a) learning the image to grouping parameter mapping,<br\/>(b) learning the forms of the groups, and the associated hierarchy,<br\/>from object models, and (c) learning the primitive type, such as<br\/>corners, textured-regions, or edges, that is appropriate for a domain.","title":"The Role Learning in Perceptual Organization of Complex Images","awardID":"9907141","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["522400"],"PO":["234178"]},"41029":{"abstract":"The proposal from Texas Tech seeks partial support of a DS-3 connection to the gigaPoP at Texas A&M University's (TAMU) Houston Institute of Biosciences and Technology (IBT). Applications proposed include IP multicasting, both point-to-point and multicast, to be used in facilitating collaboration, seminars and presentation of course materials focused on areas such as biocybernetics and bioinformatics. Other applications include simulations of human movement systems with specific application to solving problems of vision and human gait; retrieval of real-time and archived data sets used in developing innovative multimedia applications for accessing and analyzing meteorological data and precision agriculture. Support of system-level experiments on the active and passive components for Dense Wavelength Division Multiplexing (WDM) is another intended use of the vBNS. Collaborating institutions include but are not limited to: the University of Chicago, Washington University at St. Louis, Johns Hopkins University, University of Notre Dame, University of Washington, Texas A&M, University of California-Davis, DARPA, the Ballistic Missile Defense Organization, and the National Library of Medicine.","title":"Texas Tech University Connectivity to the vBNS","awardID":"9906090","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["420466","119092","306060","117382","561160",103867],"PO":["182196"]},"36607":{"abstract":"CCR-98-20965 <br\/>Khuller, Samir <br\/><br\/> <br\/><br\/>This project will conduct a combination of theoretical and practical explorations of algorithms for graph theoretic problems in graph connectivity, facility location, distance preserving subgraphs, multimedia storage and data broadcast. Emphasis will be on good approximations for NP-hard problems for problems in optimization. Particular emphasis will be on greedy methods and heuristics for algorithms.","title":"Designing Algorithms for NP-Hard Graph Problems","awardID":"9820965","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["538796"],"PO":["543507"]},"58409":{"abstract":"","title":"POWRE: Computational Problems Related to Phylogenetic Tree Reconstruction","awardID":"0096080","effectiveDate":"1999-08-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["485997"],"PO":["173164"]},"42735":{"abstract":"This action is part of continuing cooperation between the NSF\/CISE and the NLM\/NIH to jointly fund activities of common interest. The award will be directed to NLM managed competitions entitled, \"Visible Human Project Atlas of the Head and Neck, and Visible Human Project Computer Imaging Tools\", announced in RFPs NLM99-103DJH and NLM99-105\/SLC. The goals of the Visible Human Project Atlas of the Head and Neck solicitation is develop an educational, public domain-accessible web site, which in addition to offering new scholarly opportunities, may serve as a prototype for new educational applications based on the Visible Human Project data sets. The goals of the Visible Human Project Image Processing Tools solicitation is to develop an application programmer interface (API) and initial implementation of a Segmentation and Registration Toolkit (SRT).","title":"Visible Human Project Atlas of the Head and Neck, and Visible Human Project Computer Imaging Tools","awardID":"9910763","effectiveDate":"1999-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[108188],"PO":["433760"]},"44836":{"abstract":"The Adaptive Wavelet element method is a new mathematical method which is fundamentally more appropriate for highly parallel computing than existing methods. This project studies scalable parallel algorithms and simulations based on adaptive wavelet methods for the investigation of combustion flow problems. The project isa driven by the need for large scale simulation capability required by the intrinsic physical property of industrial applications.<br\/><br\/>The focus of this research is on parallel wavelet simulation of combustion flow problems, which includes the associated algorithmic\/mathematical development and software implementation. A new method - the Wavelet Element Method - is introduced based on wavelet and domain decomposition methods. The new method extends the applicability of wavelet methods to combustion problems and other viscous flow problems in more complex geometries and provides a coarse grain parallelism based on domain decomposition. It is efficient, stable, highly accurate, and highly parallel, and it has good data locality. Wavelets support localization in both space and frequency domain which makes adaptive grid generation possible. Wavelet coefficients uniquely indicate the workload variation across subdomains, and parallelism in the wavelet element method comes from two levels - the level of domain decomposition and the level of parallel solution of Spline Wavelet ADI in each subdomain.<br\/><br\/>Four main tasks will be performed: 1) Develop a two level parallelized wavelet element method, which combines the domain decomposition and wavelet ADI methods, to maximize parallelism, locality, and scalability. 2) Investigate interface conditions among elements (subdomains) in the context of wavelet element and investigate their effects on solution accuracy, workload balance, and communication cost. 3) Study dynamic workload balance based on wavelet coefficients on both domain decomposition level and on ADI wavelet solution in each subdomain. 4) Test the scalable parallel adaptive wavelet element methods on the Deflagration to Detonation Transition Problems for multidimensional premixed flames.","title":"Adaptive Wavelet Element Methods for Highly Parallel Computations","awardID":"9972251","effectiveDate":"1999-08-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["542982"],"PO":["321058"]},"45859":{"abstract":"EIA-9977030<br\/>Voigt, Robert G.<br\/>Simha, Rahul<br\/>College of William & Mary<br\/><br\/>MRI: Acquisition of High Performance Clusters for Effective Parallel Computing in Computational Science Research and Education<br\/><br\/>The PIs request funding to purchase and operate a high speed network of computer systems that will complement state investment in computational science at College of William and Mary and help drive significant, related research and educational activities. The equipment will be used as the centerpiece of the common research focus: the effective use of parallel systems for scientific computation. The PIs seek hardware that balances the many needs of their activities. The selected architecture consists of three interconnected subsystems each of which is a cluster of workstations or PC's. Two of these are 16-processor and 32-procesor Pentium-based Beowulf-like systems built with different interconnection networks, and the third is a combination of four 4-processor SUN multiprocessors.","title":"MRI: Acquisition of High Performance Clusters for Effective Parallel Computing in Computational Science Research and Education","awardID":"9977030","effectiveDate":"1999-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["418746","551992","562052","333016","518455"],"PO":["557609"]},"40525":{"abstract":"The object of the project is the development of the necessary tools and know-how to design and implementable signal detector for magnetic recording systems operating in signal-dependent correlated noise environments, i.e., media noise dominated environments. According to recent studies, it is anticipated that the current magnetic recording technology will hit the superparamagnetic limit in approximately five years. The superparamagnetic limit occurs when the magnetic media particles become so small that thermal energy at room temperature is enough to destabilize the particle by randomly switching its magnetization orientation. To push back the approaching superparamagnetic limit, signal processing circuits will have to cope with a radically changed signal\/noise environment: the signal-to-noise ratio will drop, the magnetic media noise will dominate over the electronics white noise, and the overall noise will become extremely correlated and signal-dependent due to the intersymbol interactions in the magnetic media and due to the coloring introduced by the read head. This project will develop a fundamental understanding of nonstationary stochastic modeling and use it to develop a magnetic recording detector ideally tuned to correlated nonstationary media noise.<br\/><br\/>The project will be conducted through collaboration between Harvard University and IBM Almaden Research Center. IBM, a recognized global magnetic recording technology leader, is in a unique position to provide the cutting edge experimental support required establishing the link between the theoretical and experimental parts of the project. The project combines three major efforts. (i) A understanding of signal-dependent noise modeling issues will be developed. This is an extension of widely used autoregressive modeling methods in stationary processes to nonstationary processes. Particular attention will be given to objective model-size estimation through the adaptation of Akaike's information theoretic criterion or Rissanen's minimum description length principle. (ii) The receiver will be designed through a complexity-constrained optimization procedure. Since both the intersymbol interference length and the noise memory length contribute equally to the receiver complexity, the constrained-complexity detector will minimize the sum of the two lengths under a performance specification. (iii) The final goal is the implementation of the detector in VLSI technology. Towards this goal, a software detector and then a hardware detector will be developed. Both detectors will be tested in real channel environments at IBM Almaden Research Center.","title":"Signal\/Noise Modeling and Detector Design for Media Noise Dominated Magnetic Recording Systems","awardID":"9904458","effectiveDate":"1999-08-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["492224",102639],"PO":["188393"]},"40767":{"abstract":"Human language depends upon a dictionary of words (the mental lexicon) and rules which specify how those words are put together into larger words, phrases, and sentences (the mental grammar). The computational and brain bases of these two fundamental language capacities are still not well understood. This project investigates the novel view that the learning and use of the two language capacities depends upon two more general-purpose memory systems whose neural foundations are relatively well studied. Specifically, it is hypothesized that the acquisition and use of words depends upon \"declarative memory\" temporal-lobe brain circuits previously shown to underlie the learning and use of fact knowledge, such as what a zebra is and where it lives. It is also hypothesized that the acquisition and use of grammatical rules depends upon \"procedural memory\" left frontal\/basal-ganglia brain circuits previously shown to underlie the learning and expression of motor and cognitive \"skills,\" such as riding a bicycle. On this \"declarative\/procedural\" view of language, lexicon and grammar are linked to distinct general-purpose systems, each responsible for a particular set of language and non-language functions. The declarative\/procedural view contrasts with the two main classes of previously proposed theories regarding the computational and neural mechanisms of language. It shares the perspective of traditional \"dual-system\" theories that lexicon and grammar depend upon distinct systems, but it diverges from their claim that these systems are responsible for language alone. Conversely, while the declarative\/procedural view agrees with \"single-system\" theories that the two language capacities depend upon general-purpose brain circuitry, it diverges from their claim that both capacities are linked to a single system with a broad distribution in the brain. <br\/><br\/>To distinguish the three views, the project will focus on a simple distinction in language: between regular and irregular transformations in past tense and in other aspects of language. In this distinction lexicon and grammar can be contrasted, while other psychologically relevant factors are held constant. Irregular transformations are at least partially arbitrary (e.g., sing-sang, bring-brought), and therefore must depend upon memory, whereas regular transformations are predictable (e.g., verb + -ed), and so could be computed by a grammatical rule. Thus links are predicted among irregulars (lexicon), facts, and temporal-lobe circuits, and among regulars (grammar), skills, and frontal\/basal-ganglia circuits. Patients with brain damage limited to particular temporal-lobe areas (e.g., \"posterior aphasics\") should have more trouble with irregulars than regulars, and with facts than skills. Patients with damage limited to particular left frontal\/basal-ganglia structures (e.g., \"anterior aphasics\") should show the opposite pattern. <br\/><br\/>If indeed the declarative and procedural memory systems play a role in lexicon and grammar, then data from numerous investigations of the neural, computational, and developmental underpinnings of the two brain memory systems in humans and in animals will contribute to our understanding of language. Conversely, new approaches to the study of the two memory systems will become possible on the basis of our knowledge of language structure, processing, and acquisition. Tests of lexicon and grammar, such as those used in the proposed project, may become useful probes of the two brain systems. In addition to the advancement of fundamental knowledge in cognitive science, the contributions of animal and human studies of the two brain systems to our understanding of language should lead to new clinical approaches for the diagnosis and treatment of acquired and developmental language disorders.","title":"A Role for Declarative and Procedural Memory in Language","awardID":"9905273","effectiveDate":"1999-08-01","expirationDate":"2008-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1191","name":"BEHAVIORAL NEUROSCIENCE"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"V414","name":"CIA-RES ON DECEPTION DETECTION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"T024","name":"DARPA-INVEST IN TMS"}}],"PIcoPI":["489457","292681"],"PO":["374415"]},"45937":{"abstract":"Virtual reality (VR) aims to perceptually place the user in an artificial world through computer-generated sight and sound. VR thus offers a new human-computer interaction paradigm which can improve the user's understanding of and interaction with 3D information spaces in diverse applications domains such as design, data visualization, training, education, and medicine. Stereoscopic VR systems generate imagery by presenting a separate perspective image to each eye. As a result, the user perceives a single, true 3D image that appears to exist in front of and behind the physical display surface. While stereoscopic display is an important and common feature in VR systems, further research is needed because stereoscopic viewing raises concerns beyond those raised in monoscopic VR systems as the user travels through and manipulates the virtual environment. This is especially true for extended virtual environments where the scene contains rendered geometric detail at scales covering several orders of magnitude. In such environments, users need to zoom in and out to move between detailed and global views. This project will investigate techniques for maintaining good stereoscopic viewing conditions under such conditions. The PIs will focus on stereoscopic Head-Tracked Display systems such as the virtual workbench (as distinguished from head-mounted displays in which the display surface is mounted on the user's head). The expected impact of this project will be better understanding and implementations of head-tracked displays based on a thorough geometric and analytic analysis of false eye separation and head-tracking distortions; new and improved techniques for automatic view optics adjustments and automatic view position adjustments to maintain good stereoscopic viewing conditions; and a systematic study of the compatibility between the above methods and the relevant geometric attributes of VR applications.","title":"New Methods for Maintaining Good Stereoscopic Viewing During Interaction with Large-Scale Head-Tracked Displays","awardID":"9977325","effectiveDate":"1999-08-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["439404","472831"],"PO":["246649"]},"44518":{"abstract":"This research is an investigation of model-independent fault diagnosis <br\/>systems that are intended to be robust, comprehensive, extendible, and<br\/>practical. The approach is to exploit the underlying probabilistic<br\/>framework of the system, which makes it possible to incorporate disparate<br\/>diagnostic algorithms, different sets of data, and a mixture of fault<br\/>models into a single diagnostic result. The use of heterogeneous fault<br\/>candidates will allow a diagnosis result that pinpoints problem areas based<br\/>on data gleaned from the results of logic tests, delay tests, and IDDQ<br\/>tests. The research results are being verified by testing them using actual<br\/>industrial IC failure data. Algorithms and software demonstrating the<br\/>research ideas are being developed.","title":"Mixed-Model Fault Diagnosis","awardID":"9971172","effectiveDate":"1999-08-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["368045"],"PO":["562984"]},"41879":{"abstract":"This Small Grant for Exploratory Research (SGER) project will investigate a novel approach to driving CNC machines directly from the analytic descriptions of paths based on the use of Pythagorean-hodograph (PH) curves. The principal goal of this exploratory study is to give a practical demonstration of the advantages of PH curve interpolator algorithms by implementing and testing them within the framework of a commercial open-architecture CNC software product. The MDSI OpenCNC system will be used for this purpose. The performance of the PH curve CNC interpolators in terms of positional accuracy, feedrate smoothness, continuously-variable feedrate capability, and other characteristics will be compared with both linear\/circular G code part programs and approximate Bezier\/B-spline interpolation algorithms.<br\/> The PH curves incorporate a special algebraic structure, which renders them well suited to real-time processing by open-architecture CNC interpolators and controllers. In addition to bypassing the need for intermediate linear\/circular tool path approximations, PH curves offer a new ability to drive CNC machines at continuously-varying feedrates. This project offers the potential for very significant performance improvements in CNC machines.","title":"SGER: Implementation and Performance Analysis of Real-Time Pythagorean-Hodograph (PH) Curve CNC Interpolators for Precision Machining Applications","awardID":"9908525","effectiveDate":"1999-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1468","name":"Manufacturing Machines & Equip"}}],"PIcoPI":["181687"],"PO":["182945"]},"44805":{"abstract":"The ordered semantic hyper-linking strategy (OSHL) combines propositional efficiency, semantics, and equality in one integrated automatic theorem prover for first-order logic. Semantics refers to the meaning of symbols, and propositional efficiency refers to efficiency on problems requiring significant case analysis. Few existing provers utilize semantics, and most are not propositionally efficient. The current Prolog implementation will be extended in ways that were suggested by a recent paper on the topic. The prover will also be re-implemented in Scheme for greater speed. In addition, a prover combining equality, unification, and propositional efficiency but no semantics will be implemented, because semantics may not always be available. These combinations should outperform almost all other provers on a significant class of problems. Techniques capable of effective theorem proving on sets of millions of input clauses will also be sought.","title":"Instance-Based Theorem Proving with Semantics and Equality","awardID":"9972118","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[113835],"PO":["321058"]},"44827":{"abstract":"Faugeras<br\/>9972228<br\/> The investigators and their colleagues study the problem of<br\/>automatically clustering sets of points that lie on smooth<br\/>manifolds of arbitrary co-dimension. They use the geodesic snake<br\/>approach in which they set up a Partial Differential Equation<br\/>(PDE) that drives the evolution of a manifold in some potential<br\/>field created by the data points, such that the solution of the<br\/>PDE converges to a manifold that is very close to the data points<br\/>(ideally contains them). The \"shape\" of this manifold (including<br\/>its co-dimension) characterizes the set of points. They<br\/>investigate computationally efficient implementations for<br\/>evolving manifolds of arbitrary co-dimension by level sets<br\/>methods, because of their robustness and flexibility. These<br\/>implementations are being used to study the Euclidean and affine<br\/>mean-curvature motion of curves in three-dimensional spaces. Two<br\/>applications are being pursued by the investigators. The first<br\/>application is the detection of blood vessels in Magnetic<br\/>Resonance Angiography (MRA) images. In MRA images, blood vessels<br\/>appear as bright and noisy curve-like patterns, possibly with<br\/>gaps. It is important to detect those patterns independently of<br\/>the noise and to bridge the gaps. The detection of blood vessels<br\/>can be considered, as a first approximation, as an instance of<br\/>the three-dimensional case, co-dimension two. The second<br\/>application is the clustering of feature points in higher<br\/>dimensional spaces with an eye on two specific problems, the<br\/>description of the \"shape\" of a cluster and the design of<br\/>automated content-based image retrieval systems. A given pattern,<br\/>e.g. an image, can be represented by a vector of features in some<br\/>n-dimensional space. Patterns in the same class usually fall into<br\/>clusters that may have some very tricky \"shapes\". The<br\/>investigators and their collegues believe that their methods can<br\/>provide ways of automatically obtaining shape descriptions from<br\/>sets of sample feature vectors thereby facilitating the design of<br\/>recognition algorithms and improving their performances. A target<br\/>application is the design of automated content-based image<br\/>retrieval systems.<br\/> The investigators and their colleagues study the problem of<br\/>automatically fitting a set of points in a possibly<br\/>high-dimensional space to a set of smooth manifolds. This is<br\/>important because in many practical applications data can be<br\/>represented as points in high-dimensional spaces. They are<br\/>currently pursuing two applications of these techniques. The<br\/>first one is the detection of blood vessels in Magnetic Resonance<br\/>Angiography (MRA) images. In MRA images, blood vessels appear as<br\/>bright and noisy curve-like patterns, possibly with gaps. It is<br\/>important to detect those patterns independently of the noise and<br\/>to bridge the gaps. The results of this detection can be used in<br\/>the diagnosis of diseases and in planning surgery. The second<br\/>application is the description of the \"shape\" of a cluster of<br\/>points in a high-dimensional space. The investigators and their<br\/>colleagues are investigating means of automatically obtaining<br\/>such descriptions from a set of samples. They believe that this<br\/>will facilitate the design of recognition algorithms and increase<br\/>their performances. A target application that is particularly<br\/>relevant to the average citizen is the design of automated<br\/>content-based image retrieval systems. In such systems each image<br\/>can be represented by a point in some high-dimensional (10 to 20)<br\/>feature space, and images in the same class, e.g. images of cars,<br\/>cluster on some manifold, e.g a \"car-manifold\". The description<br\/>of the shape of this manifold (which is simpler than the real<br\/>shapes of the objects in the class) can then be used to retrieve<br\/>all images of, e.g. cars, in the data base because their<br\/>representations in the high-dimensional space will be closer to<br\/>the corresponding manifold than to any other.","title":"Evolution of Co-dimension k>1 Manifolds Embedded in R^n and Applications to Medical Image Analysis","awardID":"9972228","effectiveDate":"1999-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["142535",113889],"PO":["562372"]},"41924":{"abstract":"A growing number of applications for 3D graphics and imaging systems require the customized approach to the design of high performance 3D graphics and imaging systems. The progress in hardware support of graphics API functionality gives a real possibility to use a top-down approach in the design of custom systems based on the mixed hardware\/software implementation of OpenGL API architecture. Software simulation is relatively cheap and fast way for initial architecture template development and evaluation to acquire the structure and key parameters that can be used later for elaboration in hardware description language level.<br\/> The project includes the implementation of 3D graphics system architecture model based on OpenGL hardware support simulation. The object-oriented approach has been used for this development of analytic and software behavioral models simulating hardware units in different stages of graphics pipeline. Interactive Imaging System Architecture Composer has been developed for fast run-time architecture reconfiguration, simulation management, data acquisition and visual interpretation. The expandable set of architecture templates uses a reconfigurable shared library of \"virtual hardware units\" simulating various hardware structures for graphics and image processing.<br\/> The project realization provides a set of simulation and performance evaluation tools for computer architects to cover the first steps in top-down design process. The graphics\/imaging system design can be customized and this technology might be expanded from corporate level to public domain to make it available for engineers willing to build graphics\/imaging systems for particular applications.","title":"GOALI: Behavioral Simulation and Performance Evaluation of Imaging System Architectures","awardID":"9908631","effectiveDate":"1999-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[106154,106155],"PO":[106156]},"40714":{"abstract":"9905140<br\/>Sequin, Carlo <br\/>Wright, Paul<br\/>University of California, Berkeley<br\/><br\/>CADRE: MOSIS++: A Distributed Manufacturing Resource for Research, Education and Industrial-Integration<br\/><br\/>This award provides support for the establishment on the Berkeley campus of MOSIS++, an enhanced hardware testbed for rapid prototyping that will allow remote users to use the facility for fabricating and rapid prototyping of their designs using different processes. The testbed, an extension of the CyberCut project (a networked manufacturing service for rapid part design and fabrication on the Internet) will allow the rapid manufacture and physical prototyping of hybrid systems typical of consumer electronics products. Educational materials will be developed and made available to other universities who wish to use MOSIS++ capabilities to teach product design and manufacturing of small electromechanical products in computer science and engineering courses.","title":"REU Supplement: CADRE: MOSIS++: A Distributed Manufacturing Resource for Research, Education and Industrial-Integration","awardID":"9905140","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1463","name":"INTEGRATION ENGINEERING"}}],"PIcoPI":["457562","504279"],"PO":["241298"]},"44916":{"abstract":"Computational geometry began with the promise of unifying the multiplicity of efforts to solve geometric problems arising in diverse areas of computation such as statistics, biology, robot motion planning, graphics, image analysis, virtual reality, and data mining. In two decades, the field has produced a rich collection of tools for solving algorithmic problems of a geometric nature. A recurring feature in the design and analysis of geometric problems is the strong link between the computational and combinatorial aspects of the questions under investigation. Understanding the combinatorial geometry behind the problem is fundamental to being able to find an efficient solution. This project will explore combinatorial problems arising in geometric contexts in order to develop new tools and to refine tools already available for the design and analysis of geometric algorithms.<br\/><br\/>The primary goal is to develop powerful combinatorial tools which can be utilized to construct simpler and more efficient algorithms. It may be that there is considerable additional cost to analyze the complexity of these algorithms but this cost will be transparent to the end user. The project will also investigate techniques that would make it possible to obtain more realistic estimates on the behavior of geometric algorithms on typical inputs. This might be accomplished, for example, by identifying some metrics that capture the \"badness\" of a data set. Such a metric might be able to distinguish worst-case situations from ``typical'' ones, and provide an easy a priori <br\/>estimate of how well a given computational procedure can handle a specific class of inputs.","title":"Geometric Complexity Problems","awardID":"9972568","effectiveDate":"1999-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["518464"],"PO":["321058"]},"44817":{"abstract":"Richard Schlichting<br\/>CCR-9972192<br\/><br\/>The movement of code from one machine in a distributed system to another has often been used as a way to gain a functionality or performance advantage. This project focuses on using code shipping to optimize execution performance in distributed systems. Code shipping involves statically extracting code fragments form an existing program, constructing executable parcels written in a language such as Java from the fragments, and shipping the parcels to another machine for execution. An example use of code shipping is to implement call folding to remote procedure calls (RPCs), where multiple RPCs from a client to a server are folded into a single RPC. The program fragment that performs the calls, including any intervening statements, is extracted and generated as a parcel at compile time, and then shipped to the server at run time as an argument in the single remaining RPC and executed there. Thus, the calls to the server operations that originally required network transmissions are now local. In contrast to previous approached, code shipping involves automatic generation of parcels and other software components from regular source code, typically involves finer-grain fragments, and emphasizes performance optimization rather than function enhancement.<br\/><br\/>The goal of this project is to explore code shipping as a technique for optimizing execution in distributed systems. The issues being investigated range from identifying optimization possibilities in the code to developing appropriate transformation techniques. Our investigations are based on pragmatic approached to the problem, with the work being done in the context of building a prototype code shipping sys","title":"Using Code Shipping to Optimize Distributed System Execution","awardID":"9972192","effectiveDate":"1999-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["118484"],"PO":["209879"]},"44828":{"abstract":"Marvin H. Solomon<br\/>CCR-9972232<br\/><br\/>The internet presents the potential for efficient and equitable allocation of distributed computing resources, such as high-speed computers and databases, to those best able to use them productively. Realization of this potential requires a rotation for describing producers and consumers of resources and a mechanism for allocating them subject to bilateral constraints: Consumers of resources may specify acceptability criteria for resources, and purveyors of resources may impose restrictions on consumers. The Classified Advertisement language provides a precise and powerful notation for defining these constraints and the Matchmaking algorithm provides a mechanism for enforcing them. This research improves the efficiency of Matchmaking by discovering and exploiting homogeneous properties of sets of Classified Advertisements. It also extends the Matchmaking paradigm to \"co-matching\" to support situations in which a successful allocation required assembling a complete and consistent set of resources, each of which may impose restrictions on others in the set. Thee enhancements are motivated by practical problems arising in the context of the Condor distributed resource management system, which is widely used by computational scientists to harness the power of idle workstations. The results of this research will be tested by applying it directly to improve the Condor service.","title":"A Policy Language for Distributed Resource Management","awardID":"9972232","effectiveDate":"1999-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[113891],"PO":["209879"]}}