{"194041":{"abstract":"Progress in computer vision makes biometric authentication and recognition become more reliable and readily available than before, with a potential for ubiquitous use of such data well beyond traditional authentication. The need to protect highly sensitive biometrics is apparent, which, unlike other types of data used for authentication purposes, cannot be revoked and replaced with a new value. This means that any breach in security of biometric data has far reaching consequences to the individual than loss of other sensitive data.<br\/><br\/>Previously, only limited mechanisms for protecting privacy of biometry were available. To address the paucity of adequate protection mechanisms, this project develops novel techniques for enhancing privacy protection of biometric data when it is being processed and used in environments which are not fully trusted or secured in a broad set of contexts and applications that go well beyond comparing two biometric codes. The project's scope covers (i) secure interactive computation on biometric data, (ii) secure outsourcing of biometric computation to untrusted servers, and (iii) efficient verification of the correctness of the result of outsourced computation. A distinct benefit of this work is that it combines cryptographic design with practical evaluation on real biometric data, as well as includes integration of developed tools into a biometric computing grid environment. The outcomes of this research are expected to enable and promote safer practices in handing sensitive biometric data, including utilizing untrusted computing power, and a wider degree of collaboration between entities who are otherwise not permitted to share their data.","title":"TWC: Small: Protecting Privacy of Biometric Data throughout Computation","awardID":"1223699","effectiveDate":"2012-12-01","expirationDate":"2015-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["550254"],"PO":["564223"]},"199024":{"abstract":"This award will support student and postdoctoral scholar travel expenses for the 19th International Meeting on DNA Computing and Molecular Programming (DNA19), which will take place September 23-27, 2013 at Arizona State University. This conference emphasizes topics that bridge computation, biology, and nanotechnology and attracts top researchers in the fields of Computer Science, Mathematics, Chemistry, Molecular Biology, and Nanotechnology.<br\/><br\/>The primary purpose of these funds is to provide assistance to students and postdoctoral scholars who are delivering oral or poster presentations at the conference. The process of selecting the travel award recipients is intended to give priority to women and underrepresented minorities, in addition to supporting quality research presentations. <br\/><br\/>Intellectual merit:<br\/>The topics of the DNA computing and molecular programming conference include control of molecular folding and self-assembly to construct nanostructures; demonstration of switches, gates, devices, and circuits with biomolecules; molecular motors and molecular robotics; computational processes in vitro and in vivo; studies of fault tolerance and error correction; synthetic biology and in vitro evolution; software tools for analysis, simulation, and design; as well as a range of applications in engineering, physics, chemistry, biology, and medicine. Scientific discoveries discussed in this conference should eventually produce important new technologies and new nanoscale manufacturing techniques for materials and devices, new medical biosensor and therapeutics, and new models for understanding organization and complexity in biological systems.<br\/><br\/>Broader impact:<br\/>The travel awards will help to foster the development of the next generation of molecular programmers, by encouraging students and postdocs to attend, present their work, and interact with other important players in the field. There is a unique blend of theory and practice at DNA computing and molecular programming conferences, from a range of academic disciplines. Attending this conference will allow the students and postdocs to gain an understanding of the process of creating and developing novel scientific ideas.","title":"Student and Postdoc Travel Support for DNA19","awardID":"1252443","effectiveDate":"2012-12-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"7623","name":"BIOMATERIALS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["555498"],"PO":["565223"]},"202974":{"abstract":"This award will support student travel to three co-located conferences: the International Symposium on Code Generation and Optimization (CGO 2013), the International Symposium on High-Performance Computer Architecture (HPCA 2013), and the ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPoPP 2013). The conferences are being held in Shenzhen, China in February 2013. These conferences are top-ranked in the fields of architecture, compilers and parallel programming. Supporting student travel to attend professional conferences and workshops is a very important mission of the NSF. Broader impacts include building the next generation of researchers in this research area, as well as providing international experiences to build a globally-aware workforce.","title":"Student Travel Support for the CGO 2013, HPCA 2013, and PPoPP 2013 Symposia Co-located in Shenzhen, China","awardID":"1306105","effectiveDate":"2012-12-15","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":[543957],"PO":["564588"]},"208959":{"abstract":"The vast majority of planning or design tasks involves an optimization problem, seeking to either minimize the cost of the proposed solution, or maximize its efficiency or payoff. Often, the goal would be the identification of the optimal solution from a set of finite many discrete options (combinatorial optimization). Unfortunately, an exact solution for the overwhelming majority of optimization problems turns out to be computationally intractable. To cope with intractability, one often settles for algorithms that provably approximate the optimal solution. The following question stems naturally from the notion of approximation: For a given combinatorial optimization problem, what is the best approximation to the optimal solution that can be efficiently computed?<br\/><br\/>There are two facets to answering the above question: designing approximation algorithms and showing that no efficient algorithm can provide a better approximation guarantee (hardness result). The convergence of these two seemingly different facets has been one of the most exciting developments in theoretical computer science in recent years. This project would involve the design of improved approximation algorithms as well as showing that these algorithms are essentially optimal. Although the design of approximation algorithms is a vast area of research, the main tool underlying an overwhelming majority of existing approximation algorithms is a convex optimization technique such as linear or semidefinite programming. Existing algorithmic techniques have hit upon a common barrier on a large number of fundamental combinatorial optimization problems, a barrier that is encapsulated by the tantalizing \"Unique Games Conjecture (UGC).\" Therefore the study of approximability is at a very exciting juncture. On one hand, an affirmation of the UGC would resolve long standing open questions , demonstrate an underlying unity in combinatorial optimization problems, and, more importantly, show that the simplest semidefinite programs yield the best approximations. On the other hand, disproving the UGC would lead to new algorithmic techniques that will eventually lead to better approximation algorithms.<br\/><br\/>The PI proposes a set of research questions involving both design of approximation algorithms and hardness of approximation results. Broadly speaking, the project has the following four research themes:<br\/><br\/>1) Understand the power of semidefinite programming hierarchies via the design of new algorithms and constructions of integrality gap examples.<br\/><br\/>2) Extend the emerging framework of approximability under the UGC to a larger class of combinatorial optimization problems.<br\/><br\/>3) Develop technical machinery and gadgets to show unconditionally some of the hardness results based on the UGC, making progress towards its resolution.<br\/><br\/>4) Apply the analytic tools developed in hardness of approximation to other branches of theoretical computer science, such as the study of exact algorithms for constraint satisfaction problems.<br\/><br\/>This research necessarily draws upon tools from various theoretical disciplines such as coding theory, property testing, computational learning, derandomization and discrete harmonic analysis. The research has a strong potential for broader impact in terms of scientific workshops, developement of graduate courses, lecture notes and survey articles on the latest research in approximation, promoting undergraduate research, and advising Ph.D students.","title":"CAREER: Approximating NP-Hard Problems -Efficient Algorithms and their Limits","awardID":"1343104","effectiveDate":"2012-12-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[560084],"PO":["565251"]},"204614":{"abstract":"Are computing professionals adequately prepared for the ethical challenges that they will face in an increasingly global and interdisciplinary workplace? In this multi-institutional research\/education project, the PIs will investigate the gap between the need for ethical computing professionals and the ethical learning that occurs in graduate computing programs. They will then apply these insights to develop and disseminate best practices in graduate ethics education. The mixed-method research combines surveys, interviews, focus groups, content analysis, and experimental design, and will be conducted in partnership with ACM's SIGCAS and the IEEE's SSIT. The project will begin with an investigation of computing programs and courses at four diverse institutions: a traditional research 1 university, a rural polytechnic, an urban liberal arts college, and a leading institution for online education. What are the existing goals and strategies used in graduate computing ethics education at these sites? What ethical issues are covered? What pedagogical approaches and materials are used? Faculty and students will be surveyed and interviewed about their perspectives on computing ethics education. Observations of teaching ethics across the courses will be conducted at each institution by the project team and the evaluation team. With baseline data from these four institutions, the PIs will survey members of leading professional associations to gauge alignment between industry practice and interests and the education in ethics provided by postsecondary institutions. Finally, the PIs will refine a set of best practices and pedagogical recommendations for CS ethics education, and disseminate their findings along with examples of teaching materials designed to be applicable across a range of institutional settings. Specific research questions to be addressed include:<br\/><br\/>1. What specific ethical issues are CS instructors currently teaching and what pedagogies are currently being used in graduate-level computing courses?<br\/>a. What are the similarities and differences in computing ethics issues covered within curricula across different institutions?<br\/>b. What materials (texts, readings, videos, simulations, social media, etc.) are used in classes?<br\/>2. How can professionals? experience in the computing industry enrich teaching about ethical challenges in the workplace?<br\/>a. What do computer professionals think students should know about ethics before entering the workplace?<br\/>b. How do computer professionals think this information can best be conveyed?<br\/>3. How can computing ethics education be improved?<br\/>a. What do CS students need to learn about ethics that they are not currently learning?<br\/>b. What are the best pedagogical approaches for teaching students these ideas?<br\/><br\/>Project outcomes will include a report on the state of ethics education in graduate computer science\/technology, a report on industry needs for an ethically knowledgeable workforce, and recommendations for best practices in ethics education effective in graduate education and the workplace. The project will ultimately result in computing professionals who are more attuned to their ethical responsibilities to the public, leading to more reliable computing systems.<br\/><br\/>Broader Impacts: This work will fill an important gap in the research literature about the appropriateness and effectiveness of pedagogical approaches currently used to increase graduate computing students' awareness of ethical issues relative to the challenges that they will face in the workplace. Results of the study will be based on, and thus applicable to, a broad range of stakeholders in graduate computing ethics education, and thus could transform curricular standards promulgated by professional societies such as the ACM and IEEE. The innovative mixed-method approach that will be used has merit not only for this study but could also be applied to future studies in other domains.","title":"EESE: Collaborative Research: Understanding and Preparing Future Computer Professionals for the Ethical Complexities of a Diverse World","awardID":"1314002","effectiveDate":"2012-12-16","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7787","name":"EESE"}}],"PIcoPI":[547983],"PO":["565227"]},"197245":{"abstract":"This award will help to support the first U.S.-Brazil Frontiers of Science and Engineering Symposium (USBFOS&E) organized by the National Academy of Science (NAS) and the National Academy of Engineering (NAE), respectively, in partnership with the National Academy of Sciences of Brazil. The symposium, to be held in Brazil in early 2014, is designed to facilitate exchange and collaboration across scientific and engineering disciplines and to enhance networks among early-career scientists and engineers. This would be the first bilateral Frontiers meeting involving both young scientists and engineers at the same meeting, and will also be the first to be held in Latin America. <br\/><br\/>About 60-70 outstanding early-career scientists and engineers from the United States and Brazil (30-35 from each side) are expected to participate and attend this symposium. A program organizing committee, led by co-chairs from the U.S. and Brazil and consisting of additional members, will identify topics and speakers. The symposium format will include formal sessions with presentations by speakers on leading edge research, emerging technologies, and with multiple opportunities for informal interactions across science and engineering fields. Similar symposia in other regions have fostered interdisciplinary and international collaborations, and have served as a reference point for many of the emerging frontiers in research and innovation in the U.S. Presentations from the USBFOS&E will be posted on the NAS and NAE-FOE web sites.","title":"U.S.-Brazil Frontiers of Science and Engineering Symposium","awardID":"1242920","effectiveDate":"2012-12-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[529214,"543859"],"PO":["559975"]},"197861":{"abstract":"Research progress often depends critically on the ability to move data over long distances: for example, from a remote supercomputer, telescope, or genome sequencing center to a researcher's laboratory or to a university data center. Yet despite major improvements in wide area and campus networks, data movement remains often frustratingly difficult and slow, due to obstacles such as firewalls and inadequate tools.<br\/><br\/>To overcome this problem, this project develops an easy-to-use, high-performance data transfer and synchronization solution that can operate everywhere researchers need their data to be: desktops and research labs, campus servers and HPC facilities, supercomputing centers, scientific instruments, and public and private cloud providers. This new data movement solution builds on the widely used Globus implementation of the GridFTP protocol and the newer Globus Transfer hosted data movement service, plus the Indiana University implementation of the eXtensible Session Protocol (XSP), which provides for negotiation of end-to-end circuits via protocols such as OpenFlow. It incorporates numerous new capabilities, including negotiation of end-to-end circuits; communication between pairs of nodes that are both behind network address translation (NAT) devices or firewalls; new data movement capabilities such as efficient verification of transfers; and HTTP for communication with object stores.<br\/><br\/>Resulting software solutions are delivered to the NSF community via a combination of Globus Transfer and the GridFTP and XSP open source software distributions. Partner science and engineering projects in cosmology, biology, physics, cyberinfrastructure, and other domains are assisting with evaluation.","title":"Collaborative Research: CC-NIE Integration: A Data Movement Solution for Next-Generation Campus Cyberinfrastructure","awardID":"1246307","effectiveDate":"2012-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8080","name":"Campus Cyberinfrastrc (CC-NIE)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["558594"],"PO":["564246"]},"197741":{"abstract":"This project identifies science labs at the University of North Carolina Chapel Hill with large data-intensive research projects on campus that would benefit most from improvements in network infrastructure. The project focuses on network enhancements by replacing networking equipment, both building links and access layer, related to these research labs on campus.<br\/><br\/>The enhancements consist of upgrading the existing 100 Mb-only switches in the affected departments with gigabit Ethernet switches providing multi-gigabit links back to upgraded building aggregation switches that, in turn, connect to the existing network backbone at 10Gbps. This provides 10Gbps connectivity from each building to the campus research computing services, as well as to Internet2 resources. The enhancements also include a monitoring machine equipped with a 10Gbps DAG monitoring card to collect traffic header traces at the ingress-egress routers at the edge of the campus network. These enhancements will enable better and faster access to the large amounts of data transferred regularly by these labs, thus enhancing data management in their respective research projects. <br\/><br\/>The research labs directly and significantly impacted by this project are involved in the following research projects: <br\/>* Biological Sciences: producing mathematical models of animal flight (e.g., hummingbird, butterfly), using recordings of high-speed and high-resolution video from locations throughout the campus. <br\/>* Biological Sciences: studying the evolution and genetics of de novo genes; obtaining the data, particularly the raw data, demands several minutes to several hours of uninterrupted downloads. <br\/>* Geological Sciences: collecting, aggregating, and moving data from volcanic and seismic monitors (some in real-time), real time analysis of ongoing geologic processing.<br\/>* Environmental Science and Engineering: Lattice Boltzmann modeling that requires large lattice sizes (8003) that translate to state storage of 8.7-95.3GB per state point. <br\/>* Computer Science: transferring large network traffic datasets captured at the main campus link to clusters of data processing machines in the lab for use in network experiments. <br\/><br\/>This project additionally has direct impact on the undergraduate and graduate curricula in the various departments represented by these research labs, broadening the participation of student researchers. These research labs continue their investment in promoting undergraduate research by involving undergraduate students, including actively promoting women and minorities in their groups.","title":"CC-NIE Network Infrastructure: Enabling data-driven research","awardID":"1245783","effectiveDate":"2012-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8080","name":"Campus Cyberinfrastrc (CC-NIE)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["554764","534241",530606,530607,530608],"PO":["564246"]},"197802":{"abstract":"Multi-Wave deploys new cyber-physical infrastructure on the campus of the University of Massachusetts Amherst, at the Massachusetts High-Performance Computing Center (MGHPCC), and at two collocation sites (1 Federal Street, Springfield, MA and 300 Bent Street, Cambridge, MA) to build a dedicated multi-lambda transport ring between the sites and to provide researchers with a dedicated high-bandwidth network. This new infrastructure allows research traffic to be isolated from the mix of other information by dedicating one of two wavelengths for the research network only. All other traffic is transported on the other wavelength. This new cyber-physical infrastructure is supporting research in the areas of big data and genomics, remote sensing, biostatics, planetary science, distributed systems and software defined networking, and climate science. Besides offering a reliable, high-bandwidth transport ring for researchers in computational sciences, the new cyberinfrastructure is also designed to integrate well into the existing, nation-wide Global Environment for Network Innovations (GENI) testbed.<br\/><br\/>This project will significantly impact researchers at UMass Amherst who are dealing with very large data sets. The new cyber-physical infrastructure will allow these researchers to transport large data sets between sources on and off campus to the MGHPCC, where significant computing resources are housed. For example, genomics researchers will be able to transmit very high volumes of data from storage systems at a sequencing center to the computing cluster at MGHPCC, instead of physically shipping hard drives via express mail as they do now.","title":"CC-NIE Integration: Multi-Wave - A Dedicated Data Transport Ring to Support 21st Century Computational Research","awardID":"1246003","effectiveDate":"2012-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8080","name":"Campus Cyberinfrastrc (CC-NIE)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[530807,"554360"],"PO":["564246"]},"191324":{"abstract":"US-German Collaboration: Computational and Neural Mechanisms of Inference over Decision-Structure<br\/><br\/>PI: John O?Doherty, Co PI: Peter Bossaerts<br\/><br\/>ABSTRACT<br\/><br\/>In this project the Principal Investigators will determine how the brain is able to identify the relevant rules that apply to a given decision-making problem in order to effectively make decisions. In most cases, features of the decision structure are hidden variables, i.e. they can be inferred only through discrete observations of outcome variables (such as reward feedback). Understanding how inferences over decision-structure are performed in a noisy and partially observable environment is therefore a fundamental yet almost unaddressed issue in the computational neurobiology of human decision-making. Here, we conceive of inferences over decision problems as a form of hierarchical inference in which the higher level of the hierarchy represents probabilistic beliefs over which decision structure is currently in place, while the lower level of the hierarchy encodes beliefs over which actions are currently rewarded within a specific decision structure. We will compare and contrast a variety of computational models deploying different strategies to solve this problem. We will combine these models with behavioral and functional magnetic resonance imaging (fMRI) data from human participants in order to address whether dynamic signals are present in the brain pertaining to the implementation of such hierarchical models, and whether different brain regions are involved in performing inference at different levels of the hierarchy. This project could potentially lead to a new understanding of the contribution of the prefrontal cortex and other brain regions in decision-making. This project will also provide insight into the neural implementation of a fundamental missing part of the picture concerning the neurobiology of human decision-making: decision-structure inference.<br\/><br\/>In terms of broader impacts, this research could provide fundamental new insights into understanding situations where human learning or decision-making fails or breaks down. Sometimes poor learning or decision-making may be due to a failure to infer the correct rules governing a decision-problem rather than a difficulty in learning or deciding per se. Such insights will not only impact on academic fields studying decision making but could also be used to develop novel methods to help individuals and organizations make better decisions (by focusing on improving inference over structure). The findings could provide relevant data for the development of artificial agents capable of autonomous, flexible and adaptive decisions. The proposal also has high potential clinical relevance: disorders with delusional beliefs such as schizophrenia and borderline personality disorder might involve in part a difficulty in performing inference over decision structure so as to rule out inappropriate (decision) structures in lieu of more appropriate ones. The present research might yield novel tools to study this question in clinical populations. Furthermore, there are substantial impacts on teaching and training. The PI and co-PI teach courses at undergraduate and graduate level and involve undergraduate researchers directly in their research programs. The work proposed here could lead to the development of new software to enable the analysis of brain imaging data using computational models. A companion project is being funded by the German Ministry of Education and Research (BMBF).","title":"US-German Collaboration: Computational and Neural Mechanisms of Inference over Decision-Structure","awardID":"1207573","effectiveDate":"2012-12-01","expirationDate":"2015-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1321","name":"DECISION RISK & MANAGEMENT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}}],"PIcoPI":[512831,512832],"PO":["561884"]},"196813":{"abstract":"The Rochester Institute of Technology, in collaboration with TERC, proposes the Inclusive Exploring Computer Science (I-ECS) curriculum as a set of curricular and tool-based enhancements for visually impaired high school students. I-ECS will be conducted via face-to-face and online support for cohorts of visually impaired high school students. While innovations have resulted in assistive technology for people with disabilities, gaps remain in the level of participation in university-level computing degree programs by the visually impaired. A significant factor is the lack of precollege preparation in courses that promote success in computing degrees. Isolation, the lack of role models and access to resources contribute as well. <br\/><br\/>The proposed project strives to increase the participation of students with visual impairments through better preparation and support. The overall goals are to increase access to an established curriculum (Exploring Computer Science) and success within the area of computing for students with visual impairments at the high school level. The development of programming tools and online modules will provide access where gaps exist in current software. The project team will assess the degree to which original Exploring Computer Science (ECS) can be made accessible to high school students who are visually impaired. The comparison in student achievement and attitudes about Computer Science will also be conducted between students using the ECS curriculum and those using the I-ECS curriculum in order to evaluate the similarity of the two curricula. By design, the I-ECS project intends to increase participation in computing by individuals with visual impairments at all socioeconomic levels via student and educator support. The project will involve students, parents and educators from around the nation. <br\/><br\/>The structured approach, building on the foundation of an existing high school computer science curriculum, will enable those with visual impairments to have greater access to the diverse areas of computer science through face-to-face and online resources that foster continuous learning and community, as the means to transition to college degrees in computing. The project components are designed to promote growth by all participants, including parents. The online community will foster greater accommodation of visually impaired students in the computer science classroom. Assessment will provide much needed statistical analysis of both the challenges and successes of students who are visually impaired.","title":"BP: Collaborative Research: I-ECS: Inclusive Exploring CS Curriculum Enhancement as Face-to-Face and Online Support for Visually Impaired, High School Students","awardID":"1240809","effectiveDate":"2012-12-01","expirationDate":"2016-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[527961],"PO":["561855"]},"196528":{"abstract":"The objective of this project is to create a focused cyber-physical design environment to accelerate the development of miniature medical devices in general and swallowable systems in particular. The project develops new models and tools including a web-based integrated simulation environment,capturing the interacting dynamics of the computational and physical components of devices designed to work inside the human body, to enable wider design space exploration, and, ultimately, to lower the barriers which have thus far impeded system engineering of miniature medical devices. Currently, a few select individuals with deep domain expertise create these systems. The goal is to open this field to a wider community and at the same time create better designs through advanced tool support. The project defines a component model and corresponding domain-specific modeling language to provide a common framework for design capture, design space exploration, analysis and automated synthesis of all hardware and software artifacts. The project also develops a rich and extensible component and design template library that designers can reuse. The online design environment will provide early feedback and hence, it will lower the cost of experimentation with alternatives. The potential benefit is not just incremental (in time and cost), but can lead to novel ideas by mitigating the risk of trying unconventional solutions.<br\/><br\/>Trends in consumer electronics such as miniaturization, low power operation, and wireless technologies have enabled the design of miniature devices that hold the potential to revolutionize medicine. Transformational societal public health benefits (e.g., early diagnosis of colorectal cancer or prevention of heart failure) are possible through less invasive and more accurate diagnostic and interventional devices. By eliminating large incisions in favor of natural orifices or small ports, these medical devices can increase diagnostic screening effectiveness and reduce pain and recovery time. Furthermore, if successful, the proposed scientific approach can be extended to any other application, wherever size, power efficiency, and high confidence are stringent requirements. The educational plan of the project is centered on the web-based design environment that will also contain an interface for high school students to experiment with medical cyber-physical devices in a virtual environment. Students will be able to build medical devices from a library of components, program them using an intuitive visual programming language and operate them in various simulated environments. A Summer Camp organized in the framework of this project will enhance students learning experience with real hands-on experimentation in a lab.","title":"CPS: Synergy: Integrated Modeling, Analysis and Synthesis of Miniature Medical Devices","awardID":"1239355","effectiveDate":"2012-12-01","expirationDate":"2016-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":["551714",527012,527013,"563860"],"PO":["565136"]},"191328":{"abstract":"This research is motivated by the problem of spinal cord injuries, with the goal of producing data that can lead to pharmacological or other interventions to make recovery possible. It is hypothesized that major changes after a spinal cord injury occur on the protein level, and that a model of protein changes and interactions between proteins will make it possible to elucidate previously unnoticed relationships between the participating proteins and protein pathways. To do this, a computational neuroscience approach is a necessary addition to laboratory experiments. This analysis requires a considerable amount of background knowledge; to acquire this knowledge, natural language processing (text mining) is necessary; specifically, new techniques for natural language processing need to be developed in the neuroscience domain.<br\/><br\/>The research plan involves a series of proteomics experiments to be carried out on rats with induced spinal cord injuries and the interpretation of these results using a computational systems biology approach. The quality of knowledge-based computational analysis depends critically on the breadth of formally represented knowledge in the program. A major challenge is that much of the requisite knowledge is \"buried\" in scientific publications, rather than being available in computable form in databases. Therefore, novel text mining techniques will be developed, tailored for the neuroscience domain, to extract such knowledge from scientific publications and convert it into a computable form. A generic computational analytical tool, known as Hanalyzer, is already available but needs to be adapted to the specific problem; the challenge is to develop the natural language processing technology. A neuroscience-specific aspect of this challenge is that there is a high diversity in the surface forms of words that are used to refer to spinal cord regeneration, making machine-learning-based approaches susceptible to data sparsity and rule-based approaches vulnerable to an intractable number of keywords that must be accounted for. A distributional approach will be used to approach this challenge, with novel techniques that make use of semantic role labeling, recognition of ontological concepts, and dependency parsing to learn the surface forms that correspond to abstract or implicit concepts like spinal cord regeneration.<br\/><br\/>This project is a collaboration involving investigators in Denver, Colorado and in Duesseldorf, Germany. A companion project is being funded by the German Ministry of Education and Research (BMBF).","title":"US-German Collaboration: Unravel CNS regeneration - From Fact Extraction to Experiment Design","awardID":"1207592","effectiveDate":"2012-12-01","expirationDate":"2017-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[512840],"PO":["564318"]},"196818":{"abstract":"The Rochester Institute of Technology, in collaboration with TERC, proposes the Inclusive Exploring Computer Science (I-ECS) curriculum as a set of curricular and tool-based enhancements for visually impaired high school students. I-ECS will be conducted via face-to-face and online support for cohorts of visually impaired high school students. While innovations have resulted in assistive technology for people with disabilities, gaps remain in the level of participation in university-level computing degree programs by the visually impaired. A significant factor is the lack of precollege preparation in courses that promote success in computing degrees. Isolation, the lack of role models and access to resources contribute as well. <br\/><br\/>The proposed project strives to increase the participation of students with visual impairments through better preparation and support. The overall goals are to increase access to an established curriculum (Exploring Computer Science) and success within the area of computing for students with visual impairments at the high school level. The development of programming tools and online modules will provide access where gaps exist in current software. The project team will assess the degree to which original Exploring Computer Science (ECS) can be made accessible to high school students who are visually impaired. The comparison in student achievement and attitudes about Computer Science will also be conducted between students using the ECS curriculum and those using the I-ECS curriculum in order to evaluate the similarity of the two curricula. By design, the I-ECS project intends to increase participation in computing by individuals with visual impairments at all socioeconomic levels via student and educator support. The project will involve students, parents and educators from around the nation. <br\/><br\/>The structured approach, building on the foundation of an existing high school computer science curriculum, will enable those with visual impairments to have greater access to the diverse areas of computer science through face-to-face and online resources that foster continuous learning and community, as the means to transition to college degrees in computing. The project components are designed to promote growth by all participants, including parents. The online community will foster greater accommodation of visually impaired students in the computer science classroom. Assessment will provide much needed statistical analysis of both the challenges and successes of students who are visually impaired.","title":"BP: Collaborative Research: I-ECS: Inclusive Exploring CS Curriculum Enhancement as Face-to-Face and Online Support for Visually Impaired, High School Students","awardID":"1240856","effectiveDate":"2012-12-01","expirationDate":"2015-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[527973,"533925"],"PO":["561855"]},"208110":{"abstract":"Can one efficiently compress search problems with small witnesses into problems whose size depends on the length of the instances? Recent results have given strong negative evidence, for example, that one cannot efficiently map the problem of finding a clique of size k to a problem of size polynomial in k. These question has surprising applications to parameterized complexity, cryptography, probabilistic proof systems and structural complexity.<br\/><br\/>This project will look to extend these results to a number of different directions including showing similar results for probabilistic compression which seem to require new breakthroughs in pseudorandom generators. Also can ever compress a function f that depends on m instances of an NP problem of size n to a single instance of size polynomial in n where the AND function seems to be the major barrier. Finally this project will explore new applications of this line of research as well as other related topics in computational complexity.<br\/><br\/>While this proposal takes a theoretical approach to instance compression, in the long-term continued research in complexity will help focus efforts when trying to tackle difficult computational problems that arise in practice. This project explore these problems with graduate students as part of their thesis research. Research from this project will be desseminated through conference and invited presentations and publications in conferences, journals and on the Internet.","title":"Instance Compression","awardID":"1338274","effectiveDate":"2012-12-15","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[557660],"PO":["565157"]},"200171":{"abstract":"This project will conduct the first exploration of a computational system that co-generates intertwined narrative and gameplay progressions. The system will utilize a novel representation called ludo-narrative units (LNUs), representing combinations of narrative, gameplay challenges, and choices. Utilizing audience experience models taking into account phenomena such as player agency, narrative comprehension, and gameplay learning objectives, the system will reason about progressions of narrative choices, narrative exposition, and gameplay challenges, and can dynamically reshape content to match designated goals and audience context. To accomplish this, the project will build an artificial intelligence director to construct interactive scenarios for audiences during their engagement with a game-based narrative.<br\/><br\/>The dynamic construction of scenarios from a pool of authored LNUs would already comprise more flexibility than currently appears in state-of-the-art scenario driven games and other popular interactive narratives, since LNUs can be selected in multiple orders in response to audience activity. But the envisioned system will provide further flexibility and customization through modification of LNU content using story generation technology. Specifically, it will use a story-planning system based on imaginative recall to dynamically provide this content. Further, global narrative and gameplay structure will be provided by using a constraint-solving algorithm to create full experiences satisfying the various system goals, written using answer set programming techniques. This enables the crucial flexibility that allows the system to reason over an arbitrary number of domains without locking it into pre-planned interfaces and infrastructure.<br\/><br\/>A high-level impact of this research will be contributing to a deeper understanding of these scenarios, as it defines them with the level of rigor required for generation. At a more technical level, the research will produce the first system that generates mixed interactive narrative and gameplay guided by shared experience goals. One of the high-level motivations for pursuing this work is that it has potentially profound impact for education, allowing next-generation educational software to benefit from the motivating power of scenarios and to be generated specifically for the learning profile, goals, and progress of particular learners. It is also potentially the case that experiences generated in this manner, and based on these models, could more effectively reach audiences that have grown up with games as a primary media form.","title":"EAGER: Toward Automatic Generation of Challenge-Driven Interactive Narratives","awardID":"1258305","effectiveDate":"2012-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[536596,536597,536598],"PO":["564456"]},"206146":{"abstract":"The goal of this research project is to provide high-quality keyword search results on semi-structured data in XML format. To address the challenge of handling inherent ambiguity in keyword search, fundamental techniques and an effective search engine are developed that exploit the meta-information in the data in order to infer user search intention and to achieve high search quality. The project includes novel research on the following key areas: (1) Query Result Generation: identifying relevant nodes in XML data and composing atomic and intact query results, each of which represents an object of the inferred user search goal; (2) Query Result Presentation: developing techniques for result ranking, snippet generation, and result clustering, in order to help users quickly find the most relevant results; (3) Advanced Queries and Data Models: supporting expressive search options and handling XML data with rich constraints; and (4) Efficiency: developing techniques for performance optimization, including indexes, materialized views, and top-k query processing. Furthermore, an axiomatic evaluation framework is initiated for formally reasoning about XML keyword search strategies. The success of the project will advance the state-of-the-art of keyword search on XML data, enhance the research and education infrastructure in this area, and have broader impacts on both general public as well as scientific communities for information discovery. This research is intergrated with education through curriculum enhancement, student advising, workshops as well as outreach programs. Publications, software and course materials that are resulted from this project will be disseminated via the project website (http:\/\/wsdb.asu.edu\/xseek\/home.htm).","title":"CAREER: Analyzing and Exploiting Meta-information for Keyword Search on Semi-structured Data","awardID":"1322406","effectiveDate":"2012-12-25","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["233230"],"PO":["563751"]},"202099":{"abstract":"This effort will organize an NSF CAREER Proposal Writing Workshop to introduce junior faculty to the NSF CAREER program, and help them prepare their CAREER proposal. The NSF CAREER program serves a critical role in the National Science Foundation's efforts to identify, foster and support the nation's most promising junior faculty in both research and education. Junior professors who are just starting their careers often have limited experience with grant writing and evaluation. They also have little or no interaction with the program directors at NSF. During this workshop, young faculty members will have the opportunity to improve their skills in proposal writing, as well as interact with NSF program directors from different divisions (IIS, CNS, and CCF) as well as recent NSF CAREER awardees. The major components of the workshop include presentations on proposal writing, experience sharing, mock panels, and proposal clinic. A limited number of travel support will be made available for HBCU\/MEI faculty to attend this workshop. This 1-day event is tentatively scheduled to be held on March 15, 2013 at Temple University Center City campus, located opposite to Philadelphia City Hall in downtown Philadelphia.","title":"NSF CAREER Workshop","awardID":"1301774","effectiveDate":"2012-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["7594",541634,541635],"PO":["565223"]},"205036":{"abstract":"NECO: A Graph-Based Approach to Traffic Monitoring and Application Classification<br\/><br\/>NETS NECO proposal 0832069<br\/><br\/>Michalis Faloutsos (UCR) <br\/><br\/>The fundamental problem that motivates this work is the need to detect and classify emerging and undesired applications in a network, such as a large ISP, or an enterprise network. The undesired applications can refer to Peer-To-Peer (P2P) protocols, which can dominate network resources, but also include malware such as intrusions and worms. This proposal addresses the following tightly related problems in this area of research: (a) monitoring and visualizing network traffic, (b) identifying applications, and (c) detecting anomalies.<br\/><br\/>Monitoring the traffic and detecting unwanted applications is far from trivial. The authors of controversial applications often obfuscate their traffic to make them very hard to detect by using encryption or ever-changing behavior. Thus, there is a need for an approach that has the following properties: (a) it is easy to use with few and intuitive parameters, (b) it can operate even when packet payload is unavailable, and (c) it does not rely on a priori knowledge of the application specification, such as port numbers. Despite the significant number of previous efforts, most previous work fails to meet one of these three constraints.<br\/><br\/>The proposal follows a more fundamental behavioral approach, where the detector looks for behavior patterns of the application that are both intrinsic to the application and distinct from other traffic. By identifying intrinsic behaviors, it becomes difficult for application writers to disguise their applications without defeating the very purpose of the application. <br\/><br\/>The key contribution of this proposal is that it demonstrates the power of a behavioral or graph-based approach to network monitoring. Specifically, the proposal fully explores the use of Traffic Dispersion Graphs or TDGs, which capture the communication pattern in a network, namely, who talks to whom. TDGs capture the ``social\" interaction of the network as a whole, which leads to a directed graph; each node is an IP address, and each edge represents an interaction between two nodes. The proposal shows that there is a wealth of information embedded in a TDG, which the other monitoring and application classification methods simply cannot capture.<br\/><br\/>Broader Impact: This proposal will make enterprise and ISP networks more reliable and safer by providing the basis for a new generation of monitoring and security tools. Service disruptions and malware cost billions of dollars per year to any industry with significant IT infrastructure. At the same time, the Internet has become the battleground of multimillion dollar wars: between industries (content providers versus ISPs on network neutrality) and between the entertainment industry and users (the peer-to-peer saga). The proposal will provide the tools (e.g. application classification) that will play an important role in deciding the future of the network. <br\/><br\/>Educational Goals: The PI will develop a cross-disciplinary educational program by bringing together networking, security, graph-mining, and social networks research. In addition, the PIs will develop programs to: (a) encourage the early involvement of both undergraduate and graduate students in research and teaching, and (b) increase the participation of minorities in higher education in engineering.","title":"NECO: A Graph-Based Approach to Traffic Monitoring and Application Classification","awardID":"1316446","effectiveDate":"2012-12-31","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[549003],"PO":["564993"]},"206147":{"abstract":"Ad hoc workflows are everywhere in service industry, scientific <br\/>research, as well as daily life, such as workflows of customer <br\/>service, trouble shooting, information search, etc. Optimizing ad <br\/>hoc workflows thus has significant benefits to the society. <br\/>Currently the execution of ad hoc workflows is based on human <br\/>decisions, where misinterpretation, inexperience, and ineffective <br\/>processing are not uncommon, leading to operation inefficiency. <br\/><br\/>The goal of this research project is to design and develop <br\/>fundamental models, concepts, and algorithms to mine and optimize ad <br\/>hoc workflows. The project includes novel research on the following <br\/>key areas: (1) Network Modeling and Structure Mining. A network model <br\/>is built that statistically captures the execution characteristics <br\/>of ad hoc workflows, and is optimized to improve the execution of <br\/>new workflows with respect to different optimization objectives. <br\/>(2) Workflow Artifact Mining. The network model built on workflow <br\/>executions is then extended with workflow artifact mining to realize <br\/>an optimization system that is able to take advantage of both <br\/>executions and text contents. (3) Role Discovery and Relation <br\/>Assessment. A computational framework is built to analyze the roles <br\/>and relationships of agents involved in ad hoc workflow executions <br\/>in order to further optimize workflows. <br\/><br\/>Advances from this project include models to represent ad hoc <br\/>workflows, algorithms for mining hidden collaborative models, and <br\/>techniques that optimize ad hoc workflow processing. The project <br\/>bridges two emerging research areas: service science and network <br\/>science, and enriches the principles and technologies of data mining. <br\/>It also enhances research infrastructure through the collaboration of <br\/>team members from different areas (data mining, database, and <br\/>network). This research is tightly integrated with education through <br\/>student mentoring and curriculum development. <br\/><br\/>Publications, software and course materials that arise <br\/>from this project will be disseminated on the project website: <br\/>URL: http:\/\/www.cs.ucsb.edu\/~xyan\/smartflow.htm","title":"III-Core-Small: Collaborative Research: Mining and Optimizing Ad Hoc Workflows","awardID":"1322407","effectiveDate":"2012-12-25","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["233230"],"PO":["563727"]},"204212":{"abstract":"Quantum Information Processing (QIP) is a rapidly developing interdisciplinary research field that studies the principles and the applications of quantum mechanics for computation, communication, cryptography, and other information processing tasks. QIP has the potential to revolutionize information processing technologies by enabling ultra-fast computation, efficient simulation of quantum physics, and unbreakable secure communication. Thus the field is not only of fundamental importance intellectually, but also for a prosperous society as well as for national security.<br\/><br\/>The QIP Workshop is the premier annual conference in the theoretical aspects of the field. It brings together hundreds of participants, from leading researchers to aspiring students, of diverse nationality and disciplinary backgrounds. This conference has played a formative role in the field and has become one of the most important venues for the groundbreaking research in the theory of quantum information processing.<br\/><br\/>This award provides partial financial support for US-based students and postdoctoral fellows to attend the 16th Workshop on Quantum Information Processing (QIP 2013), to be held in Beijing, China, on January 21--25, 2013, at Tsinghua University. Availability of travel support will be widely advertised and the recipients will be selected through an open and objective process, based on both merit and need. This support will permit broader participation by US-based students and postdocs, in particular by members of under-represented groups, contributing to their education and career development. It will facilitate the dissemination of research, and enhance the conference as an international institution for research collaboration and education.","title":"Travel Support for the 16th Quantum Information Processing Workshop (QIP 2013)","awardID":"1311817","effectiveDate":"2012-12-15","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7928","name":"QUANTUM COMPUTING"}}],"PIcoPI":["549690"],"PO":["565251"]}}