{"196372":{"abstract":"This project demonstrates the benefits of connecting radars to ultra high-speed networks to improve hazardous weather warning and response and the identification and tracking of small, low-flying aircraft by developing new detection algorithms that operate directly on uncompressed, high-bandwidth radar data. Although radar networks are a critical part of the nation's infrastructure for weather observation and aircraft surveillance, today's best-effort Internet is used to transport data from radars to a variety of end users for decision-making. To allow for real-time delivery, the radar data are compressed and important information can be lost during this process. Transmitting uncompressed radar data over ultra high-speed networks could enable advanced, very geographically precise detection and prediction of weather hazards resulting in benefits to public safety and the economy. In addition, the ability to track, small low-flying aircraft is important for drug enforcement and for tracking Unmanned Aircraft Systems used for homeland security and law enforcement that are expected to be prevalent in urban areas in the near future. The project will be conducted using a test bed of high resolution, low-cost radar located in the Dallas Fort Worth Metroplex linked to users such as emergency managers and National Weather Service forecasters. To manage the increased demand for processing and networking resources from the usage of high-bandwidth data techniques related to the usage of on-demand networks (SDN) and compute resources (cloud computing) are studied.","title":"EAGER: Ultra High-speed Bandwidth for Performance Improvements in Radar Networks for Weather and Aircraft Surveillance","awardID":"1238485","effectiveDate":"2012-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["554360","554359"],"PO":["557315"]},"196031":{"abstract":"Energy production, transportation and utilization are ubiquitous in the United States. They encompass nuclear and chemical processes that are subject to a multitude of failure mechanisms that can be the result of poor design, human error or acts of nature or terrorism than can have catastrophic impact of life and property. The disaster mitigation system being constructed in this activity is a system of systems that provides emergency response staff with both training and planning as well as real time guidance on effective strategies to protect the general public and first responders. The system uses computational fluid dynamics to predict toxic plume evolution and an intelligent agent based model of the impacted population operating within an intelligent traffic management system. Cognitive algorithms are being developed to analyze the output data and dissect it to channel necessary information and guidance to the appropriate people. These analyses use high performance parallel computing to create the necessary integrated solutions and exploit many of the features of the Global Environment for Network Innovations (GENI) network. This will result in simulation based information and guidance that can be quickly, and reliably, transmitted to an emergency operations center and first responders in the event of a large toxic material release in an urban area. A pilot exercise will be performed in collaboration with an urban emergency response team to demonstrate and explore what might be achieved during an emergency to mitigate adverse effects using such emerging advanced computing and networking capabilities and thus encourage their use.","title":"EAGER: DMS: Disaster Mitigation System","awardID":"1236706","effectiveDate":"2012-04-15","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[525458],"PO":["557315"]},"196284":{"abstract":"EarthCube is focused on community-driven development of an integrated and interoperable knowledge management system for data in the geo- and environmental sciences. By utilizing a cooperative, as opposed to competitive, process like that which created the Internet and Open Source software, EarthCube will attack the recalcitrant and persistent problems that so far have prevented adequate access to and the analysis, visualization, and interoperability of the vast storehouses of disparate geoscience data and data types residing in distributed and diverse data systems. This awards funds a series of broad, inclusive community interactions to gather adequate information and requirements to create a roadmap for a critical capability (workflow) in the development of EarthCube, a major new NSF initiative. Workflow in the context of EarthCube, and cyberinfrastructure in general, encompasses a broad range of topics including distributed execution management, the coupling of multiple models into composite applications, the integration of a wide range of data sources with processing, and the creation of refined data products from raw data. A key benefit of the funded work in terms of evaluating and creating community consensus on the best way forward for this capability (i.e., workflow) is the ability to document the provenance of data used in modeling and reproduce model and data-enabled scientific results. The funded workshop and information collecting activity will be open to all interested parties and is being led by a diverse and expert team of cyberinfrastructure developers, computer scientists, and geoscientists. Broader impacts of the work include converging on approaches, protocols, and standards that may be applicable across the sciences. They also include the fostering of close interaction between communities that do not commonly interact with one another and focusing them on the common goal of creating a new paradigm in data and knowledge management in the geosciences.","title":"EarthCube Community Workshop: Designing A Roadmap for Workflows in Geosciences","awardID":"1238196","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8004","name":"Software Institutes"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"8074","name":"EarthCube"}}],"PIcoPI":[526255],"PO":["565378"]},"185284":{"abstract":"Socially Assistive Robots<br\/>Lead PI\/Institution: Brian Scassellati, Yale University<br\/>This Expedition will develop the fundamental computational techniques that will enable the design, implementation, and evaluation of robots that encourage social, emotional, and cognitive growth in children, including those with social or cognitive deficits. The need for this technology is driven by critical societal problems that require sustained, personalized support that supplements the efforts of educators, parents, and clinicians. For example, clinicians and families struggle to provide individualized educational services to children with social and cognitive deficits, whose numbers have quadrupled in the US in the last decade alone. In many schools, educators struggle to provide language instruction for children raised in homes where a language other than English is spoken (over 20%), the fastest-growing segment of the school-age population. This Expedition aims to support the individual needs of these children with socially assistive robots that help to guide the children toward long-term behavioral goals, that are customized to the particular needs of each child, and that develop and change as the child does. <br\/>To achieve this vision, this Expedition will advance the state-of-the-art in socially assistive human-robot interaction from short-term interactions in structured environments to long-term interactions that are adaptive, engaging, and effective. This progress will require transformative computing research in three broad and naturally interrelated research areas. First, the Expedition will develop computational models of the dynamics of social interaction, so that robots can automatically detect, analyze, and influence agency, intention, and other social interaction primitives in dynamic environments. Second, the Expedition will develop machine learning algorithms that adapt and personalize interactions to individual physical, social, and cognitive differences, enabling robots to teach and shape behavior in ways that are tailored to the needs, preferences, and capabilities of each individual. Third, the Expedition will develop systems that guide children toward specific learning goals over periods of weeks and months, allowing for truly long-term guidance and support. Research in these three areas will be integrated into socially assistive robots that are deployed in schools and homes for durations of up to one year. <br\/>This Expedition has the potential to substantially impact the effectiveness of education and healthcare for children, and the technological tools developed will serve as the basis for enhancing the lives of children and other groups that require specialized support and intervention. The proposed computing research is tied to a comprehensive student training program, bringing a compelling, engaging, and grounded STEM experience to K-12 students through in-school and after-school activities. It also establishes an annual training summit to provide undergraduates with the multi-disciplinary background to engage in this promising research area in graduate school. Finally, by establishing a brand name for socially assistive robotics, this effort will create a central authority for the distribution of high-quality, peer-reviewed information, providing a coherent focal point for enhancing outreach and education.<br\/>For more information visit www.yale.edu\/SAR","title":"Collaborative Research: Socially Assistive Robots","awardID":"1139148","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[497149,"558935","507311","517804"],"PO":["565227"]},"196351":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 8 promising graduate students from the United States plus about 4 from abroad, for a total of 12, along with distinguished research faculty. The 2-day event will take place immediately preceding and in conjunction with the 2012 International Conference on Auditory Display (ICAD 2012), which will be held June 18-22 at the PI's institution in Atlanta. ICAD is the premier international forum for presenting research on the use of sound to display data, monitor systems, and provide enhanced user interfaces for computers and virtual reality systems. It is unique in its singular focus on auditory displays and the array of perception, technology, and application areas that this encompasses; this includes, for example, data sonification, auditory wayfinding, auditory graphs, speech interfaces, virtual environments, and associated perceptual, cognitive, technical, and technological research and development. Many of the interdisciplinary research and development efforts are of direct relevance to persons with perceptual disabilities, especially visual impairments; for example, developing wayfinding systems for the blind requires research into effective distance cues and object identifiers used in auditory displays. Research into the efficacy of auditory graphs may be used to help visually impaired students and scientists participate more fully in science. Even household devices can have more effective auditory displays that provide richer information than the basic \"beeps\" they presently tend to have. A common approach in this field is Universal Design, wherein a display strategy is developed once, to be used by all kinds of users, including those with and without specific access issues. More details about the conference are available at http:\/\/icad2012.icad.org. <br\/><br\/>The doctoral consortium will bring together graduate students from diverse backgrounds (e.g., engineering, computing, music, and psychology), so that they can experience the broad spectrum of approaches to auditory displays, assistive technologies and universal design, while exploring their research interests through interaction with peers and under the guidance of a panel of distinguished experts in the field. To these ends, the ThinkTank will develop a supportive community of scholars and a spirit of collaborative research, by providing participants with a friendly and open, yet rigorous, scientific forum to present their research ideas, to listen to ongoing work from peer students, and to receive constructive feedback. Student participants will make formal presentations of their work during the ThinkTank and will receive feedback from the faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The ThinkTank will also provide students with relevant information about important issues for doctoral candidates, whether they are considering academic or industrial career paths. The event will further offer invited speakers and discussion groups, and will involve many students as part of the audience and discussion groups, in addition to those presenting their work. Each student participant will furthermore present a poster about his\/her work during the conference proper. An evaluation of the ThinkTank will be conducted and the findings will be made available to the organizers of future conferences and consortia. <br\/><br\/>Broader Impacts: This event will promote scholarship and networking among new researchers in an important emerging interdisciplinary area, and will help shape ongoing and future research projects that have clear and important implications for development of assistive technologies and universal access. The doctoral consortium will afford participants exposure to a larger community, allowing them to bond among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality and culture, scientific discipline, and institution (no more than one apiece), the students' horizons are broadened to the future benefit of the field.","title":"WORKSHOP: ThinkTank (Doctoral Consortium) at ICAD 2012","awardID":"1238394","effectiveDate":"2012-04-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["529975"],"PO":["565227"]},"196263":{"abstract":"EarthCube is focused on community-driven development of an integrated and interoperable knowledge management system for data in the geo- and environmental sciences. By utilizing a cooperative, as opposed to competitive, process like that which created the Internet and Open Source software, EarthCube will attack the recalcitrant and persistent problems that so far have prevented adequate access to and the analysis, visualization, and interoperability of the vast storehouses of disparate geoscience data and data types residing in distributed and diverse data systems. This awards funds a series of broad, inclusive community interactions to gather adequate information and requirements to create a roadmap for a critical capability (workflow) in the development of EarthCube, a major new NSF initiative. Workflow in the context of EarthCube, and cyberinfrastructure in general, encompasses a broad range of topics including distributed execution management, the coupling of multiple models into composite applications, the integration of a wide range of data sources with processing, and the creation of refined data products from raw data. A key benefit of the funded work in terms of evaluating and creating community consensus on the best way forward for this capability (i.e., workflow) is the ability to document the provenance of data used in modeling and reproduce model and data-enabled scientific results. The funded workshop and information collecting activity will be open to all interested parties and is being led by a diverse and expert team of cyberinfrastructure developers, computer scientists, and geoscientists. Broader impacts of the work include converging on approaches, protocols, and standards that may be applicable across the sciences. They also include the fostering of close interaction between communities that do not commonly interact with one another and focusing them on the common goal of creating a new paradigm in data and knowledge management in the geosciences.","title":"EarthCube Community Workshop: Designing A Roadmap for Workflows in Geosciences","awardID":"1238061","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8004","name":"Software Institutes"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"8074","name":"EarthCube"}}],"PIcoPI":["558523","558524",526169],"PO":["565378"]},"187188":{"abstract":"The general purpose computing capacity of the world has been increasing at an annual rate of more than 50% over the past few decades, and this trend is expected to continue in the future. However, this increasing compute capacity directly translates to increasing power dissipation. In fact, the server farms and data centers in US consumed 1.5% of the nation's total electricity in 2006, and this number has been steadily growing every year making it absolutely critical to develop energy-efficient solutions for computing systems. Computer scientists and engineers migrated towards designing systems with dozens of low power cores on a single die to address the power problem while improving the compute capacity through parallelism. However, the deployment of these manycore systems has been impeded by the lack of energy-efficient high-bandwidth density (on-chip and off-chip) link solutions in current and projected electrical technology. Silicon-photonic link technology can potentially solve this problem as it provides an order of magnitude higher bandwidth density than equivalent electrical links. However, the power consumed in these silicon-photonic links more than offsets any bandwidth advantages, in turn limiting their widespread adoption for designing manycore systems.<br\/><br\/>This project explores system-level techniques (both reactive and proactive) to minimize power dissipation and maximize bandwidth of the silicon-photonic networks (inter-chip and intra-chip), and in turn improve the energy efficiency of manycore systems. In particular, the project focuses on the two largest sources of power consumption in silicon-photonic links - the laser sources and the active tuning of modulator\/filter rings (required to maintain resonance under thermal variations). Four techniques - run-time assignment of photonic resources, workload scheduling\/migration, memory mapping, and dynamic voltage and frequency scaling (DVFS), that use run-time system dynamics to reconfigure the system for improving its energy efficiency are being investigated. A vertically integrated approach where these system-level techniques are explored while being cognizant of the underlying silicon-photonic link circuits and silicon-photonic devices is adopted.<br\/><br\/>At a broader level, this project paves the way for the rapid adoption of silicon-photonic link technology to enable the design of energy-efficient manycore systems. This can provide energy-efficient computing solutions in turn reducing the cost of operation and carbon footprint of the nation?s computing server farms and data centers. On the educational front, the project leverages the numerous outreach programs run by Boston University to engage students with various backgrounds and levels of education in the different research activities associated with the project.","title":"CAREER: System-level Run-time Management Techniques for Energy-efficient Silicon-Photonic Manycore Systems","awardID":"1149549","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[502129],"PO":["366560"]},"185231":{"abstract":"An Expedition in Computing for Compiling Printable Programmable Machines<br\/><br\/>Daniela Rus, Vijay Kumar, Andre DeHon, Martin Demaine, Sanjeev Khanna, Sangbae Kim, Insup Lee, Wojciech Matusik, Martin Rinard, Rob Wood<br\/><br\/><br\/>This project envisions a future desktop technology that prints actual programmable hybrid electro-mechanical devices from only their sketches on-demand, anywhere with the skill of a team of professional engineers using advanced materials. It would transform manufacturing as dramatically as the personal computer democratized information technology and transformed how we communicate. <br\/><br\/>The capability to customize cyber-physical systems on-demand would change how contingencies are planned. Rescuers engaged in humanitarian aid and disaster reliefs in remote locations could minimize their logistic needs on-site. Warehouses of spare and replacement parts that may never be used could be replaced by storing only their designs digitally, not the physical parts themselves. <br\/><br\/>Fundamental problems in computer science about what is computable by digital machines will change. The problems will be reframed in a larger context as what functional hybrid machines are constructible from cyber-physical primitives. <br\/><br\/>The technical approach builds on analogies with compiler technology and supporting algorithmic theories. Experienced engineers may know from experience what is constructible but their experience must be expressed in a language that blends the continuous with the discrete, the cyber with the physics of materials processing. The project addresses broad classes of constructible cyber-physical systems: (1) the development of tools for functional specification and automated co-design of the mechanical, electrical, computing, and software aspects of the device; (2) the design of planning and control algorithms for the assembly of the device and for delivering the desired function of behavior, and tools for the analysis of these algorithms that take into account all the necessary resources, including actuators, sensors, and data streams from the world; (3) the methodology to generate device-specific and task-specific programming environments that provide safeguards for programs written by non-expert users to enable them to operate the machines safely; and (4) the development of novel approaches to the automated production of new devices which may be based on the synthesis of programmable materials with customizable electrical or mechanical properties. This research is highly multidisciplinary, primarily leveraging the disciplines of computer science, electrical and mechanical engineering, materials, and manufacturing science. <br\/><br\/>This project will create a community of interest in this new research area, reach out to young people in grades K-12, engage the national and international community through professional society meetings, and establish new interdisciplinary programs among the participating academic institutions. Like the very successful MOSIS program (www.mosis.com\/), this project will disseminate the research results and provide a community resource and service for experimentation with our technologies.<br\/>¬<br\/>For more information, please visit: http:\/\/ppm.csail.mit.edu","title":"Collaborative Research: An Expedition in Computing for Compiling Printable Programmable Machines","awardID":"1138847","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":["553656","553286",497005,497006],"PO":["565239"]},"185264":{"abstract":"ExCAPE: Expeditions in Computer Augmented Program Engineering<br\/>Lead PI\/Institution: Rajeev Alur, University of Pennsylvania<br\/><br\/>Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1139011","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["565263","557516"],"PO":["565264"]},"185275":{"abstract":"Socially Assistive Robots<br\/>Lead PI\/Institution: Brian Scassellati, Yale University<br\/>This Expedition will develop the fundamental computational techniques that will enable the design, implementation, and evaluation of robots that encourage social, emotional, and cognitive growth in children, including those with social or cognitive deficits. The need for this technology is driven by critical societal problems that require sustained, personalized support that supplements the efforts of educators, parents, and clinicians. For example, clinicians and families struggle to provide individualized educational services to children with social and cognitive deficits, whose numbers have quadrupled in the US in the last decade alone. In many schools, educators struggle to provide language instruction for children raised in homes where a language other than English is spoken (over 20%), the fastest-growing segment of the school-age population. This Expedition aims to support the individual needs of these children with socially assistive robots that help to guide the children toward long-term behavioral goals, that are customized to the particular needs of each child, and that develop and change as the child does. <br\/>To achieve this vision, this Expedition will advance the state-of-the-art in socially assistive human-robot interaction from short-term interactions in structured environments to long-term interactions that are adaptive, engaging, and effective. This progress will require transformative computing research in three broad and naturally interrelated research areas. First, the Expedition will develop computational models of the dynamics of social interaction, so that robots can automatically detect, analyze, and influence agency, intention, and other social interaction primitives in dynamic environments. Second, the Expedition will develop machine learning algorithms that adapt and personalize interactions to individual physical, social, and cognitive differences, enabling robots to teach and shape behavior in ways that are tailored to the needs, preferences, and capabilities of each individual. Third, the Expedition will develop systems that guide children toward specific learning goals over periods of weeks and months, allowing for truly long-term guidance and support. Research in these three areas will be integrated into socially assistive robots that are deployed in schools and homes for durations of up to one year. <br\/>This Expedition has the potential to substantially impact the effectiveness of education and healthcare for children, and the technological tools developed will serve as the basis for enhancing the lives of children and other groups that require specialized support and intervention. The proposed computing research is tied to a comprehensive student training program, bringing a compelling, engaging, and grounded STEM experience to K-12 students through in-school and after-school activities. It also establishes an annual training summit to provide undergraduates with the multi-disciplinary background to engage in this promising research area in graduate school. Finally, by establishing a brand name for socially assistive robotics, this effort will create a central authority for the distribution of high-quality, peer-reviewed information, providing a coherent focal point for enhancing outreach and education.<br\/>For more information visit www.yale.edu\/SAR","title":"Collaborative Research: Socially Assistive Robots","awardID":"1139078","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[497120,497121,497122,"549672",497124,497125],"PO":["565227"]},"188498":{"abstract":"This funding establishes a new CISE Research Experiences for Undergraduates<br\/>(REU) site at Salisbury University. The project, called Explore Emerging<br\/>Computing in Science and Engineering (EXERCISE), exposes students to<br\/>emerging parallel programming models, such as GPGPU languages and MapReduce,<br\/>applied to compute intensive problems in computer networks, image and signal<br\/>processing, and geographic information system.<br\/><br\/>The project will provide an opportunity for twenty-four undergraduate<br\/>students over a three-year period to participate in a supportive environment<br\/>that encourages them to pursue graduate studies in Computer Science. It will<br\/>expose these students to parallel programming, which is an area of growing<br\/>importance, and offer them the opportunity to present their results at<br\/>regional and national professional conferences. The site will recruit<br\/>participants from under-represented groups.","title":"REU Site: EXERCISE-Explore Emerging Computing in Science and Engineering","awardID":"1156509","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505423],"PO":["564588"]},"185232":{"abstract":"Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1138860","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[497008],"PO":["565264"]},"196144":{"abstract":"The topic of Human Computer Interaction (HCI) is more important now than at any other time in the history of computing. As computers become smaller, faster, and more ubiquitous, our ability to use them effectively becomes critical. Not only must we design usable systems, but we must do so in a rapidly changing landscape of computing hardware that includes desktops, mobile phones, and embedded systems. A unique aspect of HCI is that it requires the study of not just computing, but of the combination of computing and people. Because people are involved, HCI is a field where aspects such as culture, socio-economic background, gender, etc., are considered in the systems that we build. This is a clear argument for the development of a diverse field of researchers who bring to bear a wide range of experiences in their problem solving skills.<br\/><br\/>This is funding to provide partial support for the Computer-Human Interaction Mentoring (CHIMe) 2012 workshop http:\/\/chime.hci.cs.vt.edu, which will bring together approximately 67 students and 10 distinguished speakers from academia and industry as part of the Discipline-specific Mentoring Workshops sponsored in part by the BPC Alliance of CRA-W http:\/\/www.cra-w.org and CDC (the Coalition to Diversify Computing http:\/\/cdc-computing.org). This is the second offering of the CHIMe Workshop, whose goal is to provide an opportunity for networking and mentoring among students in the field of HCI who belong to one or more of the following communities: women, underrepresented minorities, and persons with disabilities. The workshop will be run as a series of presentations and panels; speakers will include leading researchers in the field drawn, to the extent they were available, from these same communities, who will address a broad range of issues ranging from technical concerns (such as appropriate evaluation methods) to some of today's hot topics. The speakers' diverse occupations in government labs, academia and industry will provide attendees with different perspectives of the field. The workshop will be collocated with and listed as an offering on the website of the ACM 2012 Conference on Human Factors in Computing Systems (CHI 2012), which will be held May 5-10 in Austin, Texas, and is sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI); this is the leading international forum for the presentation and discussion of research and practice relating to human-computer interaction, and is attended by approximately 2,500 HCI professionals from around the world. NSF funds will cover the costs of approximately 25 student participants; additional funds are being provided by CDC\/CRA-W and Microsoft Corporation.<br\/><br\/>Broader Impacts: The PIs have made a serious and successful effort to attract participants from HBCU (Historically Black Colleges and Universities), HSI (Hispanic-Serving Institutions), ACU (Appalachian Colleges and Universities), and TCU (Tribal Colleges and Universities) institutions. CHIMe 2012 will harness the cumulative experience of successful STEM professionals in the field to provide a unique forum in which to showcase the technical achievements of diverse researchers in computing and to encourage a new generation of researchers from underrepresented groups. With its focus on graduate students in HCI, the workshop will be positioned to have a direct impact on future faculty and researchers in this area of endeavor. It will provide a highly technical and supportive environment for underrepresented minority doctoral students in the field of HCI to discuss their research and to receive constructive feedback from experts, along with ample opportunities for networking and peer mentoring.","title":"WORKSHOP: Student Travel Support for the CHI Mentoring 2012 Workshop","awardID":"1237485","effectiveDate":"2012-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["531150","554552"],"PO":["565227"]},"185265":{"abstract":"ExCAPE: Expeditions in Computer Augmented Program Engineering<br\/>Lead PI\/Institution: Rajeev Alur, University of Pennsylvania<br\/><br\/>Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1139021","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["556281"],"PO":["565264"]},"189467":{"abstract":"For centuries, the primary technical meaning of image has been a visual representation or counterpart, formed through the interaction of light with mirrors and lenses, and recorded through a photochemical process. In digital photography, the photochemical process has been replaced by a sensor array, but the use of optical elements is unchanged. Thus, the spatial resolution in this traditional imaging is limited by the quality of the optics and the number of sensors in the array. This project develops the foundations of achieving spatial resolution, in 2D and 3D, by measuring temporal variations of light intensity in response to temporally- or spatiotemporally-varying illumination. This is a radical departure from traditional imaging, in which time is associated only with fixing the period over which light must be collected to achieve the desired contrast. Reducing requirements for lenses, mirrors, and numbers of sensors can both lower costs and enable entirely new imaging configurations. Of particular interest is to enable 3D capture in mobile devices such as cell phones.<br\/><br\/>Space-from-time imaging (SFTI) is based on the recognition that information of interest in a scene, such as bidirectional reflectance distribution functions at various wavelengths and distances from the imaging device, are embedded in the transfer function from a light source to a light sensor. Furthermore, light transfer is linear. Thus, SFTI introduces new inverse problems with at least portions of the forward models being linear. The investigators will apply and extend analysis techniques developed for other imaging methods, such as computed tomography and synthetic aperture radar, to develop theoretical foundations for SFTI. Analysis will inspire and be informed by proof-of-concept experiments.","title":"CIF:Medium:Space-from-Time Imaging: Fundamental Limits, Algorithms, and Preliminary Demonstrations","awardID":"1161413","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[508041,508042,508043],"PO":["564898"]},"189599":{"abstract":"This project investigates the nature and work of self-managed, voluntary teams operating in virtual spaces. The investigation is designed to provide a research basis for designing systems that will support advances in voluntary virtual teaming, and social computing more generally. The research addresses four high-level, interrelated questions: (1) How can social translucence be realized in systems to support the work of virtual teaming? (2) How can current models of self-organized and self-managed work teams be extended to address key features of voluntary teams working in virtual spaces? (3) What inter-group and intra-group characteristics of voluntary virtual teams enable meaningful understanding of a team's collaborative work and activities? (4) How can these characteristics be composed into socially translucent, system-generated views of teams?<br\/><br\/>The availability of rich data associated with voluntary project groups operating in Wikipedia provides the basis for this investigation. The research will combine model development, model testing, system design, and deployment to develop an understanding of virtual teaming in support of a larger vision of social translucence in online communities. The research focuses on broad, rich categories of interaction - within team and outside team - to elaborate the dimensions of virtual teaming that can productively be exposed through socially translucent design. The research is inherently structured as cycles of basic research and exploration, followed by design activities, design evaluations, development, and deployment. Through this process, the research will identify features of group interactions that can support views of project teams that are inspectable in a visualization system, which will be made available to the community itself. <br\/><br\/>The intellectual merit of the project lies in the elaboration of models of volunteer virtual teams and in the design and development of principles for group-oriented, socially-translucent systems. The research will extend social translucence as a framework for the development of systems in which virtual teaming occurs, and it will develop a robust model of voluntary virtual teaming, realizing relevant sociotechnical dimensions for potential community members, project managers, and social analysts. The broader impacts of this project include research-based improvements to systems supporting the interaction, contribution, and sensemaking activities engaged in by an ever increasing population of people collaborating online. The approach deploys socially translucent tools in the systems where people work collaboratively, allowing those who will benefit from such views to manipulate, extend, and refine such tools to realize greater potential in their endeavors.","title":"HCC: Medium: Enhancing Social Translucence in Systems to Support Virtual Teaming","awardID":"1162114","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["543781",508360],"PO":["564456"]},"196255":{"abstract":"EarthCube is focused on community-driven development of an integrated and interoperable knowledge management system for data in the geo- and environmental sciences. By utilizing a cooperative, as opposed to competitive, process like that which created the Internet and Open Source software, EarthCube will attack the recalcitrant and persistent problems that so far have prevented adequate access to and the analysis, visualization, and interoperability of the vast storehouses of disparate geoscience data and data types residing in distributed and diverse data systems. This awards funds a series of broad, inclusive community interactions to gather adequate information and requirements to create a roadmap for a critical capability (workflow) in the development of EarthCube, a major new NSF initiative. Workflow in the context of EarthCube, and cyberinfrastructure in general, encompasses a broad range of topics including distributed execution management, the coupling of multiple models into composite applications, the integration of a wide range of data sources with processing, and the creation of refined data products from raw data. A key benefit of the funded work in terms of evaluating and creating community consensus on the best way forward for this capability (i.e., workflow) is the ability to document the provenance of data used in modeling and reproduce model and data-enabled scientific results. The funded workshop and information collecting activity will be open to all interested parties and is being led by a diverse and expert team of cyberinfrastructure developers, computer scientists, and geoscientists. Broader impacts of the work include converging on approaches, protocols, and standards that may be applicable across the sciences. They also include the fostering of close interaction between communities that do not commonly interact with one another and focusing them on the common goal of creating a new paradigm in data and knowledge management in the geosciences.","title":"EarthCube Community Workshop: Designing A Roadmap for Workflows in Geosciences","awardID":"1238036","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8004","name":"Software Institutes"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"8074","name":"EarthCube"}}],"PIcoPI":["560774"],"PO":["565378"]},"185255":{"abstract":"An Expedition in Computing for Compiling Printable Programmable Machines<br\/><br\/>Daniela Rus, Vijay Kumar, Andre DeHon, Martin Demaine, Sanjeev Khanna, Sangbae Kim, Insup Lee, Wojciech Matusik, Martin Rinard, Rob Wood<br\/><br\/><br\/>This project envisions a future desktop technology that prints actual programmable hybrid electro-mechanical devices from only their sketches on-demand, anywhere with the skill of a team of professional engineers using advanced materials. It would transform manufacturing as dramatically as the personal computer democratized information technology and transformed how we communicate. <br\/><br\/>The capability to customize cyber-physical systems on-demand would change how contingencies are planned. Rescuers engaged in humanitarian aid and disaster reliefs in remote locations could minimize their logistic needs on-site. Warehouses of spare and replacement parts that may never be used could be replaced by storing only their designs digitally, not the physical parts themselves. <br\/><br\/>Fundamental problems in computer science about what is computable by digital machines will change. The problems will be reframed in a larger context as what functional hybrid machines are constructible from cyber-physical primitives. <br\/><br\/>The technical approach builds on analogies with compiler technology and supporting algorithmic theories. Experienced engineers may know from experience what is constructible but their experience must be expressed in a language that blends the continuous with the discrete, the cyber with the physics of materials processing. The project addresses broad classes of constructible cyber-physical systems: (1) the development of tools for functional specification and automated co-design of the mechanical, electrical, computing, and software aspects of the device; (2) the design of planning and control algorithms for the assembly of the device and for delivering the desired function of behavior, and tools for the analysis of these algorithms that take into account all the necessary resources, including actuators, sensors, and data streams from the world; (3) the methodology to generate device-specific and task-specific programming environments that provide safeguards for programs written by non-expert users to enable them to operate the machines safely; and (4) the development of novel approaches to the automated production of new devices which may be based on the synthesis of programmable materials with customizable electrical or mechanical properties. This research is highly multidisciplinary, primarily leveraging the disciplines of computer science, electrical and mechanical engineering, materials, and manufacturing science. <br\/><br\/>This project will create a community of interest in this new research area, reach out to young people in grades K-12, engage the national and international community through professional society meetings, and establish new interdisciplinary programs among the participating academic institutions. Like the very successful MOSIS program (www.mosis.com\/), this project will disseminate the research results and provide a community resource and service for experimentation with our technologies.<br\/>¬<br\/>For more information, please visit: http:\/\/ppm.csail.mit.edu","title":"Collaborative Research: An Expedition in Computing for Compiling Printable Programmable Machines","awardID":"1138967","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["527733",497067,497068],"PO":["565239"]},"185266":{"abstract":"ExCAPE: Expeditions in Computer Augmented Program Engineering<br\/>Lead PI\/Institution: Rajeev Alur, University of Pennsylvania<br\/><br\/>Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1139025","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["553547"],"PO":["565264"]},"185288":{"abstract":"Making Sense at Scale with Algorithms, Machines, and People<br\/>University of California, Berkeley<br\/><br\/>The world is increasingly awash in data. As more and more human activities move on line, and as a growing array of connected devices become integral part of daily life, the amount and diversity of data being generated continues to explode. According to one estimate, more than a Zettabyte (one billion terabytes) of new information was created in 2010 alone, with the rate of new information increasing by roughly 60% annually. This data takes many forms: free-form tweets, text messages, blogs and documents; structured streams produced by computers, sensors and scientific instruments; and media such as images and video.<br\/>Buried in this flood of data are the keys to solving huge societal problems, for improving productivity and efficiency, for creating new economic opportunities, and for unlocking new discoveries in medicine, science and the humanities. However, raw data alone is not sufficient; we can only make sense of our world by turning this data into knowledge and insight. This challenge, known as the Big Data problem, cannot be solved by the straightforward application of current data analytics technology due to the sheer volume and diversity of information. Rather, to solve it requires throwing away old preconceptions about data management and breaking down many of the traditional boundaries in and around Computer Science and related disciplines. <br\/><br\/>The Algorithms, Machines, and People (AMP) expedition at the University of California, Berkeley is addressing this challenge head-on. AMP is a collaboration of researchers with a wide range of data-related expertise, committed to working together to create a new data analytics paradigm. AMP will produce fundamental innovations in and a deep integration of three very different types of computational resources:<br\/> 1. Algorithms: new machine-learning and analysis methods that can operate at large scale and can give flexible tradeoffs between timeliness, accuracy, and cost.<br\/> 2. Machines: systems infrastructure that allows programmers to easily harness the power of scalable cloud and cluster computing for making sense of data.<br\/> 3. People: crowdsourcing human activity and intelligence to create hybrid human\/computer solutions to problems not solvable by today's automated data analysis technologies alone.<br\/><br\/>AMP research will be guided and evaluated through close collaboration with domain experts in key societal applications including: cancer genomics and personalized medicine, large-scale sensing for traffic prediction and environmental monitoring, urban planning, and network security. Advances pioneered by the project will be made widely available through the development of the Berkeley Data Analysis System (BDAS), an open source software platform that seamlessly blends Algorithm, Machine and People resources to solve big data problems.<br\/><br\/>For more information visit http:\/\/amplab.cs.berkeley.edu","title":"Making Sense at Scale with Algorithms, Machines, and People","awardID":"1139158","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[497161,497162,"560562","508219","526902"],"PO":["560586"]},"187147":{"abstract":"Successful software systems evolve: they are enhanced, corrected, and ported to new platforms. To ensure the quality of modified systems, software engineers perform regression testing, but this can be expensive depending on the size of the systems and their complexity and is responsible for a significant percentage of the cost of software. For reasons such as this, researchers have spent a great deal of time creating and empirically studying various techniques for improving the cost-effectiveness of regression testing. Despite the progress, three important aspects of the regression testing problem have not been considered: (1) factors involving the context in which testing occurs; (2) assessment of regression techniques across entire system lifetimes; (3) proper economic models that capture important cost factors and quantify benefits of regression testing techniques and strategies. <br\/><br\/>This work will lay a foundation for evaluating the cost-effectiveness of various regression testing techniques and strategies in practical ways. Further, the discoveries made by this work will promote software dependability, with potential benefits to all organizations and people who depend on that software.<br\/>This project addresses these issues by performing the following activities:<br\/>(1) Creating cost-effective regression testing techniques that address the testing process and domain contexts,<br\/>(2) Creating regression testing strategies that address system lifetimes, <br\/>(3) Creating economic models that enable the adequate assessment of techniques and strategies, and<br\/>(4) Evaluating and refining these techniques and strategies through rigorous empirical approaches.","title":"CAREER: Context-aware Regression Testing Techniques and Empirical Evaluations of Their Economic Impact","awardID":"1149389","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[502044],"PO":["564388"]},"189336":{"abstract":"The prominence of 3D video technology has skyrocketed. The 2009 movie Avatar in 3D became the highest grossing movie of all time. Such a movie requires left and right views of a scene. Many video games which provide a 3D experience require multiple views of a scene. Such data is costly to store and to transmit.<br\/><br\/>This research studies how to efficiently compress multiple-view video data, how to allow the scene to be viewed from any angle at different levels of precision, and how to reliably transmit the data over mobile wireless channels. This research has important applications in science education, traffic monitoring, and surveillance and security.<br\/>This research studies efficient encoding, rendering, and transmission of multi-view video, aiming for robust performance at arbitrary speeds of mobile units. The research is applicable both to videos of the real world taken with multiple cameras, and to rendered videos. The investigators study left\/right view coding such as in the H.264 MVC standard, and view+depth coding. The latter approach is enhanced by encoding the error signal between the original view and its decoder-synthesized version. To optimally design the system, the techniques use cross-layer optimization, in which physical-layer channel-state information and application-layer distortion-rate or slice-priority information are exploited. Whenever multiple views are rendered from an underlying 3D virtual world, the application's bit requirements can be hugely altered by rendering parameters which affect the content and level of detail of the scene. The investigators study user-experience models to quantify the relationship between rendering parameters and user satisfaction, and develop a channel-aware adaptive encoding and rendering algorithm to account for fluctuations caused by transmission over a mobile channel.","title":"CIF: Medium: Mobile multiview video: compression, rendering, and transmission","awardID":"1160832","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["279723",507608,507609,507610],"PO":["564898"]},"187158":{"abstract":"Science is becoming increasingly data intensive. As the experimental data starts to accumulate within or across institutions and over time, it is indeed a valuable wealth of information. However, little has been done to query the data repository in an integrated manner, mainly because the results among different replicates of an experiment often show a large degree of inconsistency and variance. This database poses unique challenges in data types, query types, and accuracy of distributions, etc. The broad goal of the project is to solve some major query processing challenges in such a database.<br\/><br\/>Specific techniques used to achieve this goal include: (1) Coupling top-k query answering with computation of the score distribution of top-k tuples, and the novel usage of this framework in a number of contexts; (2) Measuring the accuracy of probability distributions which affects user?s perception of query results, and devising new predicates for decision making; (3) Proposing novel semantics and efficient query processing for join queries on uncertain data; and (4) Designing a suite of algorithms for approximate substring matching and windowed subsequence matching for online monitoring queries.<br\/><br\/>The ability to effectively and accurately share, query, and monitor diverse scientific experimental data on a large scale will greatly benefit the science community. The extra data analysis capability provided to scientists can even change the way they conduct their research. The education plan includes teaching both computer science students on managing scientific data and science major students on relevant database techniques, attracting middle school and college students into computer science, and inspiring students of underrepresented groups.","title":"CAREER: MUSE: An Integrated Approach to Managing Uncertain Scientific Experimental Data","awardID":"1149417","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["550480"],"PO":["563727"]},"196289":{"abstract":"EarthCube is focused on community-driven development of an integrated and interoperable knowledge management system for data in the geo- and environmental sciences. By utilizing a cooperative, as opposed to competitive, process like that which created the Internet and Open Source software, EarthCube will attack the recalcitrant and persistent problems that so far have prevented adequate access to and the analysis, visualization, and interoperability of the vast storehouses of disparate geoscience data and data types residing in distributed and diverse data systems. This awards funds a series of broad, inclusive community interactions to gather adequate information and requirements to create a roadmap for a critical capability (workflow) in the development of EarthCube, a major new NSF initiative. Workflow in the context of EarthCube, and cyberinfrastructure in general, encompasses a broad range of topics including distributed execution management, the coupling of multiple models into composite applications, the integration of a wide range of data sources with processing, and the creation of refined data products from raw data. A key benefit of the funded work in terms of evaluating and creating community consensus on the best way forward for this capability (i.e., workflow) is the ability to document the provenance of data used in modeling and reproduce model and data-enabled scientific results. The funded workshop and information collecting activity will be open to all interested parties and is being led by a diverse and expert team of cyberinfrastructure developers, computer scientists, and geoscientists. Broader impacts of the work include converging on approaches, protocols, and standards that may be applicable across the sciences. They also include the fostering of close interaction between communities that do not commonly interact with one another and focusing them on the common goal of creating a new paradigm in data and knowledge management in the geosciences.","title":"EarthCube Community Workshop: Designing A Roadmap for Workflows in Geosciences","awardID":"1238216","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8004","name":"Software Institutes"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"8074","name":"EarthCube"}}],"PIcoPI":["535329","563687"],"PO":["565378"]},"185289":{"abstract":"Socially Assistive Robots<br\/>Lead PI\/Institution: Brian Scassellati, Yale University<br\/>This Expedition will develop the fundamental computational techniques that will enable the design, implementation, and evaluation of robots that encourage social, emotional, and cognitive growth in children, including those with social or cognitive deficits. The need for this technology is driven by critical societal problems that require sustained, personalized support that supplements the efforts of educators, parents, and clinicians. For example, clinicians and families struggle to provide individualized educational services to children with social and cognitive deficits, whose numbers have quadrupled in the US in the last decade alone. In many schools, educators struggle to provide language instruction for children raised in homes where a language other than English is spoken (over 20%), the fastest-growing segment of the school-age population. This Expedition aims to support the individual needs of these children with socially assistive robots that help to guide the children toward long-term behavioral goals, that are customized to the particular needs of each child, and that develop and change as the child does. <br\/>To achieve this vision, this Expedition will advance the state-of-the-art in socially assistive human-robot interaction from short-term interactions in structured environments to long-term interactions that are adaptive, engaging, and effective. This progress will require transformative computing research in three broad and naturally interrelated research areas. First, the Expedition will develop computational models of the dynamics of social interaction, so that robots can automatically detect, analyze, and influence agency, intention, and other social interaction primitives in dynamic environments. Second, the Expedition will develop machine learning algorithms that adapt and personalize interactions to individual physical, social, and cognitive differences, enabling robots to teach and shape behavior in ways that are tailored to the needs, preferences, and capabilities of each individual. Third, the Expedition will develop systems that guide children toward specific learning goals over periods of weeks and months, allowing for truly long-term guidance and support. Research in these three areas will be integrated into socially assistive robots that are deployed in schools and homes for durations of up to one year. <br\/>This Expedition has the potential to substantially impact the effectiveness of education and healthcare for children, and the technological tools developed will serve as the basis for enhancing the lives of children and other groups that require specialized support and intervention. The proposed computing research is tied to a comprehensive student training program, bringing a compelling, engaging, and grounded STEM experience to K-12 students through in-school and after-school activities. It also establishes an annual training summit to provide undergraduates with the multi-disciplinary background to engage in this promising research area in graduate school. Finally, by establishing a brand name for socially assistive robotics, this effort will create a central authority for the distribution of high-quality, peer-reviewed information, providing a coherent focal point for enhancing outreach and education.<br\/>For more information visit www.yale.edu\/SAR","title":"Collaborative Research: Socially Assistive Robots","awardID":"1139161","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["513294","556816"],"PO":["565227"]},"189469":{"abstract":"Wireless networks are the dominant medium through which people connect to the Internet, communicate, do business and access information. The ever-growing demand for higher data rates places the conventional approaches to network design under considerable stress. To meet this demand, future wireless networks are rapidly evolving towards high-density, user-deployed, heterogeneous infrastructure characterized by very high data rates at shorter communication range, with possibly harsh interference. In this context, multiple flow and multiple hop communication is expected to play an increasingly important role. Yet, current visions of how such networks should be designed are limited by the fact that the fundamental understanding of such novel communication paradigms is still in its infancy. <br\/><br\/>This research addresses key questions about multihop multiflow networks in the form of new ideas, insights and tools, with a transformative impact on the design of future networks. The project is organized into three symbiotic research thrusts on extensibility, side information and algorithms. In the extensibility thrust, the investigators develop a new understanding of the capacity of multihop multiflow networks of prototypical network models. The side information thrust moves beyond idealized model assumptions and incorporates imperfect or uncertain conditions at multiple spatial and temporal scales. The third thrust on algorithms translates the new key ideas developed in the first two thrusts into explicit coding and signal processing algorithms with polynomial complexity in the network size, for resource-efficient multiflow multihop communication. The research can broadly impact the wireless industry by generating new ideas that will power the design of future generations of wireless networks. The project also includes a dedicated educational plan to recruit and train under-represented minorities in this field.","title":"CIF: Medium: Collaborative Research: Multihop Multiflow Wireless Networks: A Treasure Hunt","awardID":"1161418","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["550258"],"PO":["564924"]},"200029":{"abstract":"CAREER: Art and Vision: Scene Layout from Pictorial Cues<br\/><br\/>PI: Stella (XingXing) Yu <br\/><br\/>Institution: Boston College<br\/>Artists are the masters of visual perception. Studying art and vision together can provide new solutions to fundamental problems in computer vision. We focus on inferring scene layout from a single image. This problem has been studied since the earliest days of Artificial Intelligence research, resulting in a host of so-called Shape-from-X methods, where X could be shading, perspective, etc.<br\/>Unfortunately, each of these methods works under its own assumptions which often do not hold in real images. How these cues interact and integrate remains elusive. Painters constantly use a combination of four techniques: occlusion, perspective, shading, and form to effectively evoke a 3D percept from a 2D picture. Studying their techniques can lend insights into the computation of recovering scene layout from pixel values. The PI proposes to bring artists and vision scientists together to solve the computational problem of scene layout from pictorial cues. This project realizes it in three areas:<br\/>education, experiments and computational modeling.<br\/><br\/>A new interdisciplinary course, Art and Visual Perception, has been developed at Boston College to give a comprehensive cross-examination of how art contributes to the understanding of vision, and how vision contributes to the generation and viewing of art. Students are actively engaged in both art practice and vision experiments.<br\/>Learning art and vision together results in a deeper understanding than studying each discipline separately. Students' assignments also result in valuable datasets for vision research.<br\/><br\/>The computational approach to scene layout from pictorial cues in this project is to group pixels into spatially organized surfaces from a global integration of multiple pictorial cues in a spectral graph-theoretic framework. The goal is to turn artistic rendering knowledge on how these cues interact into a computational reality.<br\/>The PI will study geometry (occlusion and perspective), appearance (brightness and color), and form using eye tracking and psychophysics experiments and computational models. These efforts are organized into two phases that progress from inferring the spatial layout from scenes made of planar surfaces (rooms and streets) to scenes made of curved surfaces (landscape and generic scenes).<br\/><br\/>Intellectual Merit<br\/><br\/>What is most remarkable about vision is its ability to perceive 3D spatial layout from a single 2D image. The proposed research replicates this ability in computation from a grouping perspective.<br\/>Compared to statistical learning approaches, the grouping method is not only generic and thus scales well with the number of scenes, but can also produce a precise organization of surfaces in the scene.<br\/>Compared to traditional Shape-from-X approaches, the grouping method examines each pictorial cue in conjunction with others. The integration of these multiple pictorial cues allows them for the first time to become applicable to real images. The PI has developed the essential grouping machinery in spectral graph theory for depth segregation. Compared to most existing formulations on this topic, it has unparalleled conceptual simplicity, computational efficiency, and guaranteed near-global optimality. The proposed research on brightness and color perception, in connection with Shape-from- Shading and surface organization, will help clarify the role of low- level and high-level mechanisms in the long-standing scientific debate between Hering and Helmholtz on color perception.<br\/><br\/>Broader Impact<br\/><br\/>This project bridges the gap between art and science not only in research but also in education by developing a new curriculum that traverses the areas of neuroscience, psychology, computer science, and visual arts, by involving students in art practice and scientific experiments, and by providing a forum for artists and scientists to exchange ideas on visual perception. These interdisciplinary efforts befit the liberal arts education tradition at Boston College. This project will not only benefit from the strong Fine Arts department on campus, but also cultivate computer science awareness and outreach to non-technical people, and promote the growth of the young Computer Science department at Boston College.<br\/><br\/>URL: http:\/\/www.cs.bc.edu\/~syu\/artvis\/","title":"CAREER: Art and Vision: Scene Layout from Pictorial Cues","awardID":"1257700","effectiveDate":"2012-04-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[536231],"PO":["564316"]},"196235":{"abstract":"This is funding for approximately 50 students to attend a full day symposium on the impact of behavior-based robotics on over 25 years of robotics research and development, which will be held on Friday, March 9, 2012, on the MIT campus, immediately following the ACM\/IEEE International Conference on Human-Robot Interaction which takes place this year in Boston. The symposium's primary focus in on possible future research trajectories; to this end, the symposium will examine the impact of the approach on both academic research and commercial development. For example, the relationship between the subsumption-based robots of the late 1980s and the Roombas being sold today is clear: the Roomba very much resembles the insect-like robots Genghis and Attila in its programming and behaviors. Are there such connections to all robot systems currently under development? The symposium will examine several questions, including the successes of behavior based robots, the adaptations made to this paradigm in order to develop robots for more complicated tasks, and the likely trends in robotics research and development over the next decade.<br\/><br\/>The symposium is structured into four main sections. The first section will address the early years of behavior-based robotics and the subsumption architecture, exploring the initial controversy and early work in this domain. The second section will look at the global impact of the work, discussing related research in labs around the world and how behavior-based robotics have been used and expanded in many different robotics domains. The third will look at the connections between behavior-based robotics and other research areas such as multi-agent learning and computer vision. The final section will explore the legacies of the work, both in terms of research and commercial robot development, and the future prospects for behavior-based robotics.<br\/><br\/>Broader Impacts: Student attendees at the symposium will have an opportunity to meet and network with a community of top robotics researchers, opening up channels for collaboration and mentoring. Faculty advisors will be able to introduce their students in-person to the field's luminaries (as most students will have their faculty advisor present); these introductions, combined with the relatively small size of the gathering, promise to provide a more personal, more memorable, and, thus, more influential experience for the students. This event will provide students with many opportunities for making connections with faculty, with people working in robotics companies, and with other students. These networking opportunities may lead to future collaborations and research.","title":"Travel Support for Students to Attend a Symposium on the Influences of Behavior-Based Robotics on the Field","awardID":"1237941","effectiveDate":"2012-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[526078],"PO":["565227"]},"189602":{"abstract":"This project aims to improve the practice of parallel programming - perhaps the central problem facing computer science in the 21st century. While the sequential model first introduced by Von Neumann and others has served us well, its inefficiency has been brought into sharp focus by the availability of billion-transistor chips, which are greatly underutilized yet power-hungry when running sequential algorithms.<br\/><br\/>This project aims to improve the programmability and efficiency of distributed memory systems, a key issue in the execution of parallel algorithms. While it is fairly easy to put, say, thousands of independent adders on a single chip, it is far more difficult to supply them with useful data to add, a task that falls to the memory system. This research will develop compiler optimization algorithms able to configure and orchestrate parallel memory systems able to utilize such parallel computational resources.<br\/><br\/>To make more than incremental progress, this project departs from existing hegemony in two important ways. First, its techniques will be applied only to algorithms expressed in the functional style, a more abstract, mathematically sound representation that enables precise reasoning about parallel algorithms and very aggressive optimizations. Second, it targets field-programmable gate arrays (FPGAs) rather than existing parallel computing platforms. FPGAs provide a highly flexible platform that enables exploring parallel architectures far different than today's awkward solutions, which are largely legacy sequential architectures glued together. While FPGAs are far too flexible and power-hungry to be the long-term \"solution\"<br\/>to the parallel computer architecture question, their use grounds this project in physical reality and will produce useful hardware synthesis algorithms as a side-effect.<br\/><br\/>Judicious and efficient data movement is the linchpin of parallel computing. This project attacks that challenge head on, establishing the constructs and algorithms necessary for hardware and software to efficiently manipulate data together. This research will lay the groundwork for the next generation of storage and instruction set architectures, compilers, and programming paradigms -- the bedrock of today's mainstream computing.","title":"SHF: Medium: Compiling Parallel Algorithms to Memory Systems","awardID":"1162124","effectiveDate":"2012-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["530445","534424"],"PO":["565272"]},"185257":{"abstract":"Socially Assistive Robots<br\/>Lead PI\/Institution: Brian Scassellati, Yale University<br\/>This Expedition will develop the fundamental computational techniques that will enable the design, implementation, and evaluation of robots that encourage social, emotional, and cognitive growth in children, including those with social or cognitive deficits. The need for this technology is driven by critical societal problems that require sustained, personalized support that supplements the efforts of educators, parents, and clinicians. For example, clinicians and families struggle to provide individualized educational services to children with social and cognitive deficits, whose numbers have quadrupled in the US in the last decade alone. In many schools, educators struggle to provide language instruction for children raised in homes where a language other than English is spoken (over 20%), the fastest-growing segment of the school-age population. This Expedition aims to support the individual needs of these children with socially assistive robots that help to guide the children toward long-term behavioral goals, that are customized to the particular needs of each child, and that develop and change as the child does. <br\/>To achieve this vision, this Expedition will advance the state-of-the-art in socially assistive human-robot interaction from short-term interactions in structured environments to long-term interactions that are adaptive, engaging, and effective. This progress will require transformative computing research in three broad and naturally interrelated research areas. First, the Expedition will develop computational models of the dynamics of social interaction, so that robots can automatically detect, analyze, and influence agency, intention, and other social interaction primitives in dynamic environments. Second, the Expedition will develop machine learning algorithms that adapt and personalize interactions to individual physical, social, and cognitive differences, enabling robots to teach and shape behavior in ways that are tailored to the needs, preferences, and capabilities of each individual. Third, the Expedition will develop systems that guide children toward specific learning goals over periods of weeks and months, allowing for truly long-term guidance and support. Research in these three areas will be integrated into socially assistive robots that are deployed in schools and homes for durations of up to one year. <br\/>This Expedition has the potential to substantially impact the effectiveness of education and healthcare for children, and the technological tools developed will serve as the basis for enhancing the lives of children and other groups that require specialized support and intervention. The proposed computing research is tied to a comprehensive student training program, bringing a compelling, engaging, and grounded STEM experience to K-12 students through in-school and after-school activities. It also establishes an annual training summit to provide undergraduates with the multi-disciplinary background to engage in this promising research area in graduate school. Finally, by establishing a brand name for socially assistive robotics, this effort will create a central authority for the distribution of high-quality, peer-reviewed information, providing a coherent focal point for enhancing outreach and education.<br\/>For more information visit www.yale.edu\/SAR","title":"Collaborative Research: Socially Assistive Robots","awardID":"1138986","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[497072,497073],"PO":["565227"]},"187204":{"abstract":"Software continues to evolve long after the first version is released. Changes made to source code in the course of evolution might not have the intended semantics (fix bugs, add features), which negatively impacts both software producers and software consumers, and has high economic costs. More generally, the software evolution process is not very well understood. To remedy this situation, this work will use information derived from analyzing software history in two ways. First, to develop a type systems-based approach named differential typing, that enables reasoning about the properties of source code before and after a change has been made, and reveals the semantics of source code changes at development time. Second, to construct a framework for declarative hypothesis testing that automates and simplifies the process of conducting empirical studies in software evolution, and software engineering in general.<br\/><br\/>The interdisciplinary foundation of this work will catalyze interaction between two primary communities, programming languages and software engineering. The results of this research will lead to a better understanding of how software evolves, and to improvements in the software evolution process. By making the semantics of software changes explicit and revealing certain kinds of errors before software is deployed, the incidence of, and costs associated with, software bugs and incorrect software updates are reduced. The project will transform the way researchers conduct empirical software evolution studies by shifting the focus from how hypotheses are tested to what the right hypotheses are. The contributions will be made publicly available, which will benefit not only the research community, but also the software development community. Ideas from this work will be incorporated into education, so that tomorrow's graduates are better prepared to tackle software evolution challenges.","title":"CAREER: Differential Types and Declarative Hypothesis Testing for Software Evolution","awardID":"1149632","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["553364"],"PO":["564388"]},"189217":{"abstract":"The grant will support student travel to the ACM SIGPLAN Symposium on Programming Language Design and Implementation (PLDI'12) and a pre-conference workshop on discussing collaboration in research and education between US and Chinese researchers, titled Trends in Concurrency (TiC'12). The main conference, PLDI, is being held in Beijing, China. PLDI is a top conference in the field of programming language and compiler technology. Supporting student travel to attend professional conferences and workshops is a very important mission of the NSF. Broader impacts include building the next generation of researchers in this research area, as well as providing international experiences to build a globally-aware workforce.","title":"PLDI'12 and Trends in Concurrency'12 Travel Support","awardID":"1160282","effectiveDate":"2012-04-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["553364"],"PO":["564388"]},"188536":{"abstract":"This award provides funding to renew the existing successful CISE Research Experiences for Undergraduates Site at the University of California - Santa Cruz (UCSC). The Summer Undergraduate Research Fellowship in Information Technology (SURF-IT) at UCSC provides an intensive and personalized summer research program focused on integrative systems design. SURF-IT is a 9-week summer program that includes research directly supervised by a UCSC faculty member. Students also have weekly meetings on graduate school preparation, ethics, and research presentation, as well as field trips to local neighboring Silicon Valley research laboratories, and a number of social activities. The summer program concludes with a research poster presentation by the SURF-IT students. The goal is to promote diversity in computer science and engineering by assisting motivated students in obtaining graduate degrees, who then become positive role models for future generations of college students throughout the nation. To better achieve this goal, the site maintains continuing contact with SURF-IT alumni to assist them in applying to and succeeding in graduate school, as well as in their eventual careers. <br\/><br\/>Intellectual merit: The students join a variety of funded research projects in integrative system design within UCSC's department of computer engineering. The special intellectual merit of each project varies, however all students will learn to apply their traditional academic training to open-ended research problems at the forefront of information technology. The site has a group of mentors with outstanding experience and expertise to direct the intellectual component of each project.<br\/><br\/>Broader Impacts: The broader impacts revolve around the focus on inclusion of individuals from groups underrepresented in information technology, such as women and racial\/ethnic minorities. These individuals are moving toward leadership positions in academia and industry, thus providing positive role models for a next generation. The combination of this program and other REU sites ensures broadened participation in computer science and computer engineering, as well as an increased domestic pool of highly trained information technologists.","title":"REU Site: SURF-IT: Exploring Integrative System Design at UCSC","awardID":"1156606","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505531,"511551"],"PO":["564181"]},"189647":{"abstract":"The wireless revolution in communication and computing has imbued electrical engineers with a steadily deepening appreciation for the importance of energy-efficient design. On the other hand, energy efficiency has for eons been a paramount consideration of living systems. <br\/><br\/>Statistical thermodynamics says that kTln2 is a lower bound for how many joules of energy must be expended in order either to encode\/transmit\/decode or to write\/read\/erase one bit of information in an environment at T degrees Kelvin, k being Boltzmann's constant. Biological encoding and decoding that performs close to the thermodynamic limit uses continuous time differential pulse position modulation (CTDPPM), arguably the most energy-efficient way to encode and transmit information. The co-PIs are applying their interdisciplinary expertise in neuroscience and information theory to address research topics such as: (i) Performance trade-offs in their bits\/joule maximizing exact solution of a 1915 model by Schrodinger now known to be applicable to thresholding neurons, (ii) Extension of the Schrodinger-style optimization to short term dynamics of bits\/joule maximizing CTDPPM systems; the present solution provides statistically optimum behavior only in the long term, (iii) Steps toward extension to networks containing multi-compartment elements, emphasizing hierarchical architectures with feedback governing short-term distribution of energy resources, and (iv) Intriguing connections with the burgeoning research discipline of network coding.","title":"CIF: Medium: Energy-Efficient Encoding of Information","awardID":"1162449","effectiveDate":"2012-04-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[508479,508480],"PO":["564898"]},"194542":{"abstract":"A one-day CISE-sponsored CAREER Workshop with participation from all three CISE Divisions will take place on March 30, 2012 at Drexel University. The agenda includes NSF leadership and former CAREER awardees who respectively speak on objectives and personal experiences with the program. The agenda also includes mock review panels. This gives attendees first-hand experience with the NSF review process and helps their understanding of evaluation criteria such as intellectual merit, broader impacts and the integration of research and education. For these panels, former CAREER awardees (from IIS, CNS, and CCF) will volunteer their past CAREER proposals as \"case studies\" for discussion. This CAREER Workshop gathers more than 100 junior faculty, including about 15% from schools that serve under-represented groups (e.g. HSBUs and MSIs). Such a workshop fills an important void; many junior faculty have little to no personal interactions with NSF. Thus, beyond the agenda, the workshop gives such young researchers opportunities to network with NSF leadership and colleagues from the CISE community. The workshop's intellectual merit stems from presentations that give attendees insight into examples of potentially transformative research and how CAREER played a critical role in shaping the field. The workshop's broader impact is underscored by a convenient location; Drexel's campus is based in Philadelphia, is easily accessible by all forms of transportation and, within a 300-mile radius of the city, there are more than 100 Ph.D.-granting universities.","title":"2012 NSF CISE CAREER Workshop","awardID":"1227966","effectiveDate":"2012-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":["403839","563560"],"PO":["565215"]},"189615":{"abstract":"Many high-end scientific applications perform stencil computations in their inner loops. A stencil defines the value of a grid point in a d-dimensional spatial grid at time t as a function of neighboring grid points at recent times before t. Stencil computations are conceptually simple to implement using nested loops, but looping implementations suffer from poor cache performance on multicore processors. Cache-oblivious divide-and-conquer stencil codes can achieve an order of magnitude improvement in cache efficiency over looping implementations, but most programmers find it difficult to write cache-oblivious stencil codes. Moreover, open problems remain in adapting these algorithms to realistic applications that lack the perfect regularity of simple examples. This project's investigation of cache-oblivious stencil compilation enables ordinary programmers of stencil computations to enjoy the benefits of multicore technology without requiring them to write code any more complex than naive nested loops.<br\/><br\/>The research project is developing a language embedded in C++ that can express stencil computations concisely and can be compiled automatically into highly efficient algorithmic code for multicore processors and other platforms. The Pochoir stencil compiler compiles stencil computations that exhibit complex boundary conditions, such as periodic, constant, Dirichlet, Neumann, mirrored, and phase factors; irregularities, including macroscopic and microscopic inhomogeneities, as well as irregular shapes; general complex dependencies, such as push dependencies, horizontal dependencies, and dynamic dependencies.<br\/>To achieve these goals, the researchers are developing provably good algorithms for complex stencil computations; exploring how domain-specific compiler technology can achieve speedups from efficient cache management, processor-pipeline scheduling, and parallel computation; investigating how to run stencils efficiently on a wide variety of architectures such as multicore, distributed-memory clusters, graphical processing units, FPGA's, and future exascale machines; demonstrating the effectiveness of their research by developing a production-quality stencil compiler; developing a benchmark suite and benchmarking system for evaluating Pochoir.<br\/><br\/>This research enables scientific researchers and others to easily produce highly efficient codes for complex stencil computations. The codes make good use of the memory hierarchy and processor pipelines endemic to multicore processors and run fast on a diverse set of hardware platforms. This research eases the development and maintenance of a wide variety of stencil-based applications ? ranging across physics, biology, chemistry, energy, climate, mechanical and electrical engineering, finance, and other areas ? benefiting these application areas, as well as society at large.","title":"SHF: AF: Medium: Collaborative Research: The Pochoir Stencil Compiler","awardID":"1162196","effectiveDate":"2012-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[508395],"PO":["565272"]},"185259":{"abstract":"Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1138994","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[497077],"PO":["565264"]},"189538":{"abstract":"Wireless networks are the dominant medium through which people connect to the Internet, communicate, do business and access information. The ever-growing demand for higher data rates places the conventional approaches to network design under considerable stress. To meet this demand, future wireless networks are rapidly evolving towards high-density, user-deployed, heterogeneous infrastructure characterized by very high data rates at shorter communication range, with possibly harsh interference. In this context, multiple flow and multiple hop communication is expected to play an increasingly important role. Yet, current visions of how such networks should be designed are limited by the fact that the fundamental understanding of such novel communication paradigms is still in its infancy. <br\/><br\/>This research addresses key questions about multihop multiflow networks in the form of new ideas, insights and tools, with a transformative impact on the design of future networks. The project is organized into three symbiotic research thrusts on extensibility, side information and algorithms. In the extensibility thrust, the investigators develop a new understanding of the capacity of multihop multiflow networks of prototypical network models. The side information thrust moves beyond idealized model assumptions and incorporates imperfect or uncertain conditions at multiple spatial and temporal scales. The third thrust on algorithms translates the new key ideas developed in the first two thrusts into explicit coding and signal processing algorithms with polynomial complexity in the network size, for resource-efficient multiflow multihop communication. The research can broadly impact the wireless industry by generating new ideas that will power the design of future generations of wireless networks. The project also includes a dedicated educational plan to recruit and train under-represented minorities in this field.","title":"CIF: Medium: Collaborative Research: Multihop Multiflow Wireless Networks: A Treasure Hunt","awardID":"1161801","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[508212],"PO":["564924"]},"187239":{"abstract":"The central vision of this project is to bring parallel programming, which continues to be a daunting task to this day even for experts, to mainstream programmers. The fundamental challenge is that the concurrency semantics defined by memory models of popular parallel languages are too weak. This project is investigating solutions that span from processors to languages to enable stronger memory consistency models starting with sequential consistency, but goes far further in achieving much stronger concurrency semantics such as determinism at the language-level. The end goal is to find solutions that provide the best of both worlds: sequential semantics and parallel performance. A set of correctness and performance enhancing tools that exploit the stronger concurrency semantics are also being developed.<br\/><br\/>Advances in computing have relied on the exponential growth in processor performance. Unfortunately, unlike in the past, successive generations of processors can no longer improve sequential performance because of technology constraints. The burden has shifted to software developers who must now evolve to take advantage of parallelism in multi-core processors. Unfortunately, parallel programming continues to be a daunting task to this day even for experts. This project is developing solutions that can bring parallel programming to mainstream programmers by dramatically simplifying the process of developing, debugging, and maintaining parallel software. Programmer productivity tools developed as part of this research will be directly beneficial to students, software developers and researchers. By involving colleagues in industry, this project could serve as a catalyst to bring the software and processor industry together to solve a problem that is common to both: enabling mainstream programmers to take advantage of multi-core architectures.","title":"CAREER: Holistic System Solutions for Empowering Parallel Programmers","awardID":"1149773","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[502231],"PO":["564588"]},"194532":{"abstract":"This award provides funding to assist approximately 10 US-based graduate students to attend the 10th USENIX Symposium on File and <br\/>Storage Technology (FAST), which is held on February 14-17, 2012, in San Jose, CA.","title":"Student Support for the 10th USENIX Conference on File and Storage Technologies (FAST)","awardID":"1227886","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[521047],"PO":["565255"]},"197426":{"abstract":"Answers to database queries often form the basis for critical decision-making. To improve efficiency and reliability, answers to these queries can be provided by distributed servers close to the querying clients. However, because of the servers' ubiquity, the logistics associated with fully securing them may be prohibitive; moreover, when the servers are run by third parties, the clients may not trust them as much as they trust the original data owners. Thus, the authenticity of the answers provided by servers in response to clients' queries must be verifiable by the clients. More generally, database responses are more useful if they contain the evidence of their own correctness. For example, this enables a consumer to provide her own credit report to a creditor without having the creditor request it from the reporting agency to establish the validity of the report. This project is developing methods for authenticating the validity and authenticity of a variety of database queries, including general relational, data cube, and spatio-temporal queries. Furthermore, techniques that use powerful cryptographic primitives are being developed for providing authentication and confidentiality. This research will enable utilization of this infrastructure in applications where users must rely on the authenticity of the answer, such as in financial systems, network monitoring, traffic control, or applications yet to be imagined. The results of this project will be disseminated through publications in journals and conferences. Furthermore, source code of these methods, in the form of libraries, will be made available over the web.","title":"CT-ISG: Collaborative Research: Towards Trustworthy Database Systems","awardID":"1243971","effectiveDate":"2012-04-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["548382"],"PO":["543481"]},"189605":{"abstract":"Many high-end scientific applications perform stencil computations in their inner loops. A stencil defines the value of a grid point in a d-dimensional spatial grid at time t as a function of neighboring grid points at recent times before t. Stencil computations are conceptually simple to implement using nested loops, but looping implementations suffer from poor cache performance on multicore processors. Cache-oblivious divide-and-conquer stencil codes can achieve an order of magnitude improvement in cache efficiency over looping implementations, but most programmers find it difficult to write cache-oblivious stencil codes. Moreover, open problems remain in adapting these algorithms to realistic applications that lack the perfect regularity of simple examples. This project's investigation of cache-oblivious stencil compilation enables ordinary programmers of stencil computations to enjoy the benefits of multicore technology without requiring them to write code any more complex than naive nested loops.<br\/><br\/>The research project is developing a language embedded in C++ that can express stencil computations concisely and can be compiled automatically into highly efficient algorithmic code for multicore processors and other platforms. The Pochoir stencil compiler compiles stencil computations that exhibit complex boundary conditions, such as periodic, constant, Dirichlet, Neumann, mirrored, and phase factors; irregularities, including macroscopic and microscopic inhomogeneities, as well as irregular shapes; general complex dependencies, such as push dependencies, horizontal dependencies, and dynamic dependencies. To achieve these goals, the researchers are developing provably good algorithms for complex stencil computations; exploring how domain-specific compiler technology can achieve speedups from efficient cache management, processor-pipeline scheduling, and parallel computation; investigating how to run stencils efficiently on a wide variety of architectures such as multicore, distributed-memory clusters, graphical processing units, FPGA's, and future exascale machines; demonstrating the effectiveness of their research by developing a production-quality stencil compiler; developing a benchmark suite and benchmarking system for evaluating Pochoir.<br\/><br\/>This research enables scientific researchers and others to easily produce highly efficient codes for complex stencil computations. The codes make good use of the memory hierarchy and processor pipelines endemic to multicore processors and run fast on a diverse set of hardware platforms. This research eases the development and maintenance of a wide variety of stencil-based applications, ranging across physics, biology, chemistry, energy, climate, mechanical and electrical engineering, finance, and other areas, benefiting these application areas, as well as society at large.","title":"SHF: AF: Medium: Collaborative Research:The Ponchoir Stencil Complier","awardID":"1162148","effectiveDate":"2012-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["548187",508374],"PO":["565272"]},"194039":{"abstract":"This activity confronts the need to study and forecast current and future data flow volumes in the context of NSF's International Research Network Connections (IRNC) program. The study is built around the following components: \"Capabilities Inventory\", to itemize the largest international data flows in combination with IRNC link capacities; \"Data Volume Projection\", a methodology to forecast data volumes into 2020; \"Gap Analysis\", to identify disconnects between IRNC capacities and projected data volumes; \"CI Recommendations\",to provide insights on how to address those gaps; and a final report on project activities. Intellectual merit is described as being found in the merits of the study to be conducted on data needs of the community. Broader impact is reflected in the potential impact of the study across scientific disciplines globally, impacts resulting from the study's information and findings applied to increased capabilities from IRNC connections through 2020.","title":"EAGER: Report on International Data Exchange Requirements (RIDER)","awardID":"1223688","effectiveDate":"2012-04-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["521241","533483","532703",519646],"PO":["564246"]},"187329":{"abstract":"The use of cloud computing services---services that host infrastructure on <br\/>which third-parties can run applications and store data---has skyrocketed in <br\/>the last few years. However, despite the growing number of cloud services, most <br\/>applications are deployed today on a single cloud service. This status quo has several<br\/>drawbacks---availability and performance offered by an application are limited<br\/>by the cloud service on which the application is deployed, and cost borne by<br\/>an application provider to meet performance goals is limited by the types and<br\/>pricing of resources offered by that service.<br\/><br\/>This research project will enable distributed applications to obtain better<br\/>availability and performance at lower cost by planning and managing application <br\/>deployments that span multiple cloud services. Recognizing the fact that different<br\/>components of an application have different characteristics, this project will<br\/>enable cost-effective multi-cloud deployments by matching the heterogeneity of<br\/>an application's components with the diversity of resources offered by<br\/>different cloud services. The research in this project involves three main<br\/>tasks---1) the development of algorithms to choose cost-effectively among the <br\/>myriad candidate configurations for deploying an application across cloud <br\/>services, 2) the design and implementation of a distributed measurement and <br\/>monitoring framework to dynamically reconfigure an application's deployment as<br\/>the state of cloud services and of the Internet change over time, and 3) the<br\/>development of tools and techniques that enable legacy applications <br\/>implemented for deployment on a single cloud service to be easily ported to <br\/>multi-cloud deployments. The research will involve significant<br\/>systems-building and experimentation with the proposed techniques applied to<br\/>deployments of popular applications on real cloud services.<br\/><br\/>Broader Impact:<br\/>In spite of the increasing popularity of cloud services, there remain several<br\/>concerns about their use. The algorithms and software systems developed as<br\/>part of this research may transform the ways in which application providers<br\/>use cloud services, thus easing concerns with respect to availability and<br\/>performance. The project also has a significant education component with the<br\/>introduction of new graduate and undergraduate classes, and public talks to<br\/>increase awareness about cloud services among small and non-profit businesses.","title":"CAREER: Cost-Effective Application Deployments Spanning Multiple Cloud Services","awardID":"1150219","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[502415],"PO":["564993"]},"195129":{"abstract":"High-Definition Multipoint Videoconferencing is a core application for Gigabit and faster networks. Commercial systems, designed for 10 megabit and slower networks, employ expensive conferencing bridges that have to be managed, limit the number of concurrent video conferences, and limit the quality of the video. In this research project, the endpoints discover and exchange their capabilities and determine the usable network bandwidth between them to negotiate parameters for the best quality video conference. Since the video conferences are established between two or more endpoints directly, the solution is scalable. And since no conferencing bridge is used, the solution is affordable. By taking advantage of the Gigabit or faster network bandwidth, the endpoints can send reduced-compression video or uncompressed video that is higher quality than that offered by current systems. In GENI-enabled networks, layer 2 routing is used to increase effective bandwidth and GENI slices are used for enhanced privacy.<br\/><br\/>The Case Connection Zone, a Gigabit fiber-to-the-home research project of Case Western Reserve University, is demonstrating how the Gigabit network can be used to improve quality of life for the residents in several national priority areas, including health and wellness. Next generation HD multipoint video conferencing is an essential tool for several initiatives. In about 200 senior residences, it enables seniors, without leaving home, to consult clinicians, participate in chronic disease support groups, in social groups, and in lifelong learning. Many Gigabit applications will incorporate this technology or be built upon it.","title":"EAGER: Telehealth and Wellness for Senior Citizens Utilizing In-Home Gigabit HD Multipoint Videoconferencing","awardID":"1230663","effectiveDate":"2012-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[523035,"559140"],"PO":["557315"]},"189607":{"abstract":"Wireless networks are the dominant medium through which people connect to the Internet, communicate, do business and access information. The ever-growing demand for higher data rates places the conventional approaches to network design under considerable stress. To meet this demand, future wireless networks are rapidly evolving towards high-density, user-deployed, heterogeneous infrastructure characterized by very high data rates at shorter communication range, with possibly harsh interference. In this context, multiple flow and multiple hop communication is expected to play an increasingly important role. Yet, current visions of how such networks should be designed are limited by the fact that the fundamental understanding of such novel communication paradigms is still in its infancy. <br\/><br\/>This research addresses key questions about multihop multiflow networks in the form of new ideas, insights and tools, with a transformative impact on the design of future networks. The project is organized into three symbiotic research thrusts on extensibility, side information and algorithms. In the extensibility thrust, the investigators develop a new understanding of the capacity of multihop multiflow networks of prototypical network models. The side information thrust moves beyond idealized model assumptions and incorporates imperfect or uncertain conditions at multiple spatial and temporal scales. The third thrust on algorithms translates the new key ideas developed in the first two thrusts into explicit coding and signal processing algorithms with polynomial complexity in the network size, for resource-efficient multiflow multihop communication. The research can broadly impact the wireless industry by generating new ideas that will power the design of future generations of wireless networks. The project also includes a dedicated educational plan to recruit and train under-represented minorities in this field.","title":"CIF: Medium: Collaborative Research: Multihop Multiflow Wireless Networks: A Treasure Hunt","awardID":"1162154","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[508378],"PO":["564924"]},"192346":{"abstract":"This award provides support to students and other young researchers for travel and accommodation to the International Conference on Machine Learning (ICML) 2012 to be held at the University of Edinburgh, Scotland, June 26-July 1, 2012. The International Conference on Machine Learning (ICML) is held annually and is considered to be the premier conference in Machine Learning. The students funded via this grant will be selected by a peer review process based on their financial need and alignment of research areas. The student selection process will also take into consideration goals of broadening participation, both to traditionally underrepresented groups and to students whose institutions may have limited machine learning resources. The students will get an opportunity to network with experts in the area and gain valuable insights into the cutting edge of Machine Learning research. These student scholarships are very important for encouraging student participation in this premier conference and for shaping the future of the field as a whole.","title":"29th International Conference on Machine Learning (ICML 2012)","awardID":"1212370","effectiveDate":"2012-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["559403"],"PO":["562760"]},"194656":{"abstract":"Networking Networking Women (N2Women) fosters connections among women in networking and communications research community in which women are underrepresented. This award supports students from U.S. institutions to attend the Second N2Women Workshop co-located with IEEE INFOCOM 2012, the 31st Annual International Conference on Computer Communications. INFOCOM will be held March 25-30, 2012 in Orlando, Florida. The N2Women workshop is scheduled on the day before the main conference begins (Monday, March 26th, 2012), allowing the attendees to form connections that can then be strengthened if they also attend the conference. Priority is given to students who will benefit from attending the workshop, but are unlikely to attend due to the unavailability of travel funding. Students attending the workshop are encouraged to stay and attend INFOCOM.<br\/><br\/>Intellectual Merit:<br\/><br\/>The intellectual merit of this proposal includes contributions that the student participants themselves will gain from and make to the N2Women Workshop; the information and connections that could positively impact their future research, and the co-location that allows them to participate in INFOCOM 2012, a premier conference in networking and communications. The exposure to the technical content of the N2Women Workshop (and to INFOCOM 2012 if they attend) is expected to inspire students to address challenging research problems in their field and to help them meet their long-term research goals.<br\/><br\/>Broader Impacts:<br\/><br\/>The broader impact of this proposal is the professional development of the under-represented graduate students that under this grant are able to attend the N2Women Workshop. The grant provides these graduate students the opportunity to attend high-caliber technical presentations from keynote speakers, be exposed to state-of-the-art research in a poster session, participate in mentoring sessions with leading researchers, and network with fellow graduate students. The goal is to make long-term positive impacts on the students? careers.","title":"Student Travel Grants to Attend the Second Networking Networking Women (N2Women) Workshop","awardID":"1228498","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[521384],"PO":["565090"]},"193755":{"abstract":"Computational techniques are revolutionizing the way in which research is conducted in science and engineering. However, even in domains that seem closely liked, such as biology, medicine, and drug discovery, computing science research advances are not broadly disseminated and do not become widely known. This conference would bring together computational scientists and domain experts to explore current results and to foster collaborations. A set of outstanding researchers from around the world have agreed to structure this new effort. The three day meeting meeting, in Las Vegas Nevada, would have participation by students through travel grants. This building of the next generation of computing science in different application areas is one of the key outcomes of this meeting. In addition, the selected papers will be made available online. In addition, some of the papers will be published through BioMed Central, which has reduced the costs for this meeting. Bringing together academic and industry researchers to consider the latest advances in computational methods will promote the rapid transfer of results from research to products and technologies.","title":"Second International IEEE Conference on Computational Advances in Bio and medical Sciences (ICCABS) - Travel Awards","awardID":"1219598","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["559638"],"PO":["565136"]},"195889":{"abstract":"NSF funding supports travel grants for U.S.-based student teams to participate in the fourth annual programming contest held at SIGMOD 2012 in Scottsdale Arizona, May 20-24, 2012 (http:\/\/ http:\/\/www.sigmod.org\/2012\/). The contest is open to graduate and undergraduate teams from degree-granting institutions. This year's task is to implement a multidimensional high-throughput in-memory indexing system. As with previous years, the goals of the contest are to: (a) stimulate student interest in the database management systems field; (b) present a research challenge; (c) foster the creation of sharable open source code modules; (d) foster Computer Science education by creating a forum where students can excel; and (e) present a forum where excellent students can be acknowledged for their problem-solving and programming skills. The contest is conducted during the first two quarters of 2012, with a bake-off among the finalists at the conference. A $5,000 prize, donated by SAP, will be awarded to the winning team. This contest will stimulate the database community to develop robust open source implementations of challenging research software. Such implementations have intellectual merit in that they provide a base upon which other researchers can build tools and students can learn how others have architected large data management systems.<br\/><br\/>The contest will attract young, eager, students with enthusiasm for building real systems to the database community and a special effort will be made to encourage participation from under-represented groups. The programming contest will emphasize that the community values real implementations in addition to fundamental research, and will potentially lead to open source software that will be used by researchers outside of the community. For more information see the Program Contest website (http:\/\/wwwdb.inf.tu-dresden.de\/sigmod2012contest\/).","title":"ACM SIGMOD 2012 Student Programming Contest: A Multidimensional Indexing System","awardID":"1235666","effectiveDate":"2012-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[525076],"PO":["563751"]},"194999":{"abstract":"The International Symposium on Performance Analysis of Systems and Software (ISPASS) is a premier forum for sharing advanced academic and industrial research focused on performance analysis of computer systems and software, and brings together researchers from the computer architecture, systems and applications software, and performance analysis fields. ISPASS seeks to increase student participation in symposium and the field. The proposed funding supports the travel of eligible US students to the symposium. The education and training of students is an important broader impact of NSF funding.","title":"Travel Support for the 2012 IEEE International Symposium on Performance Analysis of Systems and Software","awardID":"1229998","effectiveDate":"2012-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[522703],"PO":["564388"]},"194526":{"abstract":"SIAM International Conference on Data Mining Student Travel Awards 2012, PI: Jennifer Dy, Northeastern University.<br\/>The project provides NSF Student Travel Fellowships to graduate students enrolled in PhD programs in data mining or closely related areas to attend and participate in the 2012 SIAM Data Mining (SDM 2012) Conference organized by the Society for Industrial and Applied Mathematics (SIAM) in cooperation with the American Statistical Association in Anaheim, California, USA from April 26 to 28, 2012. Special efforts will be made to attract women and members of groups that are underrepresented within the data mining research community. The NSF student travel award recipients will be able to attend the plenary and contributed talks, workshops and tutorials that are part of SDM 2012, as well as a Doctoral Forum. The Doctoral Forum is designed to allow doctoral students who are at an early stage in their research careers to present their work, interact with their peers from other universities as well as receive one-on-one mentoring from leading data mining researchers.<br\/><br\/>Intellectual Merit. Participation in premier research conferences is an essential component of research-based advanced training of Ph.D. students in data mining. The SDM 2012 Doctoral Student Forum provides an opportunity for Ph.D. candidates to receive constructive feedback and mentoring from established researchers in data mining. Such interactions serve to broaden the training of students, enhance the quality of the dissertation research performed by the students at their home institutions, and ultimately, help them make informed decisions that advance their long-term career objectives.<br\/><br\/>Broader Impact. Data mining is playing an increasingly important role in many emerging data-rich applications ranging from computational biology to computer-assisted discovery and counterterrorism efforts. The award will help broaden the representation of women and members of underrepresented minority groups within the Data Mining research community. It also contributes to the training of a cadre of new generation scientists equipped with sophisticated tools to extract knowledge from data in areas that are growing in importance in our increasingly digital, interconnected world.","title":"SIAM International Conference on Data Mining Student Travel Awards 2012","awardID":"1227843","effectiveDate":"2012-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[521034],"PO":["565136"]},"195606":{"abstract":"The 8th International Nanotechnology Conference on Communication and Cooperation (INC8) will bring together some of the world?s most renowned and technologically advanced thinkers to exchange information and ideas with regards to nanotechnology, nano-optics and nanoelectronics. This arena will provide a unique opportunity where academics and industry leaders can interact on issues in nanotechnology. Current issues that will be discussed includes energy and environmental challenges facing mankind in particular targeting to decrease CO2 emissions and increase the viability of renewable energy solutions - and the associated societal implication and issues. Also, another major challenge that will be discussed includes a look at logic switch replacement technologies for CMOS and what alternate state variables are viable options. Semiconductor industry related questions and topics that will be discussed include nanoscale interconnects, thermal management, directed self-assembly, and fault tolerance. <br\/><br\/>In order to further strengthen the continuous dialogue between Europe, Japan and the United States, broad regional overviews will be combined with detailed presentations from each of the regions. Senior researchers from industry, academia, leaders and policy makers from North America, Europe and Asia will hold discussions on a variety of efforts in nanoscience, along with opportunities for collaboration. Young scientists will also be invited to present posters highlighting their work. The meeting will target groups at co-operating to implement strategic programs to progress human development through nanotechnology.","title":"Eighth International Nanotechnology Conference on Communication and Cooperation","awardID":"1233716","effectiveDate":"2012-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0700","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"7681","name":"ENG NNI SPECIAL STUDIES"}}],"PIcoPI":["542723"],"PO":["562984"]},"195419":{"abstract":"This project fundsapproximately 25 graduate students to attend the Ninth Symposium on Networked Systems Design and Implementation (NSDI 2012) Conference. <br\/><br\/>NSDI 2012 will be held in San Jose, CA, on April 25-27, 2012. The conference focuses on the design principles of large-scale networks and distributed systems and, in particular, challenges that are shared across systems as diverse as internet routing, peer-to-peer file sharing, sensor nets, scalable web services, and distributed network measurement. The goal of the conference is to bring together researchers from across the networking and systems community?including computer networking, distributed systems, and operating systems?to foster cross-disciplinary approaches and to address shared research challenges. This cross-disciplinary emphasis makes it well-suited as a target for student participation. The support requested in this proposal will enable the participation of students who would otherwise be unable to attend NSDI. The support requested in this proposal will enable the participation of students who would otherwise be unable to attend NSDI.","title":"Student Travel Support for the Ninth Symposium on Networked Systems Design and Implementation (NSDI 2012)","awardID":"1232584","effectiveDate":"2012-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["532591"],"PO":["551712"]},"185270":{"abstract":"ExCAPE: Expeditions in Computer Augmented Program Engineering<br\/>Lead PI\/Institution: Rajeev Alur, University of Pennsylvania<br\/><br\/>Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1139056","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["508201"],"PO":["565264"]},"185281":{"abstract":"ExCAPE: Expeditions in Computer Augmented Program Engineering<br\/>Lead PI\/Institution: Rajeev Alur, University of Pennsylvania<br\/><br\/>Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1139138","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[497138,"556819","514744","553584",497142],"PO":["565264"]},"188691":{"abstract":"This CNIC award supports planning-visit travel to Hong Kong. Three trips will be used to develop a new research collaboration with Tak-Wah Lam at the University of Hong Kong and Mordecai Golin at the Hong Kong University of Science and Technology. The target of the research is the general problem of energy consumption in information technology. The three collaborators bring complementary strengths to the problem. The initial approach is to analyze strategies and algorithms for minimizing energy consumption in task management, comparing power-down scheduling with speed-scaling scheduling using dynamic programming and then exploring the possibility of alternative models. A graduate student from UC-Riverside will participate in the project and will travel to Hong Kong with the PI. It is anticipated that the initial collaboration will lead to a full-scale research proposal to CISE.<br\/><br\/> This planning visit aims to establish an international research collaboration that can contribute new insights and algorithmic techniques required to address challenges in energy management. From a theoretical point of view it will expand the understanding of feasible solutions of power-down and speed-scaling scheduling problems, leading to more efficient algorithms. Existing algorithms for these scheduling approaches are currently too slow or too complex for practical applications. The proposed research aims to design faster, simpler, and more general algorithms. As one of the reviewers noted, more efficient approaches in information technology, which is consuming increasing amounts of energy, can help to control global energy consumption. Thus, the results of this research can have an impact on supporting sustainable computing and a sustainable modern society. Another benefit of the project is the involvement of a graduate student in the international collaboration.","title":"Collaboration with Hong Kong: Minimizing Energy Consumption Through Task Scheduling","awardID":"1157129","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["517719"],"PO":["563279"]},"188460":{"abstract":"This funding establishes a new Research Experiences for Undergraduates (REU) Site at the University of Pennsylvania (Penn) focused on next generation robotics. The site is hosted by the General Robotics, Automation, Sensing, and Perception (GRASP) Laboratory inside Penn's School of Engineering and Applied Sciences. Each summer a cohort of undergraduate students will work with GRASP faculty on cutting-edge research aligned with core projects ongoing in the lab. The students will participate in professional development activities that make them more aware of graduate school and professional aspects of a computing career. The primary purpose of the site is to extend the GRASP research experience to more students who come from groups traditionally under-represented in science, technology, engineering and mathematics. These students will have access to the outstanding faculty and facilities available at the university to conduct challenging research using technologies that underpin next generation robotics.<br\/><br\/>The intellectual merit of this project lies with the strong research team and the focus on next generation robotics technologies. The students will be exposed to the fundamentals of robotics science, spanning a wide spectrum from perception and control theory to planning algorithms and mechanical design, but unified by experiments on concretely defined real-world challenges. The research has the potential to contribute to the research core of the computing disciplines.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups and from institutions with limited research environments. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Perception, Planning, Mobility, and Interaction for Next Generation Robotics","awardID":"1156366","effectiveDate":"2012-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505321,505322],"PO":["564181"]},"196393":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 12 promising graduate students from U.S. institutions of higher learning along with 9 distinguished research faculty, to be held in conjunction with the Fifth International Conference on Pervasive Technologies Related to Assistive Environments (PETRA 2012), which will take place June 6-8 on the island of Crete, Greece (http:\/\/www.petrae.org). PETRA is the only annual conference that brings together theoreticians and practitioners from a wide variety of disciplines to focus on the application of pervasive technologies to assistive environments. What connects different disciplines in this highly interdisciplinary but topical conference is the ability to discover new alliances, share data and design new methods that have real-world social impact while also advancing each field scientifically. PETRA projects assume a human is at the center of \"cyberphysical systems\" where the digital world merges with the physical. PETRA 2012 will address timely computational challenges including integration mechanisms of diverse sensor technologies, modeling heterogeneous data, synthesis and analysis of data streams, privacy and security of information, ranking, cleaning, storing and retrieving sensor data streams for pattern analysis and discovery, robust remote rehabilitation mechanisms, correlating brain imaging with behavioral imaging, handling intensive real time data in complex environments, and ways to interpret seemingly meaningless data in order to derive meaningful human behavioral patterns and\/or to identify important \"events\" or changes. PETRA 2012 will also incorporate new exciting aspects in improving the quality of human life and health, such as how clinical and biomedical indicators are connected with observed behavioral patterns over time to refine a particular treatment. <br\/><br\/>The goals of the Doctoral Consortium are to increase the exposure and visibility of the participants' work within the community, to help establish a sense of community among this next generation of researchers, and to help foster their research efforts by providing substantive feedback and guidance in a supportive and interactive environment from a group of senior researchers. Student participants in the Doctoral Consortium will be drawn from diverse communities including computer science, engineering, psychology, social science, neuroscience, human-computer interaction, cognitive science and communication. They will make formal presentations of their work and will receive feedback from a faculty panel; the feedback is geared to helping students understand and articulate how their work is positioned relative to other research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The workshop faculty members will bring a wide spectrum of expertise, and provide student mentoring and coordination. Doctoral Consortium attendees will be asked to create and maintain \"conference workbook\" (webpage) where along with their work they include feedback on papers they attended and observations that they gathered (e.g., through meetings and discussions with conference speakers and other participants) that will apply to and impact their work. Short papers on the participants' work will be published in the Conference Proceedings (which are included in the ACM Digital Library), and a summary report on the event will be posted on the conference website. <br\/><br\/>Broader Impacts: The PETRA 2012 Doctoral Consortium will bring together some of the best students, researchers and practitioners in relevant fields, and will thereby afford the younger participants a unique opportunity to gain wider exposure for their innovative ideas while also receiving reinforcement for the importance and value of conducting research with societal impact. The workshop will allow the junior participants to create a social network both among themselves and with senior colleagues. The organizing committee will make a concerted effort to attract participants who are women, members of under-represented minorities, and persons with disabilities. To further assure participant diversity, the organizers will endeavor not to accept more than 2 students from any one institution.","title":"Workshop: Doctoral Consortium and Student-Author Travel for the PETRA 2012 Conference","awardID":"1238660","effectiveDate":"2012-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["560636","558118","557541","229551","564932"],"PO":["565227"]},"185261":{"abstract":"Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1138996","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[497082,"526896","556654","556655","518109"],"PO":["565264"]},"185272":{"abstract":"ExCAPE: Expeditions in Computer Augmented Program Engineering<br\/>Lead PI\/Institution: Rajeev Alur, University of Pennsylvania<br\/><br\/>Computers have revolutionized our daily lives, and yet the way we program computers has changed little in the last several decades. Software development still remains a tedious and error-prone activity. ExCAPE aims to change programming from a purely manual task to one in which a programmer and an automated program synthesis tool collaborate to generate software that meets its specification. <br\/><br\/>A distinguishing feature of the ExCAPE approach is that the program description can involve a wide range of artifacts that are best-suited to the particular development task: incomplete programs; declarative specifications of high-level requirements; positive and negative examples of desired behaviors; and optimization criteria for selecting among alternative implementations. This diversity is aimed at allowing a programmer flexibility to express insights through a variety of formats, leading to a more intuitive and less error-prone way of programming.<br\/><br\/>The synthesis tool uses a range of computational approaches and developer interaction to compose these different views about the structure and functionality of the system into a unified, concrete implementation. The computational techniques include decision procedures for constraint-satisfaction problems; iterative schemes for abstraction and refinement; and data-driven learning. The methodology for programmer interaction moves verification from the back-end of the design cycle to the front-end, with the promise of a more reliable software product.<br\/><br\/>To develop the theory and practice of the proposed paradigm, the ExCAPE team brings together expertise in theoretical foundations (computer-aided verification, control theory, program analysis), design methodology (human-computer interaction, model-based design, programming environments), and applications (concurrent programming, network protocols, robotics, system architecture). Research will focus on developing new computational engines for transformation and integration of synthesis artifacts, and effective methods for programmer interaction and feedback. <br\/><br\/>While the benefits of the ExCAPE approach will apply broadly to software development, the ExCAPE team will focus its efforts by initially targeting four challenge problems: developing efficient concurrent data structures; developing protocols for on-chip interconnection networks; developing distributed routing network protocols; and end-user programming for autonomous robots. The ExCAPE approach will be a radical departure from the way these problems are solved today. For example, for the challenge problem on concurrent programming, the planned design tool will provide smart assistance for expert programmers to produce efficient and correct code, while the proposed tool for the robotics challenge problem will let end users program robots by demonstrating example behaviors. As ExCAPE aims to affect industrial practice, design tools for all four challenge problems will be developed and evaluated in close collaboration with industrial partners.<br\/><br\/>The technology developed by ExCAPE also has the potential to revolutionize the way computing concepts are taught. Building on the core technology used in program synthesis, the ExCAPE team plans to develop smart tutoring software that can analyze students? answers for conceptual errors and generate additional problems tailored to that student.. This tutoring software will be developed for representative high-school and undergraduate courses and will be made widely available. This outreach effort is aimed at attracting more students to computing disciplines by promoting a new and more appealing vision of what it means to program. ExCAPE will also nurture an inter-disciplinary community of researchers in computer-augmented programming, via an annual workshop, a biannual summer school, and a competition for synthesis tools, with associated challenge problems and benchmarks.<br\/><br\/>For more information visit http:\/\/excape.cis.upenn.edu","title":"Collaborative Research: Expeditions in Computer Augmented Program Engineering (ExCAPE): Harnessing Synthesis for Software Design","awardID":"1139061","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["526859"],"PO":["565264"]},"187186":{"abstract":"One of the fundamental challenges facing the processor industry today is in continuing to address performance and scalability demands given the constraints of both energy and programmer efficiency. This CAREER project builds upon recently-introduced fused designs, which incorporate conventional microprocessors and graphics processors in the same package, in order to address these challenges through the development of more programmable, flexible, scalable, and secure hybrid architectures. Towards this long-term goal, this project investigates techniques that minimize limitations of the traditional coprocessing model, including performance bottlenecks, vulnerable shared memory spaces, and inflexible resource management. <br\/><br\/>Specifically, this project explores thread divergence caused by complex control-flow and memory access, thread migration between cores, hardware accelerator design for tasks beyond traditional graphics processing, and adding security safeguards to match what is currently available on conventional microprocessors. In addition, this project also examines a variety of instruction set extensions, accelerator architectures, and models of computation that have the potential to lead to significant efficiency and programmer flexibility improvements. The expected impact is that this CAREER project will one day bear fruit in the form of another new segment of the computing industry, one that specializes in hybrid architectures that can scale to thousands of independent threads, while maintaining the capabilities of a traditional multi-user operating system and middleware. Broadly speaking, by advancing the state-of-the-art in computer architecture, this research will lead to improvements in consumer devices in terms of size and form factor, energy efficiency and battery life, and complexity and graphical fidelity of supported applications. Similarly, the usage of these architectures to enable continued performance scaling has the potential to have wide-ranging societal impact, through the advancement of those fields (e.g. bioinformatics, climate modeling, business intelligence) that utilize high-performance computing to enable innovative discovery. This project also includes a focus on expanding an existing course that the PI has developed, that takes a novel approach in introducing graphics processing and architecture from a hardware design perspective.","title":"CAREER: Architectural Support for CPU \/ GPU Hybridization","awardID":"1149539","effectiveDate":"2012-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[502125],"PO":["366560"]}}