{"81735":{"abstract":"ABSTRACT<br\/><br\/>Real-time rendering with complex illumination, realistic materials, and an<br\/>accurate simulation of light scattering, with the ability to manipulate<br\/>parameters interactively, is the challenge addressed in this project.<br\/>Fundamental questions about the representation of appearance are explored,<br\/>resulting in the development of a new class of real-time algorithms.<br\/>Specifically, the focus is on three main directions: (i) Mathematical and<br\/>Empirical Analysis of the complexity of appearance representations and<br\/>light transport; (ii) Computational Techniques such as fine-to coarse and<br\/>coarse-to-fine algorithms, function dictionaries, and hierarchical<br\/>principal component analysis; and (iii) Algorithms and Systems supporting<br\/>interactive manipulation of illumination, materials, and viewpoint.<br\/><br\/>Computer graphics and scientific visualization is increasingly used in<br\/>areas such as simulation and training, automobile design, architectural<br\/>renderings, defense, electronic commerce, and entertainment. With today's<br\/>technology, it is possible to create strikingly realistic images using<br\/>sophisticated, but also slow rendering algorithms. These algorithms<br\/>cannot address the growing need for effective methods to manipulate and<br\/>interact with 3D environments. Modern PCs can render scenes with<br\/>millions of polygons at interactive rates, but this performance comes<br\/>at the cost of a considerable loss in quality and realism. This project<br\/>seeks to overcome these limitations: producing highly realistic images<br\/>at interactive rates.<br\/><br\/><br\/>Over the last thirty years computer graphics research has created technology that improves both the realism and generation speed of computer-generated images. However, there is no widely used method for creating realistic images, and it remains difficult in practice to create realistic images. This project aims to develop a practical method for realistic image creation that addresses the visual effects believed to be salient by the graphics and perception communities. The method is intended to be robust, relatively simple, and to have the potential to be interactive in the next decade.<br\/><br\/>The ability to rapidly generate realistic images is useful in many applications. For example, flight and driving simulators rely on realistic imagery, but the interactive nature of these systems limits the realism that is feasible. The proposed work should extend these limits. The proposed method would also be useful for generating images for planning and education; images could be created to help visualize the results of reconstruction efforts, habitat change, and urban planning. Finally the method should be useful for generating synthetic images for input to automated vehicles, where many different scenes and atmospheric conditions could be generated rapidly and at low expense.","title":"Collaborative Research in Computer Graphics: Real-Time Visualization and Rendering of Complex Scenes","awardID":"0305322","effectiveDate":"2003-12-15","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["485160"],"PO":["532791"]},"92916":{"abstract":"This proposal supports the first step in the Proteus Media Project, a project to design and build a computer-assisted political war-game. In particular, the Proteus gaming environment will be designed to provide participants with experience in political, economic, operational, cultural, and temporal dimensions of post-war Iraq. This first phase will develop a preliminary design for the system. The Proteus system will address issues in temporal reasoning and adaptive agents.","title":"Proteus Media Project Phase I","awardID":"0403158","effectiveDate":"2003-12-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V123","name":"NIMA-TIME BASED RES WORKSHOP"}}],"PIcoPI":[243510],"PO":["564316"]},"86671":{"abstract":"Project Summary: The now well-known vision and challenge in post-genomics biology is to make the entire process of research scalable to large networks using high-throughput techniques and large-scale computation. Computational biology and bioinformatics have focused attention on the need for sophisticated methods for handling large databases and tools for modeling and simulating complex networks. Not as widely recognized is that the scalability of the more subtle processes of drawing meaningful and reliable scientific, medical, and biological inferences from the wealth of data and computation is equally important and requires the development of fundamentally new theory and software. <br\/><br\/>The research objective of this project is to develop the theoretical foundation and information technology infrastructure necessary to accelerate progress in systems biology, with concrete demonstrations on a variety of biological experiments. This ambitious goal requires augmenting bioinformatics and current modeling and simulationapproaches with greater understanding of the organizational principles underlying network complexity, including connections with molecular details, and exploiting this understanding to advance mainstream experimental biology. Building on recent breakthroughs in theory and scalable algorithms for systematic robustness analysis and model (in)validation of nonlinear network models with uncertain rate constants, the project maps out a research path that will (1) develop the necessary rigorous and practical mathematical theory; (2) embody it in a software environment that supports the complex iterative processes involved in going from raw data to modeling, analysis, and inference, with tight feedback to experimentation and modeling throughout; and (3) apply the theory and software to specific experimental studies in biology as a way of grounding the entire endeavor. <br\/><br\/>The intellectual merit combines immediate practical impact and conceptual depth. Automating and computationally augmenting scientific and mathematical inference from noisy and incomplete data for uncertain models has long been an elusive goal. Achieving it in the context of complex biological systems is for the first time both a necessity and an achievable goal. To do this, data and modeling assertions and questions must be described in a common framework that is biologically natural, yet can be stored, manipulated, shared, and ultimately turned over to powerful algorithms for resolution. Our objective is to create tools which make it possible to systematically answer questions such as: Is a proposed model consistent with experimental data? If so, is it robust to additional perturbations that are plausible but untested? Are different models at multiple scales of resolution consistent? What is the most promising experiment to refute or confirm a model? Traditionally, such network-level questions that arise naturally in biology have been considered computationally intractable, since they are typically stochastic, nonlinear, nonequilibrium, uncertain, involve multiple scales, and hybrid (mixing continuous and discrete mathematics), limiting approaches to heuristic and brute-force methods, or to extreme simplification. Recently this situation changed profoundly, based on new methods developed by the research team and their collaborators. A crucial insight is that evolution favors high robustness to uncertain environments and components, yet allows severe fragility to novel perturbations, and this \"robust yet fragile\" feature must be exploited explicitly in scalable algorithmic approaches. <br\/><br\/>The broader impact lies in the synergistic links this work forges with similar challenges that exist throughout science and technology, such as the Internet, aerospace systems design, materials science, multiscale physics, stochastic multiscale chemistry, and disturbance ecology. The theoretical foundations build broadly on robust control theory, dynamical systems, numerical analysis, operator theory, real algebraic geometry, computational complexity theory, duality and optimization, and semi-definite programming. The results will be made accessible to the broadest possible audience, both with representative and challenging experimental biology and the connections with other examples of complex systems. The preliminary progress already made by this team is striking and has been applied to understanding, for example, the robustness of complex control systems, the performance of internet protocols, and bacterial<br\/>chemotaxis and stress response. The work is creating new mathematics and algorithms, beginning to appear in the highest-impact journals, and concretely demonstrating that this research can help experimental biologists.<br\/>Diversity and breadth appear at every level. In the research group of the lead PI (Doyle), 6 of 11 graduate students and 2 of 4 postdoctoral scholars are women, and include a broad racial and ethnic divers","title":"ITR COLLAB: Theory and Software Infrastructure for a Scalable Systems Biology","awardID":"0326635","effectiveDate":"2003-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["499268","490256"],"PO":["565223"]},"86495":{"abstract":"ITR: A Biologically Inspired Adaptive Working Memory System For Efficient Robot Control<br\/><br\/>Abstract<br\/>A major goal in robotics has been to give robots the capacity to learn and reason about new tasks without explicitly programming this new information. This approach takes the programming of robots away from writing tedious code, and transforms it into a process of learning through experience. Experience-based learning is employed by human beings, primates, mammals, and a large number of other animals. In particular, there is much evidence for the existence of an adaptive working memory in primates. Such memory is closely tied to the learning and execution of tasks, as it contributes to decision-making capabilities by focusing on essential task information and discarding distractions. The employment of such a biologically-based adaptive working memory within a robot has not been previously investigated. Our goal is to develop an adaptive working memory to support the following:<br\/> Focus attention on the most relevant features of the current task.<br\/> Support generalization of tasks without explicit programming.<br\/> Guide perceptual processes by limiting the perceptual search space.<br\/> Provide a focused short-term memory to prevent the robot from being confused by occlusions.<br\/> Provide robust operation in the presence of distracting events.<br\/>We propose to integrate the adaptive working memory structure into a robot in order to provide a solid context for exploring the issues of task learning. The adaptive working memory will be tested using a series of evaluation tasks on both humanoid and mobile robot systems.","title":"ITR: A Biologically Inspired Adaptive Working Memory System for Efficient Robot Control and Learning","awardID":"0325641","effectiveDate":"2003-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["537126","270496","259953","561794","376312"],"PO":["564318"]},"94660":{"abstract":"While head-mounted display (HMD) technologies have undergone significant developments and their functional benefits for 3D visualization have been recognized, they have suffered from tradeoffs and limitations in capability, which impose critical affects on visualization accuracy, user performance, and user safety. Chief among these problems is an ignorance of eye movement. Most state-of-the-art HMDs use head pose to approximate line-of-sight, which may cause a significant disparity between what users are intended to look at and what they actually see. The integration of eye tracking capability into HMDs would significantly improve display quality and user interface. In this project, the PIs will optimize the conceptual design of HMD-eye tracker integration from low-level optical configurations; the PIs expect to achieve by this means a more compact, comfortable, easy-to-use, and dependable system than would result from integration of off-the-shelf commercially available displays and eye trackers. The PIs will set up a comprehensive methodology to calibrate and quantitatively assess the testbed, and to quantify rendered and perceived depth\/size representations of virtual objects with and without eye tracking capability in the HMD; the PIs expect thereby to determine whether integration can significantly improve the performance of both eye tracking accuracy and display quality as it relates to accuracy and precision of registration of real and virtual objects in augmented environments. Finally, two pilot studies will be pursued. The first of these will explore the concept of a unique fovea-contingent display scheme which utilizes photonics technology to position a high resolution inset at the gaze point, innovatively with no moving parts, in order to address the trade-off between field of view and resolution existing in conventional HMDs. The second pilot study will investigate a \"pointing by looking\" visual interface in remote collaborative environments in which the focus of attention of a participant follows the point-of-regard of a remote collaborator, or vice versa.<br\/><br\/>Broader Impacts: This research will not only advance display quality and the user interface, but most importantly it will drive new and thrilling applications of augmented reality technology. In particular, the new HDM-eye tracker technology will lead to novel interactive interfaces for information retrieval, will provide more accurate eye-movement monitoring for human factors and vision research, will support improved assessment of behavior in virtual environments, and will afford new methods of interaction and communication for people with certain types of disabilities. The mixture of basic optical science and engineering, computer graphics, human factors, and hands-on experience with building a testbed will be an excellent interdisciplinary training ground for the graduate and undergraduate students involved.","title":"IIS\/HCI: Collaborative Research: Development and Assessment of Head-Mounted Fovea-Contingent Display Technology","awardID":"0411578","effectiveDate":"2003-12-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["485281"],"PO":["565227"]},"90272":{"abstract":"CAREER: Capacity and Ubiquity in Multitier Wireless Networks<br\/>Abstract<br\/>To meet diverse communication requirements of users, wireless systems must<br\/>simultaneously support wide-area access (ubiquity) and local area performance<br\/>(capacity). Multitiered wireless networks represent a natural design option that fulfills<br\/>these joint goals. These networks contain radios designed with coverage areas that vary<br\/>in their order of magnitude. Higher-tier radios, which have larger coverage, extend the<br\/>network's reach while lower-tier radios target location-specific performance. This<br\/>research studies the capacity and ubiquity supported by various multitier networks. As a<br\/>demonstration of the benefits offered by such systems, topographic and demographic data<br\/>for Susquehanna County, a rural and technology-poor county in Northern Pennsylvania,<br\/>will be used to implement derived results and to devise a multitier network for that<br\/>region. This design will take into consideration the extremely hilly propagation<br\/>characteristics of the area; location of population centers; and communication<br\/>requirements at these locations in order to better serve the needs of the county (e.g.,<br\/>provide satisfactory cellular coverage, deliver broadband access, promote distance<br\/>learning initiatives, etc.).<br\/>Overall, this research aims to develop a general and unified framework for spectrally<br\/>efficient multitier systems. Specifically, it examines the case of full spectral reuse across<br\/>tiers for various centralized and decentralized multitier configurations. In centralized<br\/>networks, users communicate exclusively to access points, which control admission and<br\/>route information. In non-centralized systems, such responsibilities are distributed over<br\/>access points and users, and ad-hoc connections are possible. The key challenge lies in<br\/>overcoming cross-tier interference produced by high spectral reuse. This research<br\/>develops analytical methods that 1) model this interference; and 2) use signal processing,<br\/>radio resource allocation, and access control techniques to jointly suppress it and deliver<br\/>desired ubiquity and capacity.<br\/>COVER SHEET FOR PROPOSAL TO THE NATIONAL SCIENCE FOUNDATION<br\/>FOR NSF USE ONLY<br\/>NSF PROPOSAL NUMBER<br\/>DATE RECEIVED NUMBER OF COPIES DIVISION ASSIGNED FUND CODE DUNS# (Data Universal Numbering System) FILE LOCATION<br\/>FOR CONSIDERATION BY NSF ORGANIZATION UNIT(S) (Indicate the most specific unit known, i.e. program, division, etc.)<br\/>PROGRAM ANNOUNCEMENT\/SOLICITATION NO.\/CLOSING DATE\/if not in response to a program announcement\/solicitation enter NSF 03-041<br\/>EMPLOYER IDENTIFICATION NUMBER (EIN) OR<br\/>TAXPAYER IDENTIFICATION NUMBER (TIN)<br\/>SHOW PREVIOUS AWARD NO. IF THIS IS<br\/>A RENEWAL<br\/>AN ACCOMPLISHMENT-BASED RENEWAL<br\/>IS THIS PROPOSAL BEING SUBMITTED TO ANOTHER FEDERAL<br\/>AGENCY? YES NO IF YES, LIST ACRONYM(S)<br\/>NAME OF ORGANIZATION TO WHICH AWARD SHOULD BE MADE ADDRESS OF AWARDEE ORGANIZATION, INCLUDING 9 DIGIT ZIP CODE<br\/>AWARDEE ORGANIZATION CODE (IF KNOWN)<br\/>IS AWARDEE ORGANIZATION (Check All That Apply) SMALL BUSINESS MINORITY BUSINESS IF THIS IS A PRELIMINARY PROPOSAL<br\/>(See GPG II.C For Definitions) FOR-PROFIT ORGANIZATION WOMAN-OWNED BUSINESS THEN CHECK HERE<br\/>NAME OF PERFORMING ORGANIZATION, IF DIFFERENT FROM ABOVE ADDRESS OF PERFORMING ORGANIZATION, IF DIFFERENT, INCLUDING 9 DIGIT ZIP CODE<br\/>PERFORMING ORGANIZATION CODE (IF KNOWN)<br\/>TITLE OF PROPOSED PROJECT<br\/>REQUESTED AMOUNT<br\/>$<br\/>PROPOSED DURATION (1-60 MONTHS)<br\/>months<br\/>REQUESTED STARTING DATE SHOW RELATED PRELIMINARY PROPOSAL NO.<br\/>IF APPLICABLE<br\/>CHECK APPROPRIATE BOX(ES) IF THIS PROPOSAL INCLUDES ANY OF THE ITEMS LISTED BELOW<br\/>BEGINNING INVESTIGATOR (GPG I.A)<br\/>DISCLOSURE OF LOBBYING ACTIVITIES (GPG II.C)<br\/>PROPRIETARY & PRIVILEGED INFORMATION (GPG I.B, II.C.1.d)<br\/>HISTORIC PLACES (GPG II.C.2.j)<br\/>SMALL GRANT FOR EXPLOR. RESEARCH (SGER) (GPG II.D.1)<br\/>VERTEBRATE ANIMALS (GPG II.D.5) IACUC App. Date<br\/>HUMAN SUBJECTS (GPG II.D.6)<br\/>Exemption Subsection or IRB App. Date<br\/>INTERNATIONAL COOPERATIVE ACTIVITIES: COUNTRY\/COUNTRIES INVOLVED<br\/>(GPG II.C.2.j)<br\/>HIGH RESOLUTION GRAPHICS\/OTHER GRAPHICS WHERE EXACT COLOR<br\/>REPRESENTATION IS REQUIRED FOR PROPER INTERPRETATION (GPG I.E.1)<br\/>PI\/PD DEPARTMENT PI\/PD POSTAL ADDRESS<br\/>PI\/PD FAX NUMBER<br\/>NAMES (TYPED) High Degree Yr of Degree Telephone Number Electronic Mail Address<br\/>PI\/PD NAME<br\/>CO-PI\/PD<br\/>CO-PI\/PD<br\/>CO-PI\/PD<br\/>CO-PI\/PD<br\/>Page 1 of 2<br\/>0346945 CCR - COMMUNICATIONS RESEARCH<br\/>NSF 02-111 07\/22\/03<br\/>240795445<br\/>Lehigh University<br\/>0032896000<br\/>Lehigh University<br\/>Alumni Building 27<br\/>Bethlehem, PA. 180153005<br\/>CAREER:Capacity and Ubiquity in Multitier Wireless Networks<br\/>578,373 60 01\/04\/01<br\/>Electrical Engineering<br\/>610-758-6279<br\/>Bethlehem, PA 180153005<br\/>United States<br\/>Shalinee Kishore PhD 2003 ","title":"CAREER: Capacity and Ubiquity in Multitier Wireless Networks","awardID":"0346945","effectiveDate":"2003-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["342763"],"PO":["432103"]},"86653":{"abstract":"The now well-known vision and challenge in post-genomics biology is to make the entire process of research<br\/>scalable to large networks using high-throughput techniques and large-scale computation. Computational biology and bioinformatics have focused attention on the need for sophisticated methods for handling large databases and tools for modeling and simulating complex networks. Not as widely recognized is that the scalability of the more subtle processes of drawing meaningful and reliable scientific, medical, and biological inferences from the wealth of data and computation is equally important and requires the development of fundamentally new theory and software.<br\/>The research objective of this project is to develop the theoretical foundation and information technology in-frastructure necessary to accelerate progress in systems biology, with concrete demonstrations on a variety of bi-ological experiments. This ambitious goal requires augmenting bioinformatics and current modeling and simula-tion approaches with greater understanding of the organizational principles underlying network complexity, including connections with molecular details, and exploiting this understanding to advance mainstream experimental biology.<br\/>Building on recent breakthroughs in theory and scalable algorithms for systematic robustness analysis and model (in)validation of nonlinear network models with uncertain rate constants, the project maps out a research path that will (1) develop the necessary rigorous and practical mathematical theory; (2) embody it in a software environment that supports the complex iterative processes involved in going from raw data to modeling, analysis, and inference, with tight feedback to experimentation and modeling throughout; and (3) apply the theory and software to specific experimental studies in biology as a way of grounding the entire endeavor.<br\/>The intellectual merit combines immediate practical impact and conceptual depth. Automating and computation-ally augmenting scientific and mathematical inference from noisy and incomplete data for uncertain models has long been an elusive goal. Achieving it in the context of complex biological systems is for the first time both a necessity and an achievable goal. To do this, data and modeling assertions and questions must be described in a common framework that is biologically natural, yet can be stored, manipulated, shared, and ultimately turned over to powerful algorithms for resolution. Our objective is to create tools which make it possible to systematically answer questions such as: Is a proposed model consistent with experimental data? If so, is it robust to additional perturbations that are plausible but untested? Are different models at multiple scales of resolution consistent? What is the most promising experiment to refute or confirm a model? Traditionally, such network-level questions that arise naturally in biology have been<br\/>considered computationally intractable, since they are typically stochastic, nonlinear, nonequilibrium, ncertain, in-volve multiple scales, and hybrid (mixing continuous and discrete mathematics), limiting approaches to heuristic and brute-force methods, or to extreme simplification. Recently this situation changed profoundly, based on new methods developed by the research team and their collaborators. A crucial insight is that evolution favors high robustness to uncertain environments and components, yet allows severe fragility to novel perturbations, and this robust yet fragile feature must be exploited explicitly in scalable algorithmic approaches.<br\/>The broader impact lies in the synergistic links this work forges with similar challenges that exist throughout science and technology, such as the Internet, aerospace systems design, materials science, multiscale physics, stochas-tic multiscale chemistry, and disturbance ecology. The theoretical foundations build broadly on robust control theory, dynamical systems, numerical analysis, operator theory, real algebraic geometry, computational complexity theory, duality and optimization, and semi-definite programming. The results will be made accessible to the broadest possible audience, both with representative and challenging experimental biology and the connections with other examples of complex systems. The preliminary progress already made by this team is striking and has been applied to under-standing,<br\/>for example, the robustness of complex control systems, the performance of internet protocols, and bacterial<br\/>chemotaxis and stress response. The work is creating new mathematics and algorithms, beginning to appear in the highest-impact journals, and concretely demonstrating that this research can help experimental biologists.<br\/>Diversity and breadth appear at every level. In the research group of the lead PI (Doyle), 6 of 11 graduate<br\/>students and 2 of 4 postdoctoral scholars are women, and include a broad racial and ethnic diversity. The o","title":"ITR COLLAB: Theory and Software Infrastructure for a Scalable Systems Biology","awardID":"0326566","effectiveDate":"2003-12-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["539224"],"PO":["565223"]},"86664":{"abstract":"\"Regulography\"- Quantitative Reconstruction of Transcriptional Regulatory Networks<br\/>James C. Liao, Vwani Roychowdhury, Chiara Sabatti, David Eisenberg, Fuyuhiko Tamanoi, University of California, Los Angeles<br\/><br\/>Goal and Tasks: The goal of this project is to reconstruct the hidden structure and dynamics of transcriptional regulatory networks based on massive gene expression data (generated from DNA microarray) and regulatory models under the constraints of various ancillary information, such as protein interactions with DNA, other proteins, and RNA. The ultimate outcome of the project will be an integrated framework (incorporating both methodology and the required databases) for deducing transcriptional network structure and dynamic, which can be applied to define the signal transduction pathways perturbed by unknown drug effects, toxic compound challenges, and mutations. We are using Saccharomyces cerevisiae as the model eukaryote for verification of our paradigm. Toward this end, we are pursuing the following specific tasks: (1) Develop an analytical and IT-based framework for quantitative and dynamic reconstructions of various pre-translational regulatory networks. This includes transcriptional regulation (as governed by protein-DNA and protein-protein interactions), and processing, transport, and stability regulation of mRNA (as governed by various protein-mRNA interactions). This work builds on a novel system-reconstruction methodology called Network Component Analysis. (2) Acquire and organize data for protein-DNA, protein-protein interaction, protein-RNA interactions, mRNA stability, and gene-expression noise. (3) Experimental verification of the paradigm of the framework developed in (1) and (2). (4) Disseminate the results through a composite \"regulographic\" database.<br\/>Team Organization: The PIs of this project come from five different fields: Dr. Liao is a chemical\/biochemical engineer specialized in metabolic engineering and DNA microarray analysis, Dr. Roychowdrury is an electrical engineer\/computer scientist specialized in networks and systems theories, Dr. Tamamoi is a microbiologist specialized in yeast genetics, Dr. Eisenberg is a renowned biochemist\/crystallographer specialized in protein structure, function, and protein-protein interactions, and Dr.Sabatti is a statistician specialized in genetic and microarray analyses.<br\/>Broader Impact: In addition to the fundamental scientific discoveries proposed here, we are pursuing the following information technology related activities: (1) As part of the interdisciplinary bioinformatics program at UCLA, we plan to develop a two-part course on intracellular regulatory networks (targeted toward upper-level undergraduate students and beginning graduate students in both engineering and biological fields) . (2) We will leverage the organizational infrastructure of a number of interdisciplinary research institutes on UCLA campus (including, the NSF Institute for Pure and Applied Mathematics, the California Nano-Science Institute, and the Institute for Cell Mimetic Space Exploration) to attract both undergraduate and graduate minority students. (3) We will integrate our experimental and analytical results into a dynamic database, and make it available to the larger community, which we believe will spur and aid research efforts on intracellular process modeling at a much larger scale, involving academic and commercial institutions nation wide.","title":"ITR:\"Regulography\"- Quantitative Reconstruction of Transcriptional Regulatory Networks","awardID":"0326605","effectiveDate":"2003-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":[226731,"434505","558793","455118",226735],"PO":["474792"]},"87116":{"abstract":"Every day news media report misunderstandings, intolerance or outright aggression between people from different cultures. Age-old disputes over land, water, religious and cultural practices fuel intolerance. Children absorb the ambiance, culture and attitudes of their community. Consequently, cycles of intolerance pass from generation to generation. But there is some hope for change: research has shown that sharing personal experiences can change attitudes. When it comes to developing tolerance, early intervention is best. The multicultural education literature highlights the effectiveness of children interacting with children from other cultural groups, as well as reading children's literature from other cultures. The aim of this project is to develop technology and social structures needed for children who speak different languages to learn with and from each other in a digital community setting centered on children's books. The PIs will address two closely linked technical challenges. The first is the design of child-friendly user interfaces to support online interaction and communication between children; this will be addressed via cooperative inquiry, in which design teams (including researchers and child participants) gather field data, initiate ideas, and test and develop new prototypes. The second is the problem of translation; this will be addressed by involving the communicating children themselves as collaborative participants in an innovative approach to developing language technology resources that support cross-language communication without full-scale machine translation. A combination of methods will be used to evaluate the proposed research. Data to be gathered in classrooms will include understanding changes in how children from different cultures use new technologies to communicate, interpret stories, develop collaborative narratives, and see other cultures. This research will leverage the ongoing NSF ITR-funded International Children's Digital Library (ICDL), with which the PIs are involved, in order to provide access to books that create common ground for children's \"ICDL communities.\" This project will add value to ICDL by contributing technologies that give children who speak different languages an opportunity to interact. The intellectual merit of this research includes: new interfaces that enable children who speak different languages to communicate safely with each other in ways that are comfortable for them; advances in translation technology; and evaluation of the impact of children's experiences in ICDL communities. <br\/><br\/>Broader Impacts: The broad impacts deriving from this research include two significant contributions: a model online community using technology to advance the cause of tolerance and understanding; and a technology test-bed that will be made available to the scientific community in order to lower the barriers to entry for further development of cross-cultural online communities for children and adults.","title":"Technology for Cross-Cultural Communication in a Children's International Book Community","awardID":"0328823","effectiveDate":"2003-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["518152","527291","514912"],"PO":["565227"]},"87138":{"abstract":"The objective of this research is to develop a self-adapting vision system inspired by biological systems. The proposed system will construct models of its environment and will employ feedback processes in a hierarchical framework based on natural systems. The project will investigate a new class of symmetry phenomena involving approximate or qualitative symmetry; qualitative symmetry is beyond the scope of most cognitive models of perception and humans often classify nearly symmetric figures as not symmetric. The model offers the potential of explaining a number of unintuitive and surprising aspects of human performance on the task. The work proposed is aimed at fleshing out and testing these explanations, and secondarily at developing a robust modeling tool for this task.<br\/><br\/>The proposed research is meritorious intellectually since it addresses the problem of qualitative symmetry detection, an aspect of qualitative spatial reasoning, a topic that is a very important in artificial intelligence. This work has a broad impact on many areas important to computer science and engineering including computer-aided design, interpretation of diagrams and the creation of diagramatic representations. This work will also have a broad impact on understanding human qualitative reasoning in general.","title":"Cognitive Simulation of Qualitative Symmetry Detection","awardID":"0329026","effectiveDate":"2003-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["261083"],"PO":["491702"]},"82013":{"abstract":"ABSTRACT <br\/>0306385<br\/>Farin, Gerald <br\/>Arizona State University<br\/><br\/>Splines are used to describe geometric objects by breaking down into individual parts such that the overall smoothness of thes pieces is guaranteed. Splines are widely used in the automotive, aerospace, and other engineering disciplines. They work very well when the geometry has a rectilinear struture (such as the roof of a car), but need considerable effort when this is not the case. For that reason, splines are not much used in biological or medical applications, where shapes tend to be highly irregular. This research introduces a new class of splines having all the smoothness properties of standard ones but also being able to cope with complex and unstructured shapes. <br\/>This research explores a new class splines, those that are defined over an unstructured set of 2D points - i.e., no regular structure is assumed. The most fundamental algorithm in the theory of B-spline curves is the recursive de Boor algorithm. This algorithm is generalized to a recursive algorithm involving the construction of a hierarchy of Voronoi diagrams in the plane. The resulting surfaces are of arbitrary degree and are piecewise smooth. They are capable of reproducing polynomials of any order. Since the de Boor Algorithm is fundamental to all spline theory, a proper reformulation for unstructured point sets is a significant breakthrough and constitutes the main intellectual merit of this research. The existence of splines defined over unstructured point sets opens up the possibility of handling complex shapes. This is particularly important for organic shapes, which tend to be highly irregular. Thus the broader impact of this research is the possibility to successfully describe non-engineering shapes using techniques similar to standard splines.","title":"Splines Over Iterated Voronoi Diagrams","awardID":"0306385","effectiveDate":"2003-12-15","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["279394"],"PO":["321058"]},"81760":{"abstract":"ABSTRACT<br\/><br\/>Real-time rendering with complex illumination, realistic materials, and an<br\/>accurate simulation of light scattering, with the ability to manipulate<br\/>parameters interactively, is the challenge addressed in this project.<br\/>Fundamental questions about the representation of appearance are explored,<br\/>resulting in the development of a new class of real-time algorithms.<br\/>Specifically, the focus is on three main directions: (i) Mathematical and<br\/>Empirical Analysis of the complexity of appearance representations and<br\/>light transport; (ii) Computational Techniques such as fine-to coarse and<br\/>coarse-to-fine algorithms, function dictionaries, and hierarchical<br\/>principal component analysis; and (iii) Algorithms and Systems supporting<br\/>interactive manipulation of illumination, materials, and viewpoint.<br\/><br\/>Computer graphics and scientific visualization is increasingly used in<br\/>areas such as simulation and training, automobile design, architectural<br\/>renderings, defense, electronic commerce, and entertainment. With today's<br\/>technology, it is possible to create strikingly realistic images using<br\/>sophisticated, but also slow rendering algorithms. These algorithms<br\/>cannot address the growing need for effective methods to manipulate and<br\/>interact with 3D environments. Modern PCs can render scenes with<br\/>millions of polygons at interactive rates, but this performance comes<br\/>at the cost of a considerable loss in quality and realism. This project<br\/>seeks to overcome these limitations: producing highly realistic images<br\/>at interactive rates.<br\/><br\/><br\/>Over the last thirty years computer graphics research has created technology that improves both the realism and generation speed of computer-generated images. However, there is no widely used method for creating realistic images, and it remains difficult in practice to create realistic images. This project aims to develop a practical method for realistic image creation that addresses the visual effects believed to be salient by the graphics and perception communities. The method is intended to be robust, relatively simple, and to have the potential to be interactive in the next decade.<br\/><br\/>The ability to rapidly generate realistic images is useful in many applications. For example, flight and driving simulators rely on realistic imagery, but the interactive nature of these systems limits the realism that is feasible. The proposed work should extend these limits. The proposed method would also be useful for generating images for planning and education; images could be created to help visualize the results of reconstruction efforts, habitat change, and urban planning. Finally the method should be useful for generating synthetic images for input to automated vehicles, where many different scenes and atmospheric conditions could be generated rapidly and at low expense.","title":"Collaborative Research in Computer Graphics: Real-Time Visualization and Rendering of Complex Scenes","awardID":"0305399","effectiveDate":"2003-12-15","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["332004"],"PO":["532791"]},"95841":{"abstract":"This is the first year funding of a three-year continuing award. A demanding application area of virtual or augmented environment is multi-user collaborative environment where multiple users at either a local site or remote sites communicate with each other and interact with a synthetic or virtual scene. Among the necessary sensors and devices, an effective visualization device and a real-time image acquisition system are two main challenges. The objective of this project is to develop a novel visualization device referred to as head-mounted projective display (HMPD), build a multi-user interactive workbench by integrating the developed HMPD technology with a unique real-time image acquisition system known as an omni-focus camera, and evaluate and quantify the system as an effective tool for remote collaboration. The head-mounted projective display (HMPD) proposed is coupled with a supple, non-distorting and durable projection surface as an alternative to current visualization devices. Its novel concept suggests solutions to part of the problems of state-of-art visualization devices, such as large distortion with wide field of view, occlusion contradiction between virtual and real objects, and brightness conflict with background illumination. Several properties of the proposed HMPD make it extremely suitable for multiple-user collaborative applications. Research efforts will be made to design and implement a lightweight and compact head-mounted prototype by introducing diffractive optical element (DOE) and plastic materials, and investigate approaches to optimize the illumination of the display and retro-reflective material properties for imaging purpose. At one site, a multi-user interactive bench prototype with tele-presence capability will be built by using the HMPD concept and adding an image acquisition system developed from a unique omni-focus camera system. At the other site, a mural display system will be built with conventional stereoscopic video system located near the mural display, where one or several collaborators will also gather. Tele-collaborative work will be tested between the Beckman Institute at the University of Illinois--Urbana Champaign and the School of Optics-CREOL at the University of Central Florida through the Internet II connection linking our laboratories. Finally, the PIs will quantify the depth and size representation and perception accuracy, evaluate occlusion perception aspects, and set up a comprehensive calibration procedure for the HMPD and the workbench and mural prototypes. The results are expected to impact a wide range of applications such as collaboration\/tele-collaboration, tele-presence, tele-manipulation, and visualized education\/tele-education.","title":"ITR: Collaborative Research: Development of Head-mounted Projective Display for Distance Collaborative Environments","awardID":"0417598","effectiveDate":"2003-12-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["485281"],"PO":["565227"]},"83796":{"abstract":"A grant has been awarded to Drs. Nancy Moran and Katrina Mangin of the University of Arizona, and Dr. Anthony Ives of the University of Wisconsin to address the role of symbiotic infections in determining tolerance of insects to heat stress, both at the molecular and ecological levels. The complete genome sequence of a facultative bacterial endosymbiont of aphids will be determined. Approaches exploiting this and other genomic data will be used, including measures of expression of heat stress genes of both hosts and symbionts under different thermal environments. These studies will reveal how heat sensitivity is affected by symbiont distributions among hosts as well as by genetic variation in stress responses. In addition, the ecological consequences of variation in thermal tolerances will be examined under field environments; these experiments will reveal how heat tolerance interacts with additional biological factors, such as predators and parasites, to determine population density and persistence. <br\/><br\/>Chronic infection is a normal part of the life cycle for most animals, including humans and insects, but it is not known how such infection affects tolerance to changing environmental conditions. At the same time, the forces that maintain symbiotic associations are dependent on the joint effects of genetic and environmental factors, but no studies have addressed these together. In this project, researchers with expertise in both ecology and molecular biology will apply methodologies from both fields to obtain answers to these issues. By illuminating the molecular and ecological mechanisms through which heat affects animal populations, the findings will demonstrate how geographic ranges and abundances of individual species are impacted by changes in climate over time. Results will be particularly relevant to insects that are agricultural pests and vectors of disease, a large proportion of which have symbiotic associations similar to those of aphids. In addition, a substantial educational program will introduce Arizona secondary school teachers to the use of state-of-the-art molecular tools for analyzing how organisms interact with environmental stress.","title":"Biocomplexity in the Environment\/GEN-EN: Response of Host and Symbiont Genomes to Environmental Stress and its Ecological Consequences","awardID":"0313737","effectiveDate":"2003-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7304","name":"ERE General"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1693","name":"ENVIRONMENTAL GENOMICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}}],"PIcoPI":["565122","527958","452513"],"PO":["561897"]},"86657":{"abstract":"The now well-known vision and challenge in post-genomics biology is to make the entire process of research<br\/>scalable to large networks using high-throughput techniques and large-scale computation. Computational biology and bioinformatics have focused attention on the need for sophisticated methods for handling large databases and tools for modeling and simulating complex networks. Not as widely recognized is that the scalability of the more subtle processes of drawing meaningful and reliable scientific, medical, and biological inferences from the wealth of data and computation is equally important and requires the development of fundamentally new theory and software.<br\/>The research objective of this project is to develop the theoretical foundation and information technology in-frastructure necessary to accelerate progress in systems biology, with concrete demonstrations on a variety of bi-ological experiments. This ambitious goal requires augmenting bioinformatics and current modeling and simula-tion approaches with greater understanding of the organizational principles underlying network complexity, including connections with molecular details, and exploiting this understanding to advance mainstream experimental biology.<br\/>Building on recent breakthroughs in theory and scalable algorithms for systematic robustness analysis and model (in)validation of nonlinear network models with uncertain rate constants, the project maps out a research path that will (1) develop the necessary rigorous and practical mathematical theory; (2) embody it in a software environment that supports the complex iterative processes involved in going from raw data to modeling, analysis, and inference, with tight feedback to experimentation and modeling throughout; and (3) apply the theory and software to specific experimental studies in biology as a way of grounding the entire endeavor.<br\/>The intellectual merit combines immediate practical impact and conceptual depth. Automating and computation-ally augmenting scientific and mathematical inference from noisy and incomplete data for uncertain models has long been an elusive goal. Achieving it in the context of complex biological systems is for the first time both a necessity and an achievable goal. To do this, data and modeling assertions and questions must be described in a common framework that is biologically natural, yet can be stored, manipulated, shared, and ultimately turned over to powerful algorithms for resolution. Our objective is to create tools which make it possible to systematically answer questions such as: Is a proposed model consistent with experimental data? If so, is it robust to additional perturbations that are plausible but untested? Are different models at multiple scales of resolution consistent? What is the most promising experiment to refute or confirm a model? Traditionally, such network-level questions that arise naturally in biology have been<br\/>considered computationally intractable, since they are typically stochastic, nonlinear, nonequilibrium, ncertain, in-volve multiple scales, and hybrid (mixing continuous and discrete mathematics), limiting approaches to heuristic and brute-force methods, or to extreme simplification. Recently this situation changed profoundly, based on new methods developed by the research team and their collaborators. A crucial insight is that evolution favors high robustness to uncertain environments and components, yet allows severe fragility to novel perturbations, and this robust yet fragile feature must be exploited explicitly in scalable algorithmic approaches.<br\/>The broader impact lies in the synergistic links this work forges with similar challenges that exist throughout science and technology, such as the Internet, aerospace systems design, materials science, multiscale physics, stochas-tic multiscale chemistry, and disturbance ecology. The theoretical foundations build broadly on robust control theory, dynamical systems, numerical analysis, operator theory, real algebraic geometry, computational complexity theory, duality and optimization, and semi-definite programming. The results will be made accessible to the broadest possible audience, both with representative and challenging experimental biology and the connections with other examples of complex systems. The preliminary progress already made by this team is striking and has been applied to under-standing,<br\/>for example, the robustness of complex control systems, the performance of internet protocols, and bacterial<br\/>chemotaxis and stress response. The work is creating new mathematics and algorithms, beginning to appear in the highest-impact journals, and concretely demonstrating that this research can help experimental biologists.<br\/>Diversity and breadth appear at every level. In the research group of the lead PI (Doyle), 6 of 11 graduate<br\/>students and 2 of 4 postdoctoral scholars are women, and include a broad racial and ethnic diversity. The o","title":"ITR COLLAB: Theory and Software Infrastructure for a Scalable Systems Biology","awardID":"0326576","effectiveDate":"2003-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["304181","442255","524314"],"PO":["565223"]},"90334":{"abstract":"0347289<br\/>CAREER: Type-Directed Programming in Object-Oriented Languages<br\/>Stephanie Weirich<br\/>University of Pittsburgh<br\/><br\/>Type-directed programming is an important paradigm in the design of software. By using this form of programming to analyze the structure of data, many operations, such as serialization, equality and iterators may be defined once, for all types of data. As software evolves, these operations need not be updated---they will automatically adapt to new data forms. Although object-oriented languages are widely used in the implementation of modern software systems, they have only primitive support for type-directed programming. Therefore, this project proposes to adapt and extend the mechanisms for type-directed programming to those languages. <br\/><br\/>The specific goals of the project are threefold. The first goal is to extend the existing theory of type-directed programming to object-oriented programming languages. The second is to validate and refine that theory by developing an implementation of an object-oriented language that supports type-directed programming. Finally, the third goal is to use this implementation to investigate new patterns of type-directed programming to inspire new developments in language support for these patterns. Experiments with type-directed programming will be included to better understand its role in programming in the context of object-oriented languages.","title":"CAREER: Type-Directed Programming in Object-Oriented Languages","awardID":"0347289","effectiveDate":"2003-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550615"],"PO":["564388"]},"90477":{"abstract":"The purpose of this research is to develop several unexplored areas in<br\/>data compression, as well as to utilize universal data compression<br\/>techniques in other applications including biological modelling and a<br\/>novel direction of joint source-channel coding. The research focuses on<br\/>four topics: (a) design of joint source-channel universal source code<br\/>based codes, (b) study of universal compression for large and unknown<br\/>source alphabets, (c) design of advanced universal coding techniques for<br\/>non-traditional, yet more realistic, data models with practical<br\/>implementations, and (d) the study of random access lossless compression.<br\/><br\/>Common techniques in joint source-channel coding suffer from<br\/>severe synchronization problems in bad channel conditions and do<br\/>not address universality issues when the source statistics are<br\/>unknown. This research develops techniques to combat these<br\/>problems, and even attain \"free\" gain in channel decoding<br\/>performance for redundant channel information streams. Common<br\/>compression schemes assume that the data is from a known alphabet,<br\/>it has a \"standard\" stationary or constantly changing<br\/>statistical model, and it consists of a long sequence. However,<br\/>(a) there exist compression applications with large unknown<br\/>alphabets, such as text compression where the words constitute the<br\/>alphabet, (b) most real data sequences are usually neither stationary<br\/>nor of constantly varying statistics, and (c) random access is<br\/>necessary in large compressed data bases. The investigator studies<br\/>these three non-traditional problems. The research work combines<br\/>the development of rigorous theoretical results including<br\/>redundancy and description length bounds, with empirical testing,<br\/>algorithm design with focus on practical low-complexity<br\/>techniques, and implementation of proposed techniques. Finally,<br\/>the research also investigates the use of universal compression<br\/>techniques to segmentation and modelling of biological sequences.","title":"CAREER:Advances in Universal Data Compression with Applications to Joint Source and Channel Coding","awardID":"0347969","effectiveDate":"2003-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[237220],"PO":["564924"]},"92556":{"abstract":"ABSTRACT<br\/>0401569<br\/>James Hook<br\/>Oregon Health & Science U<br\/><br\/>The Symposium on Software, Science & Society is one of three events honoring the distinguished career of Professor Richard B. Kieburtz. The symposium consists of a full days worth of activities directed towards creating a consensus on the role of software in society. The highlight of the symposium is a series of internationally respected researchers addressing this topic. The symposium will capitalize on the gathering of the speakers in one place, at one time, speaking at an open symposium, to facilitate the reaching of a consensus about challenges for the software research community in the next decade. The symposium program includes directed focused discussion on particular topics, and a final wrap up discussion.","title":"Symposium on Software, Science & Society","awardID":"0401569","effectiveDate":"2003-12-15","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["341680"],"PO":["564388"]},"93656":{"abstract":"","title":"Interagency Agreement to Support ESCHER","awardID":"0406782","effectiveDate":"2003-12-15","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":[245481],"PO":["561889"]}}