{"156453":{"abstract":"What does the desktop metaphor mean for communities that do not use or value desks? How does the QWERTY keyboard perform in communities whose language has no \"Q\", \"W\", \"E\", \"R\", \"T\", nor \"Y\"? What is the point of a personal computer in a context where technologies are not held for a person but are shared by a whole community? Computer applications and PC appliances have traditionally been designed by and for Western high-income populations. But today the Internet and internet-enabled computers have become a truly global phenomenon, reaching out to many of the most remote and marginalized communities. This workshop will be held on Saturday and Sunday, April 4-5, as an official part of the ACM 2009 Conference on Human Factors in Computing Systems (CHI 2009) in Boston. The workshop will explore interaction design in the context of international development, and in particular will address interaction design for parts of the world that are often marginalized by current systems and applications designers. The PI believes that to extend the boundaries of existing practice in designing information and communication technologies, design should be with, for, and of the marginalized communities he plans to set centre stage in the workshop discussions. The workshop will provide a forum to exchange experiences, to explore differences between developed and developing world contexts, to develop new partnerships, and to learn from each other's experiences. NSF funding will enable approximately ten international delegates to attend from low-income countries, from which participation would otherwise be impossible; without the active involvement of these participants, the outcomes of the workshop would be far less useful and effective.<br\/><br\/>The annual CHI conference, sponsored by the Association for Computing Machinery's Special Interest Group on Computer-Human Interaction (ACM SIGCHI), is a leading international forum for the presentation and discussion of human-computer interaction (HCI) research and practice. The conference is attended by over 2,000 professionals from around the world. Research papers presented at the conference are heavily-refereed and widely cited; they constitute some of the most scientifically respected research publications in the field of HCI.<br\/><br\/>Broader Impacts: A review of the HCI literature exposes the broad intellectual gap that exists between problems of computer interaction and studies of the development impact of computer technologies in low-income countries. The PI expects that this workshop, building on the outcomes of two previous meetings at CHI 2007 (funded in part by NSF) and CHI 2008 (which led to establishment of a website http:\/\/hci4d.org that provides a platform for exchange of information, ideas, and experiences in this domain), will be instrumental in developing additional intellectual momentum around these topic areas. Position papers generated as part of the workshop and summary articles will be published in a special issue of the journal Information Technology and International Development, as well as in ACM Interactions, Interfaces magazine, and Usability News. The PI is also working on a story-based template, which will provide an online repository for reporting findings and observations that can be easily searched and shared.","title":"Workshop at the ACM CHI 2009 Conference: Human-centered Computing in International Development","awardID":"0925660","effectiveDate":"2009-04-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["531482"],"PO":["565227"]},"158103":{"abstract":"PROJECT SUMMARY<br\/><br\/><br\/>The Sixteenth Annual East Coast Computer Algebra Day (ECCAD?2009) will be held at the University of Rhode Island in Kingston on Saturday, May 2, 2009. The purpose of the meeting is to stimulate interest and enhance understanding of the technical and applied aspects of computer algebra. The conference provides a forum for those interested in becoming more active in computer algebra to participate, interact, and meet with others in an inexpensive and easily accessible way. ECCAD is a one-day meeting that is more informal than other technical conferences in the field, with ample time for unstructured interaction. Participation by graduate students and junior faculty is particularly encouraged through special invitation to contribute to the poster session and software demonstrations, and through travel support.<br\/>The meeting will include presentations by four invited speakers who have made outstanding contributions in the field of computer algebra. These speakers will anchor the meeting and help attract participants. There will also be a special panel on Future Directions in Computer Algebra, along with the poster and demonstration session. The invited talks, panel, and poster session are expected to cover the entire range of computer algebra: algorithms, systems, and applications. The contributed posters and software demonstrations will enable researchers, especially junior faculty and graduate students, to publicize their recent findings and to make new contacts.<br\/>This year's ECCAD is only the second to be held in New England. With many colleges and universities in the area, it is hoped that the meeting will be able to draw a large number of attendees and to generate new interest in computer algebra.","title":"East Coast Computer Algebra Day 2009","awardID":"0934110","effectiveDate":"2009-04-15","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":[422091],"PO":["550329"]},"146399":{"abstract":"A perspective camera captures the spatial relationships of objects in a scene as they would appear from a single viewpoint. In contrast, a multi-perspective camera combines what is seen from several viewpoints into a single image and provides a potentially advantageous imaging system for understanding the structure of observed scenes. However, most existing computer vision and graphics algorithms are not directly applicable to multi-perspective cameras. The goal of this project is to develop a complete framework to characterize and design new multi-perspective cameras and displays and to use these systems for computer vision and graphics applications.<br\/><br\/>On the vision front, the PI explores two types of real multi-perspective cameras: the first extends existing catadioptric mirrors and the second uses specially-shaped apertures. To categorize these cameras, a ray geometry analysis is applied to identify important ray structures and study their implications on image distortions. The PI also investigates several new 3D reconstruction methods, such as epsilon stereo matching, ray-curvature analysis, and curvature-from-distortions, for a broad class of multi-perspective cameras. On the graphics front, the PI explores practical multi-perspective display architectures by combining a consumer projector with specially-shaped mirrors\/lenses. Such displays can offer an unprecedented level of flexibility in terms of aspect ratio, size, field of view, etc. The PI also investigates real-time multi-perspective rasterization and frustum culling algorithms by modifying the traditional rendering pipeline. <br\/><br\/>The project contributes to education by involving undergraduate and graduate students in self-contained projects with both theory and application components, and attracting under-represented students through the pre-engineering program between the University of Delaware and the Delaware State University.","title":"CAREER: Beyond Perspective Cameras: Multi-perspective Imaging, Reconstruction, Rendering, and Projection","awardID":"0845268","effectiveDate":"2009-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["550477"],"PO":["564316"]},"148115":{"abstract":"This award provides support to undergraduate students in science and engineering disciplines, in particular underrepresented women and minorities with cohort and high-quality research experiences in an interdisciplinary area of information technology and automotive engineering. The program is run in an eight-week long intensive summer research camp involving ten students per year. The program is cross-disciplinary, involving twelve participating faculty mentors from three departments: Electrical and Computer Engineering, Computer Science, and Biomechanical Engineering. The program seeks to improve students' skills in applying the scientific method to hands-on research and train each student in modern research techniques; lead students to greater independence in pursuing their research interests; and strive to increase the participation of women and underrepresented minorities who enter and complete graduate programs in science and engineering.<br\/><br\/>The students will be matched with suitable mentors to participate in a wide range of individual research projects in the fields of computer modeling and simulation in vehicle safety study, embedded systems and computer-based control in vehicles, vehicular networks, telematics applications, and reliable and secure mobile Internet services. The program integrates meaningful interdisciplinary research and active learning experience into undergraduate education to promote retention of students in science and engineering, and motivate them to continue to graduate schools. The program benefits society at large by contributing to developing an educated computing workforce capable of quickly putting new ideas to work in innovative ways that serve the needs of the populace and begin to take better advantage of flat world realities.","title":"REU Site in Telematics and Automotive Information Technology","awardID":"0851856","effectiveDate":"2009-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["425920","451038"],"PO":["523800"]},"151251":{"abstract":"The main purpose of the workshop on Computational Approaches to Linguistic Creativity (CALC-09) is to strengthen research in automatic detection, classification, understanding, and generation of neologisms, figurative language, indirect speech acts, poetry, fiction, and other phenomena illustrating linguistic creativity. The workshop also welcomes descriptions and discussions of computational tools that support people in using language creatively. These include computational and cognitive models, metrics and tools for evaluating the performance of creativity-aware systems, specific application scenarios, and the design and implementation of creativity-aware systems.<br\/><br\/>The CALC-09 workshop is held in conjunction with the NAACL - Human Language Technologies (NAACL-HLT 2009) conference in Boulder, Colorado. This award subsidizes travel and accommodation expenses for students actively participating in the workshop. These travel grants support geographic and other minorities by giving them an opportunity to exchange ideas, get into contact with key persons in the field, and gain invaluable feedback from the senior participants. The award also subsidizes travel and accommodation for an invited keynote speaker from the U.S.<br\/><br\/>The workshop brings together people working on different forms and modalities of linguistic creativity. It fosters collaboration between theoreticians and practitioners working in academic or industrial settings, across disciplines. Thereby, the workshop facilitates the integration of current punctual efforts on different aspects of linguistic creativity into more comprehensive approaches.","title":"Workshop on Computational Approaches to Linguistic Creativity - Element 7495","awardID":"0906244","effectiveDate":"2009-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550607"],"PO":["565215"]},"158610":{"abstract":"As the computing needs of business and consumers continue to grow, mega data centers with tens of thousands of machines are being built the size of shopping malls that consume tens of megawatts of power. These data centers support e-commerce, financial services, health care, telecommunications, and a variety of other services critical to the society. Power and thermal management of servers in these data centers and the clients using them has become a critical issue from many perspectives including utility costs, environmental impact, space usage, etc. Although there is a substantial amount of ongoing research into these issues in both academia and industry, many of the approaches tend to be ad hoc and empirical in nature. The purpose of the workshop is to examine power and thermal issues at a much more fundamental level and thereby bring a scientific approach to designing, configuring and managing hardware and software in a way that comprehends not only the power\/thermal issues but also the associated performance and reliability tradeoffs.<br\/><br\/><br\/><br\/>The broader impact of the workshop is expected to be in terms of guiding future research in this area that is important from technological, economic and sustainability perspective","title":"Science of Power Management","awardID":"0936386","effectiveDate":"2009-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["534213"],"PO":["535244"]},"155971":{"abstract":"Abstract:<br\/>The modern approach to understanding natural complex systems relies on new mathematical visions and ideas from computer sciences to infer and explain features of these systems. In exemplary nonlinear dynamical systems simple equations can lead to rapid increase in complexity, even strict rules can lead to chaotic behaviors, and properties that do not exist in its individual components emerge in the system. <br\/>The complexity theory substantiates the view that life will spontaneously develop within systems provided with a sufficiently complex chemistry. There is an enormous gap, however, between this conceptual advance and our actual experimental ability to demonstrate spontaneous emergence of even the most simple life?]like properties. The leading theme of the conference on ?gEmergence in Chemical Systems 2.0?h will be the search for chemistries that can lead to increasingly complex behaviors and emergent properties. <br\/><br\/>To computer scientists many aspects of complex systems come naturally, both by tradition and by training. For example, building on the continuing progress stemming all the way from Zuse and von Neumann, Chou and Reggia described a cellular automaton leading with close?]to?]certainty to self?]replicating structures regardless of a randomly chosen initial state. One of the goals of the conference is to facilitate chemical grounding of these concepts, which in turn will lead to experimental breakthroughs in designing new and understanding existing complex chemical and biochemical systems. <br\/><br\/>Sessions at the conferences are planned for bringing together scientists bridging computer science and chemistry in order to develop novel ideas for molecular computing and programming. The sessions will cover wide range of topics, from purely theoretical treatment of computing with chemical reaction networks in vitro and in vivo, through implemented examples from biocomputing and synthetic biology, to existing chemical systems in which implementation of local rules can lead to complex chemical synthesis and self?]assembly. The webpage of conference is: http:\/\/www.math.uaa.alaska.edu\/~afkjm\/chemicalemergence\/index.php funding will be used to cover travel costs for up to 10 promising junior scientist that are on the ?gpath to independence?h. While we will focus on the recruitment of graduate students and postdoctoral fellows, recommended undergraduate students and other non-faculty members will be considered as well. We will strive to fill 50% spots with underrepresented groups in science.","title":"Students Participation for Emergence in Chemical Systems 2.0 Conference","awardID":"0923691","effectiveDate":"2009-04-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["448447"],"PO":["565223"]},"152231":{"abstract":"Studies of large-scale information technology (IT) development projects that include multiple groups of stakeholders have found that such projects are prone to conflict escalation and eventual project failure if care is not taken to repair intergroup conflict as it erupts or even to avoid it entirely. This project aims to understand what triggers intergroup conflict, or, more precisely, what the researchers call ?faultlines,? among stakeholders engaged in cyberinfrastructure development projects and, more specifically, in GENI, a virtual laboratory currently being prototyped to explore future internets at scale. Early identification of potential faultlines and their mitigation or repair are central to achieving positive stakeholder interactions and project success.<br\/><br\/>The research will consist of an in-depth longitudinal study of the social networks emerging in the GENI development and prototyping community over the next three years, using a mix of quantitative and qualitative methods. Social Network Analysis (SNA) will be used to understand the communication patterns among stakeholders, primarily based on electronic communications, e.g., email and wiki postings. Qualitative Comparative Analysis (QCA) will be used to discern patterns in qualitative data, for example, from interviews, meeting minutes or project documents. The GENI social network will be studied at two levels, within development teams and across them ? at the larger GENI community level. <br\/><br\/>The management of large-scale IT development projects is challenging, in large part due to their sheer scale, scope and complexity. As a result, this research could have broad applicability. Understanding how conflict can be anticipated, avoided or mitigated has the potential to positively impact project stakeholders as well as the broader society, which is the ultimate beneficiary of the innovations that GENI may stimulate.","title":"Collaborative Research: IDENTIFYING FAULT LINES, CIRCUMVENTING FAULT LINE ERUPTIONS, AND MITIGATING THE EFFECTS OF FAULT LINES","awardID":"0909611","effectiveDate":"2009-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[405531],"PO":["564993"]},"158985":{"abstract":"Although service-oriented environments and technologies are receiving a great deal of attention in both academic and corporate arenas, the ability to automate the discovery and composition of such services into higher-level capabilities remains elusive. This is funding to support the 4th international web service discovery and composition competition (the WS-Challenge), whose objective is to identify, evaluate and baseline approaches to solving that problem. Building on the success of the first three competitions, which were held in 2005 in Hong Kong, in 2006 in San Francisco, and in 2007 in Tokyo (the latter two with NSF funding), the PI will organize the planning and enactment of the 2008 competition to be held in conjunction with the IEEE International Conferences on Electronic Commerce (CEC 08) and on Enterprise Computing, E-Commerce and E-Services (EEE 08), which will take place in Washington DC in July. The first competition was limited to syntactical matching using the Web Services Description Language (WSDL); participants were required to identify and compose WSDL-specified services based on their input and output messages as specified in a directory of WSDL documents. In 2006 the competition focused additionally on the semantic linking of web services using XML-based semantic notations. The 2007 competition supported the implementation of an initial Web service interface package that served as a platform upon which participants built composition engines, which were then exposed as a Web service; teams were evaluated in terms of architecture and design as well as performance. The 2008 competition will focus on issues relating to dissemination, such as code generalization and creation of APIs that can be used to help new teams access the competition. NSF funding will support participation in the competition of approximately 4 teams from the United States consisting of about 2 students apiece. A small amount is earmarked for travel for the organizers to the competition and the conference registration of the PIs and research assistants.<br\/><br\/>The IEEE International Conferences on Electronic Commerce and on Enterprise Computing, E-Commerce and E-Services bring together researchers and developers from diverse areas of computing. The conferences provide a venue for developers and practitioners to explore and address challenging research issues surrounding e-technology, in order to develop a common research agenda and vision for e-commerce and e-business. The focus is two-fold: to investigate enabling technologies to facilitate next generation e-transformation; and to disseminate application and deployment experience in e-themes such as e-business, e-learning, e-government, e-finance, etc. The CEC\/EEE conferences are particularly timely and relevant because they focus on the application of electronic services as they cut across several \"e-domains\", whereas other conferences tend to either focus on a specific technology or on a single domain.<br\/><br\/>Broader Impacts: The workshop and resulting artifacts will serve as a centralized repository of algorithms, software, and techniques in a timely emerging area. The workshop will provide participants with an opportunity to gain exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. The workshop experience will integrate well with the goals of a software engineering education, as participants are evaluated on their design in addition to the performance of their approaches. To engage a broader audience in this year's event, the PI will expand his previously successful efforts to solicit teams from under-represented universities.","title":"WORKSHOP: Web Service Discovery and Composition Competition (WSC2008)","awardID":"0938382","effectiveDate":"2009-04-01","expirationDate":"2010-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["444191"],"PO":["565227"]},"153056":{"abstract":"Award Abstract:<br\/><br\/>The complexity of problems in computational neuroscience requires research from multiple groups across many disciplines to be combined. In order to combine research from multiple groups, there must be an infrastructure for exchanging model specifications; however, the current use of multiple formats for encoding model information has hampered model exchange. NeuroML is a model description language developed in XML (extensible Markup Language) that was created to facilitate data archiving, data and model exchange, database creation, and model publication in computational neuroscience. One of the goals of the NeuroML project is to develop standards for model specifications that will allow for greater simulator interoperability and model exchange.<br\/><br\/>An international workshop will be held in March of 2009 to bring together members of the computational neuroscience community for further development of the NeuroML specifications. The workshop participants will include modelers, software developers and experimentalists with the goal of refining the NeuroML standards for single cell modeling including the modeling of channels and the biophysical description of cells. Workshop outcomes will include a list of updates to the standards for the ChannelML and Biophysics specifications, an agreement from simulator developers for future support of cell and channel descriptions including optimization of simulators for large-scale simulations, and a publicly available summary of the meeting proceedings.","title":"NeuroML Development Workshop: Biophysical Single Cell Modeling","awardID":"0912814","effectiveDate":"2009-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7334","name":"MATHEMATICAL BIOLOGY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[407679],"PO":["564318"]},"156455":{"abstract":"This is funding to support travel by 6-9 students currently enrolled in PhD programs in the United States to present their accepted papers and posters, and to take part in the Doctoral Consortium, at the First International Conference on User Modeling, Adaptation, and Personalization (UMAP 2009), to be held in Trento, Italy, on June 22-26, 2009. UMAP, the premier user modeling conference in the world, is a merger of the long-running and successful biennial conference series on User Modeling (UM, 1986-2007) and the Adaptive Hypermedia and Adaptive Web-Based Systems (AH, 2000-2008); the former provided a forum in which academic and industrial researchers from the many fields involved in user modeling research (artificial intelligence, education, psychology, linguistics, human-computer interaction, and information science) could exchange their complementary insights on user modeling issues, while the latter provided a forum for dissemination of adaptive technology for hypermedia and other web-based systems. User modeling has been found to significantly enhance the effectiveness and usability of software systems in a variety of areas. A user model is an explicit representation of properties of a particular user; a system that constructs and consults user models can adapt diverse aspects of its performance to individual users. Applications for user modeling range from electronic commerce and intelligent learning environments to health care and assistive technologies. Relevant platforms for user modeling include mobile and wearable systems, and smart environments, as well as individual desktop systems, groupware, adaptive hypermedia, and other web-based systems. The UMAP 2009 Doctoral Consortium will provide a unique opportunity for PhD students partway through their dissertation research to receive valuable feedback from top researchers in the field. Participants will present their work to the conference (15 minutes, which may include a short demo if appropriate), with additional time allocated to questions and for discussion (15 minutes). Both during the question\/discussion period and in subsequent informal interactions, committee members and other conference participants will provide constructive comments on the student's work and attempt to address the aspects of the work on which s\/he requested advice. Student papers will be published in the adjunct proceedings of the conference, while summaries will be included in the proceedings. In allocating NSF funds to participants, the Doctoral Consortium Co-chairs will give preference to students who can reasonably prove financial hardship, and they will also strive for diversity (gender, racial, ethnic, disabilities, institutional, etc.) among the selected students.<br\/><br\/>Broader Impacts: Bringing young and creative researchers to UMAP 2009 will help advance an important and socially valuable research field. NSF funding will significantly impact the careers of the next generation of User Modeling researchers, by enabling a number of them to take part in an important event they would otherwise have to miss. The students will have an opportunity to gain wider exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. Participation will also help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development.","title":"Supporting Students Attending the International Conference on User Modeling, Adaptation, and Personalization","awardID":"0925663","effectiveDate":"2009-04-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["451009"],"PO":["565227"]},"146203":{"abstract":"New generation DNA sequencing technologies are revolutionizing modern biological research. Scientists can now generate the rough equivalent of an entire human genome (~3 billion base-pairs of DNA) in just a few days with one single sequencing instrument. Until recently, such amounts of data could only be generated at large genome centers using hundreds of sequencers. The analysis of these data is complicated by their size - a single run of a sequencing instrument yields terabytes of information, often requiring a significant scale-up of the existing computational infrastructure. This project is developing parallel algorithms for analyzing new generation sequencing data with a specific focus on the Map-Reduce paradigm implemented on a highly-distributed computing cluster supported by Google and IBM. The project is primarily focused on developing algorithms for sequence alignment and sequence assembly ? critical tasks in the analysis of genomic data ? and involves the adaptation of string matching and graph algorithms to the Map-Reduce paradigm. <br\/> <br\/>This work will potentially lead to parallelism-enabled genomic analysis software that will allow researchers to analyze new generation sequencing data through web-scale computational resources, thereby obviating the need for establishing and maintaining a local high-performance computing infrastructure. The software developed during this project is being made available under an open-source license in order to encourage broad use and to enable future research. The research is integrated with teaching and mentoring of graduate and undergraduate students and the results of the work will be disseminated through journal publications and conference presentations.","title":"Algorithms for the Analysis of Data from Massively-parallel Genome Sequencing","awardID":"0844494","effectiveDate":"2009-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I153","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I331","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I435","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7782","name":"CLUSTER EXPLORATORY (CLuE)"}}],"PIcoPI":["538208","486199"],"PO":["560586"]},"153783":{"abstract":"This workshop proposal requests funds to partially support a meeting to bring together researchers who have developed formal methods and applied them to industrial use, in order to discuss the current state of applicability of formal methods. The meeting takes place at the cusp of two related conference VMCAI and POPL, the first being a conference about verification and the second being a conference about programming languages. It is highly desirable to get representatives of the group together for this meeting. If such a consensus is reached, an Organizing Committee will be formed and plan a follow-up workshop that will allow for in-depth examination of the issues raised.","title":"WORKSHOP: Usable Verification.","awardID":"0916034","effectiveDate":"2009-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":["417591",409234],"PO":["564388"]},"156577":{"abstract":"Abstract<br\/>0926109<br\/><br\/><br\/>Over the last twenty years, the international open source community has increasingly provided thesoftware at the heart of the world?s high-performance computing systems. The community provideseverything from operating system components to compilers and advanced math libraries. As an international community, however, there are only loosely coordinated activities and plans for<br\/>development. The new rapidly changing technologies in multicore, power consumption, GPGPUs, and memory architectures creates an opportunity for the community to work together and build an international program to design, build, and deliver the software so critical the science goals of these<br\/>institutions. To help plan how the international community could build a partnership to provide the next generation of HPC software to support scientific discovery, a series of workshops are being planned. Funding under this proposal would provide travel and support for the first workshop in the series.<br\/>Goals for this first meeting include:<br\/>· Assess the short-term, medium-term and long-term needs of applications for peta\/exascale systems<br\/>· Explore how laboratories, universities, and vendors can work together on coordinated HPC software<br\/>· Understand existing R&D plans addressing new programming models and tools addressing extreme scale, multicore, heterogeneity and performance<br\/>· Start development of a roadmap for software on extreme-scale systems","title":"International Exascale Software Workshop for Scientific Computing","awardID":"0926109","effectiveDate":"2009-04-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["558550"],"PO":["558205"]},"150560":{"abstract":"Proposal: EFRI-0903867<br\/>PI: Janet Hunziker <br\/>Organization: National Academy of Engineering <br\/><br\/>This award partially supports a series of three national and international Frontiers of Engineering (FOE) Symposia by the National Academy of Engineering: German-American FOE (April 23-25, 2009, in Potsdam, Germany), U.S. FOE (September 8-10, 2009, in Irvine, CA), and Japan-America FOE (November 9-11, 2009, in Irvine, CA). Each symposium focuses on four topical areas. Topics for 2009 include engineering tools for scientific discovery, health informatics and health care delivery systems, frontier optical micro and nano devices and materials, resilient and sustainable infrastructures, breakthrough technologies in brain science, modeling global climate change, novel materials for industrial applications, state-of-the-art technologies for knowledge management, complex systems design and control, renewable energy, biosystems engineering, and materials for extreme environments. Between 60 and 100 outstanding, early-career scientists and engineers participate in each symposium. Sessions consist of presentations by speakers on leading edge research, emerging technologies, and opportunities for collaboration across science and engineering fields. The symposia foster interdisciplinary and international collaborations and serve as a reference point for many of the emerging frontiers in research and innovation in the U.S. Presentations from the U.S. FOE seminar will be posted on the NAE FOE web site.","title":"2009 Frontiers of Engineering Symposia (U.S., Japan-America, and German-American)","awardID":"0903867","effectiveDate":"2009-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0704","name":"Division of EMERGING FRONTIERS IN RES & IN","abbr":"EFRI"},"pgm":{"id":"1402","name":"BIOCHEMICAL & BIOMASS ENG"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0704","name":"Division of EMERGING FRONTIERS IN RES & IN","abbr":"EFRI"},"pgm":{"id":"7633","name":"EFRI RESEARCH PROJECTS"}}],"PIcoPI":["543859"],"PO":["565007"]},"158603":{"abstract":"This award is for the support of student participation in CPSWeek 2009 and the CPS Forum, San Francisco, California, April 13 through April 17, 2009, California. The objective is to attract a diverse student population to research careers in Science, Technology, Engineering and Math (STEM) areas contributing to the emerging field of Cyber-Physical Systems. This NSF grant will be used to ensure the broadest possible student participation in CPSWeek events.","title":"Cyber-Physical Systems Week (CPSWeek 2009)","awardID":"0936350","effectiveDate":"2009-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":["457653"],"PO":["561889"]},"158824":{"abstract":"Robot-assisted rehabilitation can enhance and speed motor control recovery following brain injury such as stroke. Most existing rehabilitation approaches and modeling work supporting them focus primarily on the forces required to generate controlled movements, in effect deemphasizing planning that occurs at a kinematic level. A thorough understanding of the role of kinematics in coordination is needed to help diagnose the level at which deficiencies lie, and then focus treatment at that level. In this project, the PI will formulate and experimentally validate unified, coherent models of human motor coordination based on a foundational time-invariant, kinematic mapping between the output space and the control space. Inspired by curvature theory, which is traditionally applied to mechanism synthesis, such a mapping provides an elegant description of motion. With this novel approach, the PI will seek to demonstrate that decoupling the kinematic geometry from the time-based trajectory tracking of arm motion leads to a compact internal model of path planning consistent with experimental data. The work will further demonstrate that a similarly compact internal dynamic model provides an additional layer for an efficient formulation of motor control. The internal kinematic and dynamic models to be developed will enable investigation of optimization mechanisms at the kinematic level, the dynamic level, and through mutual interaction of the two. In order to experimentally validate this model, the PI will develop an actuated, but back-drivable, planar x-y table that has uniform apparent endpoint inertia throughout its workspace. This device will both enable the model validation experiments and serve as a first prototype for a new robot-assisted rehabilitation device that can be used to clinically leverage the knowledge gained from the modeling effort. The PI will collaborate with colleagues in his institution's Physical Therapy Division and Physical Medicine and Rehabilitation Department to develop and evaluate new diagnostic and rehabilitation techniques that implement the new device based on the findings.<br\/><br\/>Broader Impacts: Robot-assisted rehabilitation is likely to have an increasingly significant impact on society as health care costs rise and the number of strokes increases with population aging. Grounded in understanding human motor coordination, this research will impact the fields of locomotion, neurally controlled prosthetics, digital human modeling, and robot control. The investigator will integrate this research into his educational activities with two foci: increasing student understanding of the significance of kinematics and dynamics in human motor coordination; and enhancing student ability to internally visualize physical movement in mechanical systems. These activities will involve modifications to a required undergraduate kinematics course, an elective undergraduate product design course, and two graduate kinematics courses to incorporate the results of the research. Additionally, a seminar course for students from all academic units will be developed to more broadly disseminate the work. In conjunction with four other faculty in the Ohio State College of Engineering, the PI will organize a weeklong engineering summer camp for women and minority high school students. The PI will create two modules for the camp: one related to human motor coordination in which the students will conduct experiments using the x-y table developed in the project; and one related to visualization of motion in mechanical systems.","title":"CAREER: Modeling Time Invariances in Human Motor Coordination for Robot-Assisted Rehabilitation","awardID":"0937612","effectiveDate":"2009-04-01","expirationDate":"2012-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["524608"],"PO":["565227"]},"154579":{"abstract":"This award supports a Doctoral Consortium to be held in conjunction with the 2009 Conference on Communities and Technologies, June 24-27, 2009. The Communities and Technologies (C&T) conference addresses communities as social entities comprised of actors who share something in common. Further, C&T addresses the ways that computing and communication technologies influence, enable or hinder, communities and the actions that they take. The Doctoral Consortium focuses on the intellectual contributions of the diverse set of doctoral students who are competitively selected to attend. The Doctoral Consortium will help build a future set of community informatics researchers by providing an intellectually intense pre-conference event that attracts and energizes a key set of faculty advisors and doctoral candidates. The Doctoral Consortium will build on the diversity of community informatics researchers and help establish their connection to the broader computing research community. Developing this diversity is valuable for the NSF and for the vitality of the CISE\/IIS research community.","title":"Workshop: Doctoral Consortium at the Fourth International Conference on Communities and Technologies (C&T 2009)","awardID":"0919004","effectiveDate":"2009-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["549541"],"PO":["565342"]},"150115":{"abstract":"The vast majority of neurons in the brain communicate with one another using discrete impulses known as spikes. Modeling studies have demonstrated that systems constituted of spiking neurons can have dynamics that are starkly different from those of systems whose constituent units interact via continuously varying quantities. This project is aimed at deciphering the core dynamical and computational properties of networks of spiking neurons, a formal understanding of which is necessary to comprehend how the brain, or any part thereof, works.<br\/><br\/>A prerequisite for such a program is the choice of a mathematical model for networks of spiking neurons that is at once biologically realistic and is amenable to formal analysis. In prior work, Arunava Banerjee has formulated one such model that is founded on the observation that a neuron is in essence a device that transforms multiple input sequences of spikes arriving at its various afferent synapses into an output sequence of spikes on its axon. Building on this model, this project aims to answer a broad set of interrelated questions concerning the nature of computation in feed-forward and recurrent networks of spiking neurons.<br\/><br\/>For continuous input-output systems, the Volterra\/Wiener approach to system identification has led to a highly successful account of the levels of complexity inherent to transforming functionals. This project will formulate and analyze a corresponding framework that is applicable to feed-forward networks whose inputs and outputs are both spike trains. Next, the relationship between the input-output transformation of a feed-forward network and its information transmission capacity, as well as the nature of the recoding of information, will be analyzed. Networks driven by artificially generated realistic input spike trains shall be used to address this issue. The educational aspect of the project will focus on achieving two simultaneous objectives: attracting undergraduate women with an interest in the Biological Sciences to the field of Computer Science, and introducing senior undergraduate and beginning graduate Computer Science students to the basic neurobiology of the brain.","title":"Formal Characterization and Analysis of Computation in Networks of Spiking Neurons","awardID":"0902230","effectiveDate":"2009-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["499431"],"PO":["564318"]},"151699":{"abstract":"Proposal Number: IIS - 0907889<br\/>PI: John Gero<br\/>Institution: George Mason University<br\/><br\/>The Problem: Visual and spatial reasoning often play pivotal roles in design creativity, most noticeably through sketching, diagrams, visualization and visual imagery. There is research on visual and spatial reasoning in multiple disciplines but very little is focused on design creativity. There is a need to bring this research to bear onto design creativity to improve it. <br\/><br\/>The Proposal: This Workshop brings together the leading researchers from the disciplines that carry out research into visual and spatial reasoning of relevance to design creativity: <br\/><br\/> design science, <br\/> computer science, <br\/> cognitive science, and <br\/> neuroscience <br\/><br\/>in order to define the state-of-the-art and to produce the opportunity for transdisciplinary activity related to design creativity. The workshop format allows a focus on discussion and groups work on research agendas and grand challenges. Presentations are catalysts for discussion rather than the primary focus. To improve international collaboration, the workshop is held in France. One doctoral student from each area is also invited. <br\/><br\/>Intellectual Merit: Each of the four sciences studies visual and spatial reasoning in isolation without a focus on design creativity. Bringing together researchers from these different communities provides opportunities for transdisciplinary research. Making designing the focus is expected to result in knowledge about processes for studying visual and spatial reasoning that will produce new knowledge about design creativity. One enduring output of the workshop will be archival proceedings, expected to be published by Springer. <br\/><br\/>Broader Impact: Design creativity holds the key to transformational products and processes. The outcomes of this workshop will form the basis of the development of a research agenda for visual and spatial reasoning in design creativity and provide the basis for an education agenda to improve the creativity of designers. The aim is to develop international research collaborations. Studying visual and spatial reasoning produces knowledge of design creativity. The knowledge derived from studying design creativity has the potential to form the foundations of new kinds of support tools for creative designing. Attention to a diverse and inclusive group of discussants, attention to design for social impact, and plans for a larger conference are also elements of the meeting.","title":"Two-Day Workshop: Studying Visual and Spatial Reasoning in Design Creativity","awardID":"0907889","effectiveDate":"2009-04-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["564585"],"PO":["565227"]},"152469":{"abstract":"The value of social computing environments has been demonstrated in many contexts, including web search, shared bookmarking and photo sharing, personal social networking, online support groups, and information resources such as Wikipedia. Collaborative game environments have been used as both research environments to study collaboration and as environments for facilitating scientific meetings, and professional organizations and scientific communities also leverage cyberinfrastructure and social network applications to share resources, collect data, and facilitate communication. Virtual worlds have also been applied to support a diverse range of professional and work activities, however, there is so far little empirical evidence on how virtual worlds are adopted and leveraged to promote scientific progress. The exploratory research proposed here aims to explore how virtual worlds can be leveraged in the digital curation community for purposes of improving work practices and training.","title":"SGER: Collaborative Research: Curatorial Work and Learning in Virtual Environments","awardID":"0910465","effectiveDate":"2009-04-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["531548"],"PO":["565227"]},"150601":{"abstract":"Through this award, travel support is being provided for young researchers to attend the 2009 IEEE Symposium on Security and Privacy to be held in Oakland, California, USA. The 2009 symposium marks the 30th annual meeting of this flagship security and privacy conference. Since 1980, the IEEE Symposium on Security and Privacy has been the premier forum for presenting developments in computer security and electronic privacy, and for bringing together researchers and practitioners in the field. The Symposium is sponsored by the IEEE Computer Society Technical Committee on Security and Privacy. The Symposium, as many other academic activities, relies on the experience of senior members of the community but requires fresh ideas and new researchers to join the community. As such, and to encourage graduate students and young faculty members to participate in the always exciting technical program and events at the Symposium, the travel support is used to sponsor the travel expenses for graduate students and junior faculty members to attend the Symposium. The total amount of the award is $25,000 on the basis of an average travel grant of $1,200 for each selected junior faculty participant and $900 for each selected graduate student. Attendance at SP 2009 will be very beneficial to young scientists who otherwise would be unable to participate. Travel support for student and junior faculty attendance is advertised nationwide, and women, minorities and disabled students are especially encouraged to apply for the grants.","title":"Travel Support for 2009 IEEE Symposium on Security and Privacy to be held in Oakland, CA on May 17-20, 2009.","awardID":"0904011","effectiveDate":"2009-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["543507"],"PO":["497499"]},"148181":{"abstract":"This project will be performed by the Computer Science Department at the University of Texas at ElPaso (UTEP), in collaboration with the departments of Psychology, Biological Sciences, Industrial Engineering, and Civil Engineering. The topical focus will be Applied Intelligent Systems. The main goals of the project are to increase participation in science and engineering fields by traditionally underrepresented groups, to introduce science and engineering students to cutting edge interdisciplinary research, and toprovide students with an opportunity to familiarize themselves with graduate programs in science and engineering at a regional university. The program will host students for a period of ten weeks during the summer. It will emphasize interdisciplinary research, where techniques developed in the area of artificial intelligence will be appliedto real-world problemsinscience and engineering. This will allowthe students togain a broader overviewof science and engineering as a potential career than would be possible in more narrowly-defined research areas. An emphasis will be placed on recruiting students from minority-serving institutions and institutions that do not offer graduate programs in computer science. The proposed program will provide undergraduate students an opportunity to conduct full-time collaborative interdisciplinary research under the co-supervision of a faculty member fromthe computer science departmentand a faculty member from one of the collaborating departments hold a seminar series in which academic and non-academic careers in science will be discussed, promote extensive student-faculty and student-student interaction through weekly gatherings (research meetings and social\/cultural activities) and undertake activities to mprove students' confidence and communication skills through oral and written presentations of project results and through Career Development Workshops.<br\/><br\/>Intellectual Merit<br\/>The intellectual merit of this proposal lies in the unique combination of: a)well-planned interdisciplinary research projects, which can realistically be expected to be completed by an undergraduate student during one summer; b) mentorship by at least two faculty members from two different research departments,which enables students to gain a richer perspective about careers in science; c) emphasis on development of research skills over knowledge about a particular discipline; d) emphasis on recruitment by individualized invitation over self-selection of applicants, which is expected to attract larger numbers of minority applicants, and, f) participate in a proven mentor training program.<br\/><br\/>Broader Impacts<br\/>The broader impact of this project will ultimately be increased numbers of students, in particular members of underrepresented groups, pursuing graduate studies in science and engineering and engagingin successful careers.It is expected that most of the students who participate in the project will enroll and successfully complete graduate studies and that a significant fraction of them will become faculty members at colleges and universities.","title":"REU Site: UTEP Summer REU Program in Applied Intelligent Systems","awardID":"0852066","effectiveDate":"2009-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7603","name":"SCIENCE, TECH & SOCIETY"}}],"PIcoPI":["528236"],"PO":["562760"]},"147074":{"abstract":"Many of today's data-intensive application domains, including searches on social networks and module searches in biological pathways, require complex queries on large graph datasets. Their highly connected nature means graph operations tend to \"crawl\" across many links, resulting in very large memory footprints that strain resources on today's commodity servers. In addition, current application platforms lack abstractions for graph operations, leaving developers to implement a variety of complex standalone graph query components. The PIs of the UCSB Massive Graphs In Clusters (MAGIC) project are developing a scalable infrastructure to provide high level abstractions for graph primitives, simplifying design of complex queries while addressing difficult challenges of maximizing data parallelism and adaptive graph partitioning across clusters. <br\/><br\/>Advances from this project will include data partitioning techniques, novel primitives for graph operations, and a software infrastructure that together expand the applicability of scalable cluster infrastructures such as MapReduce and Dryad to graph-oriented queries in social networks and biological graphs.","title":"CluE: Towards Scalable Primitives for Graph Operations","awardID":"0847925","effectiveDate":"2009-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7782","name":"CLUSTER EXPLORATORY (CLuE)"}}],"PIcoPI":["536696","500153","402357","560388","432722"],"PO":["560586"]},"146282":{"abstract":"CAREER: Novel Geometric Techniques for Optimal Surface Detection <br\/>in Medical Images<br\/><br\/>Xiaodong Wu<br\/>Department of Electrical and Computer Engineering<br\/>Department of Radiation Oncology<br\/>The University of Iowa<br\/><br\/>Automated detection of globally optimal surfaces representing object boundaries in volumetric images is fundamental and remains challenging in modern computer-assisted medical diagnosis and treatment as well as other important medical applications. The analyses of 3-D data are typically performed visually in routine clinical practice, and are done in 2-D on a slice-by-slice basis. Maximum intensity projections providing 2-D images of the 3-D data or qualitative volume renderings are also common. However, reliable quantitative volumetric 3-D and 4-D segmentation methods that are robust, user-friendly, and applicable to clinical practice are not routinely available. As such, a significant and possibly critical portion of the image information available in the acquired data may unfortunately be never used for clinical diagnostic purposes. <br\/><br\/>This research involves directly addressing the needs of automated segmentation and will result in novel methodologies and practical tools that greatly accelerate the pace of medical image analysis. The investigator studies the specific problems of optimally detecting single and multiple interacting surfaces in volumetric medical images. Surfaces with high-order smoothness are of particular interest. The newly introduced edge-weighted geometric graph representation for the surface detection problems allows incorporating a wide spectrum of image features into the formulation, admitting highly accurate segmentation results. However, it also brings tremendous computational challenges. The target geometric problems include highly smooth surface identification, geometric layer partitioning, surface reconstruction from noisy data, digital rays, constrained k-means clustering, and geometric multiple labeling. The application of computational geometry techniques to medical imaging is intellectually deep and will result in advances in both computational geometry and medicine. An important goal of this research is dissemination of implemented algorithms in software to medical domains. In doing this, it can help to further integrate computer science with medicine. Beyond its research impact, the educational goal of this project is to facilitate the institution-wide effort to foster and promote the extension of the strength of biomedical research at the University of Iowa to successful interdisciplinary undergraduate and graduate programs.","title":"CAREER: Novel Geometric Techniques for Optimal Surface Detection in Medical Images","awardID":"0844765","effectiveDate":"2009-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["550205"],"PO":["565157"]},"143260":{"abstract":"PROPOSAL: 0830618<br\/>INSTITUTION: Univ. of Maryland<br\/>PI: Samet, Hanan<br\/>TITLE: Scalable Geometric and High Dimensional Data Structures and Algorithms: A Parallel and Distributed Approach<br\/><br\/>ABSTRACT<br\/>The steadily decreasing cost of commodity computing as well as the democratization of the increasing thirst for computing power, fueled largely by the massive volumes of data generated by powerful search engines, has led to a reexamination of how the traditional methods of solving problems that involve search. As more and more applications become web services (i.e., ``cloud applications'' in technology parlance), there is an increasing expectation that answers be obtained and provided in real time and at a scale that is capable of servicing millions of users at the same time. For many complex problems, this expectation forces a rethink of the solution paradigm. In particular, there is an increasing realization that the speed and scale requirements mean that the only way to provide the service is to decouple the solution process into two steps: one that precomputes a solution space to all possible problems, and possibly provides an encoding of it, and one that navigates the solution space. This research explores the decoupling paradigm in the context of answering shortest path and nearest neighbor queries in a spatial network, where the effect is to decouple the process of computing shortest paths along the network from the process of finding the nearest neighbors.<br\/><br\/>This research aims at increasing the accessibility to massive amounts of user generated data including maps, documents, videos, images, and music by speeding up the similarity searching task. This invariably involves taking advantage of ways to sort the data which also includes developing methods to build appropriate multidimensional and spatial indexes. By focusing on making use of GPUs and distributed processing, as well as decoupling via pre-computation, it brings the benefits of this increase in computing power to a wider range of users who often have this power at their disposal. In addition, by demonstrating the power obtained by the use of decoupling in computing nearest neighbors in a spatial network it stimulates the development of scalable solutions to other search problems.","title":"Scalable Geometric and High Dimensional Data Structures and Algorithms: A Parallel and Distributed Approach","awardID":"0830618","effectiveDate":"2009-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["551003"],"PO":["565157"]},"148111":{"abstract":"Software safety is critical to many projects conducted<br\/>by both private industry and the government. After the<br\/>Challenger accident, NASA adopted a safety policy based<br\/>on a National Research Council report that requires every<br\/>project to take an organized and systematic approach to<br\/>identify safety hazards or unsafe situations and practices,<br\/>and to follow appropriate steps to assure adequate safety.<br\/>At the REU site to be established undergraduates participate<br\/>in research on verification and validation for software<br\/>safety: from, initially, a series of training seminars on<br\/>the necessary background knowledge, to becoming involved<br\/>in one of several specially designed research topics<br\/>according to their interests. Topics include safety analysis,<br\/>model construction and simulation, validation test generation<br\/>and execution, etc. Interaction between the students and<br\/>faculty mentors is emphasized. Follow-ups are also conducted<br\/>with the students after the summer program to prepare their<br\/>results for presentation at conferences and publication in<br\/>journals.<br\/><br\/>The research subject is software safety with a focus on the<br\/>analysis and integration of failure conditions with functional<br\/>specifications, the use of assertions in formal specifications,<br\/>and validation not only for testing software under normal<br\/>conditions but also for showing that unsafe states cannot be<br\/>generated by the software as the result of single or multiple<br\/>erroneous inputs. This project allows students from<br\/>underrepresented groups or universities with limited research<br\/>opportunities to experience cutting-edge research in software<br\/>engineering and to gain proficiency in a broadly applicable<br\/>skill set, including critical thinking, research methods,<br\/>problem solving, and oral and written communication -- all of<br\/>which are very important for success in graduate programs and<br\/>careers in science and technology research.","title":"REU Site: Verification and Validation for Software Safety","awardID":"0851848","effectiveDate":"2009-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["505880","450698"],"PO":["523800"]},"155372":{"abstract":"This award supports a Doctoral Consortium at the 2009 ACM GROUP Conference to be held May 10-13, 2009. The ACM GROUP conference brings together researchers from the fields of organizational behavior, information systems, social informatics, information sciences, and computer supported cooperative work (CSCW). As such the conference is a critical link between the research communities supported by CISE\/IIS and the broader social, behavioral, and management sciences. The focus of the GROUP Doctoral Consortium is the intellectual content of the students' doctoral dissertations. These dissertations represent state-of-the-art research in the study and development of organizational systems, information systems, social informatics, and computer supported cooperative work. The Doctoral Consortium creates a social network among the next generation of researchers and several senior researchers. Students and faculty are anticipated to be a diverse group on several dimensions (nationality, scientific discipline, gender, institutional affiliation, under-represented minority status), therefore participation in the consortium will broaden the students' intellectual and social perspectives at a critical stage in their professional development.","title":"Group09 Doctoral Consortium","awardID":"0922106","effectiveDate":"2009-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["498457"],"PO":["564456"]},"152293":{"abstract":"Studies of large-scale information technology (IT) development projects that include multiple groups of stakeholders have found that such projects are prone to conflict escalation and eventual project failure if care is not taken to repair intergroup conflict as it erupts or even to avoid it entirely. This project aims to understand what triggers intergroup conflict, or, more precisely, what the researchers call ?faultlines,? among stakeholders engaged in cyberinfrastructure development projects and, more specifically, in GENI, a virtual laboratory currently being prototyped to explore future internets at scale. Early identification of potential faultlines and their mitigation or repair are central to achieving positive stakeholder interactions and project success. <br\/><br\/>The research will consist of an in-depth longitudinal study of the social networks emerging in the GENI development and prototyping community over the next three years, using a mix of quantitative and qualitative methods. Social Network Analysis (SNA) will be used to understand the communication patterns among stakeholders, primarily based on electronic communications, e.g., email and wiki postings. Qualitative Comparative Analysis (QCA) will be used to discern patterns in qualitative data, for example, from interviews, meeting minutes or project documents. The GENI social network will be studied at two levels, within development teams and across them ? at the larger GENI community level. <br\/><br\/>The management of large-scale IT development projects is challenging, in large part due to their sheer scale, scope and complexity. As a result, this research could have broad applicability. Understanding how conflict can be anticipated, avoided or mitigated has the potential to positively impact project stakeholders as well as the broader society, which is the ultimate beneficiary of the innovations that GENI may stimulate.","title":"Collaborative Research: IDENTIFYING FAULT LINES, CIRCUMVENTING FAULT LINE ERUPTIONS, AND MITIGATING THE EFFECTS OF FAULT LINES","awardID":"0909833","effectiveDate":"2009-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[405707],"PO":["564993"]},"156572":{"abstract":"The Association for Computing Machinery (ACM) proposes to fund student attendance at the 2009 Richard Tapia Celebration of Diversity in Computing Conference that will be held April 1-4 in Portland, Oregon. The Tapia conference is unique in that it focuses on underrepresented minorities in Computer Science. Students will have access to the many researchers and technical presentations at the conference. In addition, they can present their own work in a poster session and at a PhD Consortium, giving them the opportunity to get feedback from discipline specialists. The Tapia Conference provides a supportive environment for students, allowing them to engage in intellectual discourse with a range of researchers and to meet peers from other institutions. The students will be able to build their personal networks and form professional relationships. This award will also fund travel support for some faculty at MSIs, giving them the opportunity to accompany their student mentees and make important technical contacts for themselves.","title":"A Proposal for Funding Student Scholarships to The Richard Tapia Celebration of Diversity in Computing Conference 2009","awardID":"0926083","effectiveDate":"2009-04-15","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["531150","554552"],"PO":["561855"]},"146452":{"abstract":"CNS - 0845476<br\/>Nguyen, Thinh<br\/>Oregon State University<br\/>CAREER: Network Coding for Media Transmission and Storage<br\/><br\/><br\/>This research seeks to advance Network Coding (NC) theories and practices for multimedia transmission and storage in best-effort networks. NC has been shown to be a promising approach to enhance networking performance. However, many benefits of NC will not likely be realized fully when they are used naively with the existing wired and wireless infrastructures. This research consists of two primary efforts, aimed to develop theories and methodologies for optimally incorporating NC to a large body of existing coding, signal processing, networking and communication techniques. The first effort will investigate the NC-based techniques for efficient multimedia delivery from the Internet to receivers in a wireless access network such as Wi-Fi or WiMax. This effort will focus on the optimal integration of NC to the network stack, from media compression techniques at the application layer, to packet schedulers at the link layer, to channel coding and modulation methods at the physical layer, in order to improve quality of wireless multimedia networking applications. The second effort will explore a scalable, NC-based, Peer-to-Peer architecture for multimedia storage and delivery. The focus will be on developing network protocols and NC-based data replenishment techniques to support high quality video streaming. <br\/><br\/>These two efforts will provide an in-depth understanding of when, where, and how to apply NC techniques for multimedia networking applications. The specific research goals are 1) to understand and quantify the effects of the interactions among network layers and NC techniques, 2) to develop theories and methodologies for jointly optimizing NC techniques with the existing infrastructures, and 3) to develop software platforms for enhancing wireless multimedia networking applications, and for building robust, scalable, distributed multimedia storage and streaming systems. <br\/><br\/>Broader Impact. Integral to the research will be efforts to increase enrollment and retention of electrical engineering and computer science students through exciting projects and class materials, to promote inter-community collaborations among researchers in the fields of networking, signal processing, and coding theory through a series of workshops, and to create societal wealth through innovations via industrial collaborations and start-up ventures.","title":"CAREER:Network Coding for Media Transmission and Storage","awardID":"0845476","effectiveDate":"2009-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["399757"],"PO":["565090"]},"157386":{"abstract":"OCI 0929541<br\/>Purdue University<br\/>Barbara Fossum<br\/>Abstract<br\/><br\/>This proposal requests funding for a two day International Workshop to be held April 14-15, 2009 at Tsinghua University in Beijing, China. The Co-Chairs for this workshop are Jun Li, Dean of the Research Institute of Information Technology and Vice Dean of the School of Information Science and Technology, Tsinghua University, and Alex Pothen, Director of the Computer Research Institute, Director of the Combinatorial Scientific Computing and Petascale Simulations Institute at Purdue University. The program committee consists of Junwei Cao, and Xiaoge Wang from Tsinghua University and Barbara Fossum and Carol Song from Purdue University.<br\/><br\/>The purpose of this workshop is to address some of the major challenges presented<br\/>by evolving cyberinfrastructure and to identify one or two areas of common interest where<br\/>joint collaboration will bring together an international team to solve these challenges. The<br\/>broader impacts of this workshop are to engage with international colleagues to create a venue<br\/>for leveraging existing cyberinfrastructure investments beyond the United States. This workshop offers the opportunity for the community to create a global cyberinfrastructure enabling science and engineering between the U.S. and China.<br\/><br\/>One of the major challenges facing cyberinfrastructure is how to meet the needs of a rapidly changing and growing global society whose dependence on computing and information technology is growing exponentially. As we move closer to the end of the first decade of the 21st century it is essential that cyberinfrastructure evolve to be ready to meet the needs of all communities in all areas of research on a global level. To address the issues of building cyberinfrastructure for the next decade with a view to enabling global science.","title":"International Symposia on Cyberinfrastructure:A Series of 2 Workshops on the Challenges of the Complexities of Cyberinfrastructure for the 21st Century","awardID":"0929541","effectiveDate":"2009-04-15","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["538222","167299"],"PO":["564246"]},"158013":{"abstract":"EAGER: Transforming Attitudes via Best Practices CS1<br\/>Beth Simon, Computer Science and Engineering<br\/>UC San Diego<br\/><br\/>For several years, the computing community has been concerned about dropping enrollments in computing majors and courses while the national need for well trained students in computing is increasing. To understand this crisis, many factors have been examined including the image of computing and the pedagogy and materials used in introductory classes. Over time, many instructors have experimented with classes that teach fundamental computing constructs and skills through more attractive applications and environments. There is some anecdotal evidence that this approach is effective and some studies that have been carried out with non-majors. This project presents a unique and timely opportunity to test this approach; in the past, finding viable and significantly large comparison groups to support the hypothesis has been a challenge.<br\/><br\/>Intellectual merit: This EAGER project takes advantage of two existing comparison groups in introductory classes that are being taught the same two semesters at the University of California San Diego, one traditional and one using media computing. Students are surveyed to support the hypothesis that teaching computing through a more attractive domain such as media computing will result in better attitudes toward computing among both majors and students who take computing courses to complement their majors. The existence of two viable and significantly large comparison groups is fortunate and provides results of interest to the computer science education research community. This first round of data, expected to support the hypothesis that motivating context will improve attitudes toward engagement in computing classes and immediate intent of students to continue in computing classes and major, enables future projects that examine effects on more enduring retention.<br\/><br\/>Broader impacts: This lays out a comparative study showing key data that will assist other computing departments in making decisions about curricular change to improve recruitment and retention. Specifically, the attitudes of students taking CS1 with media computation is analyzed and compared to students who are taking a traditional CS1 class absent the hypothesized motivating context. These results are informative to departments that seek an increased number of students applying to their departments, greater numbers of students succeeding in their programs, and overall a student body that is more engaged and positively inclined towards the value of computing in their career and in society.","title":"EAGER: Transforming Attitudes via Best Practices CS1","awardID":"0933635","effectiveDate":"2009-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7494","name":"CCLI-Type 1 (Exploratory)"}}],"PIcoPI":["558312"],"PO":["564181"]},"152382":{"abstract":"The value of social computing environments has been demonstrated in many contexts, including web search, shared bookmarking and photo sharing, personal social networking, online support groups, and information resources such as Wikipedia. Collaborative game environments have been used as both research environments to study collaboration and as environments for facilitating scientific meetings, and professional organizations and scientific communities also leverage cyberinfrastructure and social network applications to share resources, collect data, and facilitate communication. Virtual worlds have also been applied to support a diverse range of professional and work activities, however, there is so far little empirical evidence on how virtual worlds are adopted and leveraged to promote scientific progress. The exploratory research proposed here aims to explore how virtual worlds can be leveraged in the digital curation community for purposes of improving work practices and training.","title":"SGER: Collaborative Research: Curatorial Work and Learning in Virtual Environments","awardID":"0910183","effectiveDate":"2009-04-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["550462"],"PO":["469867"]},"146431":{"abstract":"ABSTRACT<br\/>CAREER: Theories and Applications of Efficient Separator and Randomization<br\/><br\/>The goal of this project is to study efficient separator and randomization theories and technologies with applications to algorithm design. Separator and randomization are basic tools of designing algorithms for many applications problems. A separator is often used to decompose a difficult computational problem into smaller and easier ones, and then to solve the problem with a divide and conquer strategy. Randomization is widely used to speed up computation by sampling a small number of cases from a large number of possibilities. In order to attack challenging computational problems, such as protein 3D structure prediction, more efficient decomposition methods are expected to be developed. This project unifies the two approaches of separators and randomization because of their close connection. This unified approach helps the development of sublinear time algorithms, which are usually based on random sampling. <br\/><br\/>The decomposition methods are studied from low dimensional geometric spaces to high dimensional spaces and to general graphs and to algebraic computation. Proving the existence of a separator will get new insights into combinatorial nature of a given problem. Finding a separator efficiently is also an interesting algorithmic problem itself and often uses randomized methods. On the other hand, the research on complexity theory related to randomness is a part of this project, which includes the research about some lower bounds for randomization methods and the limitation of derandomization. A potential application of separator theory is protein folding prediction. A more efficient decomposition method will bring faster algorithm for this significant problem in science. As this project combines decomposition with randomization, the results of the research make new contributions to the core area of computation theory and discover applications in the field of bioinformatics. Education is an integral part of this project. Minority graduate students and female graduate students are involved in the protein 3D structure related algorithm design and web-server implementation. A randomized computation course for both undergraduate and graduate students is developed.","title":"CAREER: Theories and Applications of Efficient Separator and Randomization","awardID":"0845376","effectiveDate":"2009-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["557183"],"PO":["565157"]},"156045":{"abstract":"This is funding to support attendance by approximately 4 senior graduate students and recent PhDs from VR research groups in academia, industry, the military, and government, at the IEEE Virtual Reality 2009 conference, so that they can participate as panelists on a student panel. IEEE VR is the premier international conference and exhibition in virtual reality. It provides a unique forum for interaction among leading experts in VR and closely-related fields such as augmented reality, mixed reality, and 3D user interfaces, who come together to share their work and in turn to be exposed to the latest work from a worldwide contingent of researchers, as well as to renew friendships and make new ones. The IEEE Virtual Reality 2009 conference will be held in Lafayette, Louisiana, on March 14-18, 2009. Virtual Reality is reaching a crossroads, moving from hype-fueled field to one of serious application, evaluation, and study. And those who will transform the field are the senior graduate students and recent graduates in VR research groups and companies across the world. These \"next-gen\" VR pioneers need a stronger voice in the field, and the \"current-gen\" VR researchers and developers need to hear that voice. IEEE VR has a long tradition of strong student participation, with an extensive student volunteer program, fair student conference rates, and strong student interest. However, aside from presenting papers students have had few opportunities to play an active role in the conference. The student panel, which has been accepted for inclusion in the 2009 conference program, will provide a platform for students to participate in forming longer-term visions. This panel will be the third of its kind, following in the footsteps of very successful and well attended predecessors in 2007 and 2008. This year's discussion will focus on two main topics: building a career in VR, and evolving the IEEE VR conference. A moderator will lead the discussion with a focus on involvement by students, but while preference will be given to questions from students in the audience senior researchers will also be encouraged to contribute advice. The PI has committed to being proactive in order to ensure diversity among the panelists, including members of traditionally under-represented groups and women. <br\/><br\/>Broader Impacts: The IEEE VR 2009 student panel will provide a unique vehicle for broadening participation by under-represented groups in the conference, while also affording an opportunity for young researchers to network, cultivate ideas, and create a sense of community ownership. The ideas of the future pioneers of the VR field will be of significant interest to all conference attendees. The establishment of this annual series of student panels at the IEEE VR conferences will serve as a model to other conference organizing committees.","title":"Student Panel at IEEE Virtual Reality 2009","awardID":"0923897","effectiveDate":"2009-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[416130],"PO":["565227"]}}