{"122452":{"abstract":"This research investigates self-organizing systems: (1) how to engineer self-repairing distributed computing systems, (2) how to understand robustness in multicellular biology. The goal is to provide<br\/>a fundamental understanding of the basic principles underlying robustness and adaptability in multicellular biological systems, and demonstrate how these principles can be applied to computing systems.<br\/>Many areas in computer science critically depend on the ability to easily program robust collective behavior from massively-parallel substrates, from traditional computer networks to modular robotics.<br\/>This research will significantly improve our ability to design computing systems that self-organize, self-heal, and adapt. This research will also impact biology by providing novel insights into<br\/>tissue development and disease.<br\/><br\/>This research has two main thrusts: (1) using insights from self-maintaining and self-healing behavior in multicellular organs, such as the heart, to design algorithms for embedded distributed systems, such as wireless sensor networks (2) developing computational models of cell level behavior, based on experimental data, that can predict novel system-level properties in epithelial tissues. These efforts will contribute to a deeper understanding of how global robustness is achieved from the decentralized interactions of large<br\/>numbers of identically-programmed, unreliable agents.","title":"CAREER: Self-Organizing Systems: Engineering and Understanding Robust Collective Behavior","awardID":"0643898","effectiveDate":"2007-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["563386"],"PO":["565223"]},"131694":{"abstract":"This is funding to support the first-ever U.S. conference on persuasive technology, to be held April 26-27, 2007, at Stanford University (BJ Fogg, Conference Chair). Investigation into persuasive technology began in 1993 when BJ Fogg began his doctoral work at Stanford to investigate how computing technologies, from websites to mobile phone software, could be designed to influence people so as to change beliefs and behaviors. Trained as an experimental psychologist by professors Cliff Nass and Byron Reeves, Fogg has continued his work until today, teaching at Stanford and running a scientific research lab on campus. Fogg's 2003 book \"Persuasive Technology\" helped bring understanding and focus to this emerging domain, and inspired a group of academics at the Technical University of Eindhoven to host the First International Conference on Persuasive Technology in 2006, at which Fogg was the keynote speaker. That event attracted 140 academics, scientists, and practitioners from around the world, and the 28 peer-reviewed papers were published in a volume by Springer Verlag. This year's event is a direct outcome of that success; locating this first-ever U.S. conference on persuasive technology at Stanford is appropriate, in light of the role Stanford has played in shaping this domain. The research presented will be empirical in nature, drawing mostly on methods from the social sciences, the specific papers to be presented being selected from among over 80 papers received by the submission deadline and currently being evaluated by 42 reviewers through a blind peer-review process. The conference will adopt a single-track format that allows time for questions and discussion. Because of the event's location in Silicon Valley and Stanford's connection to persuasive technology, the organizers expect this conference to attract a large number of participants, and they are specifically encouraging graduate students to participate by offering reduced registration fees for students, a poster session, and deeper involvement for 12 student volunteers, who will attend the event without charge in exchange for their help. The peer-reviewed papers will be published as conference proceedings and distributed after the event; the presentations and discussions will also be videotaped, to allow sharing the content with a larger audience. A key goal of the conference is to build a coherent community of researchers; with this objective in mind, the organizers plan to hold monthly online gatherings after the conference using a new Internet service designed for large online discussions. Additional information relating to all aspects of the conference can be found at www.persuasivetechnology.org.<br\/><br\/>Broader Impacts: Bringing together the world's experts on persuasive technology will help accelerate our understanding of how computers can motivate and influence people. The exchange of research findings and methods at this conference will improve the quality of our scientific community's work in two ways: we'll be better able to ask interesting research questions because we'll have a broader understanding of the domain, and we'll have access to a wider range of research methods proven by others in the community. The conference will also serve as inspiration and invitation for graduate students to do new research in persuasive technology. Perhaps most importantly, the conference will hasten our understanding of how to use computers to motivate people in beneficial areas such as health promotion, environmental conservation, elder care, and education. As we learn to use computers to solve problems in these important domains, we will be able to improve quality of life for individuals and save money for government and NGOs in addressing some of today's biggest problems.","title":"Persuasive Technology Conference at Stanford University - April 26-27, 2007","awardID":"0732353","effectiveDate":"2007-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[349741],"PO":["565227"]},"122410":{"abstract":"CAREER: Design Methodologies for Three-Dimensional Integrated Circuits<br\/>PI: W. Rhett Davis, <br\/>INST: North Carolina State University, Raleigh NC 27695-7911<br\/>Proposal no: 0643700<br\/><br\/>ABSTRACT:<br\/><br\/>The semiconductor industry has succeeded in shrinking transistors on integrated circuits for more than 40 years, giving us dimensions now in the tens of nanometers and a market that expects new, faster chips every year. Although quantum-mechanical limits of shrinking have not yet been reached, the cost of manufacturing equipment is becoming prohibitively large, and industry experts are struggling to find ways to justify this cost. One promising approach is to stack chips vertically, thereby meeting the market's demands and re-using existing equipment to sell more chips. This process of stacking, often called three-dimensional integrated circuits (3D ICs), has been shown in prototype circuits to successfully increase the number of transistors on a chip, but it has not yet been shown to give significant improvements in speed. Theoretically, 3D ICs can increase the speed of circuits by a factor of two to five, depending on the application. The goal of this work is to experimentally discover and document the design techniques that will enable these speed improvements for 3D ICs in three ways: improved memory design, improved analysis of heat flow, and a search for applications that are especially well suited for 3D ICs. <br\/><br\/>In addition to scientific discoveries, this project seeks to improve engineering education by developing a free design-kit for the latest integrated-circuit technology. All design-kits developed since 1998 have strict intellectual property controls, limiting educators' ability to use and expand them. This sub-project, called the FreePDK project, will build on the latest, most successful free design-kit with a thorough literature search and collaboration with industry, providing a much-needed boost to education and small businesses.<br\/><br\/>Finally, an outreach partnership with a local community center and national education foundation will promote interest in low-cost electronics among disadvantaged students. A nationally distributed workshop curriculum to build crystal radios and a wirelessly-controlled robot will be developed tested each summer with forty middle-school and high-school students.","title":"CAREER: Design Methodologies for Three-Dimensional Integrated Circuits","awardID":"0643700","effectiveDate":"2007-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["332139"],"PO":["562984"]},"130396":{"abstract":"The East Coast Computer Algebra Day, ECCAD'2007, meeting, will be held at Washington College in Chestertown, MD on Saturday April 21, 2007. The meeting is the fourteenth of the series of ECCAD meetings that have been held annually since 1994 at a variety of US East Coast locations. We estimate a turnout of about 80-100 participants from the Computer Algebra research community, doing either theoretical research or important applications in science and engineering. There will be three very distinguished invited speakers: David Stoutemyer (Hawaii), Evelyne Hubert (INRIA), and George Labahn (Waterloo). Participants will come mainly from the eastern half of North America and especially from the East Coast of the United States. In addition to the invited talks there will be contributed poster and software demonstration sessions, and a moderated panel discussion: \"What IS Computer Algebra?\".","title":"East Coast Computer Algebra Day 2007","awardID":"0725750","effectiveDate":"2007-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":[346013],"PO":["565157"]},"122465":{"abstract":"Natural evolution has an amazing ability to produce elegant solutions to the challenges faced by living systems. As these challenges become more complex, so too must the organisms that respond to them. Evolution is clearly a powerful force, yet it is difficult to gather sufficient data to understand how complex traits arise and are incorporated into the working whole. The twin goals for this project are to understand how evolution designs complex functions, and to apply this knowledge to solving complicated computational problems. To accomplish this, the investigators will use \"digital organisms\" as a model system. These are self-replicating computer programs, subject to mutations and selection, that evolve complex features de novo in a natural evolutionary process. The investigators will use this system both for research purposes and as the basis of a teaching platform in biology classrooms and museum kiosks. <br\/><br\/>Populations of digital organisms are tractable and transparent, allowing researchers to study all aspects of the evolutionary design process. For example, the lineage of an evolved individual can easily be traced and the contributions of each mutation along the way can be quantified. The investigators will use these techniques to study several fundamental questions: How contingent are the outcomes of adaptive evolution on small random events? When populations reach evolutionary dead-ends, is it due to a single, severe 'wrong turn' in multidimensional genotypic space, or is this a more gradual process? How vital are deleterious mutations to promoting adaptive evolution? Are neutral mutations more important? How can these forces be harnessed to solve computational design problems? Finally, can harmful populations ( e.g., pathogens or evolving computer viruses) be forced into evolutionary dead-ends?","title":"CAREER: Digital Evolution and Biocomplexity - From Biological Theory to Computational Applications","awardID":"0643952","effectiveDate":"2007-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["425363"],"PO":["565223"]},"122377":{"abstract":"Federated sharing of dispersed pools of geographically distributed high-end computing resources under coordinated control is widely recognized as a promising paradigm for building and executing next generation distributed high performance applications. However, the autonomous, heterogeneous and decentralized nature of participating peers across multiple administrative domains introduces two challenges.<br\/>One challenge is effective decentralized resource management, which includes introducing incentives for peers to provide good services, self-adaptive resource sharing in different situations and optimal resource allocation. The other challenge is efficient system management, which includes self-defensive system management and user friendly management interfaces. Efficient system management makes the system easy to maintain and use and reduces the system management cost, which is extremely important for large scale systems.<br\/><br\/>This investigator conjectures that the fundamental problem of resource sharing is a dependable mechanism for resource trading. Given this trading mechanism, it is easy to build several high level resource management services, such as service level agreements, optimal resource co-allocation, advance reservation, and dynamic adaptation and reconfiguration. This research consists of four components: (1) An adaptive, personalized trust model named aPET to be employed by individual peers for trustworthiness derivation; (2) A trust-based economic model M-CUBE to efficiently express resources thus to provide a powerful foundation for resource allocation and management; (3) Efficient resource allocation scheme across multiple sites and investigating the impact of trustworthiness provided by aPET on resource allocation schemes; and (4) Applying the proposed trust and economic models to provide efficient system management. The research is expected to serve as a fundamental component and has the extraordinary potential to be deployed and adopted by several high-end computing communities, which require collaboration of geographically distributed resources.","title":"CAREER: Mechanisms for Resource Sharing in Collaborative High-End Computing Platforms","awardID":"0643521","effectiveDate":"2007-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["563661"],"PO":["565272"]},"131089":{"abstract":"Proposal 0728898<br\/>\"The Second Northeast Student Colloquium on Artificial Intelligence\"<br\/>PI: Joseph Y. Halpern<br\/>Cornell University<br\/><br\/><br\/>ABSTRACT<br\/>This award will help to subsidize the participation of graduate students in the second Northeast Student Colloquium on Artificial Intelligence (NESCAI) to be held April 13-15, 2007 at Cornell University in Ithaca, New York. This conference is to include oral and poster presentations by students and invited talks and tutorials by senior AI researchers. The conference will be largely run by a program committee consisting of doctoral students under the guidance of senior faulty, particularly the PI. The program committee will conduct a review process to select the projects chosen for oral presentations. In addition to graduate students, the conference plans to encourage attendance by a few outstanding senior undergraduates in the hope that it will increase their enthusiasm for research and thus the likelihood that they will go on to graduate work.","title":"The Second Northeast Student Colloquium on Artificial Intelligence","awardID":"0728898","effectiveDate":"2007-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["516488"],"PO":["387198"]},"131772":{"abstract":"This project supports the organization of the annual CISE PI meeting for REU Sites. The meeting is to be held in April, 2007 in San Jose, CA. An executive committee of CISE REU Site PIs, led by the PI of this award, is organizing the meeting. The PI meeting provides an opportunity for REU site PIs to network and share details about their sites. The PI meeting provides an excellent mechanism to sustain and improve the well-developed CISE REU Site PI community and promote collaboration and success through participation in the community. <br\/><br\/>The intellectual merit of this project lies in strong team that is leading the effort. The leadership team includes three individuals who are respected for their research as well as their involvement of undergraduates in their research. The meeting includes opportunities for the PIs to promote their own sites and research, as well as to develop ideas for increasing the value of the REU site program as well as enhancing the many research efforts that are the foundation of the REU site experience.<br\/><br\/>The broader impacts of the project include providing a quality research experience for undergraduate students, particularly students from underrepresented groups and community college students. The REU Site program is one of the most effective ways of transitioning undergraduates to graduate school. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning. The project will also provide a better technically educated workforce to meet national security and economic priorities.","title":"Computer and Information Science and Engineering (CISE) 2007 Research Experiences for Undergraduates (REU) Site Principle Investigator Meeting","awardID":"0732604","effectiveDate":"2007-04-15","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["505531"],"PO":["564181"]},"120651":{"abstract":"ABSTRACT<br\/>CNS 0634338 - PI Lecia Barker, Univ. of Colorado - Boulder<br\/>CNS 0634278 - PI Tracy Camp, Colorado School of Mines<br\/>CNS 0634502 - PI Alice Agogino, Univ. of California - Berkeley<br\/>TITLE: Collaborative Research: BPC-DP: Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS)<br\/><br\/><br\/>This collaborative project builds a digital repository of educational resources and practices shown to be effective in increasing the participation of underrepresented groups in information technology. Three collaborating institutions, the University of Colorado - Boulder, the Colorado School of Mines, and the University of California - Berkeley are developing Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS) resource. The project includes technical development of the resource engine as well as data organization, a rating system, and a review process. Central to the effort is the engagement of a user community to test the usability of the PAIRS resource as well as to pilot effective uses of the resource. PAIRS is to be made available to educators and others through a variety of dissemination methods and outreach programs.<br\/><br\/>The intellectual merit of this project lies in its potential to support both the research community conducting research on increasing the participation of underrepresented groups in computing as well as to provide essential evidence to those developing intervention implementations for broadening participation. The research and review in developing the best practice materials in the resource also provide a central source of effective strategies as well as a credible, research based body of information. The project team has excellent expertise in all aspects of this project and should develop a resource for which there is a great need within the computing community into which it will be integrated.<br\/><br\/>The broader impacts of the project lie with the potential to impact many projects aimed at broadening participation and thus fundamentally play a role in increasing participation in computing. While many effective practices for increasing participation in computing exist and are available, underrepresentation persists and continues to be a major challenge to developing the diverse computing workforce needed to meet our national needs for the future. PAID develops a set of quality materials and provides access and visibility to them, thus greatly increasing the opportunities for others to choose appropriate sound resources to address broadening participation in computing.","title":"Collaborative Proposal: BPC-DP: Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS)","awardID":"0634278","effectiveDate":"2007-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["546219"],"PO":["564181"]},"122499":{"abstract":"The construction and validation of reliable multi-threaded programs is extremely difficult. Threads can improve performance on multi-processor machines and multi-core processors by enabling a program to execute more than one routine simultaneously, but unintended interactions between threads are hard to recognize during testing and are a common source of errors in deployed systems.<br\/><br\/>This research develops hybrid checkers that prevent unintended thread interactions by ensuring that a program's routines are atomic. A routine is atomic if its execution is not affected by and does not interfere with concurrently-executing threads. Previous work on static atomicity checkers (that inspect source code) and dynamic atomicity checkers (that monitor running programs) demonstrate the potential advantages of enforcing atomicity requirements. However, these approaches have precision or coverage limitations that reduce their ability to check large systems effectively. Hybrid checkers synthesize the best aspects of both techniques without suffering from these limitations.<br\/><br\/>The impacts of hybrid atomicity checkers, and their integration into a broad educational program, include improved software quality and better software engineering practices. Specifically, hybrid checkers provide a cost-effective mechanism for finding errors resistant to testing, are more usable and scalable than existing tools, and support a design methodology that encourages precisely specifying interactions between threads.","title":"CAREER: Hybrid Atomicity Checking","awardID":"0644130","effectiveDate":"2007-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["485938"],"PO":["523800"]},"124028":{"abstract":"National Science Foundation - Division of Chemical &Transport Systems Particulate & Multiphase Processes Program (1415)<br\/><br\/>Proposal Number: 0651628 <br\/>Principal Investigators: Walsworth, Ron <br\/>Affiliation: Harvard University <br\/>Proposal Title: Collaborative Research: Grain and Gas Motion in Dense Granular Flows <br\/><br\/>Nuclear magnetic resonance and magnetic resonance imaging (NMR\/MRI) will be used to noninvasively study the motions of grains and gas in two dense granular flow systems: the gas fluidized bed and vertical channel flow. This project will extend beyond previous NMR\/MRI studies of these systems in two key aspects: (a) a synchronous bubble-generation technique will be used to probe the space-time structure of bubbles in a fluidized bed, both with gas and grain NMR; and (b) gas motion and exchange will be explored in fluidized beds much larger than previously possible for NMR studies (up to 50 cm diameter), as a step towards studies of beds of direct engineering relevance. As a collaborative project, the proposed work will combine the expertise for NMR on grains in granular flows in the Candela lab at UMass, Amherst, with the expertise for hyperpolarized-gas NMR in the Walsworth lab at Harvard. This collaboration will be crucial for the synchronous-bubble experiments, to ensure that grain and gas data can be taken for identical granular flow states.<br\/><br\/>Intellectual Merit<br\/><br\/>Previous work on this project has used grain and hyperpolarized-gas NMR to explore the velocity field and gas-emulsion exchange in gas-fluidized beds, but due to the chaotic random occurrence of bubbles the ability to sharply test models has been limited. In this new project bubbles will be created synchronously with NMR acquisition, permitting a detailed picture of grain and gas motion to be built up. Current theoretical ideas on the glassy, history-dependent nature of dense granular fluids will be directly confronted, as will models of the gas flow and exchange mechanisms. Large-scale fluidized bed studied by low-field hyperpolarized-gas NMR. The applicability of conventional NMR to large systems is severely constrained by the need for a strong, uniform magnetic field over the entire sample volume. Hyperpolarized-gas NMR by contrast can function with much lower magnetic fields, practical for industrial-scale applications. As a step towards scale-up of NMR methods for granular media to industrial scales, a large-scale fluidized bed will be constructed in the existing low-field MRI setup and use hyperpolarized techniques to study the motion and exchange of gas. This collaboration is unique in its ability to perform this groundbreaking research of applying hyperpolarized gas NMR to a large-scale fluidized bed. <br\/><br\/>Gravity-driven vertical-channel (hopper or silo) flow is one of the basic granular shear flows, yet little information exists on its structure in 3D due to the lack of noninvasive probes. NMR\/MRI will be used to study the flow field and space-time correlation structure of gravity-driven vertical-channel flows. Proposed constitutive laws for dense granular shear flows will be tested and the growth and decay of correlated structures like force chains will be explored as the flow parameters are changed.<br\/><br\/>Broader Impacts<br\/>A strong tradition of involvement of undergraduates (including many from underrepresented groups) in research will be continued, alongside traditional graduate research and training. Existing cross-disciplinary, inter-institutional collaboration will be enhanced to bring novel NMR techniques such as hyperpolarized gas to bear on soft-matter physics problems. This large-scale low-field NMR project should pave the way for true industrial-scale applications of noninvasive NMR techniques.","title":"Collaborative Research: Grain and Gas Motion in Dense Granular Flows","awardID":"0651628","effectiveDate":"2007-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}}],"PIcoPI":["564899"],"PO":["517761"]},"122401":{"abstract":"Although the introduction of multi-core systems has increased overall processor speed without significantly increasing CPU clock rates, a significant speed disparity remains between the CPU core and main memory. Multi-level caches have long been used to bridge this gap. Conventional cache design favors applications with good locality. The community's understanding of locality, however, is more qualitative than quantitative. A quantitative understanding of locality is essential to exploit memory hierarchy and achieve maximal performance. The new generation of multi-core systems adds the challenge of quantifying data locality for multi-threaded programs.<br\/><br\/>This research models data locality as a function of three parameters: data size, path history, and thread count, relying on close cooperation among the compiler, the profiler, and hardware just-in-time monitoring. The compiler provides a global view of the program. The profiler, using traces, has a view of the run-time behavior of a program, but this view is based on only a limited number of training inputs. Although the hardware's view is run specific, its prediction, often depending on hardware buffers, is not always effective due to buffer size limitations. The cooperative model being developed combines the advantages of static analysis and run-time sampling and profiling, providing an accurate view of program locality for both single-threaded and multi-threaded programs. Given this model the project explores memory system performance including managing data movement in conventional multi-level cache as well as non-uniform cache architecture (NUCA) caches, reducing the memory traffic of a state-of-the-art hardware-only region prefetcher, and improving spatial locality of Java programs.","title":"CAREER: Modeling Data Locality For Next Generation Systems","awardID":"0643664","effectiveDate":"2007-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["382991"],"PO":["565272"]},"125514":{"abstract":"Biological systems are collections of elements that communicate However, the more profound quantifiable meanings of information and communication are often overlooked when considering biological systems. Information can be quantified, its flow can be measured and tight bounds exist for its conveyance between {transmitters} and {receivers} in a variety of settings. Furthermore, communications theory is about {\\em efficient} communication where energy is at a premium. Similarly, energy and its efficient use almost always plays a pivotal role in the description of biological systems. This exploratory work will cover a wide variety of problems in modern biology that involve large collections of cells (``multicellular systems'') from a communications theory perspective and determine if and when a communications theory framework confers any special benefit. Known organizational principles from multicellular systems will be applied to engineering problems which might share the same sorts of constraints and optimization metrics -- such as large multielement sensor networks.<br\/><br\/><br\/>The intellectual merit of this program lies in careful exploration of communications concepts applied to signaling within cells (cellular networks) and between cells (multicellular networks) where mainly cursory application has previously been pursued. The broader impact of developing an effective communications framework for biological systems which can both explain and predict the general behavior of multicellular systems is hard to overestimate. The most obvious impact areas are aging and age-related diseases such as cancer in biology, and distributed specification and assembly of robust structures in engineering. But, a multitude of other applications in biology and engineering are clearly possible.","title":"SGER: Communications Theory & Multicellular Biology","awardID":"0703708","effectiveDate":"2007-04-15","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["466323"],"PO":["565272"]},"122379":{"abstract":"Current understanding of many biological signal transduction processes consists of knowing key mediators and their positive or negative effects on the process as a whole, yet is increasingly recognized that these mediators function in concert with each other and with other possibly unidentified components. This CAREER award project integrates graph inference, network analysis and dynamic modeling approaches into a general framework for reconstructing and modeling biological signal transduction networks from partial and indirect knowledge. The methodology under development allows predictive modeling of partially characterized signaling networks where traditional frameworks cannot be applied.<br\/> The graph synthesis process represents indirect relationships as paths and finds the sparsest graph incorporating all experimental evidence via a minimal binary transitive reduction algorithm. New graph measures of redundancy and centrality are developed to incorporate interaction attributes (sign, timing, synergy) and to elucidate the topological constraints on the dynamical repertoire of signal transduction processes. Stochastic Boolean and piece-wise linear approaches are used to formulate predictive dynamic models of signal transduction networks. The methodology is applied to abscisic acid (ABA) induced stomatal closure, light-induced stomatal opening, and ABA inhibition of seed germination, complex plant biology processes that can eminently serve as model systems to better understand animal signaling.<br\/> A comprehensive interdisciplinary education\/outreach plan is implemented which includes but is not restricted to (i) incorporating a simulation component to teaching Solid State Physics, (ii) developing a course in modeling biological systems, and (iii) distilling the developed methods into software modules to be disseminated as bioinformatics services.","title":"CAREER: Graph Theoretical Inference and Predictive Dynamic Modeling of Signal Transduction Networks","awardID":"0643529","effectiveDate":"2007-04-15","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["547502"],"PO":["565223"]},"131532":{"abstract":"This Special Project award provides funding for approximately eighty-eight undergraduate and graduate students to attend the 2007 Grace Hopper Celebration of Women in Computing. The fourth Grace Hopper Celebration will be held on October 17-20, 2007 in Orlando.<br\/><br\/>The intellectual merit of this project lies in the access to the many technical presentations and researchers at the conference. In addition, students have the opportunity to participate in poster sessions and receive feedback from discipline specialists. The Grace Hopper Celebration provides a unique, supportive environment for intellectual discourse that is particularly appealing for women and other under-represented groups. <br\/><br\/>The broader impacts of this project deal with providing resources and support to students that will help them persist in their programs as well as access to avenues to continue through the IT workforce pipeline. Students who attend the Grace Hopper Celebration will be exposed to women who are creating, improving, and studying computer and information technologies who serve as role models and mentors. This travel scholarship support provides a unique opportunity to directly affect the careers of future computer scientists and increase the representation of women in computing.","title":"Scholarship and Travel Grants for the Grace Hopper Celebration of Women in Computing 2007","awardID":"0731378","effectiveDate":"2007-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["425926","529248"],"PO":["564181"]},"120664":{"abstract":"ABSTRACT<br\/>CNS 0634338 - PI Lecia Barker, Univ. of Colorado - Boulder<br\/>CNS 0634278 - PI Tracy Camp, Colorado School of Mines<br\/>CNS 0634502 - PI Alice Agogino, Univ. of California - Berkeley<br\/>TITLE: Collaborative Research: BPC-DP: Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS)<br\/><br\/><br\/>This collaborative project builds a digital repository of educational resources and practices shown to be effective in increasing the participation of underrepresented groups in information technology. Three collaborating institutions, the University of Colorado - Boulder, the Colorado School of Mines, and the University of California - Berkeley are developing Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS) resource. The project includes technical development of the resource engine as well as data organization, a rating system, and a review process. Central to the effort is the engagement of a user community to test the usability of the PAIRS resource as well as to pilot effective uses of the resource. PAIRS is to be made available to educators and others through a variety of dissemination methods and outreach programs.<br\/><br\/>The intellectual merit of this project lies in its potential to support both the research community conducting research on increasing the participation of underrepresented groups in computing as well as to provide essential evidence to those developing intervention implementations for broadening participation. The research and review in developing the best practice materials in the resource also provide a central source of effective strategies as well as a credible, research based body of information. The project team has excellent expertise in all aspects of this project and should develop a resource for which there is a great need within the computing community into which it will be integrated.<br\/><br\/>The broader impacts of the project lie with the potential to impact many projects aimed at broadening participation and thus fundamentally play a role in increasing participation in computing. While many effective practices for increasing participation in computing exist and are available, underrepresentation persists and continues to be a major challenge to developing the diverse computing workforce needed to meet our national needs for the future. PAID develops a set of quality materials and provides access and visibility to them, thus greatly increasing the opportunities for others to choose appropriate sound resources to address broadening participation in computing.","title":"Collaborative Research: BPC-DP: Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS)","awardID":"0634338","effectiveDate":"2007-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["510151","510151","510094"],"PO":["564181"]},"120675":{"abstract":"ABSTRACT<br\/>CNS 0634338 - PI Lecia Barker, Univ. of Colorado - Boulder<br\/>CNS 0634278 - PI Tracy Camp, Colorado School of Mines<br\/>CNS 0634502 - PI Alice Agogino, Univ. of California - Berkeley<br\/>TITLE: Collaborative Research: BPC-DP: Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS)<br\/><br\/><br\/>This collaborative project builds a digital repository of educational resources and practices shown to be effective in increasing the participation of underrepresented groups in information technology. Three collaborating institutions, the University of Colorado - Boulder, the Colorado School of Mines, and the University of California - Berkeley are developing Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS) resource. The project includes technical development of the resource engine as well as data organization, a rating system, and a review process. Central to the effort is the engagement of a user community to test the usability of the PAIRS resource as well as to pilot effective uses of the resource. PAIRS is to be made available to educators and others through a variety of dissemination methods and outreach programs.<br\/><br\/>The intellectual merit of this project lies in its potential to support both the research community conducting research on increasing the participation of underrepresented groups in computing as well as to provide essential evidence to those developing intervention implementations for broadening participation. The research and review in developing the best practice materials in the resource also provide a central source of effective strategies as well as a credible, research based body of information. The project team has excellent expertise in all aspects of this project and should develop a resource for which there is a great need within the computing community into which it will be integrated.<br\/><br\/>The broader impacts of the project lie with the potential to impact many projects aimed at broadening participation and thus fundamentally play a role in increasing participation in computing. While many effective practices for increasing participation in computing exist and are available, underrepresentation persists and continues to be a major challenge to developing the diverse computing workforce needed to meet our national needs for the future. PAID develops a set of quality materials and provides access and visibility to them, thus greatly increasing the opportunities for others to choose appropriate sound resources to address broadening participation in computing.","title":"Collaborative Proposal: BPC-DP: Practices Aggregation, Infrastructure, and Retrieval Service for Broadening Participation in Computing (PAIRS)","awardID":"0634502","effectiveDate":"2007-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["555580"],"PO":["564181"]},"123601":{"abstract":"It is well known that exposure of undergraduates to research often leads to a positive decision about pursuing graduate degrees. Program such as the current REU Site grant in CS at TAMU have been very effective with increasing our numbers of women and minorities in our graduate program. For example, from the 2004 and 2005 REU site summer programs, 4 of the 16 REU students (or 25%) are enrolled in graduate programs at TAMU, of which 2 are women or minority. The objectives of the proposed renewal REU site are: (1) exposure of diverse undergraduates to exciting research in Computer Science with the goal of having the students pursue a graduate degree and (2) exposure of diverse undergraduates to a career as a faculty member. <br\/><br\/>The computer science field lags behind in numbers of ethnic minorities and women in the graduate program. This project directly benefits these students by having a program that provides an opportunity for women and minorities, in particular, to participate in the research projects, be exposed to various role models, and form communities that can exist beyond the program. Each REU student will have a faculty advisor and a graduate student mentor. The research projects will focus on seven core areas that reflect the current expertise in the department: Foundations of Computing; Human-Centered Systems; Information; Intelligent Systems and Robotics; Software; Software Engineering and Systems. These areas are critical to emerging multi-disciplinary areas, such as bioinformatics, computational science, and humanities informatics. Students will have an opportunity to work in depth in the core area or with the application of the core area to an emerging, multi-disciplinary area.","title":"REU Sites: Renewal for the Department of Computer Science at Texas A&M University","awardID":"0649233","effectiveDate":"2007-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["410068","541641","561154"],"PO":["523800"]},"122534":{"abstract":"Developing efficient, scalable, correct, and precise program analyzers and optimizers is difficult. There is a long time, often up to a decade, before a new optimizing compiler is mature enough to be widely used. These difficulties hinder the development of new languages and new architectures, and can also discourage end-user programmers from extending compilers with domain-specific checkers or optimizers.<br\/><br\/>Techniques will be investigated for automatically generating efficient, scalable, correct, and precise dataflow analyzers and optimizers from a very high-level specification. The overarching theme is to understand the underlying principles behind designing program analyses and optimizations, and use this understanding to automate as much as possible the analyzer- and optimizer-writing process. Attempting to automate the process of writing analyzers and optimizers enables many new kinds of usage models for compilers, including: allowing end-user programmers to easily extend the compiler with domain-specific checkers or optimizers; allowing end-user programmers to continuously train the compiler, even after it is deployed, based on additional input-output examples; and automatically generating additional analyses when the optimizer discovers the need for new dataflow information, and linking these new analyses into the optimizer while in execution.","title":"CAREER: Automatically Generating and Processing Program Analyses and Optimizations","awardID":"0644306","effectiveDate":"2007-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["521726"],"PO":["523800"]},"122545":{"abstract":"This research will study ways in which several collocated devices may be enabled to work together as a system and take advantage of the unique characteristics of collocation. Specifically, the research seeks to explore and evaluate the use of embodied mobile agents (EMAs) -- animated agents that can transfer seamlessly among different devices -- as one potential solution to the problem of multi-device interaction. The move in many societies toward individuals using multiple networked computational devices -- workstations, notebooks computers, mobile phones, PDAs -- radically changes the ways in which people engage those devices. However, we lack interaction paradigms that support a coherent experience across these technologies and enable them to work as systems of collocated devices. Therefore, this research will develop technological and interactional solutions that promote learning, engagement, accessibility and collaboration across heterogeneous networks of collocated computational devices.<br\/><br\/>This work will integrate and build on previous research in a variety of research fields including autonomous agents, human computer interaction, computer graphics, mobile computing, computer supported learning, and other areas. By expanding on these domains, the research will advance the state of the art in understanding how people can work simultaneously with multiple devices. By developing theoretical and practical foundations for collocated device systems, this research lays the groundwork for many new kinds of multi-device interactions. And by rigorously evaluating specific implementations, the research will help pave the way for wider-scale adoption of collocated device systems.<br\/><br\/>This research effort is closely coupled with two educational programs: a series of informal science education museum exhibits based on a system of collocated devices, and an interdisciplinary educational effort at the University of California, Irvine. The museum exhibits are being designed in collaboration with ecologists, educators and science centers around the country to help 8-12 year old children learn about restoration ecology. The educational work at the university involves the engagement of students from several departments in collaborative research projects and the design of several new courses. The integration of computer science and applied fields will help make the research more relevant to the interests of female students.<br\/><br\/>Systems of collocated devices enabled by this research could be applied to numerous areas including collaborative work settings, educational exhibits, and new entertainment media. By producing innovative research, by developing a publicly available interactive educational tool, and by building partnerships both within the university and to the external community, this project will provide significant benefits to society.","title":"CAREER: An Agent-Based Approach to Human-Computer Interaction for Systems of Collocated Devices","awardID":"0644415","effectiveDate":"2007-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["422697"],"PO":["564456"]},"130058":{"abstract":"This award supports the \"Visualizing Network Dynamics\" Competition intended to cull some of the world's best dynamic network visualization results to be exhibited at the 2007 International Workshop and Conference on Network Science (NetSci07), held in the New York Hall of Science, May 20 - 25, 2007.<br\/><br\/>The competition is designed to attract researchers, practitioners, and educators from such diverse disciplines as anthropology, sociology, history, social psychology, political science, human geography, biology, economics, communications science but also art and design to submit the best-of visualizations of evolving networks, activity patterns over networks or combinations of the two. Competition applications comprise of large resolution static images or video footage together with a detailed explanation of datasets used, analysis or modeling techniques applied, and the visualization design. Applicants are also asked to list and explain major insights gained and to discuss the value the visualization may have for educational purposes.<br\/><br\/>The competition plans to feature the winning entries that support insight and decision making network dynamics visualizations (as opposed to purely artistically appealing images or videos). In addition, it aims to raise the bar for the documentation and communication of the process applied to generate those visualizations, and to sensitize people to the importance of visualization for education.<br\/><br\/>The winning entries will be recognized and all valid entries will be made available online via the NetSci07 Web site (http:\/\/www.nd.edu\/%7Enetsci\/) as a general, free resource for anybody interested in the study or communication of dynamic networks. Online dissemination is expected to improve diverse network science related scientific, engineering and\/or educational activities.","title":"III: \"Visualizing Network Dynamics\" -- Competition at the International Conference on Network Science 2007","awardID":"0724282","effectiveDate":"2007-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["519649","526223"],"PO":["563751"]},"120797":{"abstract":"In order to simulate physical phenomena, such as fluid flow or electromagnetism, one must map the underlying equations to algorithms that can execute efficiently and reliably on a computer. This process of mapping involves discretization, for example, mapping a smooth surface to a triangle mesh. To ensure that the resulting computations are still meaningful this discretization step must be performed so as to preserve as many of the important physical structures as possible. In mathematical terms one must find discrete analogs for the operators of differential and integral calculus which follow the same theorems and structures as their abstract mathematical counterparts. To this end the PI together with his students will bring tools from geometric modeling (subdivision schemes) to the construction of discrete basis forms (which are the foundation of suitable numerical algorithms). Such tools will enable higher order and more accurate simulation of the equations at the heart of physical phenomena of interest. Building such foundational algorithms for numerical simulation will increase their reliability and speed and extend their impact in numerous scientific and engineering disciplines. <br\/><br\/>When discretizing partial differential equations for purposes of numerical simulation much emphasis has been placed on numerical accuracy, stability, and convergence. Only in recent years has it been fully appreciated that preservation of continuous structures such as symmetry groups and their associated momenta can have equally dramatic impact on the performance of numerical simulations, and in some cases appears to be essential to fully predictive simulations. Discrete Exterior Calculus has emerged as a framework in which to study such discrete realizations of the basic operators of integral and differential calculus. So far the underlying theory has essentially been one of local approximation without attendant global smoothness properties (in fact, much of it has been piecewise linear only). This research uses tools known from the construction of refinable functions to construct smooth bases of discrete differential k-forms on simplicial three manifolds (with boundary). In particular the underlying deRham complex is induced by the simplicial co-boundary operator. Piecewise linear forms of this type have been known classically. The research team recently demonstrated that the concept of refinability together with certain discrete commutative relations are sufficient to produce bases of higher smoothness in the simplicial two manifold setting. The three manifold case (using tetrahedra rather than triangles) is considerably more challenging since no regular tetrahedralizations of three space exist. Furthermore the smoothness analysis of the resulting constructions will require new tools since new classes of singular cases need to be examined and standard assumption of refinable function theory are violated. The researchers will both construct (in the sense of providing algorithms and their implementation) and analyze such constructions.","title":"Subdivision and the Construction of Smooth Bases for Discrete Differential Forms","awardID":"0635112","effectiveDate":"2007-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[320958],"PO":["562984"]},"130335":{"abstract":"Proposal 0725478<br\/>\"Natural and Artificial Intelligence An International Workshop at Oxford University (Oxford)\"<br\/>PI: Paul R. Cohen<br\/>University of Southern California<br\/><br\/><br\/><br\/><br\/>ABSTRACT<br\/><br\/>This proposal will subsidize in part the participation of experts from the U.S. in a three-day workshop to be held June 24-27, 2007 at Oxford University in Oxford, England. The primary objective of the workshop is to bring together two remote scientific communities in artificial intelligence\/cognitive science and behavioral ecology to discuss various aspects of cognition in humans, other animals, and artificially intelligent systems. The goal is to elucidate general cognitive principles what the workshop organizers term universal models of cognition that apply in humans, animals and AI systems. A secondary goal of the meeting is to help establish collaborative research relationships among scientists in the contributing fields and among researchers from the US, Europe, and other countries. The workshop will involve approximately 30 experts from AI, cognitive science, behavioral ecology, and psychology. Approximately half will be from the U.S. This award will be used to help defray the costs (airfare, hotels, meals, etc.) for the U.S. attendees.","title":"Natural and Artificial Intelligence - An International Workshop at Oxford University (Oxford)","awardID":"0725478","effectiveDate":"2007-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["524130"],"PO":["565136"]},"130159":{"abstract":"This award funds a joint COST-IST (EU) and NSF (USA) NeXtworking 2007 Workshop on Future Internet Architecture held on April 19-20, 2007, in Berlin, Germany. There are three main objectives for the workshop:<br\/>. Identifying networking research challenges: The workshop focuses on identifying the main research challenges that must be addressed to lead to a future Internet architecture that addresses the many challenges of today's networks and the promising capabilities of tomorrow's technologies.<br\/>. Identifying requirements for experimental facilities: A closely related goal is to investigate the role of experimental facilities in supporting the research and the capabilities these facilities should have, as well as documenting the strengths and limitations of existing research testbeds.<br\/>. Facilitating collaboration between EU and US researchers: By bringing together researchers from the EU and US, the workshop will build stronger ties for joint research including organizing joint efforts on the design, and particularly the federation, of future experimental facilities. <br\/>The workshop targets key research areas in networking represented by premier researchers from the EU and USA, with an emphasis on the needs of future network architectures rather than summaries of mature research results. The workshop organizers are Christophe Diot (Thomson), Serge Fdida (U. Paris), Anja Feldmann (TU-Berlin), Jennifer Rexford (Princeton University), and Ioannis Stavrakakis (University of Athens), Jennifer Rexford will handle the NSF funding and Scott Kirkpatrick is handling the 30,000 Euros that COST is providing for the workshop. After the conclusion of the workshop, the organizing committee will furnish a report to the COST-IST (EU) and NSF (USA) and will make it publicly available to participants and others via the workshop Web site and any relevant funding-agency Web sites.<br\/><br\/>Intellectual Merit<br\/>The workshop focuses on the intellectual challenges of designing a future Internet architecture that is worthy of society's trust (in terms of important metrics such as scalability, reliability, security, manageability, usability, and other so-called X-ities) and expands the capabilities available to end users (including support for mobility and large numbers of wireless and sensor devices). At the NSF, these research challenges lie at the heart of the FIND (Future INternet Design) initiative. In addition, the workshop will include discussion of tools and techniques for evaluating new architectural ideas, including modeling, simulation and experimental tools and techniques for connecting multiple experimental facilities to enable larger-scale evaluation. <br\/><br\/>Broader Impact: The importance of the Internet for the economic, political, and social well-being of the nation, and the world, cannot be overstated. The workshop will play an important role in outlining a larger research agenda for the design of a future Internet. In addition, the workshop will enable a strong collaboration between EU and US researchers in networking research and the design and operation of global experimental facilities for evaluating new network architectures.","title":"NeXtworking 2007 Workshop on Future Internet Architecture","awardID":"0724719","effectiveDate":"2007-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["531675"],"PO":["565090"]},"129906":{"abstract":"This award provides support to approximately fifteen graduate students in the<br\/>United States to attend the 2007 SIAM Conference on Data Mining (SDM 2007), held in Minneapolis, USA from April 28th to April 30th, 2007 (http:\/\/www.siam.org\/meetings\/sdm07\/). This technical conference is the premiere venue for presenting new research results in the area of data mining, and is widely attended by researchers and practitioners in the field.<br\/><br\/>Attending this conference is of paramount importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with other graduate students as well as hundreds of other leading researchers in the area of data mining. The travel support targets graduate students with accepted papers and in particular women and under-represented minority students in order to enhance their educational experience and foster diversity in the data mining research area.","title":"III: 2007 SIAM Data Mining (SDM 2007) Conference Student Travel Support","awardID":"0723468","effectiveDate":"2007-04-15","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["532009"],"PO":["563751"]},"122427":{"abstract":"The prevailing model for digital preservation is that archives should be similar to a fortress: a large, protective infrastructure to protect a relatively small collection of data from attack by external forces. If data objects were not tethered to repositories, can we create objects that preserve themselves more effectively than repositories or web infrastructure can?<br\/><br\/>Intellectual Merit<br\/><br\/>This project will advance the science and engineering of digital preservation in several areas: complex digital object metadata formats, web object design, P2P algorithms, automatic format migration and object repository interaction. Some areas, such as the format migration services and migration preference language will be new contributions. Other areas will be a matter of novel adaptation, integration and deployment. Technical highlights of this proposal include:<br\/><br\/>i) Adopting flocking rules for data objects in digital libraries (DLs), thus allowing complex emergent behavior of the archived data objects from a small number of simple, easily implemented rules. ii) Making data objects responsible for the conversion and translation of their own holdings according to preferences that were specifed at creation time. The data objects will rely on transient, network-accessible services that are not attached to repositories. iii) Creating a preservation testbed with real content in self-preserving digital objects, repositories, and in the general web.<br\/><br\/>Broader Impacts<br\/><br\/>In many ways, creating and integrating the technology necessary for self-preservation will be straight-forward; raising peoples' expectations from passive digital objects to self-preserving digital objects will be the biggest challenge. For this reason, a series of longitudinal experiments about preservation in general as well as self-preserving digital objects will be integrated across the four-year undergraduate computer science curriculum at Old Dominion University. The complimentary relationship between preservation and software engineering will be stressed. The content will be of interest to students, thereby avoiding listless, perfunctory participation. One example will include preserving copies of old tests, assignments and projects content the students will be highly motivated to preserve. This kind of preservation (digital or nondigital) is already performed to some extent by fraternities and other memory organizations. This process will be codified and democratized with the appropriate information technology tools. The experiences reported by the students will be incorporated into future versions of the preservation software.","title":"CAREER: Self-Preserving Digital Objects","awardID":"0643784","effectiveDate":"2007-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["527258"],"PO":["543481"]},"122449":{"abstract":"In the face of current technology trends, the drive for faster, less power-hungry, and easier-to-program computers will fundamentally alter how we design computer systems. Niche-based computer systems address these challenges by combining a diverse range of specialized and semi-specialized processors into a heterogeneous computing fabric. The niche-based software components provide a uniform abstraction for this fabric that makes it easy for programmers to utilize.<br\/><br\/>Niche-based systems contain a configurable, non-uniform set of computing elements (CEs) that vary widely in capabilities, performance, and power consumption. The software runtime in a niche-based system provides a uniform abstraction and programming model for the non-uniform CEs. The runtime dynamically partitions programs across the CEs and translates them for execution. As a result, niche-based systems can exploit the power and performance advantages of specialized CEs to execute general-purpose computations more efficiently. Furthermore, niche-based systems can address the unintentional non-uniformity that manufacturing defects and device wear-out will cause in advanced process technologies.<br\/><br\/>The PI is proposing exploring the design space for each of the hardware and software components in a Niche-based system and constructing prototype implementations. These components include three key software systems: the Niche runtime system and the translators for generating executable code for a range of CEs, a partially automated system for specifying (and verifying via formal method techniques) the behavior of a CE and generating the required CE-specific translator, and a front-end compiler to generate executables for Niche-based systems. The PI is also constructing a prototype Niche- based hardware system from commercially available hardware.","title":"CAREER: Niche-based Systems: Uniform Abstractions for Non-uniform Hardware","awardID":"0643880","effectiveDate":"2007-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["518615"],"PO":["565272"]},"121724":{"abstract":"Proposal ID: 0639624<br\/>Title: Error Power and Reliability for Nano-Silicon and Beyond<br\/>PI: Sanjukta Bhanja<br\/>Institution: University of South Florida<br\/><br\/><br\/><br\/>ABSTRACT:<br\/>Over the years, the underlying design philosophy of electronic design and analysis tools has undergone paradigm shifts from area optimization to timing optimization to power optimization and now is shifting to reliability-centric design optimization. Understanding of the interplay between errors, power dissipation in a chip with its associated side effects, and reliability problems will be the key to commercial success of sub-30nm silicon and nonsilicon technologies. It is expected that statistical theories and probabilistic methods will play significant role in the design of such reliability-centric CAD tools. In this context, the career research goal of the PI is to construct reliability-centric design and analysis tools for the inter-coupled issues of error, power and redundancy for nano-CMOS and other emerging nano-devices, such as quantum-dot cellular automata. There are two main thrusts : one in medium term problems and the other in long term problems. First, in the medium term category are problems related to nano-CMOS for which the PI will research reliability-centric design optimization and analysis tools at logic level for error, power, and reliability of nano-CMOS, taking into account process variability and circuit topology. These models would allow probabilistic abstraction of technology-dependent parameters, such as device characteristics, process parameter variations, and thermal issues, in addition to, structural dependencies among the interconnected components and input uncertainties. In the long term category are problems in novel computing paradigms using emerging nano-devices such as field-coupled computing architectures using quantum-dot cellular automata. The basic issues considered will still be the same, i.e. error, power, and reliability; however, the modeling of these will be driven by the physics of these devices to a larger extent than nano-CMOS. The career teaching goals of the PI spans traditional pedagogic activities, such as developing new courses, and educational research related to VLSI education, such as testing the hypotheses that (a) active learning, based on sensory mode of a student, or (b) \"Learning by doing\" promotes deeper understanding of VLSI concepts.","title":"CAREER: Error Power and Reliability for Nano-Silicon and Beyond","awardID":"0639624","effectiveDate":"2007-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["380845"],"PO":["562984"]},"122529":{"abstract":"This research aims to develop a formal, integrated analysis framework based on a synergistic combination of various analysis techniques such as symbolic execution, model checking, static analysis, constraint solving, and theorem proving for reasoning about behaviors of open systems (whose computational structures are incomplete). The framework enables a holistic approach to quality-assurance of modern software systems for strong behavioral properties including contract checking, assisting code inspection and understanding, and automatic test case generation. Key technical challenges in providing such framework are scalability of the analysis and support for modular reasoning about deep semantic properties of software components that heavily use dynamically created heap objects, high-level programming constructs and abstractions (e.g., design patterns), libraries, and software frameworks. This project lays the foundation for a long-term investigation of an automatic formal analysis for open object-oriented systems that draws its strengths from significant advancements of various analysis techniques over the past several years. In addition to reasoning about strong functional properties, the approach can support a spectrum of software quality-assurance techniques for future investigations such as analyzing concurrency aspects, secure information-flow, and system event orderings (e.g., useful for checking protocol conformance of application programming interfaces).","title":"CAREER: A Formal, Integrated Analysis Framework for Contract-based Reasoning of Strong Properties of Open Systems","awardID":"0644288","effectiveDate":"2007-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[325387],"PO":["564388"]},"122808":{"abstract":"Quiescence is a poorly understood but universal state of cells on earth. Quiescent cells, from unculturable microbes to M. tuberculosis and stem cells, play important roles in the survival of all species. Dr. Werner-Washburne and co-workers have recently discovered that when yeast colonies exhaust glucose, cells in the culture undergo an asymmetric cell division leading to the production of a quiescent daughter cell and non-quiescent mother cell. The physiological and morphological differences between the quiescent and non-quiescent cells are remarkable and are reminiscent of the differentiation seen in the production of other quiescent cells, such as neurons and stem cells. This research project will examine the cell division after glucose exhaustion through a time-course analysis of changes in mRNA transcript abundance and identification of genes required for this process. mRNA will be studied using oligonucleotide-based microarrays. Genes required for the formation and survival of quiescent and non-quiescent cells will be identified using a yeast deletion set composed of approximately 6000 yeast strains, each carrying a deletion in a specific gene. Characterization of the changes in mRNA levels and mutants will lead to a better understanding of the development of vegetative, quiescent yeast cells. It will also lead to a better understanding of the evolutionary conservation of this asymmetric cell division and, thus, the role of this cell division in the production of quiescent cells in all organisms. The broader impact of this work comes from the cross-disciplinary interactions in the Werner-Washburne laboratory, with close collaborations in computer sciences and math, and from training of students from under-represented groups at the undergraduate, graduate and post doctoral levels.","title":"The Biogenesis and Survival of Vegetative, Quiescent Yeast Cells","awardID":"0645854","effectiveDate":"2007-04-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J265","name":"Defense Intelligence Agency"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1114","name":"Cellular Processes"}}],"PIcoPI":[325966],"PO":["565043"]},"128132":{"abstract":"The 5th USENIX Symposium on File and Storage Technology (FAST) is scheduled for February 2007. FAST is a leading forum for innovative research in storage systems, bringing in researchers and practitioners from both industry and academia. Topics include reliability, performance, mobility, power management, measurement, and other topics germane to file and storage systems. This NSF proposal requested funding to support the attendance of US-based graduate students. Participation in leading conferences is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work.<br\/>The support requested in this proposal makes possible the participation of students who would otherwise be unable to attend. Particular attention will be paid to directing support towards underrepresented minorities including women, African-Americans, and Native Americans.","title":"Workshop: NSF: Request for Funding for Student Participation in File and Storage Technology (FAST) 2007","awardID":"0716163","effectiveDate":"2007-04-15","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["550389"],"PO":["565272"]},"127023":{"abstract":"This research: (1) creates and deploys a spectrum observatory platform to collect spectral occupancy data (30 MHz to 3 GHz) for Chicago for one year; (2) analyzes the data on a weekly basis to identify anomalies (occupancy and vacancy); (3) projects future spectrum occupancy, including seasonal trends; and (4) results in a wide distribution of the findings to the wireless R&D and regulatory communities via the Web, workshops, conference and journal papers. This research provides a quantum enhancement in the raw quantity and quality of the spectrum occupancy information available to wireless researchers and regulators.<br\/>This grant supports collaborative research across and between academia, industry, and government entities enabling the rapid development of new wireless devices and networking concepts. In turn, the availability of this information and the techniques used provide a useful education platform, initially supporting graduate education at IIT. Minority students and women are engaged in the research, thereby deriving the ongoing benefit from this new knowledge. The US government communications policy-makers derive the greatest early benefit from this research. Currently information on spectrum occupancy is spotty at best, leading policy-makers to use worst-case analysis techniques that yield conservative policies and sub-optimal utilization of this scarce resource. Novel technologies including software definable and cognitive radios require an improved understanding of spectrum utilization to determine the most beneficial spectrum policy.","title":"NeTS - SGER - Chicago Spectrum Observatory Proposal","awardID":"0711094","effectiveDate":"2007-04-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["353259","560175","560174"],"PO":["434241"]},"123581":{"abstract":"This site is co-funded by the Department of Defense in partnership with the NSF REU program. It is also supported by the Directorates of Mathematics and Physical Sciences (MPS), Computer and Information Science and Engineering (CISE), and Social, Behavioral and Economic Sciences (SBE), in addition to the Directorate for Biological Sciences. Future advances in molecular biology depend critically on technology and ideas crossing over from the physical sciences and the computational sciences. Experimental techniques that probe materials at the nanoscale-level offer promising new views of living systems and modeling approaches based on pure theoretical and computational approaches offer new insights into biological systems. Our program provides a week-long hands-on introduction to molecular biology techniques and then a nine-week mentored research internship in laboratories. The research is aimed at fundamental questions in Biology that cut across the disciplines of Anthropology, Biology, Computer Science, Materials Physics and Materials Chemistry. Students will be further engaged in interdisciplinary ideas through discussions with participating faculty about their on-going research, scientific career options and ethics. In this context the REU program will seek to stimulate student interest in pursuing scientific research and to engage students in cross-disciplinary biological research, with particular emphasis on quantitative approaches. Students will be provided opportunities to enjoy the rich variety of Washington D.C.'s cultural and scientific venues. Nine students, who aspire to pursue research careers in the life, computational, and physical sciences will be selected for this ten week program. For more information contact Robert P. Donaldson or Mark E. Reeves 202-994-4039, robdon@gwu.edu, and visit http:\/\/bioinformatics.gwu.edu\/reu.","title":"REU Site: Molecular Biology, Bioinformatics and Biomaterials","awardID":"0649165","effectiveDate":"2007-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"7222","name":"OFFICE OF SPECIAL PROGRAMS-DMR"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"T370","name":"AIR FORCE-ASSURE PROGRAM"}}],"PIcoPI":["385364","552097"],"PO":["545311"]},"122460":{"abstract":"The ability to embed computation on the I\/O path creates exciting possibilities for accelerating a wide spectrum of data intensive applications, ranging from content-based retrieval of images stored on a personal computer to fusion of massive geospatial datasets. The presence of processing power at the storage devices, coupled with the location of these devices in the system, also opens up the opportunity to provide storage-centric computing services that run directly on the I\/O path. <br\/>However, harnessing a large amount of processing power on the I\/O path at a small energy cost requires extensive architectural support. This research project develops a storage-centric architecture in which the entire I\/O path is treated as a programmable and reconfigurable computational substrate. The research addresses several cross-cutting issues in electro-mechanical design, processor microarchitecture, and parallel programming. An integral component of this project includes the development of simulation tools and a hardware testbed for research and education in the area of adaptive active storage systems.","title":"CAREER: Architectural Techniques and Tools for Adaptive Active Storage Systems","awardID":"0643925","effectiveDate":"2007-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[325247],"PO":["565272"]},"125023":{"abstract":"CCF - 0635205<br\/>Title: Understanding Unreliable Computation: Theory and Practice<br\/>PI: Mohanram, Kartik<br\/>Inst: William Marsh Rice University<br\/><br\/>ABRSTRACT<br\/>Low reliability and performance variability are intrinsic to future electronic technologies, and loom large as potential show-stoppers to the commercial success of these exciting technology alternatives. The proposed research involves complementary research in the theory and practice of computation using unreliable circuits. It is proposed to investigate (i) information-theoretic, circuit-structure-independent limits for computation in the presence of noise and (ii) techniques for reliability estimation that are accurate, robust, and scalable with design complexity. <br\/><br\/>The outcomes of this research will help bridge the gap between the theory and practice of reliable computation using noisy circuits. Besides advancing fault-tolerant design, this will contribute to our understanding of the capacity of Boolean circuits and provide metrics for the maximum rate at which circuits can be operated reliably. The proposed research thus has the potential to further our understanding of the theory and practice of reliable and robust circuit design, and accelerate the evolution to new computing paradigms. The models and software resulting from this effort will have significant scientific value within the broader research community, and it is proposed to develop resources for their distribution. Through (i) an introductory undergraduate class in nano-electronics and (ii) a graduate class that delves into the technologies that will define the first generation of nano-computing systems, it is proposed to enhance awareness and understanding beyond traditional intra- and inter-disciplinary boundaries.","title":"SGER: Understanding Unreliable Computation: Theory and Practice","awardID":"0701547","effectiveDate":"2007-04-15","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["517951"],"PO":["562984"]},"122340":{"abstract":"Prop No: 0643319<br\/>Title: CAREER:Robust Design for Scaled CMOS Technologies<br\/>PI: Subhasish Mitra<br\/>Inst: Stanford University<br\/><br\/>Abstract<br\/><br\/>This project focuses on creating novel core technologies for designing robust computing and communication systems, and educating future generations of engineers who will be responsible for designing such systems with robustness as a fundamental design objective. Such systems constitute an inseparable part of human lives today, and will be further integrated in the future over a wide range of complex applications such as information appliances, transportation, health, bio-medical, and finance. The project is motivated by an imminent paradigm shift in hardware design resulting from the growing problem of hardware failures in future semiconductor process technologies. The traditional hardware design paradigm assumes that semiconductor process technologies always produce perfect hardware that will never operate incorrectly during its lifetime. Continuous push for smaller semiconductor process geometries also called technology scaling which is the key to the success of the semiconductor industry is approaching a point where such a design paradigm will be infeasible due to fundamental limitations. This project breaks this barrier by adopting the following principle: accept the fact that the underlying hardware will be imperfect, and develop technologies and tools for designing efficient, cost-effective, and failure-aware robust systems that ensure high quality of service, data integrity, availability, security and safety. This advancement in Computer Engineering will enable the semiconductor industry to continue technology scaling with immense impact on future electronic products. It is also expected that the research ideas developed in this project will have a far-reaching impact on robust designs in emerging revolutionary nanotechnologies far beyond contemporary CMOS technologies.","title":"CAREER: Robust Design for Scaled CMOS Technologies","awardID":"0643319","effectiveDate":"2007-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["559405"],"PO":["562984"]},"132141":{"abstract":"This proposal addresses the fundamental challenges in todays on-chip thermal sensing and control problems. The thermal sensing technique in even the most recent processors predominantly relies on thermal diodes or sensors. Both suffer from the fixed-location problem as on-chip hot spots migrate at run time. This project aims to develop novel techniques for spectrum and high precision temperature sensing to mitigate this problem. The proposed solutions can lead to more efficient and effective on-line thermal management. The intellectual merit of the project includes the development of a fast, lean, and accurate software thermal sensor for online temperature tracking. The software adopts a highly efficient and fine-tuned numerical method to calculate temperatures at a fine granularity both temporally and spatially. Experimentation will demonstrate its superior accuracy and speed, and hence the great potential of becoming a truly competitive remedy for chip temperature sensing.","title":"Fast Software Thermal Sensing and Control for Efficient Dynamic Thermal Management","awardID":"0734339","effectiveDate":"2007-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["508314"],"PO":["550859"]},"126630":{"abstract":"A set of small-scale human-computer dialogue corpora (\"micro-corpora\") is being transcribed and annotated, and distributed to researchers in the area of dialogue. The raw data for these corpora already exists and has been generated using two existing system (DiSCoH from AT&T labs and ConQuest from Carnegie Mellon University). The resulting corpora are being distributed to researchers in the field with the goal of soliciting feedback on the corpus composition and annotation that can best support research in the field of human-machine dialogue interaction. <br\/><br\/>Feedback from this exercise is being collated and disseminated back to the community. Discussion on the outcome of this exercise at a workshop collocated with the 2007 HLT\/NAACL conference provides the opportunity to develop a set of guidelines for the large scale collection of such data. The workshop collocation makes attendance convenient for many researchers in the dialogue community. In addition, support from NSF allows the workshop to ensure broad participation by researchers from both North America and international centers. Discussions and documents generated in the feedback and solicitation process provide a basis for the preparation of a community-supported proposal to the NSF CRI:CRD program. The availability of systematically collected and annotated data supports progress in human-computer dialogue research which in turn enables the development of more sophisticated and broadly-accessible technologies for information access.","title":"CRI:CRD Creation of a Goal-Oriented, Human-Machine Spoken Dialog Corpus and an Infrastructure for Dialog System Evaluation","awardID":"0709161","effectiveDate":"2007-04-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["338056"],"PO":["565215"]},"129820":{"abstract":"The Association for Computational Linguistics (ACL) will organize a Student Research Workshop (SRW) during the main ACL conference on June 25-27, 2007 in Prague, Czech Republic. The workshop will consist of full paper presentations followed by a discussion panel led by senior researchers as well as poster presentations. All selected work must have only student authors, and the workshop itself will be run by students. The Student Research Workshop provides a unique opportunity for students to receive feedback on their research from experts in the field and to make contacts with senior researchers as well as students from other universities. The SRW contributes to the maintenance and development of a skilled and diverse workforce in natural language engineering, provides a supportive environment for professional growth and interactions between young researchers and well-respected experts, and encourages a spirit of collaborative research.","title":"Student Research Workshop in Computational Linguistics at the ACL 2007 Conference","awardID":"0723076","effectiveDate":"2007-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["451671"],"PO":["565215"]},"130481":{"abstract":"This award supports a workshop jointly sponsored by the NSF Engineering and Mathematical and Physical Sciences Directorates, the NSF Office of Multidisciplinary Affairs, and the U.S. Intelligence Community (IC). The workshop discussions will address the basic research gaps and educational needs required to advance developments in small power sources for anti-terrorism activities. Participants from academia, industry, and government laboratories will contribute to discussions in five focus areas: (1) energy harvesting, (2) photovoltaics, (3) fuel cells, (4) batteries, and (5) systems integration, miniaturization, and packaging. The interdisciplinary cadre of engineers and scientists will become well informed regarding the current challenges and needs of the IC. A web-accessible report will describe energy capture, conversion, and storage as related to national security applications. These research topics also hold broad implications for the development of new, long-lived, portable devices in medicine, sensing, communications, and transportation.","title":"A Workshop Exploring the Role of Physical Sciences in Support of the Critical Basic Power Source Science Needs of the United States Intelligence Community","awardID":"0726204","effectiveDate":"2007-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1978","name":"PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1417","name":"CHEMICAL & BIOLOGICAL SEPAR"}}],"PIcoPI":[346234],"PO":["564370"]},"124585":{"abstract":"roposal Number: 0653951<br\/><br\/>PI: Stephanie Forrest <br\/>Institution: University of New Mexico <br\/><br\/><br\/>Title: Safe Computing Workshop: Introspective Hardware Architectures or Information Assurance <br\/><br\/><br\/>Abstract<br\/><br\/>The University of New Mexico will host a workshop on November 29 to December 1 towards the realization of a secure computing platform. There is a pressing need for a secure host, as most of the attacks on our nation's computer and networks systems exploit weaknesses in the end points, i.e., the host computers on which users run applications. This workshop will assemble experts from academia, industry (hardware and software communities) and US Government agencies to prepare an agenda for the development of a secure host, including the hardware base, the operating system, the interface to the users and to the network. <br\/><br\/><br\/>Topics to be covered in the workshop include:<br\/><br\/> Status of security tagged architectures<br\/> Pointer control and Memory layouts in a secure tagged architecture New Frontiers Enabled by Cheap Domain Crossings <br\/> Secure Programming Language<br\/> Zero Kernel Operating System, that is operating systems with essentially no security kernel <br\/> Formal Verification of Hardware, as one step towards a secure host<br\/> Advanced User Interfaces as a step towards a manageable system <br\/> Industry Roadmap out 5-10 years, to determine what industry can offer in hardware support for security <br\/> Legacy Systems and Applications, to previous work towards a secure host but also to determine how legacy systems can be accommodated on a newly-developed host processor and operating system Roadmap for Cryptography and Authentication, to determine how to interface the secure host to encrypted media and also how to selectively encrypt memory on the secure host <br\/> Attack Scenarios, to identify threats to the secure host for the purpose of designing to accommodate to such threats but also to look towards a red team exercise <br\/> Verification Assessment, to identify the feasibility of applying recent promising research in formal methods towards the verification of the secure host<br\/> Networking, to determine how to interface the secure host to network services, such as those being studied under NSF's GENI and FIND programs","title":"Safe Computing Workshop: Introspective Hardware Architectures for Information Assurance","awardID":"0653951","effectiveDate":"2007-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["461864"],"PO":["529429"]},"124002":{"abstract":"National Science Foundation - Division of Chemical &Transport Systems Particulate & Multiphase Processes Program (1415)<br\/><br\/>Proposal Number: 0651397 <br\/>Principal Investigators: Candela, Donald <br\/>Affiliation: University of Massachusetts Amherst <br\/>Proposal Title: Collaborative Research: Grain and Gas Motion in Dense Granular Flows <br\/><br\/>Nuclear magnetic resonance and magnetic resonance imaging (NMR\/MRI) will be used to noninvasively study the motions of grains and gas in two dense granular flow systems: the gas fluidized bed and vertical channel flow. This project will extend beyond previous NMR\/MRI studies of these systems in two key aspects: (a) a synchronous bubble-generation technique will be used to probe the space-time structure of bubbles in a fluidized bed, both with gas and grain NMR; and (b) gas motion and exchange will be explored in fluidized beds much larger than previously possible for NMR studies (up to 50 cm diameter), as a step towards studies of beds of direct engineering relevance. As a collaborative project, the proposed work will combine the expertise for NMR on grains in granular flows in the Candela lab at UMass, Amherst, with the expertise for hyperpolarized-gas NMR in the Walsworth lab at Harvard. This collaboration will be crucial for the synchronous-bubble experiments, to ensure that grain and gas data can be taken for identical granular flow states.<br\/><br\/>Intellectual Merit<br\/><br\/>Previous work on this project has used grain and hyperpolarized-gas NMR to explore the velocity field and gas-emulsion exchange in gas-fluidized beds, but due to the chaotic random occurrence of bubbles the ability to sharply test models has been limited. In this new project bubbles will be created synchronously with NMR acquisition, permitting a detailed picture of grain and gas motion to be built up. Current theoretical ideas on the glassy, history-dependent nature of dense granular fluids will be directly confronted, as will models of the gas flow and exchange mechanisms. Large-scale fluidized bed studied by low-field hyperpolarized-gas NMR. The applicability of conventional NMR to large systems is severely constrained by the need for a strong, uniform magnetic field over the entire sample volume. Hyperpolarized-gas NMR by contrast can function with much lower magnetic fields, practical for industrial-scale applications. As a step towards scale-up of NMR methods for granular media to industrial scales, a large-scale fluidized bed will be constructed in the existing low-field MRI setup and use hyperpolarized techniques to study the motion and exchange of gas. This collaboration is unique in its ability to perform this groundbreaking research of applying hyperpolarized gas NMR to a large-scale fluidized bed. <br\/><br\/>Gravity-driven vertical-channel (hopper or silo) flow is one of the basic granular shear flows, yet little information exists on its structure in 3D due to the lack of noninvasive probes. NMR\/MRI will be used to study the flow field and space-time correlation structure of gravity-driven vertical-channel flows. Proposed constitutive laws for dense granular shear flows will be tested and the growth and decay of correlated structures like force chains will be explored as the flow parameters are changed.<br\/><br\/>Broader Impacts<br\/>A strong tradition of involvement of undergraduates (including many from underrepresented groups) in research will be continued, alongside traditional graduate research and training. Existing cross-disciplinary, inter-institutional collaboration will be enhanced to bring novel NMR techniques such as hyperpolarized gas to bear on soft-matter physics problems. This large-scale low-field NMR project should pave the way for true industrial-scale applications of noninvasive NMR techniques.","title":"Collaborative Research: Grain and Gas Motion in Dense Granular Flows","awardID":"0651397","effectiveDate":"2007-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}}],"PIcoPI":[329055],"PO":["426130"]}}