{"19271":{"abstract":"This research is on a method to detect faults in fabricated integrated circuits (ICs). The method is based on the ability to identify and assess extremely low levels of electromagnetic radiation produced by the IC during its dynamic operation. An electromagnetic radiation (EMR) \"signature\" can be collected from an IC during its operation, and it is hypothesized that a distinction between a faulty and fault-free IC can be made using the EMR signature data. Thus, EMR data is being collected from fault-free ICs, analyzed, and then stored in memory. Faults are being injected into the same ICs and the EMR data collected, analyzed, and compared with the fault-free data. Observed differences between the fault-free and faulty EMR signatures are being categorized, and a methodology for detecting faults in ICs is being developed.","title":"Research and Testing of Ultra-High Speed Electromagnetic Signature Sampling (UHS-EMSS) Techniques","awardID":"9700193","effectiveDate":"1997-05-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[48877],"PO":["321058"]},"14180":{"abstract":"9619756 The basic goal of the project is to develop an automatic theorem prover that can reason about properties of programs in high- level, mathematical programming languages. The theorem prover will supply the results of its analysis to programmers by adding hyperlinks to annotations and drawing diagrams to the program text. The annotations will describe sets of values; the diagrams will explain the anticipated flow of these values. Both can be used to understand the program's behavior before it runs. As a result, programmers will be able to create programs that either do not fail at all or only fail at a small, well-defined set of program points. While many of the basic properties of such theorem provers are understood, it is an open question whether they can be applied to programs of hundreds or thousands of modules with mutual dependencies. Hence, the central goal of the project is to design a modular, scalable proof system, to prove its correctness, to engineer a suitable programming environment, and to apply the theorem prover to itself and its programming environment. ***","title":"Modular Program Analyses for Higher-Order Programming Languages","awardID":"9619756","effectiveDate":"1997-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["475166"],"PO":["397849"]},"14084":{"abstract":"The objective of this project is to develop a robust set of algorithms for automatically learning admissible heuristics - that is, functions that identify optimal solutions to combinatorial problems and give a lower bound on the actual cost of a solution. The more accurate the heuristic function, the more efficiently an optimal solution can be found, or if an optimal solution is not required the more quickly a lower-cost solution can found. This research is developing ways to learn these heuristics in a domain-independent manner by applying a technique that has proved useful in automatically learning more accurate admissible heuristic functions that take more time to compute, but make up for it in the time they save for the algorithm using the heuristic. This work will provide better solutions of combinatorial problems of artificial intelligence which will be increasingly cost-effective as computers get faster and larger problems are presented for solution.","title":"Automatic Learning of Admissible Heuristic Evaluation Functions","awardID":"9619447","effectiveDate":"1997-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["558173"],"PO":["564456"]},"14052":{"abstract":"The goal of this project is to explore the systems architecture of high-end computers to be built a decade from now. A proposed architecture that combines COMA and NUMA designs is being used to explore architectural, applications, and compiler issues. Tools used in the study include an execution-driven simulator, an address tracer, state of the art parallelizing compiler and database systems, and many workloads. The architectural issues to be explored include organizations that merge COMA and NUMA coherence, new uses for cache tags, and design of coherence protocols. Software issues include address translation and memory management within the operating system for a simple COMA, new uses of the data replication that occurs for share data in COMA, compilation of parallel code for cache-coherent architectures, and compilation of explicit data transfers in parallel code into instructions for prefetching and forwarding of data.","title":"Getting to the Bottomline in COMA Research: The Illinois Aggressive COMA Multiprocessor (I-ACOMA)","awardID":"9619351","effectiveDate":"1997-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["533380","485665"],"PO":["549626"]},"14020":{"abstract":"Since its introduction by Reiter in 1980 default logic has been widely studied for its potential as a knowledge representation mechanism. Recent results indicate that default logic not only can serve as a declarative knowledge representation tool but also has the potential to evolve into a practical high-level computational environment. This project develops fast systems for automated default reasoning including implementations for parallel and distributed environments. A systematic methodology of computing with default logic is also under development. Usefulness of default logic as a computational tool is demonstrated through a comprehensive experimentation with default theories describing combinatorial optimization problems. To support this experimentation effort, a tool to automatically generate large families of default theories, logic programs and propositional theories is implemented. Due to the declarative nature of default logic, this new programming tool, based on default logic, will be easy to use, will allow for fast prototyping and will be effective in a wide range of artificial intelligence applications. The testing system will become a standard benchmarking tool for automated reasoning based on default logic and related formalisms.","title":"Computing with Default Logic","awardID":"9619233","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["407833","151512"],"PO":["565227"]},"14141":{"abstract":"9619644 Kamin The goal of this project is to promote technology transfer from the functional programming community into the wider programming community, by concentrating on special-purpose functional languages. The proposed work focuses on the design and implementation of a functional language for ASCII file processing, tentatively called FPERL. This addresses the goal in two mutually-reinforcing ways. First, FPERL is to be a functional alternative to languages like AWK and PERL; its development will shed light on this domain and will, it is hoped, garner a user community of new functional programmers. Second, the construction of the FPERL processor will be based on a unique class of special- purpose languages: meta-programming languages (also called program generators). The components of the processor - lexical analyzer, parser, de-sugarer, and so on - will each be written in a functional meta-programming language specially designed for that type of component. These meta-programming languages will be developed as extensions to FPERL, resulting in an unusual boot- strapping process. This research will produce new knowledge about a variety of special-purpose language domains - file processing, parsing, and so on; about meta-programming as a generally applicable programming methodology; and about the design of languages to support meta-programming. ***","title":"Special-Purpose Functional Languages","awardID":"9619644","effectiveDate":"1997-05-15","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["451105"],"PO":["150697"]},"23195":{"abstract":"The University of Illinois at Chicago and its partners, the National Center for Supercomputer Applications (NCSA), the Argonne National Laboratory (ANL) and Ameritech will provide an operational interconnection point at the Ameritech Network Access Point (NAP) that will enable international connectivity and interoperability of the cutting edge US research networks (e.g., vBNS, Internet 2, Next Generation Internet components) and high performance networks of other nations. This project is a key piece of infrastructure for high performance international Internet connections to the vBNS. It will complement the forthcoming NSF solicitation for High Performance International Internet Services (HPIIS), and it will support the G7 Global Information Infrastructure project \"Global Interoperability of Broadband Networking\" (GIBN) by providing a common interconnection point with staff support and performance monitoring. The Canadian Network for the Advancement of Research, Industry and Education (CANARIE) has already connected to the vBNS through the Ameritech NAP in an initial proof-of-concept test.","title":"The Chicago STAR TAP - Science, Technology And Research Transit Access Point","awardID":"9712283","effectiveDate":"1997-05-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["557607","558517","524614","437738"],"PO":["198445"]},"19389":{"abstract":"Peter Taylor is jointly funded by the Theoretical and Computational Chemistry Program in the Chemistry Division and the the New Technologies Program in the Advanced Scientific Computing Division to continue his research in the development and application of methods for the calculation of accurate structures, energetics, and properties of molecules. Methods will be developed for the computation of accurate, ab initio, small molecule, electronic wavefunctions using contracted Gaussian geminals (predetermined linear combinations of explicitly-correlated, two-particle, Gaussian basis functions). Geminal parameters for molecules will be extracted from optimized atomic wavefunctions. Scalable algorithms will be developed for implementation on parallel computers. Taylor asserts that two-electron basis sets offer much more rapid convergence and thus provide a route to higher accuracy for small systems, and a way to extend existing levels of accuracy to larger molecules. Applications include the determination of anharmonic frequencies and vibrational intensities for small molecules, and studies involving the electronic spectroscopy of organic and transition-metal systems and small elemental clusters. Orbital-based concepts and computational methods play a central role in modern chemical theory, but there is a practical limit to the accuracy attainable in orbital-based computations using existing supercomputers. The goal of this project is to develop improved computational methods using geminals (explicit functions of the coordinates of a pair of electrons) rather than orbitals. If successful, this will significantly increase the accuracy of theoretical predictions of gas phase reaction rates such as those required for improved computer models of the earth's atmosphere.","title":"Development and Application of Methods for the Calculation of Accurate Structures, Energetics and Properties of Molecules","awardID":"9700627","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1954","name":"QUANTUM CALCULATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["320788"],"PO":["308458"]},"23471":{"abstract":"9713347 Forbes, Lewis University of Kentucky CISE Special Project: ADMI 97 This grant provided travel assistance primarily for students along with a small number of faculty from minority-serving institutions to participate in the 1997 ADMI Symposium, \"Increasing Diversity in Research and Education\". This 1997 Symposium built on the major new themes initiated in the 1996 Symposium: 1) enabling minority-serving faculty to present papers on strategies for increasing the number of CISE-discipline students from underrepresented populations and to share these topics with representatives from major research universities, and 2) providing for significant participation by students, giving them valuable experience in presenting research papers and providing for their involvement in graduate study workshops. Participants were chosen by a selection committee following submission of their papers. A Conference Proceedings is being published containing all of the papers presented at the conference.","title":"Special Project: Assistance in Attending ADMI 97 - Increasing Diversity in Research and Education (The Symposium on Computing at Minority Institutions)","awardID":"9713347","effectiveDate":"1997-05-15","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[58959],"PO":["551712"]},"14143":{"abstract":"Research is to be conducted in several key areas of robotic movement planning. The emphasis is on robot motion planning algorithms for autonomous robots. A principal focus is on the investigation of motion planning problems with incomplete information or changing information about the environment, requiring the motion planning algorithm to be adaptive. Moreover, the research considers movement problems with inherent errors in the sensing and control, so the motion planning algorithms must be robust to a lack of information on the position of the robot, and if possible the algorithms must be minimal: that is use the least possible amount of information about the robot position and environment. The investigations will also consider motion planning problems in environments which are dynamically changing; these will require dynamic algorithms that respond to changing inputs. The research will involve solving motion planning problems using new formulations that have not yet been fully investigated. The research will concentrate particularly in emerging new areas in robotic movement planning that impact most strongly the overall goals of adaptive, robust, minimal, and dynamic robotic algorithms. Examples of topics to be researched are on-line planning algorithms for unknown environments which are randomized and\/or may dynamically learn probabilistic models of the environment, and pursuit movement games (which involve movement planning with an adversary).","title":"Robust, Adaptive and Dynamic Robotic Motion Planning","awardID":"9619647","effectiveDate":"1997-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["550822"],"PO":["475621"]},"19324":{"abstract":"In many robotic manipulation tasks, especially assembly tasks, motion of objects in contact is common and even desired in order to reduce uncertainties. An important tool in dealing with motion in contact is reasoning about contact states, which is the focus of this project. Specifically, this research has two major goals: (1) to investigate proper representation of discrete contact states and state transitions, and (2) to investigate criteria and techniques for automatic planning of contact motions in terms of contact state transitions. The first major research goal responds to the fact that although various ways of representing discrete contact states for polyhedra have been proposed in related research, there is a lack of general and systematic investigation on the best way(s) of defining\/representing contact states and state transitions based on certain important criteria, such as (i) how easy it is to describe\/represent state transitions, and (ii) how easy it is to distinguish adjacent states. The first criterion is important from the need of automatic generation of contact state space. The second criterion, addressing the granularity of representation, is particularly important from the need of automatic identification of contact states in the presence of uncertainties. The second major research goal is closely related to the first one and is particularly aimed at flexible assembly tasks. In pursuing both goals, theoretical concepts will be validated by experimental implementations and executions. This will result in a fundamental understanding of the physics of the most common assembly tasks and relate this knowledge quantitatively to the planning processes which can perform them in flexible assembly. This collaborative effort is expected to lead to results that will significantly impact the design, evaluation, generation and execution of conta ct-motion plans for automatic assembly in general.","title":"Contact State Space: Automatic Generation, Reasoning, and Search","awardID":"9700412","effectiveDate":"1997-05-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["440783","99015","475621"],"PO":["234178"]},"11493":{"abstract":"Multi-TAC is a learning system that automatically synthesizes heuristic programs for combinatorial problems, including resource allocation and scheduling problems. This project investigates fundamental research areas that will enable Multi-TAC to be used for computationally challenging problems. The first goal is to develop fast methods for searching the space of algorithms evaluated by Multi-TAC during the synthesis process. In particular, the research focuses on methods for predicting how well an algorithm will perform based on a quick test on an example problem instance. The second goal is to enable Multi-TAC to automatically synthesize very efficient iterative repair algorithms. This involves the development of generic schemas that capture the structure of wide variety of such algorithms. The last goal is to enable users to easily specify new problem domains for Multi-TAC, without needing to worry about how the details of their specification impacts the synthesis process. In particular, the work focuses on techniques for rewriting constraints so that they can be efficiently evaluated. This research project provides an important step towards problem- solving systems that can automatically configure themselves for a particular application.","title":"Automatic Specialization of Generic Constraint Satisfaction Algorithms","awardID":"9610014","effectiveDate":"1997-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["553754","427568"],"PO":["565227"]},"13374":{"abstract":"This project connects Southeastern University to the Internet over a partial-T1 line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"Connection of Southeastern University to the Internet","awardID":"9617144","effectiveDate":"1997-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33872],"PO":["121202"]},"11494":{"abstract":"The aim of this research is to devise new methods for automating reasoning via understanding and exploiting computationally tractable classes of reasoning tasks. Fundamental to the approach is the hypothesis that intelligent behavior is accomplished through utilization of idealized models of the task's environment. To explain how people perform so well on tasks that are theoretically intractable, we must assume that approximation methods based on idealized tractable models cover a significant portion of intelligent activity, and hence such methods should serve as the basis for automated reasoning systems. A language that has been found useful for modeling and solving compuationally intensive tasks in artificial intelligence is constraint networks, and use of these networks. By using idealized tractable models, constraint networks, and other techniques found useful in this area, it is hoped that real- life problemq can be solved automatically in reasonable time as well as humans solve them.","title":"Tractable Reasoning","awardID":"9610015","effectiveDate":"1997-05-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["475511"],"PO":["565227"]},"13662":{"abstract":"The goal of this project is to provide students and designers with improved access to new layered manufacturing processes including MicroElectro Mechanical Systems (MEMS) and Shape Deposition Manufacturing (SDM) technologies. Together, these technologies can facilitate the design of new classes of products that would be difficult, if not impossible, to build with currently available manufacturing techniques. These processes are capable of generating dense, multi-material parts with complex shapes; the size of device features may range over six orders of magnitude; and the range of materials includes metals, plastics and ceramics. This spectrum of integrated additive and subtractive fabrication processes will be linked by SDM And MEMS Unified Exchange Language (SAMUEL) service. The SAMUEL service will provide a common interface and rapid access to two manufacturing processes: SDM and MEMS. Creating the SAMUEL service will demonstrate that designers who are unfamiliar with details of the manufacturing processes can rapidly create physical artifacts and explore new design ideas. Through a standard interface, designers will able to access the SDM and MEMS manufacturing sites and quickly incorporate manufacturing process constraints into their design system. The manufacturing constraints can be expressed as rules for invocation at the design level.","title":"A Manufacturing Interface for 3D Design","awardID":"9618050","effectiveDate":"1997-05-01","expirationDate":"2001-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0601","name":"Division of edDATA NOT AVAILABLE","abbr":"EDNE"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1463","name":"INTEGRATION ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"Z791","name":"ARPA-SOW-CODIFYING KNOWLEDGE"}}],"PIcoPI":["508165","503978"],"PO":["179487"]},"13332":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to connect a small rural school district to the Internet. The wireless connection allows substantially lower cost Internet access through a neighboring telephone company than from the larger telephone company serving the district.","title":"Wireless Access Across Water for a Rural School District","awardID":"9617041","effectiveDate":"1997-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33764,33765],"PO":["121202"]},"19910":{"abstract":"This research project advances artificial-intelligence research in the areas of planning and reinforcement learning. The primary goal of the research is to create theoretically justified planning algorithms with wide applicability to tasks including robot navigation and control, medical decision making, flexible manufacturing, communications-network monitoring, and space mission scheduling. The research takes a two-pronged approach to develop algorithms for solving large-scale domains derived from practical, real-world problems: careful formal analysis to aid in the construction and identification of justifiable algorithms, and the development and intensive empirical validation of algorithms. This strategy encourages the creation of algorithms that will be useful in solving practical tasks while avoiding ``over fitting'' (i.e., losing generality by tailoring algorithms to attributes of specific domains). New planning algorithms developed in the course of this research combine insights from the areas of planning and reinforcement learning to make it possible to solve larger and more difficult problems than could be addressed previously. The research is creating methods for approximately solving large control problems that could be used in engineering applications ranging from elevator design to the adaptive control of computer systems; this will help create systems that aremore efficient, safe, and reliable.","title":"CAREER: Planning Under Uncertainty in Large Domains","awardID":"9702576","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["550488"],"PO":["564456"]},"20130":{"abstract":"The Virtual Retinal Display (VRD) is a new form of display device developed at the Human Interface Technology Laboratory in Seattle, Washington. This device scans light directly into the eye to create images at the retina. It is anticipated that the VRD will become a ubiquitous display device as it will be miniaturized to wear on a spectacles frame. The VRD is bright, yet safe and uses lasers as highly color saturated sources of light. The research from this proposal will be studies on the fundamentals of light perception of scanned images. These studies will allow us to optimize the scan characteristics for best color, resolution and contrast. We intend to understand the features of temporal and spatial integration by the retinal processing elements of the scanned light and how that integration affects the image perception. We will then be able to produce images with excellent color matching and image sharpness. By optimizing the VRD in this research we will allow its use where image quality is essential, such as in remote surgery, or surgical training. Further, bright, high quality images with the VRD will make it excellent for use in augmented vision applications, where images are superimposed on the real world.","title":"Optimization Studies for Applications of a Scanned Light Display","awardID":"9703598","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["118019","254012"],"PO":["565227"]},"20372":{"abstract":"This research aims to develop a conceptual natural language processing (NLP) system with adaptable components that can be easily tailored for different domains and applications. The architecture of the system consists of fine-grained layers to support various depths of text processing. The shallow layers support syntactic processing, which may be sufficient for some information retrieval tasks, while the deeper layers support semantic and conceptual processing for in-depth language understanding. The system includes components for part-of-speech tagging, prepositional phrase attachment, semantic feature identification, and concept extraction. Each component can be tailored for new domains with minimal manual effort. The layered architecture also allows students to develop individual components and plug them in to the larger system for experimentation. The education goals are to use the system as the basis for a hands-on science workshop for young girls, for summer lectures to high school students, for class projects in natural language processing and machine learning, and for graduate and undergraduate research projects. The purpose of the research is to develop techniques for building conceptual natural language understanding systems automatically or semi-automatically for new domains. Generating conceptual sentence analyzers quickly and efficiently is an important step toward many practical applications, including conceptual information retrieval, text categorization, and information extraction.","title":"CAREER: Building Conceptual Natural Language Processing Systems for Practical Applications","awardID":"9704240","effectiveDate":"1997-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["451671"],"PO":["246649"]},"14103":{"abstract":"9619522 Computing applications in the real world are generally distributed and open to interaction with their environment. Creating an architecture for such systems requires developing mechanisms for managing complex interactions between distributed components. As requirements and the environment change, both the individual components and the pattern of interactions between them evolve. This implies that interaction mechanisms may need to be synthesized during the execution of the system according to the evolving needs of components. In current software, the implementation of policies governing interactions between components is typically represented using a variety of low-level primitives -- such as message-passing, remote procedure call, or shared memory -- and is therefore a major source of code complexity. The project is studying programming techniques for abstract and modular representation of interaction patterns. Such programming techniques will allow code for distributed applications to evolve gracefully -- for example, by reusing components when only their interaction context changes. The research is based on Actors, a formal model of concurrent computation in open distributed systems. ***","title":"Abstracting Component Interactions to Support Distributed Software Architectures","awardID":"9619522","effectiveDate":"1997-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["460466"],"PO":["150697"]},"19813":{"abstract":"9702079 Torczon This project will set up, advertise, and award support for around 19 selected faculty members to attend the Programming Language Design and Implementation conference (PLDI'97) in Las Vegas, June 15-18, 1997. In addition, SIGPLAN will sponsor an educational tutorial track and waive the tutorial fees and conference registration fees for the selected participants. The topics of the tutorials are chosen to improve the effectiveness of faculty members teaching undergraduate courses in the area of programming and programming languages. The selection will be based on a competitive process with several criteria, the most significant being that the person be a teaching faculty member at an undergraduate institution with a large minority enrollment or a women's college. They will also be asked to demonstrate that they lack independent institutional support to attend without such funding. This activity follows the lines of similar activities sponsored for PLDI in 1994 and 1996. It is expected that this opportunity for faculty directly involved in the teaching of undergraduate minority and women students will assist these students in entering successful careers in computer or related sciences. ***","title":"Faculty at Minority\/Female Institutions to Attend the Programming Language Design and Implementation (PLDI) '97 Workshop, June 15-18, 1997, Las Vegas, Nevada","awardID":"9702079","effectiveDate":"1997-05-15","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["229226"],"PO":["150697"]},"11465":{"abstract":"This two-year award for cooperation on digital libraries involves Daniel E. Atkins and William Birmingham at the University of Michigan, and the European Research Consortium for Informatics and Applied Mathematics (ERCIM), which consists of the national computer and information science laboratories of 14 European countries. The award supports the establishment of four international working groups to foster an international community of Digital Library researchers and to identify joint research agendas. The working groups will focus on technical issues related to interoperability, metadata, optimized retrieval, and intellectual property and economics. Meetings will be organized to examine and define critical research questions through which joint research proposals will emerge. The University of Michigan serves as the U.S. organizer. Each working group will consist of five U.S. researchers from NSF-supported Digital Library Projects and other research organizations and five European researchers. The project takes advantage of significant European expertise in informatics and applied mathematics and will eventually provide access to a large compendium of scientific information that is produced in Europe. Through this cooperation, common standards and strategies to develop compatible systems and global digital libraries are likely to emerge.","title":"U.S.- Europe Joint Working Groups: Digital Library Project","awardID":"9605202","effectiveDate":"1997-05-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["209323","142660"],"PO":["323582"]},"14205":{"abstract":"9619832 The goal of the research is to develop the notion of \"staged computation.\" Intuitively, the idea is to execute programs and use the results of early computations to optimize later computations. This is accomplished by making use of both partial evaluation and run-time code generation. The research investigates to what extent staged computation can be exploited to improve the adaptability and safety of software while achieving good performance. The focus of the work is the design of an expressive type system for staged computation at the source level, a typed intermediate language within a compiler, and code generation technology to take advantage of explicit computation stages. The starting point for the investigation is the ML language. The proposed research is expected to lead to new compiler technology that will support, in an integrated way, a significantly larger class of optimizations than is currently possible, including both link-time and run-time optimization of code. ***","title":"Staged Computation","awardID":"9619832","effectiveDate":"1997-05-15","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["424178","339844"],"PO":["150697"]},"14238":{"abstract":"9619910 Reactive systems such as telecommunications systems, and aircraft navigation systems interact continuously with their environment and are usually safety critical. This has created a demand for a rigorous framework for reasoning about their correctness. Traditional formal methods for ensuring system reliability perform a static analysis where a high-level design is verified using techniques such as theorem proving and model checking. Since actual systems are much more complex than the verified abstraction, static analysis is supplemented by testing and monitoring of the implementation. This project will introduce rigorous paradigms for the monitoring of reactive systems and use them along with static analysis techniques to obtain mathematical guarantees on the correctness of system behaviors. It aims to extend two paradigms --- program checking, which seeks to follow up each computation of a program by a check that proves that the result is correct, and conformance testing, which seeks to determine if an implementation is correct by observing its input-output behavior --- to the context of reactive systems. The project will also explore distributed monitoring of distributed reactive systems. ***","title":"A Unified Framework for Improving the Reliability of Reactive Systems","awardID":"9619910","effectiveDate":"1997-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["553656","382346"],"PO":["150697"]},"19628":{"abstract":"This research is on developing methodologies and tools for designing real-time embedded systems with the goal of providing a tool environment to help designers explore a vast design space and locate superior system architectural configurations. The approach is to work at the system level or processor level of abstraction and to formulate the problem as a multi-attribute optimization one which captures various quality requirements in system design. Specific topics being addressed are: 1. Evaluating timing performance through studying the flexibility of a system configuration with respect to timing specifications, and formulating metrics for estimating the flexibility of systems. 2. Developing an interface tool for assisting system developers to specify value functions and preferences. 3. Combining the imprecisely specified multi-attribute utility theory with evolutionary algorithms to find optimal solutions for multiple objective optimization problems.","title":"CAREER: Performance Analysis and Tradeoff for System-Level Design Exploration of Real-Time Embedded Systems","awardID":"9701416","effectiveDate":"1997-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550624"],"PO":["562984"]},"11356":{"abstract":"The goal of this project is to equip the National Magnetic Resonance Facility at Madison (NMRFAM) 1 with a Customized Desk-top Experiment Management System (CDEMS) that will provide users with adaptable desk-top access to the software and hardware resources of the facility. This project is a joint effort between members of NMRFAM (in the Biochemistry Department) and the ZOO team (in the Computer Sciences Department, University of Wisconsin-Madison); the latter group has developed the tools to be used in constructing the CDEMS. NMRFAM is a shared instrumentation laboratory dedicated to NMR investigations of structure- function relationships in biomolecules. Hardware at NMRFAM includes five high-resolution NMR spectrometers (with proton resonance frequencies between 400 and 750 MHz), a Silicon Graphics Inc. (SGI) Power Onyx computer system, and a number of SGI workstations, the associated software encompasses a wide variety of commercial and academic software packages used for processing and analyzing NMR data and for retrieving and examining other information available on the systems studied. The proposed desk-top access capabilities will enable NMRFAM to project these assets beyond its walls and to make them freely available to collaborators and other consumers of its technology. The CDEMS will facilitate collaborations of scientists over the Internet and will enable users to interact with NMRFAM staff members in planning and scheduling experiments and in processing and analyzing data. Users, regardless of their physical location, will be able to execute, from their own desk-tops, not only simulations and data analyses, but actual data collection runs. In addition, the CDEMS will be designed to maximize able the efficiency of available computational resources. .","title":"Customized Desk-top Experiment Management System for Biomolecular NMR","awardID":"9604906","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1108","name":"INSTRUMENTAT & INSTRUMENT DEVP"}}],"PIcoPI":["138030","560467",28867,"94783"],"PO":["303087"]},"23149":{"abstract":"The Net Scout project is an Internet resource location and technology service oriented primarily to the higher education community. It currently provides four services that are used by thousands of faculty, staff, and students in higher education: the Scout Report, Net Happenings, the Scout Toolkit, and the KIDS Report. The Scout Report is a weekly electronic newsletter summarizing the best new Internet resources of use to higher education. Net Happenings is an electronic service that provides immediate notification of 50-70 Internet announcements each day via a mailing list, a newsgroup, and a Web site. The Scout Toolkit summarizes the best Internet search services and other tools needed by researchers and educators to use the Internet effectively. The KIDS Report is a biweekly newsletter written by students in elementary, middle, and high school classrooms who select and describe the Web sites they find the most interesting and useful. The Net Scout project will continue and expand these services in two ways: First, to provide additional services, including publication of three biweekly Scout Reports produced by specialists in the specific areas of Science and Engineering, Social Sciences, and Business and Economics, and, second, to implement new tools which aid in the location of Internet resources in a specific subject area. A prototype service will be built using as its initial base the three year archive of the highly selective resources that have been included in the Scout Report. Specialized authenticated collections of quality resources at higher education institutions will also be identified and included in the prototype. http:\/\/wwwscout.cs.wisc.edu\/","title":"Net Scout Internet Resource Discovery and Search Technologies","awardID":"9712163","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["229263","103805"],"PO":["198445"]},"19959":{"abstract":"The realistic deployment of highly articulated robots relies on a provably complete sensor based planner for these robots. Consequently, the operation of such robots motivates the long- term research effort to develop a sensor based planner for a broad class of highly articulated robots. The research considers the next step towards this goal: this approach introduces a new roadmap structure for an arbitrary shaped object. The roadmap is termed the hierarchical configuration Voronoi graph (HCVG) and it can be used to plan a path between two points and to explore and map an environment. Furthermore, and perhaps more importantly, the HCVG applies to situations where the robot has no a priori information about its environment and thus, the robot must rely on its sensor information to achieve its goal. A powerful feature of the HCVG is its incremental construction procedure, which is a necessary component of a sensor based planner because there typically is no one vantage point from where the robot can ``see'' the entire environment; the robot needs to couple sensing with motion. Four key aspects of this ppocedure are (1) it uses only line of sight distance information, (2) it requires minimal sensor processing, (3) it need not explicitly compute the configuration space of the robot, and (4) it is complete. This incremental construction procedure is general to any roadmap method and thus provides a framework in how local line of sight information can be used to create a global map. This award is coordinated with a companion award from the Office of Naval Research in support of this research.","title":"CAREER\/REU: Complete Sensor Based Planning for Highly Articulated Robots","awardID":"9702768","effectiveDate":"1997-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["553216"],"PO":["234178"]},"10884":{"abstract":"This three-year award for U.S.-France cooperative research involves collaboration on problems of singularities and minimal models among several U.S. and French mathematicians. The program is organized by Vyacheslav Shokurov of Johns Hopkins University and Arnaud Beauville of the Ecole Normale Superieure in Paris, France. The awards provides travel and living expenses to ten U.S. university-based mathematicians for short-term visits to France. The project addresses problems in classification of higher- dimensional algebraic varieties, theory of singularities and integrable systems. It takes advantage of complementary expertise of the U.S. and French mathematicians.","title":"U.S.-France Cooperative Research: Singularities and Minimal Models in Dimension >3","awardID":"9603180","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["442455"],"PO":["323582"]},"20025":{"abstract":"Faster computing and higher available bandwidths for digital communications have made visual communications increasingly possible - one- and two-way exchange of both images and video, including browsing multimedia databases, real-time imaging, and video-conferencing. Advances in image and video compression have contributed to the feasibility of visual communications, and packet networks such as today's ATM and future wireless ATM networks can offer the required bandwidths. However, these networks cannot offer guaranteed packet delivery - some data can be lost. As such, these networks cannot be used to reliably deliver visual information coded using today's compression standards. The goal of this research is to provide reliable visual communications over unreliable packet networks with dynamic bandwidths and packet handling characteristics through source coding specialized to transmission over such networks. This research involves developing specialized image and video compression techniques for transmission over networks with dynamic bandwidths and packet handling characteristics. Traditionally to deal with loss in transmission, redundancy is completely removed from data via source coding and then reinserted through channel coding, following Shannon's joint source-channel coding theorem. This research investigates redundant source coding, in which redundancy is included in the source coding so that less or no channel coding is required, while achieving better visual quality than if the joint-source channel coding theorem is applied. Specifically, redundant source coding techniques for subband-wavelet image representations and for the temporal information in video sequences are being developed, along with suitable packetization strategies. Optimal data partitioning algorithms are also being developed, to allow transmission over multiple sub-channels with different characteristics.","title":"CAREER: Robust Visual Communications for Packet Networks","awardID":"9703177","effectiveDate":"1997-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["530523"],"PO":["564898"]},"22104":{"abstract":"This award funds a Workshop on Perception of Action, to be held May 18-20, 1997 in Brewster, MA. As computer vision moves from the processing of static images to consideration of image streams such as video sequences or real-time robotic vision, the problem of machine \"understanding\" of actions represented in the images is becoming increasingly important, for potential applications such as security and surveillance, dynamic situation monitoring, guidance and verification of machine action such as robotic assembly, and support for human user access to video image and multimedia databases. This workshop will explore the current state of knowledge in this area, and look into future prospects for advances in understanding, including schemes that represent action more naturally than the traditional sequences of static poses or key frames. The results and recommendations of the workshop will be published in the form of a report, which will also be made available on a web site.","title":"Workshop on Perception of Action","awardID":"9708961","effectiveDate":"1997-05-15","expirationDate":"1998-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y096","name":"DARPA-PERCEPTION OF ACTION WKS"}}],"PIcoPI":["409620"],"PO":["475621"]},"20026":{"abstract":"Characterizing realistic high-performance computer applications with existing, advanced tools will be a first thrust in this project. An information repository will be created on the Web, documenting properties of application programs, computer architectures, and their interrelations. A second project part will improve the integration of tools and their user interaction. Compilers will be enhanced to make available to the users the information gathered from their source programs. Performance analysis tools will be integrated with compilation tools and developed to the point where they can interpret performance and present it to the user at several abstraction levels. The new tools will be made available on the Web, serving as a \"Remote Parallel Programming Lab\". Third, advanced capabilities of optimization and performance analysis tools will be developed. Compilers will be enhanced to increase their understanding of subscripted subscript patterns, found in many irregular applications. Performance analysis tools will be enhanced to do \"performance forecasting\", that is, predict the performance of future computer architectures running future applications. New course material will be developed based on the results of these projects. This material will be brought into the existing course framework of parallel programming, advanced optimizers, and object- oriented programming at Purdue\/ECE.***","title":"CAREER: Guiding Computer Systems Research, Development, andEducation with Real Applicatioms and Advanced Tools","awardID":"9703180","effectiveDate":"1997-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["558595"],"PO":["209879"]},"13438":{"abstract":"9617309 Murphy, Robin R. Rogers, Erika Colorado School of Mines CISE Research Instrumentation: Intelligent Assistance for Multiple Robots This award supports the purchase of equipment to be used in the following research projects: -Intelligent Assistance of remote Robots using a Tactical Agent-Intelligent Assistance for Problem Solving for Multiple Robots. Multiple autonomous robots have a wide variety of applications, including Urban Search and Rescue, hazardous waste cleanup, and planetary rovers. Full autonomy for these robots is often unrealistic given the current state of AI and demands of the domain. Two research projects will investigate aspects of semi-autonomous control for multi-agents. One project will extend work in the search of physical spaces to address issues of how to use a tactical robot to intelligently assist in the coordination and control of remote robots. The tactical robot will interpret the teleoperator's strategic commands for the inspection robots for the immediate situation and supplement and\/or modify them in order to safely control the inspection robots. The project will contribute a better understanding of cooperative heterogenous agents, thereby improving task performance, reducing cognitive fatigue, and minimizing teleoperator training. The second project will extend visual interaction methods for problem solving in order to allow a teleoperator to simultaneously control and diagnose failures in remote robots without cognitive fatigue. The expected contributions include a new paradigm of intelligent assistance, not restricted to robotics, based on differences in the agents' cognitive abilities.","title":"CISE Research Instrumentation: Intelligent Assistance for Multiple Robots","awardID":"9617309","effectiveDate":"1997-05-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["565226"],"PO":["301532"]},"10930":{"abstract":"The proposed research seeks to derive new results in the theory and application of mathematical logic as applied to problems in computer science. Because many of the classical results of logic are not applicable in the modern context, it is necessary to develop a new theoretical framework. One development would extend the approach and methods of finite model theory beyond finite models. Another development would investigate theoretical foundations for dealing with evolving algebras used to describe structures in computer science that change during the computation process. A third goal of the research is to study decidability and complexity questions relevant to computer science problems.","title":"U.S.-Germany Cooperative Research: Model Theory for Computer Science","awardID":"9603298","effectiveDate":"1997-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["70021","330436","70022"],"PO":["290800"]},"11447":{"abstract":"INT 9605174 Roberts This U.S.-Czech collaborative effort headed by Fred Roberts of Rutgers University's Center for Discrete Mathematics and Theoretical Computer Sciences (DIMACS) and Jaroslav Nesetril of Charles University's Center for Discrete Mathematics, Theoretical Computer Science and Applications (DIMATIA) will forge a link between the two centers of excellence with the intent of focussing their combined expertise on challenging problems in areas pertaining to discrete mathematics and theoretical computer science. The three year program of joint activities will feature workshops on: 1) applications of the probabilistic method, 2) probabilistic techniques in computational geometry, and 3) complexity of computations and logical deductions. Coupled with the conduct of each of these workshops will be an extended visit program for selected participants who apply to work on problems central to the workshop themes. Selections will be made by a DIMACS\/DIMATIA steering committee, with some priority given to junior, postdoc and graduate student participants. Overall, the subsequent linkage of sister centers is expected to yield long-term research interactions and important breakthroughs in combinatorics. This cooperative project between two centers of excellence fulfills the program objective of advancing scientific knowledge by enabling experts in the United States and Eastern Europe to combine complementary talents and share research resources in areas of strong mutual interest and competence. ??","title":"U.S.-Czech Research on Discrete Mathematics and Theoretical Computer Science","awardID":"9605174","effectiveDate":"1997-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["452844","264120"],"PO":["561352"]},"13648":{"abstract":"Getting leading-edge products to market faster than one's competition, is a key concern of the Nation's manufacturing enterprises. Correspondingly, many designers \"out there on the Interned\" quickly want \"one-of-a-kind\" mechanical prototypes or small batches of parts, to visualize and experiment with during the early conceptual stages of a new \"high-tech\" product. This grant will be used to build \"an experimental fabrication testbed\" for an Internet-accessible, computerized machining service called \"CyberCut\". Client- designers will be able to create mechanical components, beginning with a CAD system of their choice, and submit appropriate files to the server at Berkeley for process planning. \"CyberCut\" will utilize an existing open-architecture, computerized machining tool at Berkeley for fabrication. Rapid tool-path planning, novel fixturing techniques, and sensor-based precision machining techniques will allow the original designer to take delivery of a component with a high-strength and tight-tolerance {e.g., +\/- 0.00 inch (0.05mm)}. \"CyberCut\" will first be used by University collaborators at Carnegie Mellon, Stanford and the MTAMRI at Illinois. There will also be some instances where the design has a complex shape that cannot be prototyped by machining. Other \"Solid Free Form\" technologies will then need to be evaluated for the downstream prototype realization. A \"Manufacturing Analysis Service\" will be developed that will evaluate the design for fabrication by Stereolithography or Selective Laser Sintering. Industrial collaborators, Metalcast Engineering and Plynetics will be used for these extended services.","title":"CyberCut: A Networked Manufacturing Service","awardID":"9617995","effectiveDate":"1997-05-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0601","name":"Division of edDATA NOT AVAILABLE","abbr":"EDNE"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1463","name":"INTEGRATION ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"Z791","name":"ARPA-SOW-CODIFYING KNOWLEDGE"}}],"PIcoPI":["409023","518826","457562","504279","526900","520937","195851","86229"],"PO":["179487"]},"11944":{"abstract":"An important optical network architecture is the wavelength division multiplexed (WDM) network that supports lightpaths. WDM is basically frequency division multiplexing in the optical frequency range, where carrier frequencies are referred to as wavelengths. Lightpaths are end-to end connections made up of connected WDM channels. A network node is said to have wavelength conversion capability if it can shift the wavelengths of optical signals. The advantage of wavelength conversion is that it allows networks to support more ligthpaths, but its disadvantage is that it can be expensive and\/or difficult to implement. This research will investigate limited wavelength conversion that allows network nodes to perform some but not all wavelength shifts. Limited conversion means less complex and costly hardware than full conversion, yet better channel utilization than no conversion. Network architectures and algorithms will be studied by initially focusing on special and important network topologies such as the star and ring, and then eventually covering general network topologies. These will be analytically evaluated by worst case analysis that leads to guaranteed performance results, and also by probabilistic methods. More information on the project can be found at http:\/\/spectra.eng.hawaii.edu\/~sasaki\/NSF\/limited.html","title":"Optical WDM Networks with Limited Wavelength Conversion","awardID":"9612846","effectiveDate":"1997-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[30353],"PO":["234222"]},"11779":{"abstract":"The primary goal of this research is to develop efficient codes for noisy modulation channels such as those encountered in magnetic and optical recording devices. In these channels, it is often required to map the data to a sequence with special modulation properties; since most devices are noisy, the recorded sequence should have some error control capability as well. Coding techniques are used to transform arbitrary data to sequences that satisfy the modulation and error control requirements. Coding technology is one of the critical factors that has contributed to the astounding capacity of today's magnetic recording devices. The most commonly used coding scheme is based on concatenating an outer code for error control with an inner code for modulation. Although each of the two component codes may be optimal with respect to its function, the overall concatenated scheme may not be optimal. It is recognized now in industry that the coding gain achieved using this approach is close to reaching a saturation point. This research aims at optimizing the overall concatenated coding scheme rather than optimizing the component codes. It is expected that this approach will significantly improve the overall coding gain. To accomplish this task, the two component codes should not be independently designed and implemented. Instead, any error control capability in the inner code should be optimally exploited by the outer code for better performance. Funding for this project will be used to support graduate students in an area with many applications in data storage and communications, which are interdisciplinary in nature. There is a need for more researchers in the coding aspects of these applications.","title":"Constrained Concatenated Codes for Noisy Channels","awardID":"9612354","effectiveDate":"1997-05-01","expirationDate":"2001-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["450216"],"PO":["188393"]},"10925":{"abstract":"The proposed research investigates high-tech ceramics based on crystalline phases in the Si-Al-Y-O-N system. Better knowledge of their thermodynamic properties could lead to the synthesis of lower-cost materials with better properties. This project combines the expertise of the calorimetry group at Princeton with the materials and processi ng group in Stuttgart. The Stuttgart group will synthesize and characterize samples, while the Princeton group performs high-temperature solution calorimetry to obtain enthalpies of formation of the crystals. The data derived will be incorporated into databases and used to calculate phase equilibria, crystalline paths, and crystal-chemic al correlations.","title":"U.S.-Germany Cooperative Research: Geometric, Metric and Homotopical Aspects of Low Diminensional Cell Complexes and Manifolds","awardID":"9603282","effectiveDate":"1997-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1267","name":"TOPOLOGY"}}],"PIcoPI":[27810,27811],"PO":["290800"]}}