{"11907":{"abstract":"The critical importance of robust, flexible, and efficient software tools has long been recognized, and has been a major discussion topic at several national meetings, including those organized by the PI. These meetings focused on the difficulties associated with building good tools, and the lack of infrastructure for tool development and test. This proposal is for a workshop to discuss design and implementation solutions to the lack of these software tools for high performance computing systems. The discussions will focus will focus primarily on issues of debugging, performance measurement, analysis, and presentation as they relate to these needs. By including academic researchers, vendors, and government agency representatives, a wide variety of opinions, viewpoints, and needs can be presented and explored to the mutual benefit of all the groups.","title":"Workshop Proposal: Software Tools for High-Performace Computing Systems, Chatham, Massachusetts, October 1996","awardID":"9612753","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["562707"],"PO":["224490"]},"16071":{"abstract":"Data management is critical to the functioning of wide-area wireless communication networks. The communication infrastructure maintains user profiles to keep track of information for operations such as call setup and delivery, subscriber authentication, and billing. Data management deals with the problem of efficiently managing the information in user profiles, which may be distributed across the network. In evaluating different data management schemes, performance measures of interest are: 1) profile lookup and update response times; 2) individual and global database access requirements: 3) individual communication link and global signaling bandwidth requirements; 4) total memory requirement; and 5)overall system cost. Information in user profiles can be classified into \"system information\", such as current locations of subscribers and subscriber authorization information, \"service provider information\", such as billing records, and \"feature support information\", such as numbers for call screening or call blocking. These different categories of information have different demands on their data management schemes. One of the primary objectives of our proposed research is to investigate and develop novel database architectures and protocols for efficiently managing all the classes of information in user profiles. Specific schemes will be designed to meet the various data management requirements. We are especially interested in developing schemes that, unlike current schemes, provide lifelong user numbers through the support of location independent numbering. Scalability and backward compatibility to existing standards, IS-41 and GSM, are also important design issues. We have conceived a promising architecture that is based on a hierarchical organization of databases. Its performance will be compared with a representative set of other data management schemes through extensive simulation studies using a realistic software simulator that we are developing. Another major objective of our proposal is to develop a realistic and extensible simulation platform for studying the performance of data management schemes. Realistic user call and movement models are crucial to our performance evaluations. We will develop detailed call and movement models and corroborate them using actual traffic data. We have laid the foundation in this area through the development of the first version of a highly configurable software simulator, Pleiades. Our research in user behavior models for our simulations is expected to have applications in other areas of wireless communication research.","title":"Data Management for Wireless Communication Networks","awardID":"9628184","effectiveDate":"1996-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["401830","168746"],"PO":["125800"]},"13092":{"abstract":"9616532 Madigan, David Tanimoto, Steven University of Washington Use of On-Line Assessment in Forming and Coaching Learning Groups University of Washington has been awarded a 3-year grant for $589,701 to develop experimental software tools and methodologies to support various on-line assessment activities in both the High School environment and the University environment. Tools will be developed that combine assessment functions with facilities to translate results of assessment into meaningful interventions in both physical and virtual classrooms. The facilities include means of visualizing assessment of information for individual students and groups, means for organizing groups of students for particular activities, electronic mail exchanges, and means to help teachers articulate pedagogical goals and progress within the contexts of these groups. The project experimentation will focus in the subject area of probability and statistics with the aim of enhancing the productivity and effectiveness of teachers in guiding their student groups in mastering the subject matter using Internet-based group discussion.","title":"Collaborative Research on Learning Technologies: Use of On-Line Assessment in Forming and Coarching Learning Groups","awardID":"9616532","effectiveDate":"1996-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}}],"PIcoPI":["533344","308499"],"PO":["297837"]},"15261":{"abstract":"This research project investigates the tight integration of program generation facilities into typed languages. Present program generation technology can be classified as either integrated with the language environment, as are macros in Lisp, or external to the language, as are yacc and lex for C. Within language-integrated generators, the taxonomy can be further refined into tightly-integrated generators, exemplified by reflective systems, and loosely-integrated generators, such as macro preprocessors. Tight integration of generators into typed languages gives rise to a number of problems to which solutions must be found. However, the benefits of increased expressiveness, efficiency, productivity, reusability, reliability, and quality makes research into solving these problems worthwhile. If the project is successful, it will provide a clearer semantics to a reflective ML-like language tailored for building generator systems, illustrate how such a reflective language can be restricted to maintain the invariants of strong typing, design a meta-programming system to prevent variable capture or design hiding, and build a programming environment where generated code can be seamlessly integrated with code produced in more traditional ways.","title":"Type Safe Program Generators","awardID":"9625462","effectiveDate":"1996-10-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["551061","341680"],"PO":["565227"]},"13083":{"abstract":"9616499 Walters, Jim Bobrow, Daniel Maricopa Technical Community College CISE\/EHR\/ENG\/MPS: Collaborative Research on Learning Technologies: Community-Based Learning Systems: Exploring Models in Use. Maricopa Technical Community College has been awarded $298,698 for a 1 year planning project that will use the motivational and social learning potential of Multiple User Design environments (MUDs or MUSEs) in conjunction with computational modeling to help students develop conceptual understanding of scientific concepts. The social characteristics of MUDs, which students construct themselves, bring students into environments where they interact with adult mentors, including teachers, who expand student's horizons. While engaging in their current state, MUDs can be transformed into powerful pedagogical spaces. This planning project will develop the technological aspects of MUDs to integrate computational modeling, and define specific pedagogical goals, building on the work of MariMuse with Longview Elementary School, a Title K-6 school, serving a culturally diverse population of students. The project is a collaboration of Longview Elementary, Phoenix College (part of Maricopa Community College District, and Xerox Parc Alto Research Center.","title":"CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: Community-based Learning Systems: Exploring Models in Use","awardID":"9616499","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[33128,33129,33130],"PO":["297837"]},"16053":{"abstract":"Mobile hosts in a wireless network can move from one location to another while maintaining continuous network connections. This project aims to develop routing mechanisms for wireless networks that are scalable and are compatible with wired networks. It integrates the basic IP mobility support with hierarchical dynamic routing protocols, allowing efficient routing to mobile hosts through secure and incremental propagation of location information. It separates mobile handoff due to the air interface from routing handoff at the network layer. Such separation provides flexible tradeoffs between routing traffic and routing efficiency. Both mobile hosts and mobile support routers are able to control location propagation as route changes, in order to adapt to different requirements of applications and network management. By involving the home agent of a mobile host only in a routing handoff, it leads to a new mobile handoff procedure with a shorter delay. It offers better support for multicast from mobile hosts by control over location propagation and facilitates multicast to mobile hosts by a notion of potential group membership. The project includes the construction of a wireless network simulator and the implementation of a wireless network testbed. The simulator allows detailed performance studies and a deeper understanding of different alternatives for routing and mobility support in local as well as wide area wireless networks. The testbed offers an experimental tool for migrating existing applications to wireless networks and for gaining practical experiences of network communications on mobile hosts. Tools developed in this project will be incorporated into appropriate undergraduate and graduate courses. Transparent, flexible and efficient routing is critical to seamless network access by mobile hosts as they move between networks in vastly different environments. Insights gained in this project on routing support for mobile hosts will also shed light on building m obility-aware applications at higher levels.","title":"Routing Support for Wireless and Mobile Applications","awardID":"9628126","effectiveDate":"1996-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[40445,"62902","502875"],"PO":["150490"]},"16274":{"abstract":"The objective of this project is to develop and test fault tolerant algorithms for numerical computation in various domains, including sparse matrices, recursive filtering and signal processing. The methods used are a combination of checks made during the computation based on preconditioned checksums and thresholds, and a-posteriori checks made on the final computed results based on backward error assertions (BEAs). In spite of the presence of rounding errors, BEAs allow very tight, cheap, validation of the final results independent of the specifics of the implementation or sources of error, and checksums and thresholds supplement the BEAs by providing checks during the computation. These methods will be extended beyond prototype examples to more realistic large computations, demonstrating their scalability and applicability to large domains.***","title":"Robust Fault Tolerance for Computations in Linear Algebra and Signal Processing","awardID":"9628786","effectiveDate":"1996-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550553"],"PO":["150516"]},"12095":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to support a wireless system to allow science students to use laptop computers in the field to communicate their real-time data to the school and thus to the other student researchers.","title":"Wireless Connect at Mt. Shasta High","awardID":"9613879","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["518617"],"PO":["121202"]},"17441":{"abstract":"This Small Grant for Exploratory Research (SGER), funded by the Informations Technologies Office, DARPA, addresses the following problems in the new area of Biomolecular\/DNA Based Computation:(a) Determining correct models for biomolecular\/DNA computations;(b) Developing techniques that make biomolecular\/DNA computations error tolerant;(c) Determining a set of ``practical'' solution techniques for certain NP-hard problems (such as, breaking DES cypher and ``accurate'' pattern matchings for the human genome project) that exploit the massively parallel biomolecular\/DNA computations. One of the goals of this SGER project is to initiate and develop collaborative efforts with the Biochemistry Department at Princeton University.***","title":"SGER: Proposal for Research on DNA Based Computation","awardID":"9633103","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"Z697","name":"ARPA-RES ON DNA BASED COMPUTAT"}}],"PIcoPI":["400310"],"PO":["150516"]},"13053":{"abstract":"9616410 Carraher, David TERC, Inc. CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: Visualization Research Center TERC, Inc. has been awarded $50,000 for a 6-month period to plan a research Center for the study of scientific and mathematical visualization. The goals of the center are: (1) to undertake interdisciplinary empirical research on the technological development and cognitive interpretation of visualization technologies; and , (2) to improve K-12 math and science education by creating innovative visual curricular tools and (3) to contribute toward a new conceptual framework on the role of visualization in learning and understanding mathematics and science. To promote a broad understanding of visualization as historically, culturally, and psychologically grounded, the Visualization Research Center will draw upon expertise not only from the natural and mathematical sciences but also from the humanities and social sciences. Partnerships are being established with the National Academy of Arts and Sciences, the Massachusetts Institute of Technology Media Lab, the CalSpace at University of California-San Diego, Pennsylvania State University, the Boston University Medical Center Hospital, and the Cranbrook Institute, among others.","title":"CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: Visualization Research Center","awardID":"9616410","effectiveDate":"1996-10-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["437321"],"PO":["297837"]},"13064":{"abstract":"9616441 Dev, Pravati Stanford University Design-Based Learning of Vertebrate Biology, Comparative Anatomy and Physiology of Virtual Creatures Stanford University has been awarded $215,498 for a one-year planning grant to help integrate pre-college education implementation and research questions and strategies with an ambitious program of developing advanced computer-based tools for teaching biology at the secondary and undergraduate levels. Prior efforts to create interactive virtual creatures have restricted interaction to viewing selected structures. This project will develop and evaluate for their educational efficacy a small library of transitional creatures that will allow virtual dissection and other simulated physical manipulations on a personal computer.","title":"CISE\/EHR\/ENG\/MPS Collaborative Research Learning Technologies: Design-based Learning of Vertebrate Biology Comparative Anatomy and Physiology of Virtual Creatures","awardID":"9616441","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[33072],"PO":["297837"]},"12020":{"abstract":"This project investigates the use of two concurrent communication channels, graphics and speech, to achieve a successful interaction between a person and a geographic information system (GIS). The objective is to construct a multi-modal spatial query language in which users interact with a geographic database by drawing sketches of the desired configuration, while simultaneously talking about the spatial objects and the spatial relations drawn. This study will increase our understanding of multi-modal spatial interactions, and will lead to improved strategies for intelligent integration and processing of such multi-modal spatial queries in a GIS. The key to this interaction is the exploitation of complementary or redundant information present in both graphical and verbal descriptions of the same spatial scenes. A multiple-resolution model of spatial relations is used to capture the essential aspects of a sketch and its corresponding verbal description. The model stresses topological properties, such as containment and neighborhood, and considers metrical properties, such as distance and directions, as refinements where necessary. This model enables the retrieval of similar, not only exact, matches between a spatial query and a geographic database. Such new methods of multi-modal spatial querying and spatial similarity retrieval will empower experts as well as novice users to perform easier spatial searches, ultimately providing new user communities access to spatial databases.","title":"Multi-Modal Spatial Querying","awardID":"9613646","effectiveDate":"1996-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["117482","117483","450918","354959"],"PO":["564456"]},"13043":{"abstract":"9616396 Gilland-Swetland, Anne University of California - Los Angeles CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies Program: Digital Portfolio Archives in Learning: Modeling Primary Content Transformation for Science Education The University of California, Los Angeles has been awarded funding in the amount of $49,945 for a 12 month planning grant to develop a process model that (1) transforms primary sources into digital library content; (2) allows teachers to build personalized information systems or \"Digital Portfolio Archives\" (DPAs) that contain content and associated descriptions derived from the digital library, together with other relevant materials that teachers wish to incorporate; (3) enables students to incorporate components of teachers' DPAs, and (4) facilitates the optional incorporation of these DPAs back into the digital library, but as a distinct layer of user-created content distinguished to provenance. Content for the base digital library will be drawn from the seven archival, manuscript, and museum repositories at UCLA. The development and testing of the DPA process model builds on the work of, and feeds into several educational and technological initiatives underway at UCLA, including cross-disciplinary collaborations with the Smithsonian Institution, the Los Angeles County Museum of Art, and Special Collections at the UCLA University Research Library. This planning grant will generate: (1) generalizable processes for structuring digital libraries and enriching content descriptions that meet the needs of primary content creators, providers, and non-traditional users such as teachers and students; (2) knowledge of how teachers might select primary content and integrate it into classroom activities if it were digitally accessible; and (3) knowledge of how digitized primary sources might contribute to the enhancement of students' understanding of, and engagement in, the health and natural sciences.","title":"Collaborative Research on Learning Technologies: Digital Portfolio Archives in Learning: Modelling Primary Content Transformation for Science Education","awardID":"9616396","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["79544","184276","526230"],"PO":["297837"]},"12097":{"abstract":"PI: Alma Hernandez Laredo Community College requests support from NSF to acquire communications lines required to connect to the Internet. THENET, a midlevel network in the in the state of Texas, will provide operations management and information services and it will give the campus access to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. Laredo Community College needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general.","title":"New Connection of Laredo Community College to Internet","awardID":"9613881","effectiveDate":"1996-10-15","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["472872",30739],"PO":["121202"]},"13076":{"abstract":"9616478 Fontana, Lynn George Mason University How Can an Information Environment Support Higher-Order Thinking Skills in Science Education? George Mason University has been awarded a 1-year grant of $372,292 to examine how emerging information technologies can be integrated to create a learning environment that supports new approaches to science instruction at the college and secondary school levels. Basic research will address how to integrate effectively knowledge about science instruction, higher-order skills acquisition, instructional design, intelligent assessment, and computer networks. A student-centered, interdisciplinary, problem-centered and collaborative information environment to support teaching and learning will be built and field-tested.","title":"Collaborative Research on Learning Technologies: How Can an Information Environment Support Higher-Order Thinking Skills in Science Education?","awardID":"9616478","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["564109","46066","311712","209418"],"PO":["297837"]},"29224":{"abstract":"","title":"Numerical Algorithms for Sensitivity Estimation in Control","awardID":"9796087","effectiveDate":"1996-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["301523"],"PO":["564728"]},"12132":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to connect three public high schools, a business technical school and a Catholic K-12 school district to the Internet through a 2Mb (million bit per second) full duplex spread spectrum radio transmission system.","title":"Utah Valley State College Network (UVNET) Wireless Internet Connections Project","awardID":"9613955","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[30844,30845,"495795"],"PO":["57343"]},"13496":{"abstract":"*** 9617469 Traub This research looks at the relation between phenomena and models of phenomena in scientific theories. It is especially germane to theories in developing fields, like cognitive science, where the mathematical and computational models today are tentative and may not connect well in their theoretical constructs with phenomenological constructs coming out of the empirical side of the science. The goals are to a) Formulate the issues regarding empirical reality and scientific models more precisely so that limits on knowability can be understood; b) Compare and contrast limitative results across fields like cognitive science, biology, economics, and physics; and c) Review scholarly work on limits that is scattered across disciplines. ***","title":"SGER: What is Scientifically Knowable?","awardID":"9617469","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["516897"],"PO":["54008"]},"13079":{"abstract":"9616485 Fischer, Gerhard Arias, Ernesto University of Colorado CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies Program: Making Learning a Part of Life: Theories, Technologies, Practices, and Assessment in Support of Lifelong Learning The University of Colorado has been awarded funding in the amount of $50,000 for a period of 12 months to initiate a planning effort to establish a CRLT Center focused on the theme \"making learning a part of life; theories technologies, practices, and assessment in support of self-directed life long learning.\" The Center will build on funded research in computer science, cognitive science, psychology and education. The University of Colorado and its extended community will function as a testbed for the development and evaluation of learning technology tools and approaches. The planning grant will allow current research approaches to be shaped into specific activities that will comprise the collaborative project of the Center. Partners in this planning grant include Apple Computer and Boulder Community Network.","title":"CRLT: Making Learning a Part of Life: Theories, Technologies, Practices, and Assessment in Support of Lifelong Learning","awardID":"9616485","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[33113,"232716","538656","483372","16526"],"PO":["297837"]},"29139":{"abstract":"","title":"NSF Young Investigator: Logic and Complexity Theory","awardID":"9796002","effectiveDate":"1996-10-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1268","name":"FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["92118"],"PO":["150516"]},"12860":{"abstract":"","title":"Graduate Research Fellowship Program","awardID":"9616039","effectiveDate":"1996-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7175","name":"MINORITY GRADUATE FELLOWSHIPS"}}],"PIcoPI":["33380"],"PO":["235156"]},"12662":{"abstract":"The information-abundant user interface approach consists of two complementary parts: organization and coordination of information. Users can semantically organize complex information according to roles and relationships. Pieces of information are accessible with partial knowledge of nominal, spatial, temporal, and visual attributes. Users can explore semantic inter-relationships between pieces of information and navigate large information spaces by specifying custom coordinations between multiple filtered views. The research focus is on semantic visualization and task-oriented interaction. The main contributions of this project will be an improved understanding of psychological processes, a taxonomy of user tasks, notations for describing multiple window coordination, and new user interface techniques for information organization and coordination.","title":"Information Abundant Interfaces: Advanced Organization and Coordination","awardID":"9615534","effectiveDate":"1996-10-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["527292"],"PO":["183208"]},"12102":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for one year to establish cable television connections to four Phoenix inner-city schools.","title":"ASPIN: Innovative K-12 Connectivity with CATV","awardID":"9613893","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["30798","143282"],"PO":["121202"]},"13103":{"abstract":"9616563 Campbell, Thomas Garcia, Jorge Bell High School CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies Program: Project Technovision X-33, Planning Year The Los Angeles Unified School District has been awarded funding in the amount of $50,000 for a period of 12 months for a planning grant to study the effect of access to technology on the education of a traditionally underrepresented, culturally and linguistically undeserved student\/parent population. The proposed research will lead to the formation of policy and curricular changes which will significantly affect education in urban, low-income communities into the twenty-first century. The project will involve the collaboration of many different entities: K-12 teachers and administrators; university researchers and professors; governmental organizations; and private business. During this planning year, approximately 15 specific collaboratively development projects will be tested for feasibility and eventual implementation. Data and analyses gathered from these projects will be disseminated widely, using the full resources of the Internet and the World Wide Web.","title":"CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: Project Technovision X-33 Planning Year","awardID":"9616563","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["439472","417289",33182,33183],"PO":["297837"]},"17624":{"abstract":"Objects are programming abstractions that encapsulate mutable internal state and provide operations to manipulate the state. Object-based computing is the programming paradigm that uses objects to structure the state-manipulation carried out in programs. The goal of this project is to develop formal methods for specifying, conceptualizing, and reasoning about object- based programs. These formal methods include: (1) Type systems: what kinds of semantic entities are involved in object-based programs, and how does one capture them in type systems for programming languages? (2) Denotational semantics: what mathematical abstractions are involved in capturing the bahaviors of object-based programs? (3) Specifications: How does one specify the behaviors of individual objects? (4) Reasoning methods: what methods are appropriate and useful for proving properties of object-based programs? The Direction being pursued is to build on the several decades of research in functional programming so as ato achieve a \"tight integration\" of programming concepts and mathmatical tools in working with object-based programs. Of primary focus are algebraic specification and equational reasoning techniques using lambda-calculus-based higher-order language frameworks. ***","title":"Formal Methods for Object-Based Computing","awardID":"9633737","effectiveDate":"1996-10-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["77846"],"PO":["250083"]},"16557":{"abstract":"The hybrid automaton is a promising model for studying the behavior of hybrid systems. One drawback of this model is the difficulty in deriving decidable or semidecidable procedures. The suspension automaton is a subclass of linear hybrid automata for which decidable language containment procedures exist. The objective of this project is to investigate the use of suspension automaton to accurately model and verify real-time systems. Due to the complexity of these problems, a methodical way to study them is called for, such as would be provided by a software tool. This project is designed to explore the issues involved in building an implementation of verification techniques based on the suspension automaton. Two specific issues must be addressed. First, the relation of this work to existing work, particularly in the area of real-time systems, must be established. Second, a specific approach to building such a tool must be formulated. Both of these goals may be aided by establishing contact with researchers in the real-time area, particularly those who are have produced software tools to study real-time systems. ***","title":"Software Tools for Verification of Hybrid Systems","awardID":"9630022","effectiveDate":"1996-10-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["46865"],"PO":["250083"]},"12103":{"abstract":"Illinois Eastern Community Colleges requests support from NSF to connect four Illinois institutions of higher education and one museum to the Internet. These include: Olney Central College, Olney Frontier College, Fairfield Lincoln Trail College, Robinson and Wabash Valley College, Mt. Carmel. This grant will be used to help the institutions get access to the Internet. AccessUS, a local network service provider in Illinois, will provided the the lines used to access to the Internet. These Illinois institutions needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of these institutions as well as the community in general.","title":"Internet Access for Rural Colleges","awardID":"9613895","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[30754],"PO":["121202"]},"13104":{"abstract":"9616564 Semper, Robert Friedlander, Larry Exploratorium CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies Program: Toward the Development of a Center for Collaborative Research on Learning Technologies The Exploratorium in San Francisco, California has been awarded funding in the amount of $50,000 for a period of 12 months to initiate a planning effort leading to the creation of a Center for Collaborative Research on Learning Technologies. The Center will draw upon the efforts and expertise of a wide ranging group of San Francisco Bay Area participants from industry, research, and education to formulate powerful responses to challenges and opportunities in science, mathematics, engineering and technology education. During the proposed planning period, the Center will initiate reexamination of the basic methods and practices of these fields in light of the pedagogical potential to newly developing learning technologies. At the heart of the Center's activities will be a set of carefully selected projects that address major educational challenges and opportunities. The Center is particularly interested in projects that focus on the convergence of new hybrid technically-augmented learning spaces\/situations and new pedagogical theory. By focusing efforts on a specific problem or content area of sufficiently wide interest to the fields, the Center will be able to identify core issues for education as a whole; and thus be able to design generalizable research strategies. It is anticipated that important work will be undertaken by members from primary and secondary school system and by informal educations (such as directors of public libraries or broadcasting groups) of different kinds.","title":"Collaborative Research on Learning Technologies: Toward the Development of a Center for Collaborative Research on Learning Technologies","awardID":"9616564","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["425639"],"PO":["297837"]},"15767":{"abstract":"This research includes a quantitative X-ray resonant magnetic scattering study of the magnetic phase behavior of the HoPr site- random thin film alloy as function of concentration. The study entails: o chemical and magnetic structural characterization of HoPr samples ranging in concentration of 20%Pr\/80%Ho to 80%Pr\/20%Ho to elucidate the RKKY indirect magnetic exchange interaction in the rare earth elements. o Studies of magnetic wavevector and the magnetic order parameter of Ho and Pr atoms separately, by tuning the incident energy at the Ho LIIIedge and Pr LIIedge. o Measurement of the induced moments on the Pr atoms. The research also includes characterization of the interfaces in the semiconductor system InAs\/GaSb, by X-ray reflectivity and anomalous scattering. This artificially grown quantum heterojunction, has received considerable research attention, due to the potential application for optical and electronic devices. The interactive activities include: teaching two courses in project WISE; collaborating with Prof. Emilio Mendez on semiconductor research, and interacting with Prof. Richard Gambino on new magnetic materials and Prof. Peter Stephens on synchrotron related projects; acting as advisor and mentor to the female students in physics; and presenting a formal graduate seminar in X-ray magnetic scattering.","title":"VPW: Studies of Thin Films by Synchrtoron X-Ray Scattering","awardID":"9627065","effectiveDate":"1996-10-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"9225","name":"VISITNG PROFESS FOR WOMEN"}}],"PIcoPI":[39765],"PO":["180153"]},"16306":{"abstract":"A major bottleneck in present-day machine translation (MT) is identifying appropriate approximations when no exact translation exists between the source and target languages. An MT system must resolve mismatches either by incorporating implicit information from context or leaving out some information in the source text. A prototype MT system is implemented, incorporating the usual MT steps, analysis (analyzing English sources into an English-oriented semantic representation), transfer (transferring the English-oriented semantics into a Japanese-oriented semantics), and generation (building Japanese targets from the transferred semantics), and adding a novel Mismatch Resolution Module (MRM) called when generation fails. In this architecture, both analysis and generation modules are purely monolingual, and transfer is simplistic, incorporating minimal context information, and the bulk of mismatch resolution and disambiguation is done in the generation-MRM loop, where the MRM offers solutions to the problems encountered by generation. Two kinds of MRMs are explored, logical and statistical, with the design goal of a single MRM combining the advantages of both approaches. Translations are evaluated by monolingual English speakers applying evaluation measures modeled on those of the DARPA MT program. The focus is on translating the Japanese joint venture business articles in the MUC-5 corpus into English. This project attacks the crucial mismatch resolution problem with a novel architecture, logical and statistical techniques, and on-line text resources.","title":"Logical and Stochastic Approaches to Mismatch Resolution in Machine Translation","awardID":"9628880","effectiveDate":"1996-10-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["456792","179812"],"PO":["565227"]},"17847":{"abstract":"Lay Summary Principal Investigators: Gamlin, Twieg Proposal Number: IBN-l 9634422 Recent developments in magnetic resonance imaging (MRI) allow researchers to investigate the functional activation of the brain that is associated with particular sensory, cognitive, and motor functions. To date, most of these functional MRI (fMRI) studies have been conducted at relatively low magnetic field strengths, but we can achieve higher resolutions using higher field strengths. Also, although a number of studies have investigated functional activation of the brain by various visual stimuli and during certain eye movements, few of these studies have attempted to confirm fixation accuracy or eye movement performance. This is a shortcoming of these studies, because if one is unsure that the subject is maintaining fixation or looking at the required target, it is hard to interpret the results of the experiment. Furthermore, in earlier studies, the optical systems did not permit the eyes to view high-resolution images. One aim of the research funded by this proposal is to establish a collaboration to solve technical problems that must be remedied to further understanding of how the human visual and eye movement systems operate. More specifically the aim is to develop and build a high-resolution optical and eye-tracking system to be used in a high-field MRI system. It is expected that the system developed through funding of this grant will be invaluable to all eye movement and vision-related fMRI studies, and will result in significant advances in our understanding of the workings of the human brain.","title":"CRI: A Combined Visual Display and Eye Tracking System for High-Field fMRI Studies","awardID":"9634422","effectiveDate":"1996-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"5500","name":"NEURAL SYSTEMS CLUSTER"}}],"PIcoPI":["164309","164310"],"PO":["96450"]},"12128":{"abstract":"Utah Valley State College requests support from NSF to connect three Native American Community Colleges institutions of higher education and one museum to the Internet. These include: Provo College, Provo, UT, Northwest Indian college, Washington, Institute of American Indian Arts, Santa Fe, NM, and Fort Peck Community College, Poplar, Montana. This grant will be used to help the institutions get access to the Internet. Utah Valley State College will be using Digital Wave Modulation and V+Chip Advanced Television Decoding as a method of providing lower cost access to the Internet and delivery of educational courses and programs. These rural Native American institutions needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of these institutions as well as the community in general.","title":"UVSC - Native American Community College Multi-Location Internet Connection Project","awardID":"9613949","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["30844","30845","495795"],"PO":["121202"]},"15528":{"abstract":"9626295 Hansen The Webb Institute requests support from NSF for connection to NYSERNet. NYSERNet, a midlevel network in New York, will provide operations management and information services and it will give the Institute access to the Internet, a collection of interoperable networks connecting most research and education organizations in the United States. The Institute needs the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Webb Institute as well as the community in general.","title":"Connection to NYSERNET","awardID":"9626295","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[39192],"PO":["57343"]},"14934":{"abstract":"9624082 Fussell, Donald Lam, Simon University of Texas CISE Research Infrastructure: System Support for a Hierarchy of Distributed Applications This award provides infrastructure support for the researchers at the University of Texas at Austin to conduct the basic and experimental research necessary to address the problems that lie at the core of the emerging applications. Specifically, the research proposes projects at three levels: (1) core projects that will create an infrastructure for storing, accessing, and transporting large, heterogeneous information objects; (2) exploratory projects that will develop infrastructure which will facilitate the development of the core projects; and (3) realistic and ambitious applications from each of the following three classes. The first class is information retrieval applications, such as digital libraries. These applications will support browsing of large-scale, distributed databases of multimedia information. The second class of applications adds the requirement that the multimedia information be processed, not simply browsed. Finally, the third class of applications adds the requirement of real-time interactivity.","title":"CISE Research Infrastructure: System Support for a Hierarchy of Distributed Applications","awardID":"9624082","effectiveDate":"1996-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[37838,"516340","542402","527002","261975"],"PO":["150490"]},"12767":{"abstract":"This award is to Cornell University and the IBM Research Division to develop workstation telephony. The project will create methods for carrying telephony over an integrated services network. In addition, a key result from this project will be the ability to interconnect that network transparently with existing PBX-based system and the world telephony network. In this effort, Cornell will build on its success in creating technology for low-cost pervasive QoS-capable networks (Cells in Frames), and on its success in creating a useable and widely deployed communications application (CU-SeeMe).","title":"Workstation Telephony Reducing PBX Expense","awardID":"9615811","effectiveDate":"1996-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["507658",32414,"50776",32416],"PO":["121202"]},"13307":{"abstract":"9616990 Honey, Margaret Education Development Center CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: The Portal Project The Education Development Center, Inc. has been awarded $684.260 for a 24-month period to develop computational tools, with access to World Wide Web resources, to support effective learning and integration of computational processes with real-world research problems. This software consists of a suite of computer-based, Web-enabled programs for systematically documenting, examining, and offering feedback on students' project work. The goals of the project are: (1) to develop the Portal Tools; (2) to implement the tools in up to 70 schools in five states; and (3) to evaluate the impact of the tools on student learning, through case studies and analysis of student presentations and process documents.","title":"CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: The Portals Project","awardID":"9616990","effectiveDate":"1996-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["540207","533908"],"PO":["297837"]},"12229":{"abstract":"The goals of this project are to address some of the barriers that limit accessibility and prevent widespread use of spoken language technology. In particular, the lack of portability of today's technology means that application development requires significant engineering for each new task. As a result, the high cost and level of expertise entailed restrict research and development activities to a handful of specialized laboratories. A partnership with the Universidad de las Americas, Puebla has been established to address this portability issue. Through a program of collaborative research and technology transfer, we are developing an integrated toolkit for learning about, researching and developing spoken language systems in both English and Spanish languages. This involves creating suitable infrastructure, language resources and teaching materials, as well as performing basic research to improve on the technology underlying the toolkit. The results of this work will benefit large numbers of people. We plan to distribute the resulting toolkit and resources by making them available at no cost to academic institutions throughout the United States and Mexico. This, in turn, will promote interest and understanding into spoken language technology by allowing people to rapidly design, build and experiment with spoken language systems.","title":"CONACyT: Advancing Human Language Technology in Mexico and the United States Through Collaborative Research on Spoken Language Systems","awardID":"9614217","effectiveDate":"1996-10-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551122","492262"],"PO":["183208"]},"13308":{"abstract":"9616991 Cole, Ronald Whitney, Gail Oregon Graduate Institute of Science & Technology Collaborative Research on Learning Technologies: Conceptualization of a Flagship Center for Collaborative Research in Learning and Human Language Technologies The Oregon Graduate Institute has been awarded funding in the amount of $50,000 for a period of 06 months to plan a NSF Flagship Center for Collaborative Research on Learning and Human Language Technologies. The mission of the proposed Center is to support basic research on the use of human language technology to create better tools and strategies for learning. Areas of research and tool development will include using speech as an input modality in computer assisted learning; speech training for second language learning or articulation training; speech as a primary input modality for physically challenged individuals; and speech as a context for learning about other things.","title":"Collaborative Research in Learning Technologies: Conceptualization of a Flagship Center for Collaborative Research in Learning & Human Language Technologies","awardID":"9616991","effectiveDate":"1996-10-01","expirationDate":"1997-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["60234","551122"],"PO":["289456"]},"12803":{"abstract":"USC\/ISI will create and maintain TRAIL, Testbed Routers for Advanced Internet Labs. The TRAIL software will be a freely available, well maintained, community research router source, featuring IPv6 in particular. The work will extend and leverage developments and facilities of the Collaborative Advanced Interagency Research Network (CAIRN), organized by ISI under current DARPA funding. CAIRN is a T1, DS-3 and OC-3 wide area router testbed. The software is for two classes of hardware: 1) high performance but low-cost personal computers, supporting small numbers of router interfaces and 2) specialized router hardware, supporting the large numbers of interfaces that are characteristic of internet interconnect points, and providing a realistic experimental model of commercial IP routing technology. For the second class of hardware, one vendor who supports such numbers of high-speed interfaces proved interested in donating full source code to be used as the base of TRAIL. Therefore, the second class of hardware for TRAIL is the Ascend\/Netstar, Gigarouter. It supports 32 OC-3 ATM ports, or combinations of ATM ports with 16 to 128 fast ethernet ports. The proposal focuses strongly on support of experimental users. ISI's care will be devoted to supporting their software, and maintaining and distributing versions for PC alone, and for PC along with Gigarouter. ISI will also maintain facilities for IPv6 networking research collaboration, and coordinate the North American portion of the experimental IPv6 backbone, the \"6bone\".","title":"Testbed Routers for Advanced Internet Lab (TRAIL)","awardID":"9615927","effectiveDate":"1996-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["427568","335768"],"PO":["125800"]},"11736":{"abstract":"The is a joint effort through subcontracts, with Raj Roy, Georgia Institute of Technology, and Steven Strogatz, Cornell University The researchers will investigate synchronization of chaotic lasers for purposes of using chaos as a carrier for new modes of communication including multiplexing information bearing signals and private communications using chaotic carriers as well as methods for optical channel equalization using nonlinear properties of the fiber. The program will include experiments on Nd:YAG and Erbium Doped lasers, analysis of synchronization methods and innovative communications techniques, and mathematical analysis of synchronization of a few and assemblies of chaotic oscillators with application to optical communications. A \"group meeting\" workshop will be held semi-annually and each year we will invite experts in optics, optical engineering, and optical communications to provide additional research expertise to broaden the horizons of the students, postdoctoral fellows, and faculty involved in this project","title":"Synchronization and Communication in Nonlinear Optical Systems","awardID":"9612250","effectiveDate":"1996-10-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}}],"PIcoPI":["436476"],"PO":["234222"]},"15829":{"abstract":"Frank 9627259 Most organisms have a community of bacteria, viruses and other microorganisms living within their bodies. These microorganisms are called symbionts. Some of these symbionts are parasitic, causing harm to their hosts. In other cases the hosts depend on their symbionts for nutrients, digestive enzymes and defense against other parasites. This study analyzes the evolution of symbiont life history traits. These traits include reproductive rate within the host, the time-course (life-span) of infection, mode of transmission between hosts, and harm or benefit to the host. The host's potential to control their symbionts will also be analyzed. For example, some hosts appear to manipulate the timing and mode of their symbionts' reproduction and transmission. Such host control may have a strong influence on the tendency of symbionts to evolve from harmful to beneficial partners. This research develops mathematical and computer models to clarify the basic processes that influence host-symbiont evolution. The general models are then applied to a wide range of particular systems. One example focuses on the varying degree of harm (virulence) that bacteria cause their hosts. A second example is the relationship between mode of transmission and the life history of symbionts that aid the digestive processes of their insect hosts.","title":"Life History Models of Symbiosis","awardID":"9627259","effectiveDate":"1996-10-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1174","name":"POPULATION DYNAMICS"}}],"PIcoPI":["550018"],"PO":["306249"]},"6860":{"abstract":"9529961 Hart This Small Business Innovation Research Phase II project will develop a new imaging technology called nonfrontal imaging. The core of this new approach is active control of imaging geometry to eliminate the mechanical adjustment of sensor plane location usually required for focusing, and exploit imaging geometry and optics to achieve focusing from camera's panning motion alone. This not only results in high imaging speeds but also in seamless panoramic images. A nonfrontal imaging camera can obtain a panoramic focused image of all objects in an arbitrarily large scene regardless of their locations, which is in registration with a range map acquired in parallel. Development of algorithms and the building of a working prototype are proposed which will have the following capabilities: panoramic focused image acquisition, panoramic range image acquisition, and omni-focused 3D stereo display. All these capabilities will be achieved at multiple resolutions and for up to 360-degree views of the scene. Sensor surface orientation will be controlled in a dynamic, data-driven mode. The prototype will be tested primarily in applications involving photography and surveillance, and to a lesser extent surgery and manufacturing. The system development will be done in consultation with industry. It is expected that the resulting technology will introduce hitherto unavailable capabilities as well as lead to significant strides in existing capabilities. A US patent on the camera has been awarded, and foreign patents have been filed. Potential commercial applications are: Wide-scene studio photography; Outdoor nature photography; Endoscopic and neurosurgery; Television broadcasting; Geometric modeling for computer aided manufacturing; Surveillance of homes, stores and compounds; Virtual reality using omni-focused 3D display; Advertising; Visual art; Monitoring and control of hazardous environments; Visualization; Interactive video games.","title":"SBIR Phase II: Range and Image Acquisition Using Active Control of CCD Plane","awardID":"9529961","effectiveDate":"1996-10-15","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"5373","name":"SMALL BUSINESS PHASE II"}}],"PIcoPI":["517378"],"PO":["565053"]},"11915":{"abstract":"IRI-9612768 This award funds a research-planning workshop that is intended to discuss promising new and emerging applications for robotics, and to identify research needs to facilitate the realization of those applications. The workshop is co-sponsored by the Robotics Industries Association and by the IEEE Robotics and Automation Society. It is be held in Santa Fe, New Mexico, in November 1996. The Robotics and Machine Intelligence Program of NSF has long had a strategic objective of supporting research that would enhance robotics system performance and usability, thereby gaining acceptance and adoption of robotics technologies across a broad spectrum of application domains. The workshop aims to establish or enhance connections between technology researcher\/developers and potential end users, leading to stimulation of research of increased strategic value. Thus, the design of the workshop includes involvement of lots of industry participants, primarily representing end-users, with a few robotics vendors, and a number of academic researchers. Discussion groups will address needs identification, research identification, and research transition. Several planned publications from the workshop should assure wide dissemination of the findings and recommendations.","title":"NSF\/IEEE\/RIA Workshop on Research Needs in Robotics and Intelligent Machines for Emerging Industrial Applicaitons; October 28, 1996; Albuquerque, New Mexico","awardID":"9612768","effectiveDate":"1996-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["362108"],"PO":["125480"]},"5553":{"abstract":"The Somerset Laboratory is a facility being developed at the University of Virginia that provides a focus for experimental research in safety-critical software engineering. Over the long term, the intent of the laboratory is to establish empirical research with safety- critical systems as a sub-field of software engineering. The laboratory provides the following to researchers World wide, via the Internet: (1) A comprehensive set of artifacts associated with a small number of safety-critical applications that, to the extent possible, describe the applications accurately and comprehensively. There are sufficient artifacts and the artifacts are of sufficient quality that researchers can perform substantial experiments which will be very similar to those that they could be perform if they had direct access to the actual applications. (2) A repository of the results of research projects undertaken using the available applications. This repository contains contributed artifacts, tools, research papers, data files, and contact information. As well as allowing dissemination of results, the repository facilitates cooperative research by alerting researchers to the status, plans, and work of others. (3) A vehicle for accurate comparison of software engineering techniques for safetycritical systems. Using the artifacts associated with the safety-critical applications in the laboratory, researchers are able to evaluate tools and techniques and then compare and contrast different tools and techniques. The comparisons are especially significant in this case because data is obtained by applying them to precisely the same applications. By carrying out experiments using extensive material from actual safety-critical applications, researchers are presented with the complex details of such applications. Dealing with these details helps to ensure the relevance and practical value of the research that is undertaken. In addition, once a solution concept or approach is devised, it can be evaluated (at least in part) by applying it to one or more sample safetycritical applications thus providing a believable assessment. The first safety-critical application that the laboratory has chosen to support is a nuclear reactor. The reactor is a lowpower, research reactor that employs a conventional electromechanical control system. Though a small reactor, it presents significant challenges to researchers interested in softwarebased control and safety systems. The artifacts being developed for the laboratory include details of the reactor's physical structure, the safety rules that must be enforced, digitized images of key elements of the physical equipment, sample traces of all the reactor's sensors, a reactor simulator, and complete wiring diagrams. The goal of this planning grant is to obtain an assessment of the likely level of interest in the laboratory by the research community and to develop a detailed plan for the implementation of the laboratory. ***","title":"The Somerset Laboratory: An Open Facility for Experimentation in Safety-Critical Systems","awardID":"9525843","effectiveDate":"1996-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["402466"],"PO":["561889"]}}