{"61329":{"abstract":"TITLE: Image Coding with Constraints<br\/><br\/>ABSTRACT<br\/><br\/>This project studies image and video coding schemes for emerging and future<br\/>networks. The study concentrates on certain specific types of image coding<br\/>including facsimile, still imagery, and video. Networks of the future will<br\/>consist of hybrid combinations of wired and wireless components. Commercial<br\/>products such as digital cameras, cell phones, and PDAs will send and\/or<br\/>receive images of various types over a wide range of network channel<br\/>conditions. The networks impose constraints such as: low data rate and<br\/>high\/unpredictable packet losses. The devices impose constraints including<br\/>small batteries, small displays, low delay, limited memory, and limited<br\/>processing power. Together, these constraints make the design of inexpensive<br\/>and efficient image transmission devices of the future a very challenging task.<br\/>In addition to designing such systems, a solid theoretical understanding of the<br\/>achievable qualities and limitations is important to know.<br\/><br\/>The main objectives of this research are to achieve deep theoretical<br\/>understanding of source and channel coding for images transmitted on lossy<br\/>networks and to develop practical algorithms that can be effectively used in<br\/>real applications. The work exploits the diverse backgrounds of the PIs in<br\/>image and video coding and combined source\/channel coding. The investigation<br\/>involves code design, theoretical analysis, and computer simulation.<br\/>The main topics investigated for constrained image coding include:<br\/><br\/>(1) Robust facsimile transmission,<br\/>(2) Robust low rate video source coding,<br\/>(3) Error correction, resilience, and concealment.","title":"Image Coding for Constrained Systems","awardID":"0105734","effectiveDate":"2001-11-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["517054","507609"],"PO":["564898"]},"68029":{"abstract":"The objective of this project is to design efficient indexing strategies that support flexible retrieval metric through relevance feedback learning. However, trying to satisfy both goals (efficiency and flexibility) at the same time leads to a conflict. A novel approach is explored to capture the inherent interplay between flexible metrics and indexing that has the potential to resolve the conflict. It is hypothesized that the interplay can be exploited to create effective content-based retrieval systems that meet performance and computational challenges encountered in practical image database applications. This exploratory project seeks to establish the proof of concept of an approach that trades off accuracy for efficiency, and that can avoid exhaustive search in large-scale image databases. The methods to be explored are based on bump-hunting in high-dimensional data for inducing a set of (possibly overlapping) boxes that capture the local data distributions. The induced boxes effectively cover the feature space, thereby providing an index to the image database. The flexibility and efficiency of the novel indexing technique will be tested in heterogeneous image databases that support a variety of query types, ranging from query-by-image to query-by-region. If successful, the results of this project will enable the use of flexible metric learning in large scale image databases, which will have a significant impact in content-based image retrieval in broad areas such as health-care, scientific images, education, or art.","title":"SGER: Flexible Index Structure for Relevance Feedback Content-Based Retrieval in Large Image Databases","awardID":"0136348","effectiveDate":"2001-11-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["550606",176134],"PO":["563751"]},"66988":{"abstract":"This proposal will fund a workshop which brings together leading US librarians and computer specialists to address the needs for quality information in digital libraries. It will address selection of materials for scanning and content needs for large-scale digital libraries, in conjunction with the major scanning project being directed by CMU. It will survey national needs and opportunities in the digital content area.<br\/><br\/>The workshop will take place in Pittsburgh, Pennsylvania on November 15 and 16, 2001.","title":"Million Book Project Meeting","awardID":"0131312","effectiveDate":"2001-11-15","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["355022","461693"],"PO":["433760"]},"64498":{"abstract":"ABSTRACT<br\/><br\/>Information Technology Workforce (ITWF)<br\/><br\/>Information Technology Workforce (ITWF)<br\/><br\/>Proposal Id: EIA-0120092<br\/>PI: Pascale Carayon<br\/>Institution: U. Wisconsin<br\/>Title: Paths to Retention and Turnover in the IT Workforce: Understanding the Relationships Between Gender, Minority Status, Job and Organizational Factors<br\/><br\/>This ITWF award provides support for the University of Wisconsin to conduct a study that will identify the job, organizational and quality of working life (QWL) factors that influence turnover intention within the current IT workforce, and the way gender and minority status play a role in the relationships between job and organizational factors, QWL and intention to turnover. Two different models of the role of gender and minority status will be used and tested and compared in a sample of IT employees across a range of companies and jobs. The first research model postulates that gender and minority status have direct effects on job and organizational factors and both direct and indirect effects on QWL and intention to turnover. The second research model postulates that gender and minority status play a moderating role in the relationship between job and organizational factors and QWL and intention to turnover.","title":"ITW - ITWF: Paths to Retention and Turnover in the IT Workforce: Understanding the Relationships Between Gender, Minority Status, Job and Organizational Factors","awardID":"0120092","effectiveDate":"2001-11-15","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["386433"],"PO":["289456"]},"60794":{"abstract":"0103723-University of Delaware-Guang R. Gao <br\/><br\/>A Framework for Developing Complex Applications On High-End Petaflop-Class Machines<br\/><br\/>This research proposes to develop novel software technologies for supporting the design and implementation of complex applications on next-generation high-performance computers such as the IBM Blue Gene machine, the teraflop-class systems of the ASCI program, and the architecture (s) proposed in the NSF peta-flops point-design studies.<br\/><br\/>Future high-performance computers such as these will have large numbers of processors (from a few thousand to several hundred thousands, or even more), and a complex multilevel memory hierarchy with memories physically distributed across different parts of the machine. To use such machines effectively, enormous amounts of parallelism must be exposed in user programs, and careful attention must be paid to the latency and bandwidth of access to different levels of the memory hierarchy. The applications enabled by such high-end machines are also expected to be significantly more complex and dynamic than applications in the past. Therefore, supporting the development of such applications on next-generation high-end computers is a major software challenge.","title":"Next Generation Software: A Framework For Developing Complex Applications On High-End Petaflop-Class Machines","awardID":"0103723","effectiveDate":"2001-11-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["556730","380937","563330","475422",156449],"PO":["301532"]},"65232":{"abstract":"In this proposal, three researchers from the University of California, San Diego (UCSD), specializing in the fields of optics, communications, and computer networks, are collaborating on the Ultra-High-Capacity Optical Communications and Networking initiative. It is felt by many researchers that the most efficient and economical way to utilize optical transmission technology for large scale networking is to use wavelength division multiplexing (WDM) in a circuit switched mode, overlaid with packet switching implemented with electronics. While this may indeed be the case, it is important to investigate alternative approaches that have great potential. The UCSD team has been investigating novel techniques of information transmission via optical fiber, where code division multiple access (CDMA) using ultrashort laser pulses is employed. Compact, low cost fiber-based ultrashort pulse sources are currently being developed, making the technology suitable for future practical networks. When an ultrashort pulse is encoded for CDMA, the pulse spreads out in time and resembles a noise burst that is transmitted on the optical fiber. At the receiving node, a decoder is applied to the received signals from multiple users, which matches only the encoding of the desired transmitter. The matching signal component is transformed back to an ultrashort pulse form that can be detected over the remaining interference from other users with nonlinear optical techniques. A novel high resolution pulse synthesis and detection technique for ultrashort pulses developed at UCSD enable various data transmission formats to be considered, such as ultrafast packet transmission with on\/off keying, pulse position modulation, and amplitude modulation. The CDMA scheme enables large scale, asynchronous, concurrent access to the transmission resources. With a suitable architecture, this can be exploited to simplify network control, and increase reliability and flexibility.<br\/><br\/> The objective of this proposal is to conduct basic research by investigating theoretically and verifying<br\/>experimentally data modulation schemes for efficient information transmission in conjunction with CDMA encoded ultrashort pulses in an optical fiber network. Efficient modulation formats will result in aggregate transmission rates exceeding 10's of terabits\/second, with individual user rates on the order of 1-10 gigabits\/second. The specific objectives of this proposal include modeling of the optical CDMA for ultrashort Gaussian pulses, complete statistical analysis of the transmitted waveforms, investigation of various optical CDMA codes that support thousands of users with minimal interference, bit error rate analysis of received optical signals for various modulation schemes, modeling and characterization of the distortions induced by the fiber channel, adaptive equalization techniques for reducing dispersion and other fiber distortions, computer simulations of the modulation schemes, and experimental evaluation of the communication system: transmitter, optical channel, and receiver. The various phases of the proposed project complement each other. Combined together, they provide for in-depth knowledge of the theoretical and experimental issues of communicating with CDMA encoded ultrashort pulses. These findings will be shared with the scientific community, enhancing not only the knowledge base of other researchers in the field, but also of the students conducting the research. We shall demonstrate a prototype optical network with several users employing the modulation format that will carry over 10 terabits per second of information, when scaled up to the full number of users.<br\/><br\/> The potential impact of the work will be in the proof that optical CDMA encoding of ultrashort pulses is a<br\/>realizable and desirable alternative to WDM. Currently, WDM is the preferred multiplexing method due to its<br\/>simplicity and low cost. While WDM does increase the transmitted bandwidth significantly, it still does not fully utilize the available optical bandwidth due to both the need for guard bands between channels and the under utilization of channels. In contrast, CDMA encoded ultrashort pulses share the entire bandwidth without the need for guard bands, leading to efficient utilization of transmission resources. Using CDMA can also provide a highly flexible and robust infrastructure, upon which packet switching can be overlaid. The CDMA format also provides a degree of security, as no data can be extracted without knowledge of the codes employed.","title":"Ultra-High-Capacity Optical Communications and Networking: Optical CDMA with Femtosecond Pulses for Ultra-High-Capacity Communications and Networking","awardID":"0123405","effectiveDate":"2001-11-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["507610","235820","522499"],"PO":["565090"]},"65264":{"abstract":"It has long been a comfortable fallacy that the optical fiber has infinite bandwidth, and, therefore,<br\/>we have bandwidth to burn. With the explosion of multiple-channel communications through the use<br\/>wavelength-division-multiplexing (WDM), available bandwidth now takes center stage. When<br\/>comparing optical communications with other types of communications, we lag far behind in terms of<br\/>spectral efficiency (i.e., bits\/Hz) and we are not even close to the Shannon capacity limit. In fact, higher<br\/>spectral efficiency is probably the area of least creative activity within the field, and yet it holds the<br\/>promise for revolutionary increases in future systems capacity.<br\/> One of the technical areas within optical communications that has shown the most bandwidth<br\/>waste and has many future potential applications is subcarrier multiplexing (SCM) of many lower-speed<br\/>channels on a single wavelength carrier. In SCM, half the data bandwidth is wasted since either:<br\/>(i) transmitting double-sideband signals will, in essence, duplicate the data being sent given that each<br\/>sideband carries the full information needed for reception, or (ii) transmitting single-sideband signals<br\/>requires that the mirror frequencies on the other side of the carrier wave (i.e., where the second sideband<br\/>would have been located) remain unoccupied by any other data signals.<br\/> Subcarrier multiplexing has many advantages for future optical communications systems,<br\/>including: (a) the transmission of many lower-speed digital data signals on a single high-capacity<br\/>wavelength, (b) the transmission of many analog-modulated signals, (c) the transmission medium for<br\/>networks that accommodate wireless microwave-based optical signals, and (d) the transmission of control<br\/>labels for efficient routing in packet-switched networks.<br\/> We propose implementing a new multiplexing scheme that enables double the spectral efficiency<br\/>for optical systems that use subcarrier multiplexing. The scheme is called dispersion-division-multiplexing<br\/>(DDM) and relies on placing two data channels simultaneously in the same frequency space<br\/>away from an optical carrrier. For example, one double-sideband data channel is transmitted<br\/>conventionally, and a second double-sideband channel is transmitted in the shadow of the first<br\/>channel. Shadowing occurs due to the chromatic dispersion of the optical fiber. Due to dispersion, each<br\/>of the two double sidebands of a single channel will travel at slightly different speeds. These sidebands<br\/>will periodically be out-of-phase will each other relative to the optical carrier wave, thereby canceling<br\/>each other and inducing RF power fading (i.e., a nearly complete disappearing of the given channel's<br\/>power at a receiver). One channel would be faded when the other channel would be in-phase and have<br\/>full power. By using a tunable dispersion-inducing element, a receiver can change the relative phase<br\/>between each cannel's two sidebands and thus recover either of the two frequency-co-located channels.<br\/> Our research program will investigate unique functionalities, opportunities, and limitations when<br\/>using spectrally-efficient dispersion-division-multiplexing that could bear significant fruit in the 5-10<br\/>year time frame. The key fundamental features of our systems and networking research program are as<br\/>follows. We will:<br\/>(a) demonstrate highly-spectrally-efficient DDM for many WDM channels,<br\/>(b) demonstrate the utility of DDM for interconnecting nodes in a wireless-based photonic<br\/>network,<br\/>(c) demonstrate SCM label swapping and routing in a WDM photonic network, and<br\/>(d) investigate the fundamental limitations of generating, transmitting, and receiving DDM<br\/>channels when considering SNR, extinction ratio, and data bandwidth.<br\/>TABLE OF CONTENTS","title":"Novel Dispersion-Division-Multiplexing Technique for Enabling Double the Spectral Efficiency in Transmission and Routing of Photonic and Microwave Networks","awardID":"0123518","effectiveDate":"2001-11-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}}],"PIcoPI":["560689"],"PO":["565090"]}}