{"175241":{"abstract":"There is an increasing trend towards federated distributed systems, i.e., systems that are operated jointly by multiple different organizations or individuals. The interests of the participants in such a system are often highly diverse and\/or in conflict with one another; for example, participants may be business competitors or based in hostile nations. Thus, federated systems are inherently vulnerable to insider attacks: the participants can try to subvert the system, exploit it for their own benefit, or attack other participants.<br\/><br\/>However, the participants in a federated system are typically connected in the 'offline world' as well, e.g., through social networks or business relationships. This context can be leveraged to handle misbehavior through well-known, time-tested techniques like accountability and transparency. For example, if one participant can detect and prove that another participant has misbehaved, she can sue that participant for breach of contract.<br\/><br\/>The goal of this research is to develop a key technology for enabling this approach, namely a reliable and general way to generate and verify evidence of misbehavior in federated systems. The project (i) studies the fundamental tradeoffs, requirements, and inherent costs of creating evidence; (ii) develops new algorithms for efficiently supporting different kinds of evidence; and (iii) evaluates these algorithms in the context of practical systems.<br\/><br\/>The project is integrated with Penn's new undergraduate program in Market and Social Systems Engineering. It will produce and freely distribute software that can be used to defend federated systems against attacks and malicious insiders.","title":"CAREER: Evidence in Federated Distributed Systems","awardID":"1054229","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["475279"],"PO":["565327"]},"175274":{"abstract":"The focus of the proposed research is to develop a computational framework that allows for the systematic exploration of the growing human \"physiome\" for clues to predict and prevent major diseases. This research is motivated by the observation that despite recent progress in medicine, the disease burden of many important clinical conditions remains unacceptably high because of a failure to promptly match patients to treatments that are appropriate to their current condition or their individual risk. This situation is true of many different areas of medicine: in cardiology, over 300,000 deaths take place each year due to fatal arrhythmias; in psychiatry, 34% of patients with bipolar disorder have an interval longer than 10 years before they first receive a diagnosis; in the setting of intensive care, there are over 650,00 cases of unanticipated sepsis each year. These are only some examples, where the therapies to significantly improve patient outcomes and reduce healthcare costs exist, but are often not applied in a timely fashion due to the absence of adequate information-based tools to guide their use.<br\/><br\/>There is a critical need in this setting for novel biomarkers to guide decision-making. Particularly striking is the lack of good biomarkers that exploit recent advances in acquiring large physiological datasets continuously from patients over long periods. The existing practice of discovering disease markers in such data is highly dependent on human input and subjective abilities; inappropriate for large datasets and subtle markers; and unable to generalize for different systems and diseases. The goal of this research is to bridge this gap, through computational methods for the structured discovery of novel, highly-discriminative risk markers from terabytes and even potentially petabytes of physiological data.<br\/><br\/>Inspired by the translational impact of computational biology in extracting valuable insights from large volumes of genomic and proteomic data, this research endeavors to lay the foundations of a complementary body of research focused around a vision of \"computational physiomics\". The PI proposes a computational framework where large volumes of waveform data are first abstracted into a uniform string representation, and the resulting physiological text is then studied for characteristics associated with risk. The abstraction of physiological signals into text creates the opportunity to study these signals in a fundamentally different manner from earlier efforts (and to thereby discover new insights). As part of this work, the PI will address the challenges associated with transforming the many different kinds of physiological time-series signals (e.g., quasi-periodic, aperiodic, non-uniformly sampled, multi-channel) into symbolic sequences, registering these symbols across patients, formulating problems relating to risk stratification in the context of textual data, and developing algorithms to efficiently and accurately solve these problem statements. In addition, through extensive collaborations with clinical colleagues, he will rigorously evaluate the clinical utility of the research on real-world datasets drawn from different high-impact clinical applications.<br\/><br\/>Early investigation of the ideas that form the basis of the proposed work have shown great promise for cardiovascular applications. Clinical studies in two separate cohorts with nearly 6,000 patients show that the computational framework enables the discovery of risk markers from ECG signals that identify patients at an 8-9 fold increased risk of death within three months of a heart attack, and moreover, that this information is independent of other generally accepted risk variables (e.g., demographics, comorbidities, imaging results, biomarkers, other ECG variables etc.). The research should enable continued progress in the case of cardiovascular disease, as well as similar progress for other focus applications (e.g., psychiatry, critical care, neurology, and obstetrics) through clinical collaborations. In addition to impact in these specific cases, the research also lays the foundation of a broader body of research (i.e., the vision of \"computational physiomics\") that can transform medical data analysis by including large volumes of continuous physiological signals in a rubric that today can only handle discrete data. This research represents a central piece in this context that connects advances in continuous patient monitoring to advances in classification methods. While the research is motivated by clinical applications, the computational questions addressed by the work and the techniques will also advance existing work on time-series prediction and on sequential data mining and machine learning more generally. The challenge of extracting insights from large volumes of time-series data is increasingly important across many different disciplines. The research promises to significantly advance both the broad g","title":"CAREER: Computationally Generated Biomarkers","awardID":"1054419","effectiveDate":"2011-02-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["496138"],"PO":["565136"]},"176055":{"abstract":"The high performance data center planning project provides computational and storage resources to generate meaningful data sets and disseminate them to the public. This project utilizes computing infrastructure with large numbers of processing cores to provide a parallel computing environment required for data processing using algorithms developed for this project. The planning phase of this project is limited in scale and provides a roadmap to building large scale infrastructure to support data management and dissemination for a range of applications. The infrastructure acquired under this project is used to (i) generate spatiotemporal data sets describing the extent and motion of hurricanes, storm systems, and other natural phenomena; (ii) create visual words, visual phrases, and visual blocks based on image contents to improve image search; (iii) manage information on search preferences and search characteristics of users for improved web search; and (iv) provide utilities to enable access to deep web data sources for scientific domains. Data sets and utilities created through this project will be made publicly available.<br\/><br\/>This project serves as a catalyst for research in many fields through the production of high quality data sets, and the production of methods and utilities required collect, manipulate, and use the data. Furthermore, this work and the hardware supporting it is being directly integrated into computer science classes to expose students to high performance computing and the value of high quality data sets for research.","title":"II-NEW: Shared High Performance Data Center","awardID":"1058724","effectiveDate":"2011-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["543548",471813,"543550","543550","543551"],"PO":["565272"]},"175087":{"abstract":"This project has three main goals: 1) to estimate how privacy regulation will affect the shape and direction of electronic commerce; 2) to empirically investigate how online consumers respond to being given control over how their personal data are used and how these responses are interconnected across consumers; and 3) to assess how best organizations can safeguard and protect consumer data and the legal risks that might entail, with particular application to the health sector.<br\/><br\/> This 5-year integrated program of research will build upon concepts from multiple fields, including computer science, economics, marketing and information systems, to measure and evaluate the current effects and the likely future effects of various ways of regulating firms' use of consumer data online. The research program combines computer science techniques designed to optimize the mining of online information with economic analysis and policy evaluation techniques. The research will advance and synergize literatures in each of these fields, and apply these advances to the important academic topic of measuring the likely effect of privacy regulation and other governmental attempts to safeguard digital data. The program will uniquely yield prescriptive recommendations regarding significant industry and public concerns, based on scientific measurements.<br\/><br\/> The activities are designed to have broader impact within the practitioner, policy and academic community. Once the research program is complete, practitioners, policymakers and academics will have new ways that they can measure the impacts of existing and proposed privacy regulations. This will lead to clearer guidance for policymakers seeking to improve the design of privacy laws, and better practices for firms trying to retain a viable business model while safeguarding consumers' privacy. The research program will enable websites to use consumer data in ways that improve consumers' experience of online advertising, rather than unintentionally creating situations where consumers feel that their privacy has been violated. It will help guide privacy regulation directed at protecting the most vulnerable types of digital consumer data, such as digitized patient records, from unintentional security risks.<br\/><br\/> The educational program will create a new mentoring program for undergraduate and graduate students, focusing especially on recruiting undergraduate and graduate women and under-represented minorities with an interest in the intersection between information systems and public policy. It also involves a specialized digital data and privacy course at MIT Sloan School of Management, introducing a generation of students to new complexities raised by protecting privacy when digitization automates the collection of potentially personal data. It is increasingly important for business students to come to grips with the privacy challenges and the business practices encountered when using the Internet, and such course development will assist in that process. A graduate student seminar will help more technically-minded students understand the nuances of applying policy evaluation techniques to IS policy issues. The data, results and educational exercises resulting from this proposal will be made available to the broader academic community, to further disseminate the planned research and teaching advances.","title":"CAREER Digital Privacy and Regulation","awardID":"1053398","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["520821"],"PO":["565227"]},"175352":{"abstract":"Multithreaded programs are becoming increasingly critical driven by the<br\/>rise of multicore hardware and the coming storm of cloud computing.<br\/>Unfortunately, these programs remain difficult to write, test, and debug.<br\/>A key reason for this difficulty is nondeterminism: different runs of a<br\/>multithreaded program may show different behaviors depending on how the<br\/>threads interleave. Nondeterminism complicates almost every development<br\/>step of multithreaded programs. For instance, it weakens testing because<br\/>the schedules tested may not be the ones run in the field; it complicates<br\/>debugging because reproducing a buggy schedule is hard.<br\/><br\/>In the past three decades, researchers have developed many techniques to<br\/>address nondeterminism. Despite these efforts, it remains an open<br\/>challenge to achieve both efficiency and determinism for general<br\/>multithreaded programs on commodity multiprocessors.<br\/><br\/>This project aims to address this fundamental challenge. Its key insight<br\/>is that one can reuse a small number of schedules to process a large<br\/>number of inputs. Based on this insight, it takes an approach called<br\/>schedule memoization that memoizes past schedules and, when possible,<br\/>reuses them for future runs. This approach amortizes the high overhead of<br\/>making one schedule deterministic over many reuses and makes a program<br\/>repeat familiar behaviors whenever possible. A real-world analogy to this<br\/>approach is animals' natural tendencies to follow familiar routes to avoid<br\/>hazards and discovery overhead of unknown routes.<br\/><br\/>The greatest impact of this project will be a novel approach and new,<br\/>effective systems and technologies to improving software reliability, thus<br\/>benefiting every business, government, and individual.","title":"CAREER: Making Threads More Deterministic by Memoizing Schedules","awardID":"1054906","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["508314"],"PO":["565255"]},"175176":{"abstract":"Natural language processing (NLP) is a key technology for the digital age. At the core of most NLP systems is a parser, a program which identifies the grammatical structure of sentences. Parsing is an essential prerequisite for language understanding. But despite significant progress in recent decades, accurate wide-coverage parsing for any genre or language remains an unsolved problem. The broader impact of this CAREER project will be to advance the state of art in NLP technology through the development of more accurate statistical parsing models. <br\/><br\/>Since language is highly ambiguous, parsers require a statistical model which assigns the highest probability to the correct structure of each sentence. The accuracy of current parsers is limited by the amount of available training data on which their models can be trained, and by the amount of information the models take into account. This CAREER project aims to advance parsing by developing novel methods of indirect supervision to overcome the lack of labeled training data, as well as new kinds of models which incorporate information about the prior linguistic context in which sentences appear. It employs Bayesian techniques, which give robust estimates and allow rich parametrization, and applies them to lexicalized grammars, which provide a compact representation of the syntactic properties of a language.<br\/>This CAREER project will also train graduate students in natural language processing and develop materials that can be used to teach middle and high school students about NLP and to inspire them to pursue an education in computer science.","title":"CAREER: Bayesian Models for Lexicalized Grammars","awardID":"1053856","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["511678"],"PO":["565215"]},"179488":{"abstract":"The project funds two related activities for US-based graduate students: (1) attendance at the doctoral consortium at the International Joint Conference on Artificial Intelligence (IJCAI), where students discuss their research with senior members of the community, network with students from around the world, and discuss issues related to ethics in computing research; (2) extended research visits to European research groups, where students are exposed to new research paradigms and approaches within artificial intelligence and robotics, and build bridges between the European host and their own research group for long term cooperation. <br\/><br\/>The goals of the project are to give students a clearer idea of what ethical dilemmas they may encounter as computer scientists; meet other students and professionals; have the opportunity to present their work to others in related research subfields; receive feedback from a senior member of their research community. Students who participate in the extended visits also do research with a new research group and\/or begin a new research project; work with European colleagues; live, albeit briefly, in a foreign country; report their work at the doctoral consortium. <br\/><br\/>The outcomes of the project are assessed with pre- and post-surveys administered to the students and the European hosts. Participation in the project is expected to help graduate students become members of the international community of scholars, and develop into the global scientists that are needed for the future. These cooperations will advance science and industry in all countries.","title":"IJCAI 2011 Doctoral Consortium and International Experience","awardID":"1107011","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["516895"],"PO":["564316"]},"175232":{"abstract":"Language-based security (the use of programming language abstractions and techniques for security) holds the promise of efficient enforcement of strong, formal, fine-grained, application-specific information security guarantees. However, language-based security has not yet reached its potential, and is not in widespread use for providing rich information security guarantees.<br\/><br\/>This research makes language-based security techniques more practical, and thus helps improve the information security of new and existing computer systems. It does so through three complementary approaches.<br\/><br\/>First, this project develops techniques to make information security guarantees proportional to programmer effort, which both reduces the cost of entry for attaining formal information security guarantees, and allows incremental improvement of a program?Äôs security guarantees, as resources and requirements allow. Second, this project develops new ways to express and reason about rich information-security requirements, such as the required release of information, availability requirements, production of audit logs, and anonymity requirements. Third, information security in concurrent settings is addressed by exploring synergies with newly developed concurrent language mechanisms.<br\/><br\/>Techniques and mechanisms resulting from these explorations will be incorporated into a new programming language that helps programmers build computer systems with formal, fine-grained, application-specific information security guarantees.","title":"CAREER: Practical, Expressive, Language-based Information Security","awardID":"1054172","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[469943],"PO":["565264"]},"175364":{"abstract":"A revolution in music production and distribution has made millions of songs instantly available to virtually anyone, on the Internet. However, a listener looking for \"dark electronica with cello\" or \"music like U2's\", without knowing a relevant artist or song name, or a musicologist wanting to search through large amounts of unknown ethnic music, would face serious challenges. Novel music search and discovery technologies are required to help users find the desired content.<br\/><br\/>The non-text-based, multimodal character of Internet-wide information about music (audio clips, lyrics, web documents, images, band networks, etc.) poses a new and difficult challenge to existing database technology that depends on unimodal, text-based data-structures. This project addresses two fundamental research questions at the core of addressing this challenge: (1) The automated annotation of (non-text-based) audio content with descriptive keywords; and (2) the automated integration of the heterogeneous content of multimodal databases, to improve music search and discovery on the Internet or in a personal database. The resulting architecture leverages the automation and scalability of machine learning with the effectiveness of human computation, engaging music professionals or enthusiasts around the world.<br\/><br\/>The research addresses questions at the core of multimedia information retrieval in general, enabling the design of a new generation of expressive and flexible retrieval systems for multimodal databases, with applications to music discovery, video retrieval, indexing multimedia content on the home PC, etc.<br\/><br\/>The results of this project, including a software library and annotated music data sets, will be incorporated in ongoing education and outreach activities and disseminated via the project website (http:\/\/cosmal.ucsd.edu\/~gert\/CAREER.html) to enhance research and education in music information retrieval.","title":"CAREER: An Integrated Framework for Multimodal Music Search and Discovery","awardID":"1054960","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["500272"],"PO":["563751"]},"175276":{"abstract":"Wireless image\/video communication networks are proliferating rapidly in applications like smart camera systems, military and civilian surveillance, green buildings, immersive computing, bio-telemetry, and autonomous robots\/vehicles. Low-power embedded systems for multimedia sensing and communication are essential for their effective deployment. This research explores principles to minimize power dissipation of embedded systems for real-time imaging, high-volume multimedia processing, and wireless communication in time-varying noisy channel under Quality-of-Service (QoS) constraints. The heterogeneous integration of image sensor, memory, digital, and RF in a 3D-integrated circuit (IC) is explored to achieve this goal. The functional and physical interactions of components, algorithms, and environment in the 3D heterogeneous IC is investigated to create system design, physical analysis, and real-time control principles for power reduction. The principles are applied to design a low-power 3D wireless image sensor node for high-quality image\/video communication network. <br\/>The educational plan of the project includes creating a new undergraduate course, \"Physics of Computation\", a visual VLSI learning tool, and a \"toy-sensor\" chip design project for undergraduate courses; and fostering undergraduate research. This plan develops the pedagogical methods and tools for delivering an integrative learning of VLSI, instead of isolated skills in device, circuits, and systems, to next generation students. The outreach activities include engagement with the Summer Undergraduate Research in Engineering\/Science program at Georgia Tech; recruiting under-represented students through the Facilitating Academic Careers in Engineering and Science for African-American students program; and participation in the First Lego League for the middle school students in the State of Georgia, hosted by ECE, Georgia Tech.","title":"CAREER: 3D Heterogeneous Integration for Power Reduction in Embedded Systems: Application to Wireless Image Sensing and Transport","awardID":"1054429","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518444"],"PO":["565255"]},"175166":{"abstract":"The Internet consists of one of the most complex distributed software infrastructures in existence, made up of a vast intertwining of systems and protocols implemented over an enormous collection of routers and servers. Unfortunately, the extreme complexity of this software leads to a highly rich variety of hard-to-isolate failure modes and anomalies, turning the operation of a modern large-scale networked system into a constant process of finding and fixing problems. Research on debugging modern networked systems has thus far focused on \"removing the human from the loop\" by automatically detecting problems that violate predefined correctness conditions. However in practice, the enormous complexity of networks coupled with the fundamental need for domain-specific knowledge to localize problems limits the applicability of existing research, leaving debugging today a painstakingly manual process.<br\/><br\/>In this work, the researchers take a very different approach; namely, the position that manual labor is a necessary evil of debugging problems in networked systems, but that this process would be vastly simpler with in-network support for debugging. In this vein, the work develops techniques and tools for interactive debugging of wide area networked systems. Networked software presents new challenges for interactive debugging, including determining an ordering and global view of events in the face of high dynamism and extremely large scale, enabling the troubleshooter to interactively understand the underlying problems present in inherently massive and potentially incomplete sets of observations, localizing problems in the presence of competitors and adversaries that may subvert or limit information available to the debugger, and isolating the operational network's performance from the debugging process.<br\/><br\/>Intellectual Merit: This project will design the first interactive debugging system for modern networked systems. This work will make significant contributions to network architecture and protocol design, including: (a) a network-layer substrate that allows for tight controls on network execution, to provide reproducibility and performance isolation of the live network in highly distributed and dynamic environments; (b) extensions to support debugging in untrusted environments, to localize malicious behavior and to diagnose faults without requiring revelation of private inputs; (c) analytical models to fundamentally understand the level of diagnostics achievable in existing systems, and to redesign existing protocols for diagnosability; and (d) a characterization of faults in modern networks, and of human factors that slow the debugging process or harm diagnostic precision. This work will also produce new software and tools for interactive debugging of networked systems that will be made open-source.<br\/><br\/>Broader Impact: Network and service providers today spend billions of dollars hiring armies of highly skilled developers and troubleshooters. Being able to troubleshoot more efficiently reduces network downtime, improving reliability and cost-effectiveness of networking technologies. Networks that can be rapidly repaired after exceptions are an essential component of disaster survival and recovery for business and government communication systems. Simplifying network troubleshooting can also accelerate deployment of networks in underdeveloped regions lacking experienced technicians. Graduate students will benefit from industrial interactions via the researcher's six-year ongoing collaborations with AT&T Labs, and ongoing interactions with Yahoo! Labs, and Cisco Research. The work's research results regarding which components of systems and protocols are most prone to misunderstandings, leading to human error and debugging difficulty, will be applied to reduce misunderstandings in undergraduate networking classes.","title":"CAREER: Getting Rid of Bugs: Realizing Interactive Debugging of Networked Systems","awardID":"1053781","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["548463"],"PO":["565090"]},"181183":{"abstract":"This is funding to support a Young Pioneers Workshop (doctoral consortium) of approximately 18 graduate students and 2 postdocs from diverse research communities (e.g., computer science and engineering, psychology, cognitive science, robotics, human factors, human-computer interaction design, and communications), along with distinguished research faculty. The event will take place on Sunday, March 6, 2011, immediately preceding the Sixth Annual Human Robot Interaction Conference (HRI 2011) to be held March 7-9, 2011, in Lausanne, Switzerland, and which is jointly sponsored by ACM and IEEE. The theme of HRI 2011 is \"Real World HRI,\" which highlights HRI in which basic scientific research is further tested in real world settings or applied to questions that arise in real world settings. One central aspect of this type of research, in contrast to other realms of applied research, is that it is theoretically driven and feeds back to our theoretical understandings; as such, real world research fortifies our understanding of people, robots, and interaction between the two. More information about the conference is available at http:\/\/hri2011.net.<br\/><br\/>The Young Pioneers Workshop is designed to complement the conference, by providing a forum for students and recent graduates in the field of HRI to share their current research with their peers and a panel of senior researchers in a setting that is less formal and more interactive than the main conference. During the workshop, participants will talk about the important upcoming research themes in the field, encouraging the formation of collaborative relationships across disciplines and geographic boundaries. To these ends, the workshop will include sessions in a variety of formats. Attendees will hear short talks from 5 selected student participants; those students not invited to give an oral presentation will participate in an interactive poster session. A panel of four senior researchers will share their expertise and insights on how to address the interdisciplinary challenge of HRI. In the afternoon, workshop attendees will be divided into groups of 3-5 members with diverse backgrounds for a breakout session in which they will be asked to design integrative projects that build upon their own submissions and which span the various sub-fields of HRI (e.g., assistive robotics, urban search and rescue, etc.) The presentation session afterward will allow 10-15 minutes for each breakout group to present a summary to the entire workshop; the organizers anticipate that the discussions will continue during dinner.<br\/><br\/>Broader Impacts: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (including but nor limited to computer science and engineering, psychology, robotics, human factors and ergonomics, and human-computer interaction). This is important for the field, because it has been recognized that transformative advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming years. Participants will also gain leadership and service experience, as the workshop is largely student organized and student led. The PI will act aggressively to recruit young researchers from minority and underrepresented groups in order to assure diversity of the participants across a variety of dimensions, so that the students' horizons are broadened to the future benefit of the field. The PI will conduct pre- and post-workshop surveys in order to validate the effectiveness of the 2011 Young Pioneers Workshop.","title":"HRI Pioneers Workhop","awardID":"1115939","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[485514],"PO":["565227"]},"178753":{"abstract":"The IEEE International Symposium on Dynamic Spectrum Access Networks (DySPAN) will be held in Aachen, Germany from May 3 to May 6, 2011. This proposal requests funds to support 10 graduate students in the United States to attend this conference. Participated students will have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of other leading researchers in the field. This is an extremely important part of the graduate school experience. The support provided enables the participation of students who would otherwise be unable to attend DySPAN 2011. The project will also promote diversity by encouraging and enabling women and underrepresented minorities to participate.","title":"IEEE DySPAN 2011 Student Travel Grant to be held in Aachen, Germany May 3-6, 2011.","awardID":"1103677","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["540078"],"PO":["557315"]},"176179":{"abstract":"The very large models used in cloud-climate studies must be supported by a suitably designed infrastructure for data management, analysis, and visualization. These needs are community wide and should be addressed in a coordinated fashion that serves the community as a whole.This is a proposal to plan for a Community Infrastructure Development, Deployment and\/or Operations (CI-ADDO) proposal to be submitted in summer 2011. The community to be served by the planned infrastructure consists of researchers associated with a broadly based NSF Science and Technology Center that focuses on the role of clouds in climate change. The infrastructure will have hardware, software, education, and outreach components.","title":"CI-P: Cyber-Infrastructure for the Cloud-Climate Community","awardID":"1059323","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["563144",472132,"499736"],"PO":["565272"]},"175300":{"abstract":"This project will amplify the efforts of computer scientists who do outreach to middle school students by capturing mentor-mentee interactions and using this captured content to create a virtual mentoring system to support independent learners (children without access to computer science experts) within the Looking Glass programming environment. Looking Glass is a novice programming environment that presents programming as a means to the motivating end of creating 3D animated stories. In the system to be developed, mentors will do three things: First, a mentor watches the story-programs his or her mentee created and writes a code suggestion: new or revised functionality that will help to improve the mentees' programs. Next, the mentor edits a draft tutorial that Looking Glass has automatically generated from the mentor's code suggestion. Looking Glass then sends this edited tutorial to the mentee. Finally, the mentor writes rules that help Looking Glass identify contexts in which that code suggestion could be helpful. Looking Glass will use the mentor-contributed code suggestions, personalized tutorials, and rules to provide virtual mentoring for independent learners. Specifically, this project will explore three hypotheses: <br\/><br\/>Hypothesis One: The approach of capturing and evaluating mentor-created learning materials will enable the creation of a virtual mentoring system to support independent learners. <br\/><br\/>Hypothesis Two: Independent learners who are presented with in-context code suggestions that both further their stories and introduce new programming concepts will develop greater programming skills than those without access to these suggestions. <br\/><br\/>Hypothesis Three: Independent learners who are presented with personalized tutorials based on their experience level with each topic presented will perform better than independent learners who are presented with a single level of scaffolding. <br\/><br\/>The National Academy of Engineering lists personalized learning as one of the grand challenges for engineering in this century. This project will develop and evaluate the impact of two techniques for personalizing learning: program-specific code suggestions and personalized, multi-level tutorials. The majority of research into educational environments has focused on formal educational settings, but Looking Glass will advance research in how to effectively support independent learning in open-ended software environments. The enhancement to Looking Glass will provide an environment for exploring computer programming and learning support through virtual mentoring to middle school children without access to computer science learning opportunities. The project's educational plan uses biographies of computer scientists integrated into Looking Glass and a research blog to help middle school children develop an accurate image of computer science.","title":"CAREER: Looking Glass: Leveraging Mentor Interactions to Create Personalized Programming Help for Independent Learners","awardID":"1054587","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["565193"],"PO":["564456"]},"175333":{"abstract":"The goal of this research project is to transform the way that complex time-varying scientific phenomena are analyzed using computers. The project makes possible a new style of aggregate and comparative analysis of large, high-resolution scientific motion databases. The approach combines the high-bandwidth channel of the human visual system with computational algorithms and interactive data exploration.<br\/><br\/>The experimental research is integrated with educational efforts, including training computer scientist students in interdisciplinary research via a new course, a new writing-focused curriculum, and broadly disseminated lesson plans. Artists and designers are direct participants in the research, opening up new career paths in the sciences for visually creative students. Hands-on interactive visualizations engage 7-12th grade minority and underprivileged students in scientific computing. <br\/><br\/>The results include experimentally grounded guidelines for perceptually accurate visualization, new techniques for coupling dimensionality reduction with illustrative data visualization, and tested human-computer interfaces for exploring spatially complex multidimensional data. These results are significant because they lead to new understandings of the coupled relationship between people and computing, specifically helping scientists move from vast, complex datasets to new insights. The broader impacts of the work lie in applications to multiple disciplines including musculoskeletal biomechanics, evolutionary biology, and geospatial science. Through specific applications, the work yields insights that could lead to improved treatments for spinal disorders and diseases in children and adults, and inform new theories of historical diversification among animals. Project results will be disseminated via open source software, videos, publications, and demos, all available on the project web site (http:\/\/www.cs.umn.edu\/~keefe\/NSFCAREER).","title":"CAREER: Picturing Motion: Analyzing Multidimensional Time-Varying Data through Perceptually Accurate Exploratory Visualization","awardID":"1054783","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["565145"],"PO":["563751"]},"175344":{"abstract":"Faster numerical simulations are critical, for example, in basic science for enabling novel scientific discoveries, or in engineering for developing revolutionary new products. Most research in this vein aims to develop new algorithmitic implementations to accelerate computations. Rather than moving down that path, this research first answers the question: \"by how much can we accelerate a given computation?\" The second component, then, is to develop highly-efficient algorithms able to reach these minimum time limits. Our research leads to a better understanding of our algorithms and their intrinsic limitations, and eventually results in better, near-optimal algorithms. Both components of this research represent tremendous challenges given the complexity of the current computing architecture and the problem to be solved.<br\/><br\/>The results of this research will be communicated in an integrated education component of this project in which previous and recent work and methodologies are disseminated through classes, the publication of a book, the distribution of source codes and the development of web documents. Important taxonomy and bibliographic work will be performed during interdisciplinary math\/CS reading classes. Broader outreach activities are conducted in K-12 classrooms and through public STEM- related events in the metropolitan Denver area.<br\/><br\/>The research in the project includes three components. Given a numerical problem to be solved, the investigator (1) develops an ad-hoc model detailing the theoretical limitations of the computational machine, (2) simulates the execution of an algorithm based on the ad-hoc model, and (3) conducts numerical experiments on the targeted architecture. The investigator's methodology applies iterate improvements between these three components until they match. Each improvement requires answering several open questions in terms of lower bounds and algorithms.","title":"CAREER: Foundations for Understanding and Reaching the Limits of Standard Numerical Linear Algebra","awardID":"1054864","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["558541"],"PO":["565251"]},"175245":{"abstract":"This project seeks to develop logical foundations for cyber-physical systems (CPS), i.e., systems that combine cyber aspects such as communication and computer control with physical aspects such as movement in space. CPS applications abound. Ensuring their correct functioning, however, is a serious challenge. Scientists and engineers need analytic tools to understand and predict the behavior of their systems. This is the key to designing smart and reliable control. By providing such analytic foundations, this project addresses an intellectual grand challenge that has substantial scientific, economical, societal, and educational impact arising from the benefits of improved CPS analysis and design. In order to tame their complexity, this project studies CPS as multi-dynamical systems, i.e., in terms of the elementary dynamical aspects of their parts.<br\/><br\/>Multi-billion dollar industries spend 50% of the development cost on control software design and testing. This cannot be sustained any longer. The foundations of computer science have revolutionized our society. We need even stronger foundations when software interacts with the physical world. Multi-dynamical systems concepts provide a unifying principle for education and enable students to focus on one dynamical aspect at a time without missing the big picture. They overcome the divide between computer science and engineering that keeps causing irreconcilable differences among design teams. This project develops cross-departmental graduate\/undergraduate courses on Mathematical Foundations of CPS as prime examples of STEM integration. Long-term goals include a K-12 outreach that inspires young people to pursue science careers through an early exposure to both mathematical beauty and exciting societal challenges. CPS foundations excel in demonstrating the paramount importance of discrete and continuous mathematics, not as separate disciplines, but well-integrated.","title":"CAREER: Logical Foundations of Cyber-Physical Systems","awardID":"1054246","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[469969],"PO":["565255"]},"176147":{"abstract":"A detailed architecture simulator is indispensable for computer architects. Unfortunately, today's fastest simulators do not provide desirable simulation throughput. The problem becomes even more serious when the target of a study is next-generation systems having hundreds of processor cores. The lack of a fast and versatile multicore system simulator will seriously hamper the productivity of researchers, as well as their capability to produce timely technical innovations. Moreover, existing teaching infrastructures are predominantly for outdated single-core systems. This project is for planning the submission of a CI proposal to create and deploy a very fast and versatile simulation and emulation infrastructure that can model and evaluate a large multicore processor system using realistic workloads.<br\/>The proposed infrastructure focuses on the core components of architectural research in the multicore paradigm - the design of the memory hierarchy and interconnect. The PIs plan to integate developed high-speed trace-based software and FPGA-based simulation and emulation techniques that provide orders of magnitude speedup over conventional simulation techniques. The proposed novel dual-path approach is based on a common graphical interface that allows a user to easily and quickly specify an architecture configuration and test it using these trace-driven simulation techniques.","title":"CRI: CI-P: Planning for an Innovative Dual-Path Computer Architecture Modeling Infrastructure for Highly Productive System Simulation and Emulation","awardID":"1059202","effectiveDate":"2011-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["533851","543497","475186"],"PO":["565272"]},"172089":{"abstract":"This Pan-American Advanced Studies Institutes (PASI) award, jointly supported by the NSF and the Department of Energy (DOE), will take place July 10-23, 2011, at the Instituto Geofísico of the Escuela Politecnica Nacional in Quito, Ecuador. This PASI is a collaborative effort by Olga Cabello of the Incorporated Research Institutions of Seismology Consortium (IRIS) in the United States, and the Centro Regional de Sismologia para America del Sur (CERESIS) in Ecuador. The PASI will gather together early-career researchers to develop a basic understanding of sustainable network operations and earthquake science, as well as to facilitate data exchange and collaboration. It is designed to enable graduate students and post-docs who have a strong background in the fundamentals of seismology to begin collaborating in seismological research internationally and to facilitate future collaboration.<br\/><br\/>This project has the potential to transform the culture of how seismic networks and scientists operate throughout the Americas by encouraging greater data archiving, standardization and sharing. Participants will gain the ability to implement modern seismic methods, including improving earthquake locations and source mechanisms detected by their network. Capacity building for seismic networks across the Americas will benefit the U.S. seismological community by increasing the potential for scientific collaboration with other countries where success of a project often depends on the availability of collaborators and access to reliable data. Expected outcomes for this PASI include: 1) a guide to sustainable network operations; 2) a publically distributed inventory of networks in the Americas; and, 3) a digital index of software and a portal to facilitate future international research. The PASI results will be disseminated through electronic devices for educational purposes with links, updates and logistic information, guides to the network operations, and an inventory to provide the latest data on research problems.","title":"Pan-American Advanced Studies Institute on New Frontiers in Seismological Research: Sustainable Networks, Earthquake Source Parameters, and Earth Structure; Quito, Ecuador","awardID":"1036433","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"I451","name":"Department of Energy Chicago O"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1679","name":"INTERNATIONAL COORDINATION ACT"}}],"PIcoPI":["528851","528852"],"PO":["531406"]},"175246":{"abstract":"Cyber-physical systems (CPS) are becoming the key enabler in many engineering domains from traffic management to autonomous vehicles. Concurrency, failures, and their interactions with the physical environment make it challenging to wrestle a high level of confidence from such systems. This project develops a reusable middleware service which enables the creation of verified and hence reliable distributed CPS by pushing the state-of-the-art in two directions: <br\/>(1) Existing distributed services cannot be practically implemented because of high communication costs incurred in the face of dynamic failures and changes. This project develops a Group Communication Service (GCS) which can be implemented with reasonable resources and which guarantees automatic recovery after failures (stabilization). <br\/>(2) Existing verification techniques focus on non-distributed CPS, and in general systems with failures, message delays, etc., are unlikely to be amenable to automated analysis. For applications built with the GCS, the project develops a suite of verification tools that exploit stabilization, compositionality, abstraction-refinement, and delay insensitivity of applications. <br\/>These core research tasks will lead to fundamental advances in design and verification of hybrid and distributed systems. <br\/><br\/>The outcomes of this project are expected to bolster the dependability of emerging applications in autonomous vehicles and factories, and intelligent surveillance systems, while keeping the development costs acceptable through automation. Through industry collaborations, the research outcomes will be translated into engineering practices. The educational component will provide course and lab modules for graduate, undergraduate, and high-school students with the aim of unifying the physical and the computational viewpoints in the systems curriculum. Through active recruitment and mentoring, women and minority students will be prepared for careers in scientific research.","title":"CAREER: Algorithms and Verification for Reliable Distributed Cyber-Physical Systems","awardID":"1054247","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7731","name":"OTHER GLOBAL LEARNING & TRNING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[469971],"PO":["565255"]},"176104":{"abstract":"Over the past decade, Internet usage has grown by more than 3.5 times,<br\/>to about 1.6 billion users; about 300 million of these are broadband<br\/>subscribers. Unfortunately, despite this growing penetration and users'<br\/>increasing reliance on broadband networks for critical or<br\/>performance-sensitive applications, neither the research community nor<br\/>industry knows much about the performance of access links, or how users<br\/>configure and use networks inside the home. The lack of visibility into<br\/>today's home networks makes it nearly impossible to understand the<br\/>problems that users experience in these networks, let alone how to fix<br\/>them. A critical first step towards improving our understanding of home<br\/>networks is gathering data from homes. Towards this end, we are<br\/>developing a home network measurement infrastructure consisting of (1)<br\/>customized routers deployed in homes and (2) a central data collection<br\/>server. We are deploying both the measurement infrastructure across<br\/>hundreds of homes and collecting a corpus of active and passive<br\/>measurements that will shed more light into home network performance and<br\/>use. Given the proliferation of network devices in the home and the<br\/>general public's growing attention to the performance of access<br\/>networks, we expect that the infrastructure that we deploy and the data<br\/>that we gather from this infrastructure will play in important role in<br\/>improving our collective understanding of how home networks are used and<br\/>how well they perform. We will disseminate our results through<br\/>conference and journal publications, as well as talks with and<br\/>presentations to researchers, policymakers, and practitioners.","title":"CRI-II-NEW: Collaborative Research: Measurement Infrastructure for Home Networks","awardID":"1058977","effectiveDate":"2011-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["483390"],"PO":["564778"]},"175335":{"abstract":"The increased computational and data analysis demands of many enterprises are increasingly being met through parallel and distributed processing in corporate data centers (DCs), or more recently in `cloud'-based DCs. The performance of many DC applications (e.g, high-performance computing applications) directly depends on the underlying network performance; managing data center network (DCN) performance efficiently is therefore of utmost importance. Managing DCN performance is challenging because many DCN applications such as cloud-based Web services, storage applications, high performance computing, and financial trading applications require latencies of the order of 10s of microseconds, in contrast with ISP network applications that require latency guarantees within few 100s of milliseconds. Thus, tools and techniques developed for monitoring ISP networks alone are insufficient for high-fidelity measurements in the DCN context. <br\/><br\/>Intellectual Merit: The goal of this project is to investigate novel tools and techniques that will help build a high-fidelity knowledge plane for data centers. Specifically, the knowledge plane will collect high-fidelity measurements by equipping DCN switches with low-cost primitives for direct measurement of latency and loss properties. The knowledge plane will allow operators to perform fault diagnosis, service level agreement (SLA) monitoring, traffic engineering, network provisioning and other such management tasks in modern data center networks in an accurate and automated fashion. The up-to-date knowledge of the data center network performance will also help in building effective scheduling and performance-aware job placement algorithms to improve the performance of various DC applications.<br\/><br\/>The project will investigate the following key building blocks for the construction of the knowledge plane: (1) It will develop novel scalable primitives for latency and loss measurements that can be implemented in switches at high speed. It will focus on measurements across interfaces pairs within a switch as well as across switches that may have multiple paths between them. (2) It will explore novel per-flow or per-class differentiated latency measurements in multi-tenant environments that require SLA guarantees on a per-customer basis. It will also investigate scalable primitives for obtaining per-packet measurements in switches; together these primitives will be transformational in debugging and measurement support in managing mission-critical DCNs. (3) To ensure scalability of the knowledge plane; the project will also investigate mechanisms for scalable export of measurement information, including primitives for querying network devices for information as opposed to a `push'-based approach.<br\/><br\/>Broader Impact: The research outcomes of this project will help ease the management of data center applications significantly, thereby reducing cost and increasing the reliability and performance of data center services. The results of this project are timely as well as cloud computing is poised to bring about a renaissance in distributed and parallel computing in large-scale multi-tenant clouds. While this proposal itself is focused on the DCN context, the techniques developed are quite general and will also help debugging performance in ISP networks. The results from this research will be incorporated into undergraduate and graduate course work. All education materials and research prototypes (both software and hardware) developed as part of this project will be shared publicly for other researchers to use. The project will also involve participation of minorities and women.","title":"CAREER: Towards a High-Fidelity Knowledge Plane for Data-Center Networks","awardID":"1054788","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["518558"],"PO":["565090"]},"173036":{"abstract":"This Broadening Participation in Computing (BPC) award funds the collaborative project between thenComputing Research Association's Committee on the Status of Women in Research (CRA-W) and the Coalition to Diversify Computing (CDC) to increase the participation of women and underrepresented minorities in computing research on a national level. This BPC Alliance plans to accomplish their goal by providing mentoring, networking, community building, and highly visible role models to women and underrepresented minorities in computing. The alliance addresses all stages of the CISE research pipeline from undergraduates to senior faculty and researcher levels. With this extension, the CRA-W\/CDC Alliance proposes to improve, extend and evaluate its programs in the following ways: The highly effective Distributed Research Experiences for Undergraduates (DREU) program will continue and be expanded to include students with disabilities in partnership with AccessComputing. The Community Research Experiences for Undergraduates (CREU) will become more flexible and open to new ways of creating a community of undergraduate researchers. Undergraduate Research Mentoring Workshops (URMW) will be offered in various formats, including the Distinguished Lecture Series (DLS), CRA-W sessions at the Grace Hopper Celebrations, and increasingly, to regional conferences such as the STARS Celebrations and with the new partnership with the ABI\/ACM-W Grace Hopper Regional Consortium. By developing a portable package of materials and services, the CRA-W\/CDC Alliance will enable other groups to incorporate research mentoring workshops into their events. The materials will be disseminated on the CRA-W website and with its partner, NCWIT, as \"Programs-in-a-box\". The Discipline-Specific Workshops (DSW) will continue to provide graduate students and young researchers with skills and networking opportunities tailored for a successful research career in their particular subfield of CS&E. Career Mentoring Workshops (CMW) aimed at fresh PhDs and new Assistant Professors will be expanded to provide meaningful new content for the emerging postdoc population. Materials for CISE PIs will be designed to facilitate incorporating CRA-W\/CDC programs as broader impacts of their research proposals. The alliance will emphasize mechanisms for program sustainability and institutional change, such as increased mentor funding of DREUs and ownership of DSWs by professional organizations. Extensive evaluation of programs will include the goal of answering the specific question of how women and minorities that participate in the programs of the CRA-W\/CDC Alliance fare with respect to those who do not. The CRA-W\/CDC Alliance will continue its existing partnerships with the STARS Alliance and the Anita Borg Institute and will establish new partnerships with ACM-W and the AccessComputing Alliance.<br\/><br\/>Intellectual Merit: The proposed programs facilitate a broad range of research activities in computer and information science and engineering. These efforts will increase our understanding of the issues and remedies for underrepresentation in computing, and possibly more broadly, across STEM. In particular it will provide information on the extent to which programs that have already proven successful for women can be adapted for other underrepresented groups. <br\/><br\/>Broader Impacts: The proposed programs provide mentoring and networking opportunities and increase awareness of diversity issues across the computing disciplines. They address every rung of the ladder of computing research, from undergraduates to full professors and senior researchers. They have the potential to give many members of underrepresented groups the knowledge, skills and confidence to succeed in the existing world of computer science.","title":"BPC Pipeline: Five Year Extension","awardID":"1042403","effectiveDate":"2011-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["473711","546219","531148","209556","531150"],"PO":["560704"]},"175269":{"abstract":"Statistical privacy is the art of releasing the datasets that provide useful information about population trends without revealing private information about any individual. Recent high-profile attacks on datasets released by AOL and Netflix demonstrate the need for rigorous application-specific privacy definitions to guide the anonymization of data. The goal of this project is to develop modular components, called privacy axioms, that can be chained together to create customized privacy definitions and anonymized data for statistical privacy applications. Such modularity can enable data curators without extensive expertise in statistical privacy to release anonymized data while providing privacy guarantees that are more interpretable and reliable.<br\/><br\/>Intellectual merit: this project is designed to provide a unifying framework for statistical privacy that can bring about a deeper understanding of privacy issues and provide guidance for the safe anonymization and release of sensitive data. In addition to theoretical developments, this research plan also targets specific existing applications at Penn State and the U.S. Census Bureau.<br\/><br\/>Broader impact: the systematic approach to privacy pursued by this project can enable access to and analysis of anonymized data in domains where access to data is otherwise heavily restricted. <br\/>This project aims to build upon the investigator's prior experience with outreach programs such as the Summer Research Opportunities Program (SROP) by involving undergraduates in the proposed research. To prepare students for future work that requires analysis of anonymized data, this research is also being integrated into machine learning courses at Penn State.<br\/><br\/>For further information see the project web site at the URL:<br\/>http:\/\/www.cse.psu.edu\/~dkifer\/axiomatizingprivacy.html","title":"CAREER: An Axiomatic Basis for Statistical Privacy","awardID":"1054389","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["521519"],"PO":["562974"]},"176887":{"abstract":"The Medical Informatics (MedIX) program is hosted by the Medical Informatics Laboratory at DePaul University and the Imaging Research Institute at the University of Chicago. The program runs for three summers, with eight students doing research for ten weeks each summer under the supervision of four dedicated and experienced mentors. The MedIX program aims to 1) encourage talented undergraduates to pursue graduate education, especially undergraduates underrepresented in information technology, and b) expose students to interdisciplinary research, especially at the border of information technology and medicine. All of the students' projects are inspired by state-of-the-art research ideas in imaging informatics and by novel data mining and computer vision algorithms that these research ideas require in order to be realized in practice. Ultimately, each project has the long-term potential to increase the quality of healthcare available to people everywhere. <br\/><br\/>Faculty will conduct tutorials, lectures, and demonstrations on imaging informatics, require frequent presentations of student work, encourage students to publish, and conduct biweekly meetings of students, mentors, and teams. Students work as part of faculty-undergraduate teams on new problems; they participate in defining the direction of their research, and they are strongly encouraged to publish meaningful results. The intended impact is to continue the increase in enrollment of undergraduates into graduate school, especially with respect to underrepresented students and interdisciplinary research. Further, the emphasis on recruiting underrepresented populations can ultimately help improve the diversity of university faculty in information technology and medical informatics.","title":"REU Site: MedIX: Medical Informatics Experiences in Undergraduate Research","awardID":"1062909","effectiveDate":"2011-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[474244,474245],"PO":["563751"]},"175259":{"abstract":"Statistical learning is now central to natural language processing<br\/>(NLP). Bridging the gap between learning and linguistic<br\/>representation requires going beyond learning parameters. This CAREER<br\/>project addresses three challenging, unresolved questions:<br\/><br\/>1. Given recent advances in learning the parameters of linguistic<br\/>models and in approximate inference, how can the process of feature<br\/>design be automated?<br\/><br\/>2. Given that NLP tasks are often defined without recourse to real<br\/>applications and that a specific annotated dataset is unlikely to<br\/>fulfill the needs of multiple NLP projects, can learning frameworks be<br\/>extended to perform automatic task refinement, simplifying a<br\/>linguistic analysis task to obtain more consistent, more precise, or<br\/>faster performance?<br\/><br\/>3. Can computational models of language take into account the non-text<br\/>context in which our linguistic data are embedded? Building on recent<br\/>success in social text analysis and text-driven forecasting, this<br\/>CAREER project seeks to exploit context to refine models of linguistic<br\/>structure while enabling advances in this application area.<br\/><br\/>This basic research supports advances in a wide range of language<br\/>engineering applications and discrete data analysis. In addition to<br\/>core research advances, this CAREER project contributes a new<br\/>publicly-available parser that models the most consistently learnable<br\/>elements of syntactic struture. Educational activities include a new<br\/>project-based on text-driven forecasting within the PI's undergraduate<br\/>NLP course and a new undergraduate course in machine learning. It<br\/>supports involvement by the PI in outreach activities to high school<br\/>students and to a wider range of students at CMU by exposing aspects<br\/>of his research in non-CS classrooms.","title":"CAREER: Flexible Learning for Natural Language Processing","awardID":"1054319","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563246"],"PO":["565215"]},"176866":{"abstract":"This project renews a Research Experience for Undergraduates site focused on the area of computer security at the new Maryland Cyber Security Center at the University of Maryland. The site plans to offer enhanced research experiences to teams of undergraduate students. The REU students, called Scholars, will be involved in a variety of aspects of the research process including designing and conducting experiments, analyzing data, handling specialized technical equipment, writing research reports and papers for publication, and presenting their research to others. The site plans to select cohorts of undergraduate students to participate in a nine-week summer research program at the host institution. Particular emphasis is placed on recruitment of students from under-represented populations and from community colleges. The project includes mentorship by the experienced computer science faculty members, technical seminars and workshops, team building activities, student presentations, and other professional development opportunities. The research experience results in the students' better understanding of the computer science discipline, enhanced self-confidence and an increased interest in pursuing graduate school or future research opportunities.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications. The students participate in a full range of research activities from preparing research literature reviews to production and dissemination of research results.<br\/><br\/>The broader impacts of the project include providing a quality research experience for undergraduate students, particularly students from underrepresented groups and community college students. The participating faculty members are committed to engaging women and under-represented minority students in their research. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning. The project will also provide a better technically educated workforce to meet national security and economic priorities.","title":"REU Site: Undergraduates Engaged in Cyber Security Research","awardID":"1062820","effectiveDate":"2011-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["519631"],"PO":["564181"]},"175304":{"abstract":"Abstract #1054687<br\/>Current methods of image and video coding are effective largely because they capitalize on low-level aspects of the human visual system (HVS). The single most predominant strategy is to place the errors into regions which can better hide the compression artifacts, an approach which can be guided by computational models of early\/low-level HVS processing. The inherent assumption in this approach is that the consumer is looking for the distortion in the presence of the image. However, in actuality, the consumer is looking at the image in the presence of possible distortion, which is a fundamentally different perceptual task that requires a fundamentally different HVS model. Next-generation coding schemes which can take into account higher-level aspects such as content-adaptive masking; perceptual importance across space, frequency, and time; and elements of cognition; have the potential to dramatically reduce storage and bandwidth requirements while maximizing visual quality and the overall multimedia experience. In this project, the investigator researches how compression artifacts influence the HVS's ability to process and interpret images and video. Three main areas are investigated: (1) new models of visual masking which take into account image recognition; (2) appearance-preserving strategies of data quantization; and (3) analysis and quantization strategies which honor rules of visual cognition derived from quality-rating experiments coupled with eye-tracking. This research is integrated with an educational component that promotes student development in applying knowledge of human vision to engineering problems. Two new interdisciplinary graduate-level courses, an interdisciplinary summer workshop, and undergraduate research projects and curriculum reform are made available to students. Two multimedia-driven competitions that expose K-12 students and undergraduates to image-processing research are also made available.","title":"CAREER: Content-Based Image and Video Coding Using Higher-Level Models of Human Vision","awardID":"1054612","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[470095],"PO":["564898"]},"175348":{"abstract":"CAREER: Programming Nucleic Acids Self-Assembly<br\/><br\/>The objective of this proposal is to develop platforms for engineering programmable synthetic molecular devices self-assembled from nucleic acid molecules (DNA and RNA), and for exploiting these devices to do useful molecular work. In this research, these devices are composed of small synthetic nucleic acid monomers capable of conditional configuration change, and can be programmed to self-assemble, move, and compute. When coupled with other functional molecules, such as fluorophores and proteins, they could potentially serve as dynamic controllers for the spatial arrangement and, hence the collective function, of such molecules. This will enable the development of diverse applications in imaging, sensing, diagnostics, and therapeutics. Specifically, the proposed research will (1) develop computational tools to facilitate the design of these molecular devices, (2) experimentally construct DNA and RNA molecular devices that demonstrate prescribed dynamic behaviors, and (3) exploit such molecular devices for diverse biomedical applications. <br\/><br\/>Integrated research and education plans will be pursued to provide interdisciplinary training for postdoctoral fellows, graduate students, and undergraduate students. New curriculum on molecular engineering will be developed to benefit the Harvard graduate and undergraduate population. Field trip to the PI?s lab will be hosted to help excite students from a local high school with a majority minority population about careers in science and engineering. An international undergraduate biomolecular design and engineering competition will be launched to help expose students around world with research experience in biomolecular nanotechnology.","title":"CAREER: Programming Nucleic Acids Self-Assembly","awardID":"1054898","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["561030"],"PO":["565223"]},"182982":{"abstract":"This award supports the participation (travel, lodging, registration) of doctoral students from U.S. universities in the Doctoral Consortium of the 21st International Conference on Automated Planning and Scheduling (ICAPS-11) to be held in Freiburg, Germany, June 11-16, 2011. The Doctoral Consortium will be comprised of two parts: (1) a one-day session the day before the conference begins that will include invited talks on research skills and career development, student presentations, and mentor-led focus groups; and (2) a poster session to be held during the conference. This award will support the participation of approximately 9 US-based students. Participants will be selected through an application process that includes review of submitted materials including an extended dissertation abstract and CV, an assessment of the benefit of participation to the applicant, and the stage of the participant's doctoral research.","title":"ICAPS-11 Doctoral Consortium Travel Awards","awardID":"1125946","effectiveDate":"2011-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[490305],"PO":["491702"]},"176844":{"abstract":"This funding renews a CISE Research Experience for Undergraduates site focused on experimental research in wireless networks at Notre Dame. The site provides students with opportunities to explore and study state-of-the-art solutions to many open challenges in wireless networking. Students receive hands-on experience in the design, implementation, deployment, evaluation, and measurement of wireless and mobile networks. The project focuses on recruiting students from diverse institutions with limited research environments. Undergraduate students participate in a ten-week summer research program at the host institution. The project includes mentorship by experienced computer science faculty members, experience with research and graduate life, and professional development opportunities for the participating students.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications. The research in wireless networking, mobile computing, and pervasive systems may lead to technologies that provide for public safety and ubiquitous municipal wireless access, thus advancing the current research in these important areas.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The relationships developed during the project could lead to future collaborations among the institutions of the participating students that may enable the students to continue their research and professional growth after the summer experience. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Experimental Research on Wireless Networking","awardID":"1062743","effectiveDate":"2011-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["540626",474129],"PO":["564181"]},"176956":{"abstract":"The Harvey Mudd College REU brings 10 undergraduates to Claremont in order to engage them in research and encourage graduate study in computer science. The program provides a microcosm of the graduate experience through a set of four projects under a broadly-scoped systems umbrella. The first develops algorithms for estimating cophylogenetic trees based on biological host\/parasite data. Students' algorithms have been encapsulated in a software package named Jane, currently in use by several biological research groups. The second effort investigates approaches for automatically creating - and helping humans create - jazz. Its Impro-visor software has thousands of users and supports both the jazz and computational music communities. The third project creates efficient algorithms for memory management within garbage-collected computer languages such as Java, and the fourth project tests machine-learning and computer-vision-based algorithms that improve the state-of-the-art of performance of low-cost robot platforms, such as the iRobot Create.<br\/><br\/>In addition to the contributions of these four projects within each of their domains of specialization, the REU's environment emphasizes the benefits of pursuing CS at the graduate level for participants who had not previously considered graduate work. Challenging research problems prompt students' guided development of research skills: investigation, presentation, and publication. Introductions by advisors transition into student-led talks and culminate with publications and conference experiences during or after the summer. Although proud of the academic contributions of the REU participants, the program's most important impact lies in its cultivation of the next generation of CS researchers.","title":"REU Site in Computer Systems","awardID":"1063169","effectiveDate":"2011-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["527996","518669"],"PO":["563751"]},"176847":{"abstract":"The Department of Computer Science at the University of Massachusetts Amherst is hosting REUMass: A Summer Computing Research Experience for Undergraduates under the direction of Professor W. Richards (Rick) Adrion and Project Manager Wendy Cooper. This Program is cooperating with the Commonwealth Alliance for Information Technology Education (CAITE) - a CISE Broadening Participation in Computing Alliance based at UMass Amherst - and other partners, including other NSF BPC Alliances, such as ACCESS, CRA\/CDC, CCCE, NCWIT, ELA and Georgia Computes; NSF Broadening Participation Programs, including NE-LSAMP, UM-LSAMP, and NEAGEP; and other UMass Amherst REU Sites. The REUMass partners provide an opportunity to cast a wide net and bring a diverse set of students into positive research experiences that we hope will increase the number of students entering graduate programs and research careers, particularly those who previously would not have had that opportunity. <br\/><br\/>REUMass students will have the opportunity to work with leading UMass Amherst researchers on important scientific problems. Our selected projects emphasize how fundamental computer science enables a broad set of IT applications. They show the breadth of opportunities in CS and have proved to be attractive to our target audience. Each spring 9 students will be invited for a 10-week summer program. They will be assigned in pairs or triples to a range of research projects within a number of disciplines - health, government, biosciences, transportation, society, education, etc. Students will participate in a number of technical activities including workshops, seminars, and field trips, and social activities that have proved successful in creating a close and sustained relationship among the participants in each year's cohort. Our commitment to continuously improving the Site programs helps REU students achieve success in their research and obtain a broader view of the challenges and rewards of computing research.","title":"REUMass: A Summer Computing Research Experience for Undergraduates","awardID":"1062749","effectiveDate":"2011-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["533875"],"PO":["564588"]},"180611":{"abstract":"Computational techniques are revolutionizing the way in which research is conducted in science and engineering. However, even in domains that seem closely liked, such as biology, medicine, and drug discovery, research advances are not broadly disseminated and do not become widely known. This conference would bring together computational scientists from these three areas and foster collaborations. A set of outstanding researchers from around the world have agreed to structure this new effort. The three day meeting meeting, in Orland Florida, would have participation by students through travel grants. This building of the next generation of computing science in different application areas is one of the key outcomes of this meeting. In addition, the selected papers will be made available online. In addition, some of the papers will be published through BioMed Central, which has reduced the costs for this new meeting. Bringing together academic and industry researchers to consider the latest advances in computational methods will promote the rapid transfer of results from research to products and technologies.","title":"First International IEEE Conference on Computational Advances in Bio and Medical Sciences (ICCABS) -- Travel Awards","awardID":"1112395","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["559638","525689"],"PO":["565136"]},"181656":{"abstract":"Second US-Japan Future Network Research Collaboration PI Meeting will be held in Kyoto, Japan in June 2011. Recently, NSF has funded seven collaborative US-Japan research projects on Future Networking. This meeting will bring together US investigators and their graduate students along with the Japanese collaborators at the invitation of the NICT (the funding counterpart of NSF in Japan) to continue to strengthen the collaborations between researchers jointly funded by NSF and the Japanese. This meeting is a continuation of series of NSF-supported workshops with the Japanese. Both countries, through CISE\/NSF and Japanese research funding agencies, have major research efforts in networking research and in infrastructure development to support research activities. For NSF the major efforts are NeTSE\/NeTS\/FIND\/FIA, and GENI and other infrastructure development awards. For Japan the initiatives include AKARI, the Japan Gigabit Network (JGN2). Increasingly, our Nation depends on high speed networks for national defense, commerce, and for interactions among out citizens. Research is continually needed to lead to new technology to improve the bandwidth, efficiency, security, and reliability of the networks we do so much rely on. Cooperation with Japan will accelerate the development of advanced networking technologies.","title":"Second US-Japan Future Network Research Collaboration PI Meeting","awardID":"1118231","effectiveDate":"2011-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["541801"],"PO":["564993"]},"176191":{"abstract":"As new personal devices of various form factors (from smart phones to laptop computers) proliferate, we believe that their potential to support human learning, activity, and information access can be fully realized only when these devices function together with a broader technology environment and with each other. We envision the day when such technology envelops society, and in concert empower individuals to function more effectively both individually and as members of society. In essence the projected infra-structure will allow us to investigate this future.<br\/><br\/>In a sense, technologically savvy users already construct ecologies for themselves in an ad hoc manner. We ensure that hand-held devices we carry will synchronize with our larger devices like laptops and desktops. We ensure data exchange among the various applications we use, and we create personal and group workflows among our computational environments. We keep appropriate adaptors so that our portable devices have access to the projection screens or group displays in our work environment. We learn the interaction that is needed on each platform to ensure cross-platform interactivity. Finally, we organize our work and life around these interoperations ? synching our iPods and iPads periodically, selecting applications on each platform to support the way we work and our lifestyle as a whole. The challenge of this proposal is to remove the ad hoc nature of the construction of such one-of-a-kind ecologies.<br\/><br\/>Our proposed infrastructure comprises two related subgroups. First, we propose a Rapid Prototyping Laboratory (RPL) where faculty and students can develop new devices to populate the ecologies. The RPL will support electronic and single-board-computer designs, printed-circuit board prototyping, and 3D object construction. Second, we will construct the larger environment to be populated by these devices. This environment includes a variety of large to personal display technologies and a set of tracking technologies to enable devices to situate themselves in space.<br\/><br\/>We have assembled two sets of research projects that benefit from this infrastructure. First we inves-tigate how our envisioned ecologies may be realized. We will study how this myriad of technologies may interoperate to give the user a set of consistent expectations of interaction across devices and display environments. We shall also investigate HCI methodologies for humans to function within the 3D world populated by devices and displays. Our second set of projects investigates various uses of our envi-sioned ecologies. Extending the ecology analogy, each use scenario furnishes a habitat that contextual-izes the ecologies within it. We advance a set of research areas: education and learning; universal access; insight formation; smart homes; usable security; mediated social interaction; and electronic-textiles to furnish such contexts where technology-interoperation and user-interaction may be explored.<br\/><br\/>An important aspect of this project is to encourage a kind of computational thinking among our re-searchers and students that span the digital and physical environment. As such our proposed infrastruc-ture will facilitate a broad interdisciplinary research. We will be using the infrastructure in the classes we teach bringing graduate students, undergraduates, and individuals from underrepresented populations into our research programs.","title":"II-EN: Device and Display Ecologies","awardID":"1059398","effectiveDate":"2011-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["505416","486496","518252","486881","553340"],"PO":["565227"]},"178061":{"abstract":"The 17th IEEE International Symposium on High Performance Computer Architecture (HPCA-17) will be held, along with four workshops and five tutorials, in San Antonio, TX, February 12-16, 2011. HPCA is the premier forum for presenting the latest research findings on computer architecture and computer design including microarchitecture, cache and memory system design, parallel-, power-efficient-, embedded- and reconfigurable computer architectures.<br\/><br\/>HPCA seeks to increase student participation in symposium and the field. The proposed funding would support the travel of eligible US students to the symposium. Recipients would be able to attend the main conference, workshops, and tutorials. Travel grants will encourage the research interests and the involvement of students in the field who are not well funded and those who are just beginning their participation in the field or are interested in entering it. A special effort will be made to reach out to women and under-represented minorities.","title":"HPCA-17 Student Travel Grant Request","awardID":"1100218","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[477412],"PO":["565272"]},"175380":{"abstract":"Many computing services are moving to the \"cloud\" because cloud<br\/>computing offers economic and operational benefits. However, cloud<br\/>services not only are complex black boxes operated by third parties but<br\/>also refuse to give service guarantees. Thus, instead of trying to make<br\/>cloud services more trustworthy (that is, giving customers reasons to<br\/>place faith in the cloud), this project explicitly removes trust from<br\/>the cloud: the project is building systems that give cloud customers<br\/>guarantees, even under arbitrary service malfunctions. Two such systems<br\/>concern storage and function computation.<br\/><br\/>Under the storage system, the challenge is to use client-side<br\/>verification to resist arbitrary or malicious cloud malfunctions (losing<br\/>data, returning stale data, corrupting data, compromising data, etc.).<br\/>Under the function computation system, a client specifies a computation<br\/>to a server, the server executes it and returns the output and auxiliary<br\/>information, and the client uses the auxiliary information to<br\/>efficiently check whether the output is correct. The approach is to<br\/>adapt, and translate into practice, a fascinating body of theory (on<br\/>probabilistically checkable and interactive proofs) that is currently<br\/>thought to be impractical.<br\/><br\/>With qualitative advances in reliable yet practical computing, this<br\/>project will make cloud computing safer for existing customers and spur<br\/>the adoption of cloud services. This will mean more people paying less<br\/>for computing, producing beneficial effects throughout the computational<br\/>ecosystem. The educational thrusts include teaching graduate students to<br\/>teach (applying the K-12 student teaching model), graduate and<br\/>undergraduate mentoring, curriculum development, and outreach to<br\/>underrepresented groups.","title":"CAREER: Practical verification of outsourced computations","awardID":"1055057","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[470252],"PO":["551712"]},"176161":{"abstract":"As part of this planning project, the PIs test the feasibility of collecting a corpus of conversational speech including both broadcast and telephone conversations. The corpus is annotated to support research in extractive and abstractive summarization of opinion and attitude in speech. The goal of the pilot annotation effort is the adaptation and refinement of current opinion and attitude annotation schemes for conversational data. The PIs are also organizing a workshop to be held at the 2011 meeting of the Association for Computational Linguistics during which they plan to solicit annotation desiderata and feedback from researchers who are the future users of the resource. The pilot annotations include abstractive and extractive summaries, rich mark-up with existing automatic tools for prosodic event detection, discourse relations, topic words and extractive summaries from current baselines.<br\/><br\/> It is increasingly important to track opinions and information on a wide spectrum of issues, and increasingly difficult to do so in the face of enormous amounts of information in textual and audio form.<br\/>However, speech data is notoriously hard to search using current technologies, so developing new tools for this type of speech search is particularly important. The corpus the PIs are developing will make possible the development of automatic techniques to deal with this problem. Users will benefit from better tools to identify and summarize opinions that concern their daily choices related to health, diet, purchases, and the environment.","title":"CI-P: Collaborative Research: Summarizing Opinion and Speaker Attitude in Speech","awardID":"1059257","effectiveDate":"2011-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["519134"],"PO":["565215"]},"176172":{"abstract":"The Network-on-chip (NoC) paradigm has emerged as a scalable interconnection infrastructure for modern multi-core chips. However, with growing levels of integration traditional NoCs suffer from high latency and energy dissipation in on-chip data transfer due to conventional metal\/dielectric based interconnects. The wireless NoC (WiNoC) simultaneously addresses the latency, power consumption and interconnect routing problems of conventional NoCs by replacing multi-hop wired links with high-bandwidth single-hop long-range wireless channels. Recent investigations have characterized silicon integrated on-chip antennas operating in the millimeter (mm)-wave range of 50-110 GHz, and this is now a viable technology. Coupled with significant advances in mm-wave transceiver design, this development opens up new research opportunities for WiNoCs. Successful execution of WiNoC research is possible if simulation-based feasibility studies are combined with suitable prototype development. For accurate performance evaluation and characterization of mm-wave transceiver circuits and on-chip antennas, high frequency network and spectrum analyzers, signal generators, a bit error rate tester and mm-wave on-wafer probe stations are required. To complement these research efforts, the acquired equipment will be integrated into a laboratory to support undergraduate and graduate courses in multi-core architectures, mm-wave circuits and communication systems at the Washington State University and the University of Idaho. These courses will provide students with essential hands-on training with industrial grade test and measurement tools. Eventually, this training will produce a cadre of well-trained B.S., M.S. and Ph.D. graduates who will benefit both industry and academia.","title":"II-NEW: Acquisition of Test and Measurement Equipment Enabling Design of Wireless Networks-On-Chip for Multi-Core Systems","awardID":"1059289","effectiveDate":"2011-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["518515","523584","523585"],"PO":["565272"]},"176183":{"abstract":"Over the past decade, Internet usage has grown by more than 3.5 times,<br\/>to about 1.6 billion users; about 300 million of these are broadband<br\/>subscribers. Unfortunately, despite this growing penetration and users'<br\/>increasing reliance on broadband networks for critical or<br\/>performance-sensitive applications, neither the research community nor<br\/>industry knows much about the performance of access links, or how users<br\/>configure and use networks inside the home. The lack of visibility into<br\/>today's home networks makes it nearly impossible to understand the<br\/>problems that users experience in these networks, let alone how to fix<br\/>them. A critical first step towards improving our understanding of home<br\/>networks is gathering data from homes. Towards this end, we are<br\/>developing a home network measurement infrastructure consisting of (1)<br\/>customized routers deployed in homes and (2) a central data collection<br\/>server. We are deploying both the measurement infrastructure across<br\/>hundreds of homes and collecting a corpus of active and passive<br\/>measurements that will shed more light into home network performance and<br\/>use. Given the proliferation of network devices in the home and the<br\/>general public's growing attention to the performance of access<br\/>networks, we expect that the infrastructure that we deploy and the data<br\/>that we gather from this infrastructure will play in important role in<br\/>improving our collective understanding of how home networks are used and<br\/>how well they perform. We will disseminate our results through<br\/>conference and journal publications, as well as talks with and<br\/>presentations to researchers, policymakers, and practitioners.","title":"CRI-II-NEW: Collaborative Research: Measurement Infrastructure for Home Networks","awardID":"1059350","effectiveDate":"2011-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[472141,"561756"],"PO":["564778"]},"176162":{"abstract":"As part of this planning project, the PIs test the feasibility of collecting a corpus of conversational speech including both broadcast and telephone conversations. The corpus is annotated to support research in extractive and abstractive summarization of opinion and attitude in speech. The goal of the pilot annotation effort is the adaptation and refinement of current opinion and attitude annotation schemes for conversational data. The PIs are also organizing a workshop to be held at the 2011 meeting of the Association for Computational Linguistics during which they plan to solicit annotation desiderata and feedback from researchers who are the future users of the resource. The pilot annotations include abstractive and extractive summaries, rich mark-up with existing automatic tools for prosodic event detection, discourse relations, topic words and extractive summaries from current baselines. <br\/><br\/>It is increasingly important to track opinions and information on a wide spectrum of issues, and increasingly difficult to do so in the face of enormous amounts of information in textual and audio form. <br\/>However, speech data is notoriously hard to search using current technologies, so developing new tools for this type of speech search is particularly important. The corpus the PIs are developing will make possible the development of automatic techniques to deal with this problem. Users will benefit from better tools to identify and summarize opinions that concern their daily choices related to health, diet, purchases, and the environment.","title":"CI-P: Collaborative Research: Summarizing Opinion and Speaker Attitude in Speech","awardID":"1059260","effectiveDate":"2011-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["511614"],"PO":["565215"]},"175360":{"abstract":"Abstract:<br\/>Providing cyber security against attackers who penetrate the network, insider attackers, and non-malicious user errors or equipment failures is a formidable challenge for the scientific community. The investigator addresses problems in the area of network forensics that arise in packet-based communication of information. A key feature of the research approach is the use of timing as an under-utilized degree of freedom that provides rich statistical structure about the information dynamics. Using timing modality for performing network forensics has the advantage that it will not excessively perturb normal operation in packet networks where the information exchange is achieved via packet contents. A novelty of this research is the inclusion of causal inference. Human judgments about the likelihood of events and dependencies among variables is strongly influenced by the perception of cause-effect relationships. To extend the same decision making power, a man-made system must acquire the ability to process cause-effect relationships, rather than only assessing questions of statistical dependence. PI's objective is to understand causal influences between network flows using the timing modality. <br\/>The PI will embark on an ambitious multidisciplinary research program that targets both theoretical and practical fundamental problems in security. The main research endeavors undertaken by the PI are: (1) analysis and mitigation of queuing timing side channels that arise in presence of shared resources; (2) develop of causal inference metrics and algorithms for complex networks; (3) design of efficient compression and storage approaches for network flows using good compression codes for point processes; (4) design of network flow watermarks that will be inserted in packet timings and serve the dual purpose of providing data integrity as well as a means for network inference.","title":"CAREER: A Timing Approach to Network Forensics","awardID":"1054937","effectiveDate":"2011-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["475207"],"PO":["564898"]},"178682":{"abstract":"Funds are requested to provide limted support to US based students to participate in CADathlon contest. <br\/><br\/>CADathlon is an annual graduate student programming contest held in conjunction with the ICCAD (International Conference on Computer-Aided Design) conference held annually in SanJose, California. The contest problems are chosen from the Electronic Design Automation (EDA) field and are posed by EDA experts from academia and industry. The contest is open to all graduate students pursuing their degrees in EDA.<br\/>CADathlon was started in 2002 and every year attracts 15-20 teams from universities all over the world. In the eight CADathlon contests held so far, one or more graduate student teams from 26 US and 10 foreign universities have competed. The winning and runner-up teams are awarded cash prizes. In this proposal, we seek NSF support to partially cover the expenses of 2010 CADathlon contest.<br\/><br\/>CADathlon is a vehicle to attract students who are good at problem solving to the EDA area. CADathlon directly encourages a deeper study and understanding of critical problems in the EDA\/CAD field for the participants. As such, it is an invaluable resource for encouraging young researchers to pursue graduate degrees and for laying the foundations of a career in research in these areas.","title":"CADathlon 2010: International Graduate Student Progg. Contest in EDA","awardID":"1103387","effectiveDate":"2011-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[479047,"542087",479049,479050],"PO":["562984"]},"185382":{"abstract":"A Novel Algorithmic Approach for Real-Time Image-to-Mesh Conversion of Brain MRI<br\/><br\/>Abstract: Image-to-Mesh (I2M) conversion is the tessellation of images into simpler geometrical shapes (or elements) like triangles and tetrahedral for 2D and 3D images, respectively. In Computer Assisted Surgery (CAS) this tessellation (or finite element mesh) is a critical component for patient-specific bio-mechanics and bio-fluid finite element (FE) simulations. In this project, we target I2M conversion for image guided neurosurgery and endoscopic neck and head surgery. Specifically, we focus on FE-based non-rigid registration methods which use patient-specific bio-mechanical models to fuse pre-operative intra-operative brain images (eg. Magnetic Resonance Images and\/or Computed Tomography Scans).<br\/><br\/>The objective of this project is to extend the Delaunay refinement algorithms and theory for guaranteed quality I2M conversion that meets additional requirements related to: (1) accuracy of non-rigid registration of brain images, and (2) real-time constrains imposed by neurosurgery or head and neck surgery. The intellectual merit of this work is the development of novel theoretical framework which extends existing point insertion methods for both scalar and parallel guaranteed quality Delaunay mesh generation. These extensions increase algorithm flexibility which is important to satisfy application-specific requirements like fidelity.<br\/><br\/>The proposal will have a broader impact on several areas in both CAS and Computer Aided Design (CAD). Non-rigid registration of medical images is an enabling technology for many applications in CAS which is a rapidly growing area in health care industry. Our algorithms will contribute in the prevention of medical errors and the<br\/>use of new (more effective\/accurate) technologies which can lead to products (i.e., image guided neuro-navigation systems) that will help reduce medical and hospitalization expenses. Specifically, (1) image guided neurosurgery increases the percentage of successful tumor resections while minimizing the potential for neurological deficit by preserving critical tissue and hence improves prognosis for patient, and (2) minimally invasive endoscopic surgery results in less blood loss and reduced post-operative pain lead to faster recovery and earlier discharge of patients. In addition technology based on our I2M conversion algorithms can be used in medical simulators which can improve doctor training and minimize errors in medical procedures.","title":"AF:Small:A Novel Algorithmic Approach for Real-Time Image-to-Mesh Conversion of Brain MRI","awardID":"1139864","effectiveDate":"2011-02-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7934","name":"PARAL\/DISTRIBUTED ALGORITHMS"}}],"PIcoPI":["561580"],"PO":["565157"]},"176153":{"abstract":"As part of this planning project, the PIs test the feasibility of collecting a corpus of conversational speech including both broadcast and telephone conversations. The corpus is annotated to support research in extractive and abstractive summarization of opinion and attitude in speech. The goal of the pilot annotation effort is the adaptation and refinement of current opinion and attitude annotation schemes for conversational data. The PIs are also organizing a workshop to be held at the 2011 meeting of the Association for Computational Linguistics during which they plan to solicit annotation desiderata and feedback from researchers who are the future users of the resource. The pilot annotations include abstractive and extractive summaries, rich mark-up with existing automatic tools for prosodic event detection, discourse relations, topic words and extractive summaries from current baselines. <br\/><br\/>It is increasingly important to track opinions and information on a wide spectrum of issues, and increasingly difficult to do so in the face of enormous amounts of information in textual and audio form. <br\/>However, speech data is notoriously hard to search using current technologies, so developing new tools for this type of speech search is particularly important. The corpus the PIs are developing will make possible the development of automatic techniques to deal with this problem. Users will benefit from better tools to identify and summarize opinions that concern their daily choices related to health, diet, purchases, and the environment.","title":"CI-P: Collaborative Research: Summarizing Opinion and Speaker Attitude in Speech","awardID":"1059226","effectiveDate":"2011-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["563325"],"PO":["565215"]},"176175":{"abstract":"Recently the Federal Communications Commission (FCC) made available for unlicensed use the vacant portion of the UHF spectrum known as the TV whitespace spectrum. This project develops an infrastructure to facilitate research into new network technologies that leverage the unlicensed TV whitespace spectrum. The infrastructure will make possible research into the manageability of the next generation of networks, designing secure networks; facilitating the provision of Quality of Service through fast-link; and enabling end-to-end Internet performance enhancements to mobile users. Whitespace network communication technologies are significant because they can potentially lead to disruptive innovations impacting the entire wireless landscape. New networking protocols and systems taking advantage of the newly available TV white spaces offer the promise of enabling new wireless services and potentially creating entire new industries; this is critically important for society. This infrastructure is the first-of-its-kind that focuses on whitespace networking research spanning a large urban area and vehicles. The effort is engaging numerous local partners in significant ways: Madison Metro Transit, the local organization responsible for public transit services in and around Madison, is supporting the experimentation of various vehicular Internet access services. Edgewood College, a local four-year college is involved is the associated with the educational activities. Two technology partners, Alcatel-Lucent and Radio Technology Systems, are implementing the high-bandwidth whitespace communication system. Students are involved in learning about the new whitespace networking technologies through a laboratory-oriented curriculum centered on the infrastructure, and through new courseware developed and disseminated through public websites.","title":"II-EN: Enhancing a Metro-Scale Vehicular Testbed for Flexible White Space Networking","awardID":"1059306","effectiveDate":"2011-02-15","expirationDate":"2015-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["553458","560207"],"PO":["564778"]},"176186":{"abstract":"The importance of mobile computing is rapidly increasing but the field is held back from its potential by the difficulty of evaluating new ideas. The effectiveness of mobile computing systems depends on variable network, application, and user behaviors, many of which are only visible in large-scale systems. To enable transformative research on mobile computing and related disciplines, this project creates a global-scale live laboratory composed of mobile devices, networks, and their users that will support the validation of research ideas. This live laboratory, referred to as MobiLab, makes two key contributions: (1) it provides an online repository of real-time and archived mobile user data, including vital information such as location-specific network conditions, per-application energy usage, and user behavior and (2) through a set of software libraries and tools, it simplifies the tasks of developing, deploying and evaluating research applications. Instead of re-building applications to monitor network, application, mobile system, and user behavior, researchers can gather information online from MobiLab tools via easy-to-use application programming interfaces (APIs). The target communities include researchers in several disciplines, such as mobile systems and networks, embedded systems, network security, mobile data privacy, and social networking. <br\/>MobiLab is suitable for both undergraduate lab-intensive introductory courses as well as graduate-level courses that expose students to mobile computing, distributed computer system design, and distributed sensing. MobiLab will also have a lasting impact on the research community by providing a central repository for mobile system research data, software artifacts created by the community, and results based on the data.","title":"CI-ADDO-NEW: MobiLab -- A Global-Scale Live Laboratory to Support Mobile Computing Science","awardID":"1059372","effectiveDate":"2011-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["518034","550572","549845","562959"],"PO":["564778"]}}