{"210013":{"abstract":"Software development is inherently incremental. Nowadays, many software companies adopt an agile process and a shorter release cycle, where software needs to be delivered faster but with quality assurances, and many versions of software may co-exist in the field and need to be maintained. While faster releases do not increase the user's tolerance of bugs, it is challenging to correctly introduce a change on top of existing programs. In recent studies, researchers found that when programming a change, the most important information a developer wants to know is whether this change breaks any code elsewhere, and in fact, 15-24% of the bug fixes are incorrect. <br\/><br\/>This project will develop program analyses to address quality assurance problems related to program changes and versions, specifically for the three challenges: efficiently verifying changes for reliable software releases, automatically diagnosing failures caused by changes, and effectively patching multiple versions of software. The project will result in tools and techniques transferable to industry to improve the quality and productivity of software development. The results will also be disseminated via STEM volunteering, new course materials, and release of the software and data obtained through this research.","title":"CAREER: Analyzing Program Changes and Versions for Bug Detection and Diagnosis","awardID":"1350886","effectiveDate":"2014-06-01","expirationDate":"2019-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562941],"PO":["564388"]},"210015":{"abstract":"Physicists, meteorologists, and other users of high-performance computing want to write large and complicated models and systems that execute correctly and quickly. These models and systems are allowing us to understand our world better, and explore solutions to hard problems. Unfortunately, to make efficient use of computing resources, a non-computing specialist needs to, for all intents and purposes, become a proficient computer scientist. The fundamental problem is that a non-computing specialist is not necessarily aware of available options for optimizing their model. Domain Specific Languages (DSLs) are one possible solution to this knowledge gap, because DSLs can encode the necessary knowledge required to map programs onto high-performance targets, at the same time to provide a customized environment in the parlance of the domain specialist. By utilizing a DSL, the non-specialist does not need to worry about performance at the outset; it is the responsibility of the DSL compiler to map the model onto the high-performance target. This research will produce new DSL techniques and technologies that will substantially lower the cost of developing such high-performance DSLs, as well as improve the performance opportunities offered to users.<br\/><br\/>Over the five-year span of the project, two specific high-performance parallel platforms (GPGPUs and FPGAs) will be made more accessible. A resource-aware DSL will allow a broad range of parallel programming idioms to be directly expressed. This resource-aware DSL will also work in combination with existing DSLs. With the use of rewriting technologies, the resource-aware DSL will act as an expressive common medium for exploring design tradeoffs before, during and after the commitment to specific implementation technologies. A set of custom compiler plugins will allow translation into existing development environments and tools for GPGPUs and FPGAs. As programming continues to migrate from being the task of the general programmer into the hands of domain specialists, the broader impact of this research is lowering the performance-related knowledge burden on the domain specialist, and more generally, supporting the use of specialists by pushing the state-of-the-art in DSL design and implementation. The principal intellectual merit of this research is the challenge of creating the generic DSL that supports post-hoc and resource-aware on-the-fly refactoring on user models. This new DSL will inform future high-performance DSL compilers, and open opportunities for customized DSLs and the domain specialist working together to find implementations that execute correctly and quickly.","title":"CAREER: Filling the Gaps in Domain-Specific Functional-Based Solutions for High-Performance Execution","awardID":"1350901","effectiveDate":"2014-06-01","expirationDate":"2019-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562945],"PO":["564588"]},"211040":{"abstract":"This grant funds approximately 20 U.S.-based graduate students to attend the 2015 USENIX Security Symposium (Security '15), a leading forum for advanced professionals from academic and industrial backgrounds to meet and discuss the newest advances in the security of computer systems and networks. Participation in Security '15 and similar conferences is a valuable and important part of the graduate school experience. It provides students with the opportunity to interact with more senior researchers in the field, and exposes students to leading work in the field. The support enables the participation of students who would otherwise be unable to attend the conference. In addition, this grant supports the first USENIX Women in Advanced Computing summit, which will encourage women to become involved in the security field.<br\/><br\/>USENIX Security '15 will be held in Washington, DC, in August 2015. The conference consists of a three-day technical program, with numerous workshops co-located. The goal of the conference is to bring together researchers, practitioners, system administrators, system programmers, and others interested in the latest advances in the security of computer systems and networks. This cross-disciplinary emphasis makes it well suited as a target for student participation, and this event has always drawn a large proportion of student attendees. This venue provides an excellent vehicle for students to learn about the latest advances in computer security research, and participate in engaging discussions on a wide variety of sub-topics including network and system security, techniques for developing secure systems, technologies for trustworthy computing, hardware security, applied cryptography, etc. <br\/><br\/>A new feature in USENIX Security 2014 which will be continued for 2015 is the creation of a 'shadow' program committee to help graduate students learn about the publication review process.","title":"NSF Support for the 2015 USENIX Security Symposium, Financial Aid; August 2015; Washington, D.C.","awardID":"1421152","effectiveDate":"2014-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[565326],"PO":[565327]},"210003":{"abstract":"The Internet was not designed with information controls, such as censorship or surveillance, in mind. However, its importance has led many nations to repurpose Internet protocols (e.g., the Domain Name System (DNS) and Border Gateway Protocol (BGP)), and network management products (e.g., Web proxies, traffic shapers) for information control. This unintended use of networking technologies can lead to unintended international impact of censorship, and raises many ethical issues when network management products are exported to countries that use them to violate human rights. <br\/><br\/>To address these challenges, this project: (1) develops a platform which enables repeatable measurements of Internet censorship while mitigating risks to individuals performing the measurements, (2) designs techniques to analyze data from the platform to detect different types of censorship and even specific network management products used for censorship, and (3) uses the platform to quantify instances of national censorship which have unintended international impact on the Internet. <br\/><br\/>The use of technology to restrict freedom of speech and persecute dissidents around the globe is a human rights concern. This project provides high fidelity technical data to inform policy discussions. Further, the technical analysis provides insights into the global impacts of national censorship on the Internet, and how proposed improvements to existing protocols (e.g., DNSSEC, BGPSEC) can mitigate these issues.","title":"CAREER: Illuminating the Impacts of Internet Censorship with Principled Network Measurements","awardID":"1350720","effectiveDate":"2014-06-01","expirationDate":"2019-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[562921],"PO":["564223"]},"210262":{"abstract":"This grant supports students at U.S. institutions to attend the 4th Networking Networking Women (N^2Women) Workshop. This workshop will be co-­located with the 2014 annual conference of the ACM Special Interest Group on Data Communication (SIGCOMM 2014), to be held in Chicago, Illinois, August 2014. The workshop will be a full-day event held on the Sunday preceding the main conference in order to foster connections between attendees early in the week. Moreover, we have selected the Sunday timeslot to avoid conflicts with the technical workshops associated with the conference, which will be held on the Monday preceding the conference. Priority will be given to students who will benefit from attending the workshop, but are unlikely to attend due to the unavailability of travel funding. Students attending the N^2Women Workshop will be encouraged to stay and attend SIGCOMM. <br\/><br\/>Intellectual Merit: The intellectual merit of this proposal resides in the contributions that the student participants will make to (1) the N^2Women Workshop, (2) the SIGCOMM 2014 event (the premier conference in the networking communications field) and (3) the future scientific progress of the students? research. The exposure to the technical content of both the N^2Women Workshop and SIGCOMM 2014 will inspire students to address the tough problems in their respective field, with a long-­term benefit of scientific progress for these types of networks. <br\/><br\/>Broader Impacts: The broader impact of this proposal is the development of the under-­represented graduate students who with this t ravel support are able to attend the N^2Women. The travel funds will allow these graduate students to attend high-­caliber technical presentations, be exposed to state-of-the-art research, and interact with leading researchers and fellow graduate students. We expect the impact to the students? careers from attending the N^2Women Workshop to be substantial.","title":"N2Women 2014 Student Travel Grants","awardID":"1353944","effectiveDate":"2014-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[563481],"PO":["565090"]}}