{"115016":{"abstract":"The proposal is about organizing an informational meeting for the NeTS new focus area on Future Internet Design (FIND). The informational meeting will help potential PIs to get background information on the focus area and understand its scope so they can better target their proposals.","title":"NeTS-FIND: Informational Meeting on NeTS","awardID":"0606829","effectiveDate":"2005-12-15","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["427568","458851"],"PO":["565090"]},"114169":{"abstract":"This is funding to support next year's CSCW doctoral research consortium (workshop) of approximately 12 dissertation-stage doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2006 Conference on Computer Supported Cooperative Work (CSCW'06), to be held November 4-8 in Banff, Canada, and sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI). The biennial CSCW conferences constitute a leading international forum for the presentation and discussion of research and practice on computer supported cooperative work, and are attended by approximately 500 CSCW professionals from around the world. Research reports published in the CSCW Conference Proceedings are heavily refereed and widely cited. Goals of the doctoral consortium include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants, who are chosen by a review committee based on materials submitted by applicants in response to the CSCW Call for Participation, will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other CSCW research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on November 4, with follow up activities (including poster sessions open to all attendees) to be held during the technical program of the CSCW'06 conference on November 6-8. The organizing committee will take proactive steps to ensure and increase participation from institutions and ethnic groups that have been traditionally underrepresented at CSCW. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results made available to the organizers of future consortia. <br\/><br\/>Broader Impacts: The bi-annual CSCW doctoral consortia, which began in 1992, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today's leading CSCW researchers participated as students in earlier consortia. These doctoral consortia traditionally bring together the best of the next generation of CSCW researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"WORKSHOP: Computer Supported Cooperative Work Doctoral Research Consortium","awardID":"0602586","effectiveDate":"2005-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["518945"],"PO":["565227"]},"109417":{"abstract":"For more than a decade, \"presence\" has been a key concept for understanding and evaluating the effectiveness of virtual reality (VR) environments. VR researchers have used this term to describe the mental state of the user in response to being immersed in a virtual world, and typically equate presence with a sense of \"being in the virtual world\" or \"a lack of a sense of mediation.\" Can presence be achieved for augmented reality (AR) systems as well, so that the user loses the sense of mediation and begins to respond to being immersed in a blended physical\/virtual experience as if it were a single \"world?\" The goal of this research is to experimentally evaluate the impact of a range of technical and environmental factors on the quality of AR, so as to replace the beliefs developers wishing to create AR experiences now subscribe to with scientifically-supported guidelines or \"rules of thumb\" for best practices. To these ends, the PI and his team will explore immersion factors including graphics frame rate and texture quality, registration errors between the physical and virtual worlds, incorrect occlusion of the physical world by the virtual world, and conceptual consistency between the physical and virtual worlds. The research methods will be based on those used by researchers exploring presence in virtual reality (VR); one significant contribution of this work will be the adaptation and evaluation of the methods themselves to AR. The PI will build on the UNC VR \"Pit\" experiment, which leveraged a strong physiological reaction (fear of heights) to measure of presence, to develop an AR \"Pit\" experiment that generates similar physiological reactions, and will use it to evaluate the impact of the various immersion factors on the quality of an AR experience. Based on these findings, the PI will develop an AR presence questionnaire, which will then be applied to evaluate more realistic environments such as historic sites.<br\/><br\/>Broader Impacts: By defining a framework for evaluating AR experiences, the PI will enable AR developers to compare their work using a shared set of tools and vocabulary. Similarly, guidelines for the immersion factors that affect AR experiences will enable non-AR researchers (such as artists and educators) to more effectively explore the medium of AR with an understanding of what they should and should not pay attention to when defining the requirements of new media-rich location-based experiences. The PI envisages that AR will become a powerful tool for informal education and entertainment applications, e.g., in historic areas, where well-designed AR environments have the potential to enhance the educational and emotional experience of a wide demographic of visitors, ranging from inner-city school children to international tourists. The evaluation techniques and development guidelines that will result from this research are critical to the success of such projects.","title":"Presence and Augmented Reality","awardID":"0534315","effectiveDate":"2005-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["443269","533920","538206","402042"],"PO":["565227"]},"109428":{"abstract":"In this project the PIs will design, develop, and clinically test a vision-based user interface for enhancing the efficacy of wheelchair mounted assistive robot arms in unstructured environments. The target population is wheelchair bound individuals with limited upper extremity movement, such as patients diagnosed with Cerebral Palsy, ALS, Poliomyelitis, Multiple Sclerosis, Spinal Cord Injury, Muscular Dystrophy, and similar conditions that affect use of the upper limbs. The goal is to allow these people to function independently with comfort and speed in a variety of unstructured environments such as a grocery store, a living room, or an office. The innovation in this project that sets it apart from existing approaches is the segregation of robot motion into gross and fine components instead of unnatural joint or Cartesian motion as is currently the norm. To transform their bold vision into reality, the PIs will: develop a gross motion human-robot interface utilizing computer vision techniques and the human in the loop; utilize computer image processing algorithms for implementing a real-time robust feature identifier that is able to suggest to the user areas of interest, using computer vision techniques to segment by color, depth and other criteria; effect fine motion of the robot end-effector to facilitate pick-and-place tasks via fusion of geometric ideas from vision and adaptive control; develop a working prototype through unification of HRI, sensing, and control algorithms; and demonstrate benchmark activities of daily living tasks for wheelchair bound individuals with upper extremity impairments by tapping into the human resources available at Good Shepherd Rehabilitation Hospital located in Pennsylvania's Lehigh Valley. <br\/><br\/>Broader Impacts: The design of an enhanced functionality wheelchair robot will be a major leap toward rehabilitation of a broad segment of society whose members otherwise have only limited access to resources and opportunity. The PIs expect their approach to be directly relevant to any mobile device with on-board vision and where one can take advantage of the human in the loop, and thus to provide a new model of human-robot interaction for assistive technology. Interaction methods developed will be adaptable to a wide range of access devices, ranging from single switch scanning to sip-and-puff to a joystick. Moreover, the PIs expect that the fusion of vision and nonlinear control demonstrated in this project will advance the theory and applicability of computer vision and visual servoing.","title":"Collaborative Research: A Novel User Interface for Operating an Assistive Robot Arm in Unstructured Environments","awardID":"0534364","effectiveDate":"2005-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["526078"],"PO":["565227"]},"110330":{"abstract":"The purpose of the proposed research is to develop a dynamic data driven real-time decision support system for wildland fire spread prediction and containment that integrates simulation and stochastic optimization. The computational aspects of the decision support system include wildland fire spread simulation using the discrete event system specification (DEVS) approach and decision-making under uncertainty concerning where and when to concentrate fire containment efforts using stochastic programming. The experimental measurement aspects of the application include real-time dynamic weather conditions and sensory feedback data that include the actual fire-front position and the effect of fire suppression efforts on fire propagation. The success of the proposed research will derive from the multidisciplinary team of investigators whose areas of research include stochastic programming, discrete event modeling and simulation, systems software, and wildland fire spread.","title":"DDDAS-SMRP: Dynamic Data Driven Integrated Simulation and Stochastic Optimization for Wildland Fire Containment","awardID":"0540000","effectiveDate":"2005-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1786","name":"MANFG ENTERPRISE SYSTEMS"}}],"PIcoPI":["426827","429450"],"PO":["551712"]},"113102":{"abstract":"Improving the experiences of people in multi-user computer assisted collaborative activities or training to the extent that their interactions with each other and with their virtual environments are almost lifelike will requires much better haptic (force and touch) feedback technology than is currently available. In particular, little is available to provide human-human and human-world touch feedback when groups of users are moving freely, rather than seated at desktop displays. Compact vibration feedback devices could be used, notwithstanding that the user's ability while in motion to perceive high-frequency vibration is likely to suffer. An alternative method of activating the touch sensors in human skin is to apply distributed cutaneous stimulants, or skin stretch, but little is known about its effects on the body, or if it can be used as a body-mounted haptic display. The PI's goal in this project is to explore such issues. In particular, he will investigate the effects of both distributed skin-stretch and vibration feedback applied by means of light-weight, low-power \"tactors\" that can be mounted\/worn at various locations on a person's body. The PI will conduct experiments to quantify the effects of skin-stretch in comparison to vibration feedback for both sedentary and rapidly moving users, and will conduct preliminary investigations of the effects of body worn tactors in a physical rehabilitation environment, in the hope of improving motion training exercises which patients often require when recovering from injuries or strokes. The results of these experiments will provide a first indication of how best to utilize skin-stretch and vibration displays in virtual environments and in human-human interactions, and will also guide further tactor development.<br\/><br\/>Broader Impacts: In comparison to vision and sound, haptic feedback is an underdeveloped channel. New technologies such as those the PI will investigate in this project promise to revolutionize human-computer interaction and computer-mediated human-human interaction in a host of diverse domains, not the least of which are timely applications such as training exercises for emergency personnel and collaborative efforts among geographically distributed teams to develop emergency procedures.","title":"SGER: Optimizing skin stretch for localized haptic display","awardID":"0554188","effectiveDate":"2005-12-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["508165"],"PO":["565227"]},"112960":{"abstract":"The Netted Sensors Community Workshop will be held on October 24-26, 2005, at the MITRE Corporation McLean, Virginia, USA. The workshop brings together researchers and practitioners from Academia, Government (Gov't) and Industry; it will provide a forum for both developers and users of netted sensors technologies to share, exchange, and disseminate information with the goal of accelerating the research, development and transition of Netted Sensors (NS) technologies to solve real world problems. The workshop will focus on NS R&D activities to solve environmental monitoring, industrial and commercial, existing and future DOD and Intelligence Community sensing problems. In particular, The workshop brings together the S&T community, industry and Gov't\/Mil organizations to [1] review discuss the current state-of-the-art as well as disseminate recent advances and new R&D results, [2] highlight new commercial products and technologies, and [3] identify and discuss nationally important sensing problems suitable for Netted Sensing solutions and [4] identify a set of key challenge areas that need investments and will benefit from community wide R&D collaboration. NS R&D and applications are in the early stages of development and the transition to transformational capabilities is still a few years away. Significant NS research and development (R&D) challenges exist in the functional areas of sensors and platforms, communications and networks, signal and information processing, resource and information management, and security. An interdisciplinary approach to R&D is required because key system components and functions are highly interdependent. This workshop will act to synergistically combine the netted sensors functional areas. The workshop organizers believe that by bringing these interdisciplinary research groups together will lead to synergistic advances in the field of NS. The workshop will feature keynote addresses by leading researchers, panel discussion of future research directions, and contributed technical papers.<br\/><br\/>This proposal requests facility and travel support for university participants. We would like to keep the registration cost of the workshop low to allow many folks to easily participate. In order to accomplish this, we have decided to host the conference at the MITRE Corporation in McLean, Virginia. We request support for the cost of the organizational staff and facilities required for the workshop. We also request support for university faculty and students from US institutions who are authors or coauthors of a presentation, who without travel subsidies would not be able to attend. The workshop website will provide further details URL: http:\/\/www.twistedtiger.com\/nettedsensors\/index.html","title":"Netted Sensors Community Workshop","awardID":"0553342","effectiveDate":"2005-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[299040],"PO":["564898"]},"112685":{"abstract":"Visualization has become an increasingly important tool in all areas of scientific research and applications. It is crucial to diverse tasks such as evaluation of engineering designs, the understanding of large-scale simulations, the viewing of multi-modal 3D medical data, the mining of enormous web databases, and the analysis of homeland security information. However, visualization has not gained widespread use for routine data analysis in many fields, because while continuing advances are being made in visualization system software and hardware, the development of appropriate user interfaces for these tasks has lagged behind. In real-world applications, it is common to encounter data sets, which in addition to being of a spatial-temporal nature possess a large number of attributes (high dimensionality). The complexity of traditional user interfaces that were developed for low-dimensional data analysis grows rapidly as the dimensionality of the data increases, so that many users are unable or unwilling to perform the time-consuming and tedious steps required to create an informative visualization in a high dimensional space. In this project, the PI will address this challenge by incorporating machine learning into the interfaces used by scientists to explore and interact with their data, to develop intelligent interfaces targeting high-dimensional data visualization tasks with significantly improved usability. In a preliminary study the PI demonstrated the potential power of his approach in performing challenging volume classification tasks that conventional methods failed to do well, by coupling machine learning with a painting metaphor to enable more intuitive specification of user intent in the classification process. Users interactively paint directly on the volume rendered images or selected cross sections of the volume, and are given full control of what materials to classify by applying paint of one color to parts of the volume representing materials of interest and paint of another color to regions that are not desired. The system uses the painted regions (a very small subset of the volume) as training data to learn how to classify the whole volume, mapping each voxel into a value indicating the likelihood that the voxel is part of the material of interest; this uncertainty is then mapped to opacity for direct volume rendering. While the prototype system employed a deterministic artificial neural network, in this project the PI will use data sets with varying characteristics to explore whether support vector machines or Bayesian approaches can provide superior performance and better scalability in terms of being less computationally demanding while affording better interactivity. <br\/><br\/>Broader Impacts: The new visual interface technology to be developed by the PI in this project will dramatically increase the usability and efficiency of visualization systems and broaden the base of users who can successfully tackle the increasing challenges presented by complex visualization and analysis tasks. By incorporating effective machine learning into the process of data visualization and interaction, the PI will free users from repetitive tasks and the complex interfaces of today's systems. Concepts such as \"learning to classify\" and \"learning to track\" which are central to the PI's approach are very powerful, and will suggest to scientists that they rethink about how data analysis and visualization can be done, as well as enabling them to \"reuse\" and \"share\" valuable visualization experiences.","title":"Intelligent Visualization Interfaces","awardID":"0552334","effectiveDate":"2005-12-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["552243"],"PO":["565227"]},"113323":{"abstract":"The proposed work will undertake a multistage cluster sample of household addresses in New Orleans, supplemented by a phone banks survey. The goal is to collect 500 respondents by May 2006.<br\/> The survey questionnaire will ask about the decision to evacuate, survival experiences, demographic data, the kinds of needs that people had a different timepoints before, during, and after the hurricane. The survey has been designed by Edd Hauser, and will be piloted on refugees at UNC-Charlotte and Duke before used in the field. The first draft is under preliminary review by Duke Institutional Review Board, and will be modified according to their feedback.<br\/> The first part of the analysis will summarize the survey data, and provide cross-tabulations that show how different survival experiences are associated with age, pet ownership, income, and so forth. This is standard statistical analysis, but will help identify which aspects played dominant roles at different phases of the emergency.<br\/> The second part of the analysis will fit a social network model to the data, extending previous work on mathematical models for the kinds of help people need and from whom they get help. The nodes in the social network model will be people or agencies, and the edges in the network describe the kind of help that is required.<br\/> The research will be conducted jointly by David Banks, Edd Hauser, and John Lefante (working with Maria Sirois). David Banks and John Lefante are in charge of the survey design and data analysis. Edd Hauser, head of the Regional Center for Homeland Security and Major Disaster Management, is in charge of questionnaire design. Maria Sirois is a graduate student in Biostatistics in the School of Public Health and Tropical Medicine at Tulane; she and John Lefante are in charge of data collection. Maria Sirois is a member of the National Guard, the Louisiana Search and Rescue Team, and a certified first-responder.<br\/><br\/> The intellectual merit of the proposed research is twofold. First it will provide a statistical analysis of the factors affecting the survival experience of people in New Orleans before, during and after Katrina. Second, it will extend the social networks models applied in previous studies of disaster response by using the new class of latent space models and the data obtained from the Katrina event.<br\/> The broader impact of the proposed research is that it will provide guidance and insight for future disaster relief efforts, and highlight the interactions between people and agencies that were most\/least effective at various stages of the response.","title":"Collaborative Proposal: SGER: Social Measures of the Katrina Aftermath","awardID":"0555266","effectiveDate":"2005-12-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":[300063],"PO":["380485"]},"112597":{"abstract":"Intellectual Merit<br\/>This proposal is to explore the most promising emerging applications of Nanoscience to energy conversion and storage. This proposal will consider possible methods for improved efficiency in the following tasks: (i) conversion to electricity of solar energy and\/or heat (photo-voltaics and thermocouplers), and (ii) storage and release of energy (e.g., fuel cell and battery technology).<br\/><br\/>Rather than conduct new research, the proposal tasks will be restricted to study of research challenges, applications, and opportunities to NSF. To this end, the proposal requests NSF support for a limited scope NSF workshop on this topic in targeted areas of emerging interdisciplinary research.<br\/><br\/>Broader Impact<br\/>This NSF workshop will impact both the research community in Nanoscience as well as other disciplines engaged in the study of energy technologies. To insure involvement by graduate students, a number of their travel and local expenses will be supported. The PI and his institution, Duke University, purely as a service, make aspects of the proposal available to the community. There will no overhead charged on any aspect of this Workshop. <br\/><br\/>The workshop will also benefit the NSF to allow for the identification of targeted research opportunities and challenges in applications of key importance to US economy and industry.","title":"WORKSHOP: NSF Workshop on Emerging Opportunities of Nanoscience to Energy Conversion and Storage","awardID":"0551965","effectiveDate":"2005-12-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["550822"],"PO":["521045"]},"111322":{"abstract":"The days of traditional note-taking, where students use only pen and paper to record notes, are quickly coming to an end. With the ascendance of digital technologies, students in higher education are now expected to gather and assimilate information from a wide variety of electronic sources, most prominently the Internet, to accomplish many of their academic tasks. Students commonly need to gather, edit, annotate, organize, and save information from multiple, disparate web pages, a process the PI refers to as information assimilation. Because information assimilation activities often extend beyond a single continuous, uninterrupted session, students require support for tracking their ongoing work processes so that they can easily recall and rejoin previous work. Although similar in some ways to the concept of traditional note-taking on paper, information assimilation represents an emerging note-taking paradigm that involves the retrieval, integration and archiving of digital, often web-based information which, unfortunately, is not well supported by existing software applications, so that users are often forced to rely on ad hoc and ineffective methods to get the job done. Not only do students have a difficult time creating and integrating a set of personalized notes from the web and other sources (both digital and manual), they also lack a centralized repository from which they can store and retrieve their notes from a variety of different Internet access points. In this project, the PI will explore solutions to these problems. She will seek to extend the theory of note-taking in the digital age by designing, implementing, and evaluating a centralized web-based electronic notebook (e-notebook) to help students manage their rapidly evolving academic information assimilation tasks. She will conduct ethnographic studies in the first phase of this research to analyze how notes are recorded, maintained, used, re-accessed, interpreted, and integrated, in order to learn more about how the digital age affects a student's ability to learn from and internalize his\/her notes, and if the basic components of notes are different than what they used to be prior to our extensive reliance on electronic media. The PI will then follow a user-centered design methodology, with heavy emphasis on participatory design, to develop an e-notebook application that supports the most crucial functions for student note takers, that works seamlessly in conjunction with other electronic sources, and that is accessible from a wide variety of locations and computer platforms. The PI will evaluate the e-notebook using a series of longitudinal studies that tie back many of the theoretical questions originally posed.<br\/><br\/>Broader Impacts: This work will lead to development of a new tool to help students synthesize information and make better use of knowledge across disciplines. While the final prototype has the immediate potential to affect the student population at the PI's institution, the potential long-term benefit of this research to society as a whole is far reaching and significant, in that the e-notebook might be readily adopted by other institutions and by general web users who engage in the process of information assimilation, and ultimately alleviate the ever-increasing rate at which our society consumes paper.","title":"CAREER: From Pen and Paper to Computer: An Emerging Notetaking Paradigm for Students","awardID":"0545681","effectiveDate":"2005-12-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["345635"],"PO":["565227"]},"111465":{"abstract":"The research of this project is at the interface between computational geometry and surgery related to cardiovascular diseases. Cardiovascular diseases (such as vessel narrowing and blockage) have been major causes of death in the United States for a long time. The primary method for dealing with such diseases is to conduct interventional procedures, such as angiography, angioplasty, and coronary stent implant, in a minimally invasive manner. The research focus of this project is on developing efficient algorithms and techniques for solving a set of important geometric problems arising in these interventional procedures.<br\/><br\/>The target geometric problems include imaging geometry determination, high dimensional maximum inscribed sphere, k-set correspondence, projective curve-level, curve and point-set clustering, and minimum energy paths. New algorithms for these problems not only provide more efficient solutions to key problems in these interventional procedures, but also have the potential to be used in many other applications. The application of computational geometry techniques to medical problems is intellectually deep and can result in advances in both computational geometry and medicine. An important goal of this research is dissemination of implemented algorithms in software to application domains. In doing this, it will help to bring together the computer science and the medical community.","title":"CAREER: Efficient Geometric Techniques for Problems Arising in Cardiovascular Intervention Procedures","awardID":"0546509","effectiveDate":"2005-12-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485150"],"PO":["565157"]},"114578":{"abstract":"This project focuses on mobile persuasion (as distinct from deception) technologies, an area in which very little research has been conducted to date. The PI believes there may be several key differences when compared to other persuasive technologies that make mobile technologies particularly apt for use as persuasive tools in many situations, and that in particular mobile phones may be especially powerful persuasive devices, due to the \"always-on, always with you\" culture of mobile phones, and to the personal and private nature people ascribe to phones in general. The PI has begun prototyping a research platform for mobile phones that can be used to test the effectiveness of mobile persuasive techniques in a systematic and quantifiable manner. This funding will allow the PI to complete development of his platform, and to conduct initial experiments to investigate how mobile phones can be used to change people's beliefs and behaviors. The PI's goal is to obtain results that can be generalized to other mobile devices. The knowledge gained from these experiments has the potential to benefit the billions of people worldwide who use mobile phones, and in particular it may provide a basis for structuring programs to positively change these people's attitudes and behaviors.<br\/><br\/>Broader Impacts: Insights from this project will enhance the development and use of mobile devices, as well as providing general knowledge concerning learning, training, motivation, and persuasion, both in theory and practice. The PI will create materials to share these insights with the research community.","title":"SGER: Mobile Technologies to Change Attitudes and Behaviors","awardID":"0604463","effectiveDate":"2005-12-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[303408],"PO":["565227"]},"113545":{"abstract":"The proposed work will undertake a multistage cluster sample of household addresses in New Orleans, supplemented by a phone banks survey. The goal is to collect 500 respondents by May 2006.<br\/> The survey questionnaire will ask about the decision to evacuate, survival experiences, demographic data, the kinds of needs that people had a different timepoints before, during, and after the hurricane. The survey has been designed by Edd Hauser, and will be piloted on refugees at UNC-Charlotte and Duke before used in the field. The first draft is under preliminary review by Duke Institutional Review Board, and will be modified according to their feedback.<br\/> The first part of the analysis will summarize the survey data, and provide cross-tabulations that show how different survival experiences are associated with age, pet ownership, income, and so forth. This is standard statistical analysis, but will help identify which aspects played dominant roles at different phases of the emergency.<br\/> The second part of the analysis will fit a social network model to the data, extending previous work on mathematical models for the kinds of help people need and from whom they get help. The nodes in the social network model will be people or agencies, and the edges in the network describe the kind of help that is required.<br\/> The research will be conducted jointly by David Banks, Edd Hauser, and John Lefante (working with Maria Sirois). David Banks and John Lefante are in charge of the survey design and data analysis. Edd Hauser, head of the Regional Center for Homeland Security and Major Disaster Management, is in charge of questionnaire design. Maria Sirois is a graduate student in Biostatistics in the School of Public Health and Tropical Medicine at Tulane; she and John Lefante are in charge of data collection. Maria Sirois is a member of the National Guard, the Louisiana Search and Rescue Team, and a certified first-responder.<br\/><br\/> The intellectual merit of the proposed research is twofold. First it will provide a statistical analysis of the factors affecting the survival experience of people in New Orleans before, during and after Katrina. Second, it will extend the social networks models applied in previous studies of disaster response by using the new class of latent space models and the data obtained from the Katrina event.<br\/> The broader impact of the proposed research is that it will provide guidance and insight for future disaster relief efforts, and highlight the interactions between people and agencies that were most\/least effective at various stages of the response.","title":"Collaborative Proposal: SGER: Social Measures of the Katrina Aftermath","awardID":"0555934","effectiveDate":"2005-12-15","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":["480998"],"PO":["380485"]},"113844":{"abstract":"Despite the most recent advancement of computing and interaction technologies, it still remains a great technical challenge to faithfully and efficiently represent real-world objects in a digital computer and to develop effective human-computer interfaces for managing and communicating with such CAD models. In particular, no one has yet developed a robust graphical model and accompanying human-computer interface that can simultaneously (a) represent volumetric shapes of arbitrary topology and anisotropic material distributions, (b) efficiently simulate complex physical and dynamic behaviors in real time; and (c) facilitate natural, convenient interaction between human users and such 3D digital representations. In an effort to tackle the aforementioned challenges, and thereby bridge the large gap between real-world physical objects and CAD-based digital models, and improve communication and interaction between human beings and computer generated virtual environments, the PI will in this project develop Digital Sculpture, a novel two-hand haptic interface for HCI. Digital Sculpture will employ a new graphical model and solid subdivision scheme that unify modeling and animation for both geometry and material properties within a single physical framework, and will include a suite of two-hand, haptics-based interactive techniques for managing and manipulating the new representations in virtual environments. To date, two-hand haptic systems have been severely under-explored; an important outcome of this project will be the comprehensive investigation of a two-hand haptic system. The PI will validate the effectiveness of the new theoretic, algorithmic, computational, and software techniques that facilitate the interaction of Digital Sculpture in virtual environments via a two-hand haptic interface, via comprehensive usability studies that compare his technique and paradigm with existing ones in order to assess the benefits of the anticipated improvements. Variants of the new technique will also be explored (e.g., one-hand vs. two-hand Digital Sculpture to assess the gains provided by a haptic input from a second glove, even under conditions when the second glove remains stationary).<br\/><br\/>Broader Impacts: The novel HCI paradigm of a two-hand haptic interface would be invaluable in all applications in which 3D structures must be manipulated, including for example surgical simulation and virtual sculpting. The comprehensive study of novel, two-hand haptic interaction techniques will further deepen our understanding of haptic-based human-computer interaction.","title":"SGER: Exploring Digital Sculpture with Two-hand Haptics","awardID":"0601168","effectiveDate":"2005-12-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["416071"],"PO":["565227"]},"112943":{"abstract":"The purpose of this workshop is to address the research and development efforts on the various issues in the area of algorithms and complexity in the current and next generation infrastructure and infrastructureless wireless networks. In particular, this workshop is focusing on topics dealing with effective and efficient state-of-the-art algorithms, complexity analysis, comparisons, design and analysis, implementation and experimental studies in wireless networks. The workshop also includes discussion of future research directions that are likely to have the highest and broadest impact, as well as identify collaboration opportunities between industry and academia.","title":"Workshop on Algorithms and Complexity in Wireless Networks, April 4 - 5, 2006, Las Vegas, USA","awardID":"0553258","effectiveDate":"2005-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["280792"],"PO":["7594"]},"110523":{"abstract":"This proposal is to host the Second Annual Cybersecurity Summit 2005. The summit will address effective and efficient strategies for securing federal sponsored facilities' IT infrastructure. This summit will bring together a group of leading experts to identify major problems and strategies for solutions for a class of very difficult problems of technology, policy, and practices that increasingly threaten the successful operations of large facilities in support of scientific research.","title":"Second Annual Cybersecurity Summit for Large Federally Sponsored Facilities; Arlington, Virginia; November or December, 2005","awardID":"0540968","effectiveDate":"2005-12-15","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1798","name":"SPECIAL PROJECTS (AST)"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1743","name":"NATIONAL FACILITIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"4202","name":"UPPER ATMOSPHERIC FACILITIES"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"7255","name":"GEOINFORMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5418","name":"OCE SPECIAL PROGRAMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7396","name":"NEES RESEARCH"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1400","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"9170","name":"NSF PLANNING & EVALUATION"}}],"PIcoPI":["43608"],"PO":["337238"]},"112624":{"abstract":"The scalability of networked software-intensive switching systems is a widely recognized problem. Generally the software is large-scale, has a hierarchical, multilevel architecture, and supports several heterogeneous applications involving one or many communication protocols running on a networked computer system. These large scale commercial software systems may have been developed with the scalability as one of the key attribute of the architecture at the design stage but became non-scalable over a period of time with the introduction of new applications and protocols, the modifications of existing protocols, the addition of new features in the operating system, and the evolution of underlying hardware platforms. Worst is the situation with the software systems that were developed without scalability as an initial design goal. The objective of this project is to formulate, develop, and prototype scalability algorithms for communication software for a given performance objective that can be used for designing large-scale distributed systems that preserve their software architecture. Our goal is to apply the developed scalability algorithms to the system software of Voice over IP (VoIP) application.<br\/><br\/>The proposed research will develop scalability methods and algorithms that: (1) Identify the least scalable components of the architecture using which fundamental solutions to the scalability problem could be developed; (2) Apply the developed algorithms to commercially available VoIP system software and then examine the root causes of the scalability mismatch of hardware and software resources including the protocols. The methods and software developed under the project will be made available to the public via public domain web portal as well as conference\/journal publications.","title":"CSR - SGER: Performance Scalability Modeling Algorithms for Communication Software","awardID":"0552079","effectiveDate":"2005-12-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[298111],"PO":["551712"]},"111436":{"abstract":"The advent of high throughput technologies including DNA sequencing and microarray experiments has reshaped the landscape of molecular and cellular biology; A new field known as computational systems biology (CSB) has emerged to be a central discipline. This research investigates Bayesian signal processing solutions that enable uncovering gene regulatory networks (GRNs), the regulatory systems linking proteins and targets. Uncovering GRNs will help elucidate biological system structure, system dynamics, control mechanisms, and the design principles, thereby providing clues for new therapeutics strategies. <br\/><br\/>At the heart of the GRNs research are system modeling, inference, and data integration, all of which are the key issues of Bayesian signal processing. This research aims to: (1) investigate a novel graphical modeling framework for accurate and robust modeling of gene regulation; (2) investigate a novel Bayesian framework for systematic and efficient data integration; (3) investigate systematic procedures for effective results validation and error analysis; (4) apply the developed solutions to uncover the cell cycle GRNs of yeast and malaria parasite. This research is motivated by the inadequacy of current research in modeling, data integration, and results validation, and the shortfall in the practices that are inharmonious with the iterative nature of CSB. This research is anticipated to culminate in the formulation of powerful modeling and data integration frameworks that will significantly improve the accuracy and robustness of the uncovered GRNs, and under which further improvements and extensions to systems beyond genes can be systematically carried out. The research is also integrated with signal processing curriculum advance research training, and education of students at all levels. It promotes diversity and outreach in the area of CSB.","title":"CAREER: Bayesian Signal Processing for Uncovering Gene Regulatory Networks","awardID":"0546345","effectiveDate":"2005-12-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["559862"],"PO":["564898"]},"112657":{"abstract":"ABSTRACT<br\/><br\/>Part of the US prosperity in the last forty years can be attributed to the sustained development of information technology (IT) and the way in which IT has transformed how we live, play, work, communicate and secure the nation. The technical progress was funded by university-industry-government partnerships in research and development that yielded many billion-dollar industries. Recent trends suggest that the US base of research is being diminished, leading to a loss of leadership for the nation. The study will assess changes in the nation's long-term investment in information technology research and development and reasons for the changes. This should lead to a deeper understanding of the history and impacts of research and development support in computing, communications and their applications, and the complex interdependence of human resources, ideas, and support strategies. Alternative strategies about funding will be considered. The results will assist decision makers in both public and private sectors as they develop future strategies and programs. This should help to sustain intellectual progress in computing and information processing technologies, supporting national leadership.","title":"Assessing the Information Technology Research and Development Ecosystem","awardID":"0552216","effectiveDate":"2005-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7368","name":"SCI TESTBEDS"}}],"PIcoPI":[298189,298190,"560890"],"PO":["565136"]},"112977":{"abstract":"The phenomenal growth of the world wide web has made it the most popular<br\/>Internet application today. Web proxy caching is an important vehicle to<br\/>mitigate web traffic explosion. Current web caching services are becoming<br\/>increasingly inefficient for two reasons. First, the continuous increase<br\/>in dynamically generated content makes an increasing fraction of web-based<br\/>media uncacheable. Second, the increasing diversity of web traffic<br\/>requires a QoS-aware caching infrastructure while the current caches are<br\/>best-effort.<br\/><br\/>In this project we shall design, implement and evaluate an active<br\/>caching\/replication architecture that resolves the aforementioned major<br\/>limitations. The service augments web caches with the ability to<br\/>replicate not only static data but also data sources in a demand-driven<br\/>QoS-sensitive fashion. The cache acts as a QoS-aware retailer that<br\/>imports whatever active content is in local demand at the current time.<br\/>Demand-driven data source replication allows dynamic content to be<br\/>generated on the cache. Hence, it shifts the need for computing power from<br\/>centralized origin servers to proxies in the vicinity of end-users thereby<br\/>improving scalability and allowing cache-assisted customization of<br\/>user-perceived information access performance. By offering data source<br\/>location as a dimension to manipulate, the architecture achieves better<br\/>solutions for the web performance optimization problem that are<br\/>well-suited to diverse end-user needs.","title":"CAREER: A Pull-Based Architecture for Active Web Content Replication","awardID":"0553419","effectiveDate":"2005-12-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["553633"],"PO":["309350"]},"112914":{"abstract":"For people who have severe physical disabilities but retain control of their eyes, eye tracking may provide not merely a means to afford augmentative communication, but also a powerful and noninvasive opportunity for creative expression. Yet there have been few if any attempts to involve people with severe motor impairments as partners in participatory design projects to develop eye-controlled software to support creative expression, and the design space for eye-control of computers remains largely unexplored, so that most current eye-controlled software is limited to the user moving the mouse cursor with the eyes and looking at buttons to click on them. The PI believes other control and feedback techniques are needed to support a range of creative activities. The situation is arguably most acute with respect to young children who, because of severe physical impairments, are locked out of activities that are critical for creative, social, and emotional development, yet relatively little work has been done to explore and evaluate eye-controlled software for children with disabilities. In this project, the PI will explore how participatory design techniques can be extended to children who communicate primarily through their eye movements. He will seek ways to incorporate these children into the design process as users, testers, informants, and design partners, and will identify aspects of the process that can be reused for other applications and other user groups with severe disabilities. The PI will develop, deploy, and evaluate eye-controlled software systems that enable children with severe motor impairments to participate in creative activities that are currently not accessible to them. The project will specifically focus on the childhood activity of music making. The PI will confirm that the creative opportunities are successfully provided through quantitative and qualitative analyses. <br\/><br\/>Broader Impacts: This interdisciplinary research will enrich the scientific underpinnings and invent new techniques for creative expression and computer-control with the eyes, with special emphasis on the needs of children with severe motor impairments, for whom the project will identify new accessibility opportunities and provide creative expression through participation in collaborative, team based design projects. This project will ultimately provide people of all ages with severe motor impairments with a means of engaging in artistic, educational, and communication pursuits that are currently out of reach.","title":"SGER: Collaborating with Children with Severe Disabilities in the Design of Eye-Controlled Software","awardID":"0553117","effectiveDate":"2005-12-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["565362"],"PO":["565227"]},"116091":{"abstract":"Parallel computing has long offered the promise of very high performance, but it has delivered<br\/>only in a narrow range of applications. Exploiting parallelism at the level of large distributed-memory<br\/>systems is hampered by the cost of message-passing, while shared-memory systems remain mostly<br\/>small-scale. With the advent of symmetric multiprocessors (SMPs), however, shared-memory on a<br\/>modest scale is becoming an available commodity. High-performance gigabit networks allow scalable applications to run on large clusters of SMPs. Over the next five to ten years, clusters of SMPs will likely be the predominant architecture for scalable high-performance computing; however, little work has been done to date to support effective parallel computing on these SMP clusters.<br\/><br\/>Preliminary work we have conducted indicates that it is possible to improve upon current programming<br\/>methods for SMP clusters. In this career award the goal is to develop, implement, assess, and<br\/>refine algorithms for SMP clusters for irregular (e.g., string-, tree-, and graph-based) computations that<br\/>will deliver significant speedups on typical configurations of SMP clusters and scale gracefully with<br\/>the number of processors. The research will investigate new algorithms and a library of basic routines to<br\/>support irregular computations, mostly tree- and graph- based, along with new insights on how to leverage<br\/>the theoretical research in PRAM algorithms. Science-driven problems in genomics,bioinformatics, and computational ecology will provide the focus for this research.<br\/><br\/>The education component of this project includes mentoring high school and minority students, diseminating research results through talks and papers, and presenting tutorials at key conferences and<br\/>workshops. Prior mentoring has produced several individual and group teams that have won first place in both local and national competitions and mentoring will continue activities with minority groups, such as the National Society of Black Engineers and Native American Pueblo student groups.","title":"CAREER: High-Performance Algorithms for Scientific Applications","awardID":"0611589","effectiveDate":"2005-12-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["558497"],"PO":["565272"]},"108382":{"abstract":"This is a multi-disciplinary and inter-disciplinary study (social and computer science) in the context of teams of Free\/Libre Open Source (FLOSS) software developers to better understand the cognitive and social structures that underlie changes in individual and team behaviors in these teams. It addresses the general research question: What are the dynamics through which self-organizing distributed teams develop and work? <br\/><br\/>Increasingly, organizational work is performed by distributed teams of interdependent knowledge workers. Such teams have many benefits, but geographic, organizational and social distance between members makes it difficult for team members to create the shared understandings and social structures necessary to be effective. But as yet, research and practitioner communities know little about the dynamics of distributed teams, especially not self-organizing ones. This research will study how distributed teams develop shared mental models to guide members' behavior, roles to mediate access to resources, and norms and rules to shape action, as well as the dynamics by which independent, geographically-dispersed individuals are socialized into these teams. <br\/><br\/>As a basis for this study, a conceptual framework will be developed that uses a structurational perspective to integrate research on team behavior, communities of practice and shared mental models. A key innovation of this project is the integration of three methods to investigate these dynamics: natural language processing and social network analysis of transcripts of team interactions and source code analysis. The work will be carried out by a multi-disciplinary team including researchers from the fields of information systems and natural language processing, and with participation of an international collaborator at Politechnic of Bari. The research will be guided by an advisory board of FLOSS developers to ensure relevance and to promote diffusion of the findings into practice. <br\/><br\/>This study will have conceptual, methodological as well as practical contributions. Developing an integrated theoretical framework to understand the dynamics of a distributed team will be a contribution to the study of distributed teams. The project will advance knowledge and understanding of FLOSS development and distributed work more generally by identifying how these teams evolve and how new members are socialized. Understanding the dynamics of structure and action in these teams is important to improve the effectiveness of FLOSS teams, software development teams, and distributed teams in general. The study fills a gap in the literature with an in-depth investigation of the practices adopted by FLOSS teams based on a large pool of data and a strong conceptual framework. Furthermore, the research will use several different techniques to analyze these practices, and thus provide a richer portrait of the dynamics of these development teams. <br\/><br\/>The project will benefit society by suggesting ways to strengthen distributed FLOSS teams, an increasingly important approach to software development. The study will shed light on distributed work teams more generally, which will be valuable for managers who intend to implement this novel, technology-supported organizational form in practice. Findings from the study might also be used to enhance the way computer-mediated communication technologies (CMC) are used to support distance education or scientific collaboration, which are emerging applications of distributed teams. In order to improve infrastructure for research, the tools and data will be made available to other researchers. As well, the project involves an international collaboration. Such exchanges expand the perspectives, knowledge and skills of both groups of scientists. Finally, the project will promote teaching, training, and learning by providing an opportunity for students to work on research teams, utilize their competencies and develop new skills in data collection and analysis.","title":"Investigating the Dynamics of Free\/Libre Open Source Software Development Teams","awardID":"0527457","effectiveDate":"2005-12-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":["361079","565342","546592"],"PO":["564456"]},"109440":{"abstract":"A recent trend in the nature, place and organization of working life in the United States is the growing complexity of work, the emergence of new working populations (older workers, under-skilled workers, telecommuters and flexible shift workers), and the increasing likelihood that people will work, at least part-time, at home. As the home becomes more an office, the office is becoming more a home, where \"hot desks,\" lounges, sofas, WI-FI and internal networks often replace cubicles and hard-wired workstations. These dramatic transformations in the nature of work, combined with unprecedented new technologies associated with working life, suggest a re-evaluation of the relations between workers, their technologies and their work environments, and a redesign of the work environment itself as a socially and technologically responsive system occupying both home and office. In that spirit, the focus of this project is on a critical aspect of the \"intelligent\" work environment: the physical workspace itself. The PI and his team will design, prototype, demonstrate and evaluate an \"Animated Work Environment\" (AWE), an articulated, programmable, interior environment accommodating a range of digital technologies that the PI expects will facilitate productivity, connectedness and innovation across fluid assemblages of people working with both analog and digital materials in a wide variety of locations and settings. Featuring a continuous, morphing surface controlled by a user-friendly interface, AWE will both couple to and complement the efforts of other investigators, who continue to realize promising components of the \"intelligent\" work environment such as projectors, screens, tablets, sensors, actuators and other digital devices. This research will advance knowledge and understanding in both architecture and computer and information science and engineering, by defining the \"robot as a room\" and the \"room as a robot.\" The need to \"program the room\" will both stimulate and be enabled by existing and ongoing efforts in IT and \"intelligent environments.\"<br\/><br\/>Broader Impacts: This research, to be conducted and broadly disseminated by four investigators representing four disciplines - architecture, robotics, sociology and human factors psychology - with the active involvement of graduate and undergraduate students, including those from underrepresented groups, will expand the vision of researchers, developers and manufacturers of information technologies to recognize the physical environment as an integral and necessary part of the dynamic interaction between people and IT. Project outcomes will include a working prototype of a technologically advanced work environment aiming to increase satisfaction, participation, connectedness and productivity across working populations that might otherwise work inefficiently, unhappily, or not at all. This work is innovative, also, from a sociological point of view, for its reconsideration of the workplace. As the nature of work has changed in recent decades, sociologists have focused their attention on the impact of these changes on the social relations of production. This project takes a new perspective, emphasizing the material workplace as part and parcel of the changing social relations of production.","title":"Animated Work Envirionment [AWE]","awardID":"0534423","effectiveDate":"2005-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":[289725,"563341",289727,"563342"],"PO":["565227"]},"109561":{"abstract":"0535207<br\/>Scharf Peter<br\/>Brown University<br\/>Collaborative Research: International Digital Sanskrit Library Integration<br\/><br\/>The proposed project aims to develop a globally distributed, internet-based, digital library in Sanskrit, one of the worlds richest culture-bearing languages. At the same time, the project will explore OCR and language attributes of certain other none Roman scripts, such as Arabic, as the technologies to be developed are generic at the image recognition and other linguistic levels. Online access to digital content of many languages is at present severely hampered because available information processing technologies have developed primarily in the environment of the Roman alphabet. Sanskrit words have contextual phonetic variation and is a highly inflected language. These properties make discerning word boundaries and search of textual materials difficult, and requires the development of phonological and inflectional software.. Maximizing the utility of digital libraries of Sanskrit and a number of other widely used texts involves overcoming linguistic problems concerning script and encoding, phonology, grammar (inflection, agglutinative structures, derivation), and lexicon.This project integrates currently independent projects to create Sanskrit digital archives, digital lexica, and linguistic software; and explores text-encoding standards to enhance ancient and medieval manuscript access. The project will also advance OCR technology, display software, and Unicode-compliant text-editing software. Tools and techniques developed in this project will provide powerful new methods of access to scanned Sanskrit and other texts and will make widely available works that were previously available only to highly-trained specialists. This access will be profoundly valuable to students, scholars, and the wider public concerned with such fields as historical and general linguistics, philosophy and religious studies, pharmacology and medicine, history of science and mathematics, and general history and literature of South Asia.","title":"Collaborative Research: International Digital Sanskrit Library Integration","awardID":"0535207","effectiveDate":"2005-12-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[290054,290055],"PO":["563751"]},"109473":{"abstract":"This project will develop data mining algorithms for extracting concepts such as semantic locations and routines from location based service traces, along with techniques for handling privacy concerns. The traces will come from a system called PlaceMail that generates use records that link the virtual and physical worlds. PlaceMail users create virtual messages (such as reminders and to-do lists) for delivery at a specific place or time on a location-aware cell phone client. PlaceMail also can collect traces of user presence at a location and time. These data will enable novel applications such as a local search engine that lets the user tap into the collective community opinion to find the best place to obtain desired goods or services, and a social matching system that can bring together people with similar routines, to facilitate ride sharing and increase community cohesion.<br\/><br\/>The algorithms will extract and process information from location-linked data, including data mining algorithms to extract higher-level constructs like paths from traces and retrieval algorithms that combine keywords from messages with popularity estimates based on traces to return relevant and high-quality results. Also to be developed will be social matching algorithms that can find people with similar routines and recommendation algorithms to suggest new places a user might be interested in.<br\/><br\/>Privacy concerns are a central issue for such a system, so an important project of the project will be designing easy-to-use techniques for managing them. Privacy requirements will be investigated through contextual prototyping with PlaceMail users, in which early prototypes of the applications are filled in with the users' own data. This method will make it easy for users to conceive of the risks and benefits of sharing their data, and thus will lead to reliable requirements. <br\/><br\/>Empirical evaluations of the applications will validate results. The algorithms and privacy management techniques will be incorporated into target applications. Large field trials of PlaceMail (to generate sufficient amounts of real data) will be combined with controlled laboratory studies that compare the target applications to existing baseline applications. <br\/><br\/>Location-aware technologies can link the new virtual world of the World Wide Web to the physical world, and this project is a major step in the development of tools that can aggregate useful location-linked information. Not only will people benefit individually, for example by finding better information about places in their community, but also communities may benefit from increased cohesion, as citizens learn from each other's experience, establish relationships based on shared interests, and use public resources (roads, community centers, parks, and the like) more efficiently. This project will share the datasets produced with the research community, suitably anonymized and with user consent, and it will provide deep and diverse training to a set of graduate students.","title":"Mining Spatiotemporal Data: From Personal Use to Community Knowledge","awardID":"0534692","effectiveDate":"2005-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}}],"PIcoPI":["518491"],"PO":["564456"]},"105273":{"abstract":"This project will explore new and potentially powerful technological teaching tools for introducing the concepts of computing and physics to children (and teachers). The goal is to broaden the class of students who are not merely exposed to but rather engaged with technology, by empowering children to express ideas with usable tools for creating stop-action and 3D-animated movies, and by developing methodologies for incorporating such tools into Science, Technology, Engineering, and Mathematics (STEM) education. This effort leverages emerging public fascination for computer animation, as well as recent technological advances that have moved the graphics power of yesterday's million-dollar visualization supercomputers into every desktop PC.<br\/><br\/>A proof of concept of this approach, based on stop-motion animation, was prototyped by one of the PIs, and initial trials were encouraging. In a high-school physics class for noncollege-bound seniors, students who typically skipped class were now attending, some coming even during free time to complete their movies. Through animations, students were able to critically examine their own understanding of the physics and more effectively convey that understanding to teachers. (The same technique is also being used to teach reading to 7 year olds and biology to 9 year olds, replacing book reports and lab notebooks with animated stories and documentaries.) Informed by that experience, this project will have two arms: one to develop and evaluate teaching methodology based on moviemaking (at Tufts University), the other to create new 3D computer animation tools useable in the classroom (at Princeton University). <br\/><br\/>Technological teaching tools are often developed in the absence of strong educational research; in this project, the PIs will use accepted metrics (and develop new ones) to quantify the STEM learning improvement in high school physics as a result of using animations, comparing student understanding in conventional \"hands-on\" physics classes with those that include movie journaling. Results from this work will not only contribute to our understanding of how students learn physics and computing, but will also help bridge the student's experience and intuition with modern scientific theory. Further development of moviemaking tools will allow students to move from the jerky animation of the stop-action world to the smooth animations of modern computer graphics. Unfortunately, existing animation systems are barely usable by professionals, let alone grade-school students. This project will address that research challenge by developing inexpensive and robust 3D scanning hardware, point-and-click animation interfaces, and methods for stylized (e.g. cartoon-like) rendering of 3D animation.<br\/><br\/>Broader Impacts: Anecdotal evidence from the prototype system (gathered over the last three years in five classrooms) already suggests the potential significant impacts of the work. Science-phobic students and computer-shy teachers enthusiastically argue about the underlying physics to improve their movies. Movie making gives teachers a multi-media portfolio to assess student learning and test student preconceived models. If formal evaluations agree with this experience, the results of this project have the potential to change the way students learn science at all ages, opening up a new channel to students to show their understanding and test their hypotheses. This may lead to innovations in teaching computing, math, biology, chemistry, engineering, and even story telling and literature. (Nonetheless, this study chooses an emphasis on physics education because of established metrics for evaluation in this subject.) Even more broadly, animation represents a new medium of expression - visual rather than written - that is compelling but currently limited to highly skilled professionals. The tools the PI plans to develop in this project will make animation more accessible both to children and, more generally, to everyone outside the animation industry. Making this technology more widely available has the potential to affect the way we all communicate, learn, work, and play, turning us into media developers rather than media consumers.","title":"Collaborative Research: Telling the Story - Learning Math, Science and Engineering Through Animation","awardID":"0511965","effectiveDate":"2005-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["456692","424207",277940],"PO":["565227"]},"109552":{"abstract":"This project addresses the problem of category-level object recognition in images: Its aim is to develop effective methodologies for representing object classes; learning the corresponding object models from cluttered sample images in a semi-supervised manner; and efficiently and robustly recognizing instances of these models in novel images despite clutter, occlusion, viewpoint and illumination changes, and individual variations within each class. <br\/><br\/>Intellectual Merit. The scientific objective of this project is to develop a representation of the salient parts of an object and their relationships that can effectively be learned from<br\/>heavily cluttered data in a weakly supervised way, correctly captures within-class variability and appearance changes due to variations in viewpoint and illumination, and effectively supports inference over object models and the automated construction of efficient classification machines.<br\/><br\/>Broader Impacts. This project will investigate applications of category-level object recognition to image retrieval, video annotation, human-computer interaction; surveillance and security; and robotics via international academic and industrial collaborations. Contributions to education and outreach will include training PhD students and post-doctoral researchers, and involving underrepresented groups in graduate research and undergraduate data collection and empirical evaluation projects.","title":"Collaborative Research: Toward Category-Level Object Recognition","awardID":"0535152","effectiveDate":"2005-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[290030,"457204"],"PO":["564316"]},"109475":{"abstract":"This research will advance the state of the art in groupware along two dimensions, both motivated by mobility: (1) It will automate management of groupware tasks, subject to policies and guidelines provided by the participants and in response to changes in group configuration; the process will be made possible by the development of appropriate formalizations, protocols, and metrics. (2) It will develop a software infrastructure tailored to groupware in dynamic wireless environments and capable of multi-mode operation, i.e., in a nomadic manner when connected to infrastructure networks through a gateway or in an ad hoc manner when there are no external resources available. Central to the approach is the concept of knowledge management, whereby knowledge of the environment, other devices, and software capabilities is collected and traded by different mobile devices within the system with the overall aim of increasing each mobile device's understanding of the physical and computational environment that it perceives. This knowledge can then be used to enhance the capabilities of each entity within the system, and therefore by extension the collaborative behavior supported by the system itself.<br\/><br\/>The key technical contribution of this work is the introduction of groupware into the realm of mobile ad hoc networks and the automation of fundamental groupware processes. The dynamism of wireless ad hoc networks makes infeasible simple ports of current groupware technology, geared for reliable wired systems. In fact, the very notion of groupware needs to be reexamined and new algorithms and protocols that accommodate mobility need to be considered. Automation of groupware processes also introduces its own challenges since complex tasks, actions, information flows, work flows, contingency plans and much more need to be described in a machine decipherable format. Additionally, the element of uncertainty, ever present in mobile networks, further adds to the challenge of developing reliable algorithms and metrics. <br\/><br\/>Groupware encompasses a broad range of software technologies that facilitate human collaboration, ranging from simple e-mail and bulletin board services to shared whiteboards and videoconferencing. Today, groupware technology is on the cusp of a revolution, one that is being driven primarily by the incredible pace of development of mobile device technology that has transformed cellular phones and PDAs into viable portable computers and, by extension, into next generation platforms for groupware. Blending mobility with groupware technology will establish a foundation for ambitious new applications that will facilitate and manage the coordinated behavior of groups of people. Responding to catastrophes such as chemical spills, conducting geological surveys of remote areas, and even managing a community of robots exploring a remote planet are only a few examples of the many complex, highly coordinated activities that will benefit from this approach. The project will also mentor doctoral students, channel undergraduates towards doctoral programs, and contribute to public understanding of science and technology through an ongoing collaborative effort with the St. Louis Science Center.","title":"Adaptive Systems for Collaboration in Multi-mode Mobile Environments","awardID":"0534699","effectiveDate":"2005-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["384032","556687"],"PO":["564456"]},"109465":{"abstract":"Enabling Personal Privacy Protection Preferences in Collaborative Video Observation<br\/><br\/>This work devises automated methods to respond to many of the privacy concerns raised as a result of the<br\/>increasingly pervasive use of video monitoring of public and private spaces, made possible by<br\/>inexpensive surveillance and storage technology and justified by the need for greater security and<br\/>vigilance in our society. Furthermore, as a result of continuing progress in the machine understanding of<br\/>human behavior and event detection through machine learning and computer vision in well specified<br\/>domains, many beneficial applications of continuous video and sensor monitoring other than physical<br\/>security have been emerging. However, research that depends heavily upon clinical trials has been<br\/>impeded by natural reluctance on the part of subjects to participate in studies where a video record of their<br\/>activity and behavior is created and made accessible to diverse collaborating groups. One example is the<br\/>continuous monitoring of nursing home patients to enable early detection of changes in behavior and<br\/>performance that may correspond to environmental or pharmacological changes in their regimen. Others<br\/>include the study of child development and aberrant behavior in day care, and the monitoring of<br\/>independently living senior citizens by their families and medical providers.<br\/><br\/>To meet the associated concerns about ill-controlled access to such data even by authorized users, this project<br\/>develops and evaluates alternative control and access mechanisms for both the capture and display of video<br\/>and sensor data that enable a layered access to detail and identity in imagery in order to more appropriately<br\/>reflect how the observations are intended to be used. This is accomplished through means largely enabled<br\/>by computer vision and computer graphics research, for example, from selectively identifying and<br\/>obscuring faces, to alternatively substituting wire-frame and stick- figure surrogates, to complete removal<br\/>with substitution of background data, all without the need for human identification and intervention in the<br\/>process. The implemented methods recognize and implement the privacy protections provided by law, by institutional policy, and now, most importantly, by the personal preferences of the participating subjects of<br\/>observation, whether that be at work, at home, or in a hospital. Different groups with differing<br\/>purposes are allowed to collaboratively use the same recorded data, but each being able only to observe and extract the information that they need and to which they have been selectively permitted.<br\/><br\/>This project enables significant research in social and medical settings, where automated observation and analysis can yield the keys to understanding change and managing interventions. It is important to alleviate the concerns of citizens through trusted mechanisms. Without such capability, the use of continuously captured and automatically analyzed observation data in many fields of scientific, medical and social research, as well as in providing protections for health and safety, will be seriously impeded, if not prevented. The outcomes of this research will ameliorate or overcome these impediments by enabling meaningful access to video observables while respecting the demands of individual privacy in the light of rapidly expanding <br\/>public and private surveillance. It is anticipated that these mechanisms will enable a much broader comfort level for participation in video- based applications and environments.<br\/><br\/>URL: http:\/\/www.caremedia.cs.cmu.edu\/","title":"Enabling Personal Privacy Protection Preferences in Collaborative Video Observation","awardID":"0534625","effectiveDate":"2005-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}}],"PIcoPI":[289799,"333951","371226"],"PO":["564318"]},"115240":{"abstract":"Abstract<br\/>0438948<br\/>Paul, JoAnn M. <br\/>CMU<br\/><br\/>SoD: Enabling Design Strategies for Single Chip Heterogeneous Multiprocessors<br\/><br\/>Within the next ten years, it will be possible to provide enough transistors on a single chip for on the order of a hundred 32-bit RISC processors. The design of these emergent, software-intensive single chip heterogeneous multiprocessor (SCHM) computer systems precludes the possibility of seat-of-the-pants analysis or specify-and-synthesize methodologies. No science of design has been developed for mixed hardware\/software single chip multiprocessing systems. Strategic computer system organization - requires a creative proces that can not be automateds,and thus this designer creativity must be facilitated at the system level. The full vision of this research is to develop the science needed to enable future design systems to break away from the specify-and-synthesize mind set of current CAD tools to become a characterize-and-invent paradigm that still has ties into the current lower level integrated circuit design methodology flows. Another major theme behind our research is that computer system designers start from trend analyses, looking for future cross-over points between anticipated changes in the major features of applications sets and the physical capabilities of the major architectural features of the systems that carry them out. From these, design strategies are invented which can become basic organizing themes for entire classes of programmable systems.","title":"SoD: Enabling Design Strategies for Single Chip Heterogeneous Multiprocessors","awardID":"0607934","effectiveDate":"2005-12-15","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["464680"],"PO":["564388"]},"115098":{"abstract":"This award supports participation of doctoral students from U.S. universities in the eleventh SIGART\/AAAI Doctoral Consortium to be held July 16-17, 2006 in Boston, in conjunction with the 21th National Conference on Artificial Intelligence (AAAI-06), July 16-20, 2005. The Doctoral Consortium aims to: (1) provide a setting for feedback on participants' current research and guidance on future research directions; (2) develop a supportive community of scholars and a spirit of collaborative research; (3) support a new generation of researchers; and (4) contribute to the conference through interaction with other researchers at the conference. The Doctoral Consortium will strive to recruit and include students from underrepresented groups (e.g., women and underrepresented minorities) and smaller schools or schools with less established programs in artificial intelligence. Each student will give a 25-minute presentation to be followed by 20 minutes of discussion guided by a faculty participant; there were also be a one-on-one meeting with the faculty participant. There will also be opportunities to discuss career issues in both academic and other career pathways. In conjunction with the general conference's activities celebrating fifty years of AI, the committee plans to solicit participation of some of the very senior or founding members of the community in the Doctoral Consortium, for instance, by having them participate in a \"20\/20 Perspective: What I Wish I'd Known in Graduate School\" panel. It is expected that thesis summaries of the participants will be published in the AI Magazine.","title":"2006 SIGART\/AAAI Doctoral Consortium","awardID":"0607406","effectiveDate":"2005-12-15","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["491701"],"PO":["317663"]},"113393":{"abstract":"Internet mediated telepresence has the potential to transform society by eliminating the physical barriers to collaboration. However, it has yet to reach the ideal of providing a medium-transparent, immersive visual and audio link between remote locations. The goal of this project is to begin to address issues and tradeoffs between latency minimization and quality of service in the context of Internet mediated musical collaboration. Specifically, the PI will focus on real-time distributed musical rehearsal and performance, which is highly demanding in terms of both audio\/video quality of service and communication latency. The technical challenge to be tackled in this project is related to the development of efficient and reliable multimedia Internet protocols linked with low-latency multimedia compression. The PI will employ and build upon the ITU-T developed H.323 open standards to address the interplay between, and joint optimization of, the compression methods and the transport protocols. The team, which includes researchers from the University of Rochester (including its Eastman School of Music), from the University of Miami (including its Frost School of Music), and from Wright State University, will develop a test-bed system linking the three sites that will be capable of supporting three-way musical collaboration. Because the ultimate success of this interdisciplinary project, which involves multimedia coding and immersive environments, depends upon the experience of the end-users (musicians), a key component of the work is involvement of musicians not only in final assessment of the technology, but also from the earliest stages in the technical developments. <br\/><br\/>Broader Impacts: The impact of this research extends beyond its benefits to distance music collaboration and education. In addition to bringing music into the lives of members of underrepresented groups, the project also will enable individuals with physical limitations and those who are geographically isolated to participate in a range of essentially interpersonal activities from scientific and engineering collaboration to health care delivery and, of course, to joint artistic endeavors. The PI will seek to maximize the impact of the work by building upon existing widely accepted open videoconferencing standards.","title":"SGER: Music Telepresence","awardID":"0555457","effectiveDate":"2005-12-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["360639"],"PO":["565227"]},"109533":{"abstract":"0535038<br\/>Govindaraju, Veugopal<br\/>SUNY, Buffalo<br\/>Collaborative Research: International Digital Sanskrit Library Integration<br\/><br\/>The proposed project aims to develop a globally distributed, internet-based, digital library in Sanskrit, one of the worlds richest culture-bearing languages. At the same time, the project will explore OCR and language attributes of certain other none Roman scripts, such as Arabic, as the technologies to be developed are generic at the image recognition and other linguistic levels. Online access to digital content of many languages is at present severely hampered because available information processing technologies have developed primarily in the environment of the Roman alphabet. Sanskrit words have contextual phonetic variation and is a highly inflected language. These properties make discerning word boundaries and search of textual materials difficult, and requires the development of phonological and inflectional software.. Maximizing the utility of digital libraries of Sanskrit and a number of other widely used texts involves overcoming linguistic problems concerning script and encoding, phonology, grammar (inflection, agglutinative structures, derivation), and lexicon.This project integrates currently independent projects to create Sanskrit digital archives, digital lexica, and linguistic software; and explores text-encoding standards to enhance ancient and medieval manuscript access. The project will also advance OCR technology, display software, and Unicode-compliant text-editing software. Tools and techniques developed in this project will provide powerful new methods of access to scanned Sanskrit and other texts and will make widely available works that were previously available only to highly-trained specialists. This access will be profoundly valuable to students, scholars, and the wider public concerned with such fields as historical and general linguistics, philosophy and religious studies, pharmacology and medicine, history of science and mathematics, and general history and literature of South Asia.","title":"Collaborative Research: International Digital Sanskrit Library Integration","awardID":"0535038","effectiveDate":"2005-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["548306"],"PO":["433760"]},"109544":{"abstract":"The goal of this project is to develop a framework for intransitive pattern classification and models of intransitive choice. Intransitivity can arise from various forms of classifiers. This includes the augmenting of log-likelihood ratios with correction terms and collections of binary classifiers (SVMs\/kernel machines, binary neural networks, etc.) when used for multi-class classifiers. Intransitivity can also arise in individual and group choice (e.g., elections, tournament-style competitions). The project is developing methods to better explain intransitivity in these classifiers and to model preference relationships in social choice. Questions being investigated by this project include: (1) why\/when intransitivity occurs; (2) why\/how it helps classification; (3) how to introduce intransitivity in classifier systems; (4) whether intransitivity should itself be a goal, or rather whether to treat it as an artifact of imperfection and an indication of incertitude; (5) methods to detect intransitivity; (6) how intransitivity can be used to reduce errors; (7) how to model intransitivity; (8) the relationship between intransitivity in machine learning and in sociology, psychology, voting theory, political science, operations research, mathematics, economics, and philosophy; and (9) if transitive explanations can better explain natural organisms. In addition to establishing new cross-field scientific connections, this project has a broader impact through integration of its results into new seminars, tutorial articles on intransitive decision making, and new freely-available software.","title":"Intransitive Classification and Choice","awardID":"0535100","effectiveDate":"2005-12-01","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["478990","508528"],"PO":["562760"]},"109456":{"abstract":"This research project will investigate efficient methods of link analysis that are applicable to large-scale networks with inherent hierarchical structure: in particular, the Web. The techniques rely on extensions to the theory of stochastic stability, a subarea of matrix perturbation theory. Central to the work is an algorithm for computing the stochastically stable distribution of a perturbed Markov process, believed to be the first algorithm that achieves this goal. Embedded within a perturbed Markov process is a hierarchy; consequently, the algorithm for computing stochastically stable distributions is recursive, operating on successively smaller substructures in this hierarchy. The algorithm can efficiently compute the stochastically stable distribution of any Markov process with inherent hierarchical structure. Currently, the most prominent application of link analysis on the Web is the PageRank algorithm, upon which the Google search engine is built. Research will apply the new algorithm to an alternative perturbation of the Web's adjacency matrix, exploiting the hierarchical structure embedded in the Web.<br\/><br\/>An instance of the algorithm that computes importance rankings among web page is called QuickRank. By exploiting the hierarchical structure of the Web, QuickRank could yield dramatic computational gains over PageRank. Moreover, since QuickRank recursively aggregates local rankings into global rankings in an intuitively satisfying way, its importance rankings should be at least as compelling as those output by PageRank. Experiments with QuickRank will evaluate each of these claims.<br\/><br\/>Among the sources of inspiration for this research are sociologists working in the area of social network analysis, who rely on centrality metrics (e.g., degree, closeness, and betweenness) to rank individuals in a society according to their power, prestige, and prominence. But the technology to be developed in this project is not only of interest in the realm of network analysis; it is potentially useful in any field where the theory of Markov chains is applied, most notably equilibrium selection in economic game theory. The research will develop efficient algorithms to tackle the general problem of computing stochastically stable distributions, and it will apply these ideas to study strategic agent behavior in games. Thus, the project has strong multidisciplinary roots; as such, it will contribute to the joint computer science-economics concentration for students at Brown University. It should also help build bridges between students and professors in computer science and economics, and potentially foster future collaborations among applied mathematicians and sociologists.","title":"Efficient Link Analysis: A Hierarchical Voting System","awardID":"0534586","effectiveDate":"2005-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["517963"],"PO":["564456"]},"108367":{"abstract":"The major goal of this research is to understand and test theories of mediated communication in collaborative virtual environments. It will examine how well humans are adapting to the quickly evolving digital technologies used in modern communication and social interaction systems. This work will explore the boundaries that are beyond what we normally consider normal, mediated communication and instead delve into a phenomenon called Transformed Social Interaction, a strategy that allows users to systematically filter their physical appearance and social behaviors (as represented by avatars) in the eyes of their conversational partners, amplifying or suppressing features and nonverbal signals in real-time for strategic purposes such as persuasion, learning, memory, and liking. This goal will be accomplished by using well-accepted methods to study multi-person social interaction using networked virtual reality technology, and the research will focus on three categories of transformations: Self representation (altering an avatar's appearance, voice, and nonverbal behavior), Social-Sensory abilities (giving interactants tools that provide unique perspectives and up-to-date summaries of the social behaviors of others) and Social Environment (changing aspects of the social context to maximize interaction goals).<br\/><br\/>Transformed Social Interaction is relevant not just to collaborative virtual environments but to any form of communication medium that uses digital representations of people - cell phones, videoconferences, textual chat rooms, online videogames, and many other forms of digital media. Currently, over 60 million people use Internet chat per day. In Korea, it is estimated that 1\/20th of the general population spend a significant amount of time in online video games interacting with digital representations of other people. Cell phones are ubiquitous and now include digital photograph and video capabilities. Companies actually offer face tracking and rendering on cell phone avatars. In any communication medium in which there is a digital representation of another person, transformed social interaction is not only possible, it is inevitable. The use of transformed social interaction has the potential to drastically change the nature of distance education, communication practices, political campaigning, and advertising. Consequently, it is crucial to understand both the effectiveness of these transformations as well as people's ability to detect them.","title":"Transformed Social Interaction in Virtual Environments","awardID":"0527377","effectiveDate":"2005-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":[286412,"553205","408895"],"PO":["564456"]},"111491":{"abstract":"Proposal 0546663<br\/>\"CAREER: Scaling Up First-Order Logical reasoning with Graphical Structure\"<br\/>PI: Eyal Amir<br\/>University of Illinois at Urbana-Champaign<br\/><br\/>The ability to reason automatically about the world is central to Artificial Intelligence (AI). In recent years the number of objects and relations that applications must consider has increased dramatically, and current real-world applications require reasoning mechanisms that can scale to thousands and millions of objects and relations. This research focuses on scaling up logical inference to many objects using graph-based structures that are available in real-world domains. The key idea is a methodology for fast and correct inference in first-order logic (FOL) that can ignore most interactions between objects, functions, and predicates. The method works by partitioning the input FOL theory into a tree of sub-theories, identifying (seemingly essential) ignorable interactions, and creating a compact propositional encoding of the original theory. It reasons with that new encoding or uses the tree to guide reasoning in FOL directly.<br\/>This project has the potential for wide Broader Impact through possible applications including object detection and complex queries on natural language texts. This project will integrate research and educational activities by involving students in the research and by integrating the research into both undergraduate and graduate classes.","title":"CAREER: Scaling Up First-Order Logical Reasoning with Graphical Structure","awardID":"0546663","effectiveDate":"2005-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["440709"],"PO":["460643"]},"105277":{"abstract":"This project will explore new and potentially powerful technological teaching tools for introducing the concepts of computing and physics to children (and teachers). The goal is to broaden the class of students who are not merely exposed to but rather engaged with technology, by empowering children to express ideas with usable tools for creating stop-action and 3D-animated movies, and by developing methodologies for incorporating such tools into Science, Technology, Engineering, and Mathematics (STEM) education. This effort leverages emerging public fascination for computer animation, as well as recent technological advances that have moved the graphics power of yesterday's million-dollar visualization supercomputers into every desktop PC.<br\/><br\/>A proof of concept of this approach, based on stop-motion animation, was prototyped by one of the PIs, and initial trials were encouraging. In a high-school physics class for noncollege-bound seniors, students who typically skipped class were now attending, some coming even during free time to complete their movies. Through animations, students were able to critically examine their own understanding of the physics and more effectively convey that understanding to teachers. (The same technique is also being used to teach reading to 7 year olds and biology to 9 year olds, replacing book reports and lab notebooks with animated stories and documentaries.) Informed by that experience, this project will have two arms: one to develop and evaluate teaching methodology based on moviemaking (at Tufts University), the other to create new 3D computer animation tools useable in the classroom (at Princeton University). <br\/><br\/>Technological teaching tools are often developed in the absence of strong educational research; in this project, the PIs will use accepted metrics (and develop new ones) to quantify the STEM learning improvement in high school physics as a result of using animations, comparing student understanding in conventional \"hands-on\" physics classes with those that include movie journaling. Results from this work will not only contribute to our understanding of how students learn physics and computing, but will also help bridge the student's experience and intuition with modern scientific theory. Further development of moviemaking tools will allow students to move from the jerky animation of the stop-action world to the smooth animations of modern computer graphics. Unfortunately, existing animation systems are barely usable by professionals, let alone grade-school students. This project will address that research challenge by developing inexpensive and robust 3D scanning hardware, point-and-click animation interfaces, and methods for stylized (e.g. cartoon-like) rendering of 3D animation.<br\/><br\/>Broader Impacts: Anecdotal evidence from the prototype system (gathered over the last three years in five classrooms) already suggests the potential significant impacts of the work. Science-phobic students and computer-shy teachers enthusiastically argue about the underlying physics to improve their movies. Movie making gives teachers a multi-media portfolio to assess student learning and test student preconceived models. If formal evaluations agree with this experience, the results of this project have the potential to change the way students learn science at all ages, opening up a new channel to students to show their understanding and test their hypotheses. This may lead to innovations in teaching computing, math, biology, chemistry, engineering, and even story telling and literature. (Nonetheless, this study chooses an emphasis on physics education because of established metrics for evaluation in this subject.) Even more broadly, animation represents a new medium of expression - visual rather than written - that is compelling but currently limited to highly skilled professionals. The tools the PI plans to develop in this project will make animation more accessible both to children and, more generally, to everyone outside the animation industry. Making this technology more widely available has the potential to affect the way we all communicate, learn, work, and play, turning us into media developers rather than media consumers.","title":"Collaborative Research: Telling the Story - Learning Math, Science and Engineering Through Animation","awardID":"0511979","effectiveDate":"2005-12-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["316342","487120"],"PO":["565227"]},"109413":{"abstract":"Proposal 0534286<br\/>\"Effective Learning by Leveraging Supervised and Unsupervised Techniques\"<br\/>PI: Daniel L. Boley<br\/>University of Minnesota-Twin Cities<br\/><br\/>ABSTRACT<br\/>The well-recognized explosion of data being generated in many scientific disciplines and on the Web necessitates the development of effective scalable techniques to mine this data for knowledge in a (semi)-automated way. There has been a trade-off between the scalability of methods and the quality of knowledge extracted. This project aims to leverage the most robust machine learning algorithms (e.g. support vector machine kernel methods) with scalable clustering algorithms to permit the exploration of enormous data sets, to derive estimates of the expected performance of such methods, and to extend such methods so that they can learn new unanticipated concepts buried within the data. This research will have broader impact by making possible the use of effective, established, machine learning techniques on the large aggregations of data being generated in biology and other scientific disciplines, thus, potentially leading to the discovery of new knowledge hidden within the data.","title":"Effective Learning by Leveraging Supervised and Unsupervised Techniques","awardID":"0534286","effectiveDate":"2005-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["550553"],"PO":["460643"]},"109556":{"abstract":"This project addresses the problem of category-level object recognition in images: Its aim is to develop effective methodologies for representing object classes; learning the corresponding object models from cluttered sample images in a semi-supervised manner; and efficiently and robustly recognizing instances of these models in novel images despite clutter, occlusion, viewpoint and illumination changes, and individual variations within each class. <br\/><br\/>Intellectual Merit. The scientific objective of this project is to develop a representation of the salient parts of an object and their relationships that can effectively be learned from<br\/>heavily cluttered data in a weakly supervised way, correctly captures within-class variability and appearance changes due to variations in viewpoint and illumination, and effectively supports inference over object models and the automated construction of efficient classification machines.<br\/><br\/>Broader Impacts. This project will investigate applications of category-level object recognition to image retrieval, video annotation, human-computer interaction; surveillance and security; and robotics via international academic and industrial collaborations. Contributions to education and outreach will include training PhD students and post-doctoral researchers, and involving underrepresented groups in graduate research and undergraduate data collection and empirical evaluation projects.","title":"Collaborative Research: Toward Category-Level Object Recognition","awardID":"0535166","effectiveDate":"2005-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["384401"],"PO":["564318"]},"109425":{"abstract":"During the last four years, the PI and his students have been investigating the use of handheld devices to control all kinds of home, office and factory equipment (such as stereos, VCRs, telephones, copiers, FAX machines, and clocks), as well as the non-driving functions of automobiles (such as the air conditioning and navigation systems). They have developed a high-level XML-based language to specify an appliance's features from which a high quality user interface can be generated on a PocketPC personal digital assistant (PDA) or on a mobile phone. However, two important problems remain: to automatically generate consistent interfaces for the user across different appliances; and to automatically generate a combined user interface for multiple appliances that operate as a logical unit. No existing automatic generation system for user interfaces has addressed these problems. Solving the consistency problem would, for example, mean that people could set the time on the VCR and the time to start recording in the same way that they set their alarm clock. By providing the interface on the user's handheld, the same consistent way to set the time would be used in every place that time-setting is required on all appliances. Solving the combined interface problem would, for example, mean that for an entire entertainment system, the user would just need to press \"play DVD\" and the system would automatically turn on the TV, switch the TV to \"input3,\" turn on the stereo, switch the stereo to \"aux\" input, turn off the cable box, turn on the DVD player, and finally cause the DVD to start playing. These are the scenarios the PI plans to tackle in this project. He will develop a system that uses the interdependencies among all of a user's connected appliances to automatically create a combined user interface. The intellectual merit of the proposed research lies in determining how to generate interfaces that are consistent with one another and how to combine interfaces for multiple appliances. For consistency, this includes the sub-problems of matching which parts of different appliances should be made consistent with each other, and then how consistency can be provided when the appliances may have more or fewer features for related functions. The PI will have to develop fundamental new knowledge about what aspects of consistency are most important to preserve across appliances, and how to embody that knowledge into rules that the handheld can use to automatically generate consistent user interfaces. For combining multiple appliances, the intellectual merit will include techniques for describing the interconnection among appliances and for combining pieces of multiple appliances' user interfaces together. Extensive user studies will inform the designs and verify the results.<br\/><br\/>Broader Impacts: No one has previously tried to automatically generate consistent interfaces from specifications for different appliances or computer applications that share some or many functions. The results will be useful for all researchers and developers who are concerned with consistency across multiple user interfaces for appliances or computers. Similarly, no one has automatically created a combined user interface using models defined separately for separate appliances. The results of this research will make complex appliances much easier to use for the general public, so that they are able to make better use of their devices and also to transfer their knowledge to the operation of new, potentially more complicated, appliances.","title":"Automatically Generating Consistent User Interfaces for Multiple Appliances","awardID":"0534349","effectiveDate":"2005-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["548127"],"PO":["565227"]},"109568":{"abstract":"0535236<br\/>Tumblin John<br\/>Northwestern University<br\/>\"Thick Photography\": Tools for Rich Digital Archives<br\/><br\/>This project will combine sets of lighting basis images gathered automatically with sparse 3D data gathered manually to form a \"thick\" photo. \"Thick\" photography methods are seen as a fast, simple, and low cost adjunct to existing conventional photography. Merging image-based-relighting (IBR) and computer vision techniques, the project plans to create new these new photographic images by (1) illuminating the object with a novel computer controlled light source as we gather basis images automatically (2) measuring a small set of widely spaced points on the object by touching them with a calibrated laparoscopic camera attached to a COTS 3D stylus digitizer, (3) photographing interior and occluded views with the laparoscopic camera. As envisioned, users can then: (1) interactively re-light a \"thick\" photo to explore surface textures, and clarifying shape and occlusions; (2) interactively change the camera viewpoint by modest amounts as the lighting remains stationary; and (3) interactively reveal important but occluded object features, such as the internal structures of Moche' pottery, the subject of this experimental effort..The research and scholarly impact can be significant. Many current image digitizing projects are now underway, but gather only softly lit, high quality digital photographs. These are of limited use as objects of study because they offer no simple way to explore the objects in a way that clarifies its shape, material, or internal structure. While texture-mapped 3D scanning methods enable users to explore and compare hard-surfaced objects, scanning is far more complex, slow and expensive than photography and visual quality is uneven. The value of digital archives of museum and library artifacts can increased greatly as a result of the proposed research. With museum partners, the researchers have selected the pottery of the Moche culture in Peru as the image testbed; these ceramics are found in museums across the United States and the world. Their interior structures are culturally significant but occluded, and their external shapes are simple but with a dark and highly reflective finish they can form a particularly difficult challenge for conventional 3-D scanning or photography. The project will employ devices for data gathering that is low-cost, accessible and simple, thus lowering the barriers for deployment at any museum.","title":"\"Thick Photography\": Tools for Rich Digital Archives","awardID":"0535236","effectiveDate":"2005-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["328309","326028"],"PO":["565136"]},"111493":{"abstract":"Internet applications are growing at a phenomenal rate. They range from personal to commercial to mission critical. All of them demand network service reliability, high performance and security. The justification for these demands is mainly due to recent advances in network technologies and resource availability. Internet resources such as network bandwidth, information storage, and computer processing power are no longer the bottlenecks that used to be so in the past. However, the ever increasing traffic demand, dynamics in traffic, and the presence of malicious users pose serious challenges towards meeting these demands. Today's Internet has yet fully overcome these challenges.<br\/><br\/>This project studies quantitative resource over-provisioning for important classes of network systems to achieve reliability, high performance and security. In simple terms, the over-provisioning principle is one where resources are allocated conservatively based on expected demands. Resource over-provisioning enables better uninterrupted services and better management of traffic dynamics and attacks. However, resource over-provisioning cannot be done in an ad hoc manner. Careless over-provisioning of resources comes with increased monetary costs, maintenance overhead, and in some cases performance and<br\/>security degradation as well. Hence, it is important that resources are quantitatively over-provisioned to avoid these problems. To conduct quantitative resource over- provisioning, a host of issues need to be resolved including how many extra resources to provision, and how to optimally provision the extra resources. The focus of this project is the design of algorithms for such optimization problems in resource over-provisioning. This project has immediate and significant impacts on the networking arena. Quantitative resource over-provisioning can serve as an important foundation to effectively provide services with high levels of reliability, performance and security to internet applications.","title":"CAREER: Algorithm Design for Optimization Problems in Network Over-Provisioning","awardID":"0546668","effectiveDate":"2005-12-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["523431"],"PO":["557315"]},"118830":{"abstract":"The project proposes to advance the state of the art in automatic<br\/>speech recognition by detecting emotional and highly accented speech<br\/>and differences based on age and gender, and then optimizing the<br\/>acoustic model for those conditions. It will apply long-term<br\/>adaptation techniques to improve robustness, and will implement<br\/>an innovative second-pass decoding technique to improve accuracy<br\/>by using side information such as thesaurus terms and<br\/>human-prepared summaries.<br\/><br\/>The techniques to be developed will dramatically improve the efficiency<br\/>of professional catalogers, leveraging automatic segmentation to<br\/>suggest topic boundaries in interviews, using domain-tuned<br\/>classification algorithms to recommend thesaurus terms, and<br\/>providing automated tools to support generation of event timelines.<br\/>Volunteers will help assign metadata and provide transcripts.<br\/>Efforts will be made to automate transferring capabilities developed<br\/>originally for English to other languages. Access to multilingual<br\/>materials will be done by combining knowledge-based and corpus-based<br\/>techniques to extend existing thesauri to new languages and by supporting<br\/>cross-language searching of manually prepared segment-level<br\/>summaries and automatic speech recognition transcripts.<br\/><br\/>Each component will be evaluated and user studies done to measure<br\/>the overall impact on support for cataloging, search and exploration.<br\/>This will produce significant impact, both through improved access<br\/>to our cultural heritage and through the application of the techniques<br\/>to other important problems.<br\/><br\/>The collection of spoken material used in this project will be the 116,000<br\/>hours held by the Survivors of the Shoah Visual History Foundation, a<br\/>set of already digitized video recordings of great historical importance.","title":"ITR Large: MALACH: Multilingual Access to Large spoken ArChives","awardID":"0623946","effectiveDate":"2005-12-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1688","name":"ITR LARGE GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":[314965],"PO":["565227"]},"110361":{"abstract":"This project will develop a dynamic, data-driven application system for signal and image processing under resource constraints. This system would lay a foundation for highly optimized implementations of fundamental signal and imaging processing computations that arise in many science and engineering problems, including image recognition, communications analysis, speech processing, querying, indexing, and retrieval from multimedia databases, and image segmentation of aerial, satellite, and astronomical images. The proposed multidisciplinary approach optimizes from algorithm specification, to mathematical representation, to software and hardware (FPGA) implementation, based on properties of data and unique requirements of <br\/>the environment and the target hardware device. <br\/>The novelty of the system is twofold: (1) it performs joint optimization<br\/>across mathematical, software and hardware (system-on-a-chip FPGA) domains; and, (2) it is a dynamic, data-driven system in that signal-processing transforms are tailored to algorithm requirements and input signals, for reduced distortion and increased compression, and the system can be queried and steered during execution. Implementations are based on the best mathematical formulation of the problem coupled with automated selection of the best implementation among a space of alternatives, through the integration of models relating mathematical properties to implementation<br\/>behavior. Both hardware and software optimization are treated in a unified way. It is anticipated that with these methods the design-time will be decreased by two orders of magnitude or more, compared to implementations derived in a traditional way. Because the proposed system can explore a broad range of implementations that exceed the capabilities of a human designer, the implementations derived by the approach pursued in the project may even exhibit lower resource costs and higher performance. This research will provide a foundation for signal processing at all scales, providing key building blocks for engineers to build complex, distributed networks of adaptive signal processing sensors.","title":"Collaborative Research: DDDAS-SMRP: Optimizing Signal and Image Processing in a Dynamic, Data-Driven Application System","awardID":"0540154","effectiveDate":"2005-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["507958"],"PO":["551712"]},"109438":{"abstract":"The World Wide Web has evolved into an indispensable medium for dissemination of information, entertainment, commerce and education. However, the graphical nature of most browsing software, coupled with the diversity and complexity of web content, have limited access to this technology for an entire community of people with visual disabilities. Existing audio browsers that are based on text-to-speech conversion (e.g., screen readers) are not capable of describing the conceptual organization of a document's content or of letting a user select parts of a document to listen to. As a result, people with visual disabilities can find it difficult to perform common tasks, such as distinguishing topics or correlating similar items, which are key to understanding the organization of documents, and so waste considerable time and attention listening to irrelevant information. In this project the PI and his team will develop, test and disseminate the HearSay web browser, which will bring the browsing experience of people with visual disabilities closer to that of sighted people. HearSay is based on automated techniques for structuring the content of web documents into labeled partitions consisting of logically related items. By enabling interactive speech-driven guided exploration in which the system presents the document's labeled content and the user selects which parts of the content to listen to and when to navigate to a new page, HearSay will make non-visual browsing far less cumbersome. Furthermore, for repetitive browsing tasks, HearSay will let users create and retrieve personalized content in different ways, ranging from content-based voice-marking of selected partitions in a page to powerful personal information assistants that gather and present user-defined information at the user's command. To assure that the HearSay system is really useful \"as advertised\" to the intended community, the PIs have established a collaboration with Helen Keller Services for the Blind in Hempstead, NY, which trains people with visual disabilities, and will consult on the design and evaluation of HearSay.<br\/> <br\/>Broader Impacts: This research will result in new algorithms and powerful technologies enabling end users to navigate web content using audio. This capability will be especially valuable to people who are visually impaired in that it will enable them to browse and customize web content by themselves, but it will also be useful for mobile users of small-form devices, reducing their dependence on specialized content providers. The PIs will develop a special version of HearSay for use with the Blackboard educational system, which will be advertised and disseminated to educational institutions so as to improve access to educational materials for students with visual disabilities. In coordination with this project, two workshops on technology for accessibility will be organized, one focusing on accessibility technology in general and the second on accessibility technology for postgraduate and adult education. These workshops will serve to raise awareness of the issues faced by those with visual disabilities and the potential for content-based techniques to improve information access for users who are mobile and\/or have disabilities.","title":"Content-Driven Techniques for Non-Visual Web Access","awardID":"0534419","effectiveDate":"2005-12-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["518366","483394","560897","369058"],"PO":["565227"]},"111484":{"abstract":"With a vision for architecting the next generation video-based sensor networks capable of real-time ``superresolution imaging'' using a large distributed network of poor-resolution wireless cameras, this<br\/>project introduces new paradigms for distributed sampling and video coding that lie in the frontier of signal processing and network information theory. The new data-acquisition, compression, and inference methods developed in this project are expected to influence the architecture and evolution of large-scale wireless sensor networks and advance the state-of-the-art in applications requiring active monitoring of telemetry data such as surveillance, homeland security, intelligent transportation, and environmental monitoring.<br\/><br\/>This project 1) studies fundamental performance limits and constructive approaches for integrating poor device precision and large-scale deployment with distributed sampling and compression using new results in nonharmonic Fourier analysis, dithered sampling, and Wyner-Ziv coding and 2) develops new real-time distributed video-coding architectures that are amenable to flexible distribution of processing complexity and sensing resolution and are robust to information loss and correlation uncertainty. A novel ``bit-conservation'' principle is introduced for characterizing the tradeoffs between sensor precision and sensor density in distributed sampling. The research effort is complemented by an educational effort to train young engineers to become skilled in the design and development of distributed information systems through 1) curriculum<br\/>development, with a new course on distributed information processing and communication having an emphasis on raw-research and project development, 2) the compilation of a corpus of striking toy research<br\/>puzzles illustrating fundamental concepts in distributed signal processing and network information theory integrated into the undergraduate and graduate curricula, and 3) the creation of a new introductory graduate-level text-book on information theory in distributed signal processing.","title":"CAREER: Information-Scaling Laws, ``Bit-conservation'' Principles, and Robust Coding Architectures in Sensor Networks","awardID":"0546598","effectiveDate":"2005-12-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["521650"],"PO":["564898"]},"113541":{"abstract":"The proposed work will undertake a multistage cluster sample of household addresses in New Orleans, supplemented by a phone banks survey. The goal is to collect 500 respondents by May 2006.<br\/> The survey questionnaire will ask about the decision to evacuate, survival experiences, demographic data, the kinds of needs that people had a different timepoints before, during, and after the hurricane. The survey has been designed by Edd Hauser, and will be piloted on refugees at UNC-Charlotte and Duke before used in the field. The first draft is under preliminary review by Duke Institutional Review Board, and will be modified according to their feedback.<br\/> The first part of the analysis will summarize the survey data, and provide cross-tabulations that show how different survival experiences are associated with age, pet ownership, income, and so forth. This is standard statistical analysis, but will help identify which aspects played dominant roles at different phases of the emergency.<br\/> The second part of the analysis will fit a social network model to the data, extending previous work on mathematical models for the kinds of help people need and from whom they get help. The nodes in the social network model will be people or agencies, and the edges in the network describe the kind of help that is required.<br\/> The research will be conducted jointly by David Banks, Edd Hauser, and John Lefante (working with Maria Sirois). David Banks and John Lefante are in charge of the survey design and data analysis. Edd Hauser, head of the Regional Center for Homeland Security and Major Disaster Management, is in charge of questionnaire design. Maria Sirois is a graduate student in Biostatistics in the School of Public Health and Tropical Medicine at Tulane; she and John Lefante are in charge of data collection. Maria Sirois is a member of the National Guard, the Louisiana Search and Rescue Team, and a certified first-responder.<br\/><br\/> The intellectual merit of the proposed research is twofold. First it will provide a statistical analysis of the factors affecting the survival experience of people in New Orleans before, during and after Katrina. Second, it will extend the social networks models applied in previous studies of disaster response by using the new class of latent space models and the data obtained from the Katrina event.<br\/> The broader impact of the proposed research is that it will provide guidance and insight for future disaster relief efforts, and highlight the interactions between people and agencies that were most\/least effective at various stages of the response.","title":"Collaborative Proposal: SGER: Social Measures of the Katrina Aftermath","awardID":"0555908","effectiveDate":"2005-12-15","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":[300608],"PO":["380485"]}}