{"145295":{"abstract":"Intellectual Merit:<br\/>Advances in computational science and technology have made the theoreticalmodeling of materials processes and properties viable, desirable, and a strong supplement to experimental work. Since the understanding and manipulation of the macroscopic properties of materials relies on information obtained at the microscopic level, one of the challenges in ASE is in developing the framework for a seamless, multiscale study of materials properties and related phenomena. The kinetic Monte Carlo method is one such technique which is suitable for simulations over a large range of length and time scales and which has the potential to connect atomistic details with macroscopic observations.<br\/>The standard method is, however, handicapped because of the requirement of prior knowledge of the<br\/>underlying atomic mechanisms and their energetics. Typically only a few processes involving single<br\/>atom motion are provided as input to kinetic Monte Carlo simulations, thereby neglecting the role of<br\/>collective atomic motion, vacancy creation, and complex atomic processes, as well as biasing the time<br\/>evolution of the system. In the proposed research in ASE with technical focus in sim and dmc, we plan<br\/>to overcome these limitations through the inclusion of unique and innovative pattern recognition schemes<br\/>along with automated procedures for the calculation of system energetics on the fly. This procedure will<br\/>allow the development of an extensive database of possible atomic events. The database so collected will<br\/>serve as input for further analysis and processing using machine learning and data mining for the<br\/>development of efficient, robust, and accurate mapping functions which will be extensively tested through<br\/>simulations of a variety of phenomena in epitaxial growth and validated through comparison with relevant<br\/>experimental data. The resulting mapping functions will serve to vastly increase the accuracy and speed<br\/>of simulations.<br\/><br\/>Broader Impact:<br\/>Our goal of creating accurate and efficient computational algorithms for the simulation<br\/>of phenomena such as thin-film growth will be a significant achievement in the technical focus areas of<br\/>sim and dmc, because of the innovative methodologies resulting from cross-disciplinary approaches. The<br\/>successful implementation of the algorithms for computer design of materials, however, will be a<br\/>breakthrough in ASE, as it will enable the development of technologically important materials with much<br\/>reduced cost and much greater control.<br\/>The work will also provide us opportunities for educational and outreach activities with broad national, international and societal impact. Apart from the education and training of our graduate and undergraduate students in ITR, we will propose to work with the K-12 community in this endeavor. We intend to do so through the integration of research and education. Our team will collectively incorporate products of the research into courses on computational methods in physics, on data mining, on machine learning, and on adaptive parallelization techniques. A module for instructional and outreach purposes will also be developed. Two high school teachers will be recruited to spend summer sessions at KSU. Regular outreach activities with K-12 teachers and students will help broaden the pool of individuals in IT and nanoscale science literate individuals. Existing international collaborations of the PI with Prof. Alatalo, Finland, Dr. Trushin, Russia, and Dr. Durukanoglu, Turkey will help extend the outcomes of the proposed work internationally.","title":"ITR - (ASE) - (sim+dmc): Parallel Data Mining for Nanoscale Kinetic Monte Carlo Simulation Models","awardID":"0840389","effectiveDate":"2007-11-27","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7314","name":"ITR FOR NATIONAL PRIORITIES"}}],"PIcoPI":["545995"],"PO":["562984"]},"147445":{"abstract":"Abstract for Collaboration <br\/>0427985, 0427464, 0427094,0427912,0427695 <br\/><br\/>A multidisciplinary team of researchers from Argonne National <br\/>Laboratory, Carnegie Mellon University, Columbia University, <br\/>University of Chicago, Emory University, and University of <br\/>Pennsylvania, with collaborators from the Universities of Graz and <br\/>Lubek, will initiate a long term research project on image-driven, <br\/>inversion-based biophysical modeling. The team includes expertise in <br\/>numerical algorithms and scientific computing, fluid and solid <br\/>biomechanics, PDE optimization, inverse problems, medical image <br\/>analysis and processing, and distributed and grid computing necessary <br\/>to tackle this class of problems. <br\/><br\/>This project aims to create a framework for assimilating multimodal <br\/>dynamic medical image data to produce highly-resolved, <br\/>physically-realistic, patient-specific biomechanics models. While the <br\/>computational and algorithmic aspects of the project are widely <br\/>applicable, the target application will be the construction of <br\/>patient-specific cardiac biomechanics models from 4D image datasets of <br\/>heart motion. Such models are useful for medical diagnosis and <br\/>surgical planning. This places a premium on quick turnaround of the <br\/>computations, which mean they must be fast, scalable, and capable of <br\/>exploiting grid-based computing. <br\/><br\/>Research will focus on three key areas that undergird the project's <br\/>overall goals: registration, inversion, and distributed computing. The <br\/>registration research component will create multilevel algorithms to <br\/>extract cardiac deformation histories from time-varying medical image <br\/>datasets via the solution of sequences of 3D image registration <br\/>problems. The inversion research component will develop multilevel <br\/>algorithms that use these deformation field histories as virtual <br\/>observations to solve inverse problems for cardiac biomechanical <br\/>parameters. The distributed computing research component will create <br\/>tools for performance prediction and resource scheduling that support <br\/>simulations across distributed computational resources. <br\/><br\/>Dovetailing with the research components, the project will undertake <br\/>an educational program designed to communicate the fruits of its work <br\/>and of the wider benefits of the integration of the biomedical <br\/>sciences, computing sciences, and computational sciences, to a more <br\/>general audience of students, disciplinary researchers, and the lay <br\/>public. The professional activities of the team members in the <br\/>inversion, image registration, grid computing, and computational <br\/>science communities will be parlayed to organize workshops and <br\/>international meetings, edit volumes, teach summer schools, develop <br\/>university and short courses, and engage in outreach activities---as <br\/>they have done in the past---but with greater emphasis on the field of <br\/>computational biomedicine. The proposed image-based cardiac <br\/>biomechanics modeling application will provide an excellent <br\/>opportunity to demonstrate the benefits to health and welfare that <br\/>advances in optimization-based registration and inversion algorithms <br\/>and Grid computing can provide.","title":"ITR: Collaborative Research - ASE - (sim+dmc): Image-based Biophysical Modeling: Scalable Registration and Inversion Algorithms and Distributed Computing","awardID":"0849301","effectiveDate":"2007-11-01","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7314","name":"ITR FOR NATIONAL PRIORITIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["557487"],"PO":["565157"]},"142942":{"abstract":"Biomarkers measured in a minimally invasive and repeatable way can expedite the early diagnosis of disease, the indication of disease prognosis, and the discovery of new drug targets for therapy. Serum proteomic profiling for biomarker detection may reflect the abnormality or pathologic state of various diseases through the protein\/peptide peaks that are expressed differently between diseased and healthy individuals. Since the procedures are simple, inexpensive, and minimally invasive, serum proteomic methods readily lend themselves to screening-test development; their robustness and ease promise to translate into routine clinical practice. The objective of this project is to construct a high-throughput proteomic profiling analysis toolset, Proteomics Biomarker Information System (ProBIS), which can provide early biomarker detection and identification for clinical proteomics healthcare. Our main contributions are: (1) High Resolution Proteomic Profiling: different from traditional low resolution mass spectrometry analysis, we will use high resolution profile to analyze the low-molecular weight (LMW) end of the proteomic spectrum for more precise analysis; and (2) Integrated System for Biomarker Discovery and Identification: identification and sequencing of the underlying discriminatory proteins\/peptides will reveal the insights of biomarkers and characterize disease pathway. The results of this project will have an impact on the computer science community and an equal, if not greater, impact on the broad medical community that is in need of such a proteomic profiling data analysis tool. The experiments will be driven by a series of case studies, including ovarian cancer early relapse monitoring and prostate cancer diagnosis. The solutions for these case studies will have a direct impact on individual areas. Our source code and data will be available for general dissemination over the internet, and discoveries will be integrated into the classroom.","title":"Collaborative Research: Proteomics Biomarker Information System (ProBIS)","awardID":"0829438","effectiveDate":"2007-11-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}}],"PIcoPI":[380538],"PO":["565136"]},"142720":{"abstract":"A considerable amount of political activity is moving onto the Internet. This includes information dissemination by candidates, parties, issue advocates, campaigns, governments, news and opinion media, and individuals which is directed at citizens and potential voters. It also includes active participation by citizens in interactive digital environments mediated by social software such as blogs, opinion forums, discussion groups, etc. While there has been considerable study of the large scale demographics of this movement primarily using survey methods, there have been few close up studies of individuals involved in digital democracy using experimental and observational methods. There has also been a lack of empirical user studies in support of the design of software interfaces to support digital democracy. In this project, people will be observed closely as they use digital materials to make voting decisions. A series of empirical studies using real online materials in mock voting exercises will examine user behavior in this domain. Study issues include the conceptual categories that people use to understand political information, browsing and decision making strategies, and personalization. Another set of studies will examine more social uses of digital information. Questions include interest in sharing profile information, annotations, and opinions with others,<br\/>impact of shared information on decision making, and the interaction of privacy and information sharing. All studies will compare participants from diverse backgrounds and situations. Information gathered in the empirical studies will be used to help design a Voter Information Portal that organizes political information for citizens and helps them make decisions. The portal would use Internet information found by commonly-used search engines and allow voters to reorganize it into user-centered categories, annotate it, and share it. Issues of privacy and ethics in this context will be examined.<br\/><br\/>Intellectual Merit<br\/>The intellectual merit of the project involves the development of an understanding of how people wish to use, and do use, emerging technologies to learn, remember, reason about, and make decisions in the context of civic and government activities. <br\/><br\/>Impact<br\/>There is very broad impact of the proposal in that resulting systems couldinfluence citizens of many backgrounds and circumstances, and can be utilized by developers and implementation decision makers in<br\/>governments, private organizations, and academic settings. The educational goals of the project include the production of digital government systems that encourage learning about civic issues by citizens. The goal of making digital government work for all citizens, with specific attention to issues of equity and the digital divide, addresses diversity goals.","title":"Digital Deliberation: Searching and Deciding About How to Vote","awardID":"0827911","effectiveDate":"2007-11-29","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["547222"],"PO":["427499"]},"125362":{"abstract":"This project will study the limits to the performance of tightly-coupled heterogeneous supercomputing within the field of high-performance computing (HPC). The proposed project will develop accurate models to predict the performance of heterogeneous systems. The development of accurate models to predict the performance of heterogeneous systems will impose a scientific rigor on this field and will be of great<br\/>benefit to potential users of these systems. The proposed work is multidisciplinary across the areas of computer sciences and applications, and will be driven by real world high performance applications expected to run on such systems, drawn from the fields of biology and medicine. Formal dissemination of this research will take place through presentations and publication in the major conferences and journals, and through interactions between academia and industry thus enhancing the potential impact of this work to emerging commercial products.","title":"Tightly-coupled Heterogeneous Supercomputing","awardID":"0703139","effectiveDate":"2007-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["410444"],"PO":["551712"]},"133148":{"abstract":"The Sixth Workshop on Hot Topics in Networks, HotNets-VI, will be held in Atlanta GA, on November 14-15, 2007. The goal of the workshop is to bring together researchers in the networking systems community to engage in lively discussion of future trends in networking research and technology. The workshop will provide a venue for researchers to present and discuss ideas that have the potential to significantly impact the community in the long term; its goal is to promote community-wide discussions of those ideas. Work introduced at HotNets-VI, once fully thought through, completed, and written up in a finished form, will grow into papers accepted at SIGCOMM or other quality conferences, which in turn are expected to have impact on the field of networking. This proposal aims to fund twelve US-based graduate students to attend the HotNets-VI workshop.<br\/><br\/>Intellectual Merit:<br\/>Participation in workshops like this is an extremely important experience for Ph.D. students, providing the opportunity to interact with more senior researchers and be exposed to leading-edge work in the field.<br\/><br\/>Broader Impact:<br\/>The support requested in this proposal will enable the participation of US-based students who would otherwise be unable to attend HotNets-VI, thus enhancing the educational experience of the next generation of network researchers.","title":"Student Travel Support for ACM HotNets-VI Workshop","awardID":"0739817","effectiveDate":"2007-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550447"],"PO":["565090"]},"133997":{"abstract":"The Internet Measurement Conference (IMC), sponsored by ACM SIGCOMM will be held in San Diego, California, October 24-26, 2007. IMC is the primary venue for presenting new research results on collecting and analyzing measurements of the Internet. This award provides travel assistance to enable graduate students to attend the conference. Attending conferences such as IMC is of extremely importance for graduate students pursuing research in the field. Authors have the opportunity to present their work and all attendees have a chance to interact with many others performing leading-edge research in the field. <br\/><br\/>Intellectual Merit: This proposal will serve to widen the audience attending the Internet Measurement Conference, raising the level of interaction and the potential for new collaboration, new investigations, and higher quality research.<br\/><br\/>Broader Impact: This proposal, by enabling students to attend who might not otherwise be able, will increase the dissemination of the conference's research results to a larger and more diverse audience. Giving preference in grant awards to women and minority students will widen the participation among these underrepresented groups. Furthermore, by advertising to a wide range of colleges and universities, participants from a more diverse set of institutions should be able to attend and benefit from the conference.","title":"Student Travel Support for the 2007 Internet Measurement Conference","awardID":"0744071","effectiveDate":"2007-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["551078"],"PO":["565090"]},"139767":{"abstract":"Control protocols for wireless mesh networks must carefully deal with the cross-interactions within the network in both the vertical (i.e., across protocol layers) and the horizontal direction (i.e., across network nodes). These cross-interactions offer both an opportunity to use cross-layer\/network-wide optimization to achieve high capacity, and the challenge to maintain scalable, robust and modular solution architecture. The goal of this project is to develop a high-performance mesh-network control plane (MCP) that is loosely-coupled, i.e., only a minimal amount of information is exchanged between layers and network components to optimize network efficiency, and further, if changes, errors, or inefficiencies occur at one layer\/component, the overall solution shows graceful degradation. Thus, this new control plane achieves both efficiency and modularity. The PIs will develop a solid theoretical framework for such a loosely-coupled MCP across multiple protocol layers, based on which robust, decentralized, and easy-to-implement algorithms and protocols will be developed to address challenges in congestion control, admission control, link scheduling, multi-access, power control and routing. The solution will be implemented and evaluated on the Mesh@Purdue testbed. <br\/><br\/>Broader Impact: The results will have a broad impact on wireless industry sectors by providing new fundamental insights, novel control structures, distributed algorithms, and practical protocol stacks. Through the Center for Wireless Systems and Applications (CWSA) at Purdue, the PIs will actively share their findings with industrial collaborators. Students supported on this project will have a balanced exposure to a wide variety of theoretical and applied techniques, which will be valuable in their future careers.","title":"NeTS-NBD: A High-Performance Control Plane for Mesh Networks: Theory and Implementation","awardID":"0813000","effectiveDate":"2007-11-01","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["548182"],"PO":["557315"]}}