{"100892":{"abstract":"This research targets a suite of tools (called \"3D Sketchpad\")<br\/>for creating interactive 3D illustrations. Example applications<br\/>include a teacher explaining physics, an archaeologist recreating<br\/>a model of an ancient village, a high school student producing an<br\/>eye-catching animation, and a physician explaining a diagnosis to<br\/>a patient. The key innovation is to support 3D modeling by<br\/>drawing. The resulting content looks like the user's drawing, but<br\/>is 3D in the sense that the viewpoint can be moved interactively.<br\/>The long-range impact of this research is fourfold. First, tools<br\/>that let ordinary people create 3D content will dramatically<br\/>expand the applications of 3D graphics. Second, expert users will<br\/>design content that they would not have undertaken with current<br\/>tools because it would be too difficult or time-consuming. Third,<br\/>these tools support 3D content that is aesthetically closer to<br\/>traditional illustration than is currently possible. Finally,<br\/>this technology will propagate synergistically with the growth of<br\/>pen-based computing. Tools for creating 3D drawings will<br\/>ultimately be commonplace on tablet PCs, palm devices, and even<br\/>cell phones.<br\/><br\/>A key challenge is to develop new shape representations and<br\/>associated operations that support a drawing-based interface. The<br\/>researchers are developing a new representation, called a<br\/>\"layered mesh\", consisting of a multiresolution mesh that is<br\/>built up incrementally in layers. Each new layer responds<br\/>dynamically to changes in the previous layers. Layered meshes<br\/>support the addition of new structures (e.g. limbs of a human<br\/>figure) and surface details (bumps or bulges) at any<br\/>resolution. They produce piecewise-smooth manifold surfaces of<br\/>arbitrary topology. Additional challenges include the<br\/>development of new non-photorealistic rendering algorithms, new<br\/>interaction techniques based on gestural input, new methods for<br\/>generating animation via sketched input, and pattern synthesis<br\/>tools whereby new shape features, stroke patterns, and motions<br\/>can all be generated from provided examples.","title":"CAREER: 3D Sketchpad","awardID":"0447883","effectiveDate":"2005-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[266164],"PO":["532791"]},"105710":{"abstract":"This award is co-funded by NSF and NSA to enable two linked activities, a Workshop and an IFIP Working Conference on program verification. The purpose of these activities is to develop a global-scale strategy to respond to a \"grand challenge\" in computer science, an industrial-strength program verifier. The Workshop and the Conference will identify advances in program specification, program analysis, verification, and related tools and techniques, in order to develop a strategy for their integration to achieve this vision. This activity is coordinated through the High Confidence Software and Systems Coordinating Group in the Federal Networking and Information Technology Research and Development Program.","title":"Workshop on the Program Verifier Grand Challenge, February 21-23, 2005, Menlo Park, California","awardID":"0513856","effectiveDate":"2005-02-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"V931","name":"NSA-AREA OF PROG VERIFICATION"}}],"PIcoPI":["555363"],"PO":["561889"]},"101244":{"abstract":"In this CAREER award, co-funded by the Experimental Physical Chemistry Program of the Chemistry Division and the Condensed Matter Physics Program of the Division of Materials Research, Prof. Thomas G. Mason of the University of California, Los Angeles and his graduate and undergraduate research students produce macroscopic quantities of microscopic, colloidal particles of defined geometry, using lithographic methods. The behavior of these assemblies of particles will be studied, using a variety of techniques, with an eye towards answering important outstanding questions about the phase behavior, non-equilibrium glassy behavior, and assembly of systems of interacting nonspherical particles.<br\/><br\/>In addition to his research activities, Prof. Mason will develop a new, interdisciplinary, undergraduate laboratory course in colloidal dynamics. This laboratory course will use a significant number of instruments donated by ExxonMobil Research and Engineering Company. Prof. Mason will also participate in programs sponsored by UCLA's Center X to do outreach to disadvantaged K-12 students in the Los Angeles area, many of these students coming from groups traditionally underrepresented in the sciences.","title":"CAREER: Fabrication, Phase Behavior, and Directed Assembly of Lithographically Designed Colloidal Particles in Solution","awardID":"0450022","effectiveDate":"2005-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1960","name":"STRUCTURE AND REACTIVITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["555227"],"PO":["565047"]},"102036":{"abstract":"This REU site project allows eight undergraduate students to participate<br\/>in a ten-week summer program at Computer Science Department of Utah<br\/>State University. This summer program focuses on several hands-on<br\/>stimulating research projects including face recognition, eye tracking,<br\/>digital watermarking, image compression, and content based image<br\/>retrieval. These projects will address the broad spectrums and the<br\/>challenging issues in the field of computer vision and image processing<br\/>(CVIP) and will emphasize on several CVIP techniques and their important<br\/>utilities in some interesting and crucial applications. The REU<br\/>participants will be presented with a broad range of components in these<br\/>research topics so that each student will be able to choose a component<br\/>of a project rather than have one assigned. This research will ensure at<br\/>least four of the eight participants are underrepresented students and<br\/>ensure at least four students are from other institutions, especially<br\/>those institutions where research programs are limited. This active and<br\/>regional recruitment plan will especially help underrepresented students<br\/>and the students who are limited exposed to research to be acquainted<br\/>with interesting research projects and gain confidence in pursuing their<br\/>degrees, seeking industrial technology related jobs, and continuing<br\/>pursuing an advanced degree in graduate schools.","title":"REU Site Program in Computer Vision and Image Processing","awardID":"0453552","effectiveDate":"2005-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["380661","393998"],"PO":["433760"]},"109737":{"abstract":"This is the first year of funding of a 4-year continuing award. Preference models determine which one of several plans to prefer. It is important that planners use the same preference models as human decision makers because planners should make the same decisions as their human users, otherwise the planners are not of much use. The PI will investigate how to build planners that fit the preference models of human decision makers better than current planners, by combining constructive methods from artificial intelligence with more descriptive methods from utility theory in order to take advantage of the strengths of the two decision-making disciplines and to extend the applicability of Al planners. The PI will study optimal vs. good or near-optimal (\"satisficing\") planning with a variety of preference models. He win explore how to exploit the structure of complex sequential planning tasks to solve them efficiently for realistic preference models suggested by utility theory, with an emphasis on preference models in high-stakes decision situations. To this end, he will focus on representation changes that make use of existing planners from AI by transforming planning tasks with nonlinear utility functions into others that these planning methods can solve, and will study the errors that result for the original planning task when satisficing planning methods are used instead. The research will be performed in the context of managing environmental crisis situations, such as cleaning-up marine oil-spills.","title":"CAREER: Artificial Intelligence Planning with Realistic Preference Models","awardID":"0536375","effectiveDate":"2005-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["460643"],"PO":["387198"]},"101993":{"abstract":"REU site: BACHE-REU Scholarship Program in Computer Science<br\/><br\/>The program, BACHE-REU Scholarship in Computer Science, is designed to<br\/>provide undergraduate research opportunities to full-time students attending any of the<br\/>five member institutions in the Birmingham Area Consortium of Higher Education.<br\/>The five institutions are Birmingham-Southern College, Miles College, Samford<br\/>University, the University of Montevallo, and the University of Alabama in Birmingham.<br\/><br\/><br\/>Intellectual Merit<br\/>The BACHE REU-CS program is a year-long experience in which<br\/>participants are selected from BACHE institutions to take part in projects designed by<br\/>faculty researchers from within the BACHE consortium. Each participating institution<br\/>will have an assigned faculty coordinator who will publicize the project on his\/her<br\/>campus. Fourteen students will be selected by acommittee of faculty mentors based on<br\/>compatible interest and skills outlined in available projects. Accepted Scholars will<br\/>spend up to 10 hours per week for theacademic year and full time during the summer<br\/>learning a wide variety of disciplines and approaches. The students will participate in <br\/>weekly journal club meetings and monthly research-in-progress meetings. In addition, <br\/>the students will present their work in an inter-institutional symposium.<br\/><br\/>Broader Impact<br\/>The primary goal of this program is to give BACHE REU - CS<br\/>scholars the experience and confidence to pursue graduate study in computer science.<br\/>Several factors shape the design of this program. 1) While all BACHE institutions offer<br\/>undergraduate computer science and\/or management information system majors, only<br\/>the University of Alabama in Birmingham offers graduate study in Computer Science.<br\/>This program will increase the research opportunities for students attending<br\/>Birmingham-Southern College, Miles, Samford, and the University of Montevallo. 2)<br\/>BACHE institutions represent a wide range of student profiles: Samford and<br\/>Birmingham-Southern College students are generally upper middle class or affluent,<br\/>UAB has a large first-generation college student and international representation, Miles<br\/>is an historically black institution, and Montevallo is a state-supported liberal arts<br\/>institution. Interaction between faculty and students from such disparate institutions will<br\/>be of great benefit to all concerned, and will respond to the NSF's stated goal of<br\/>increasing research participation by underrepresented constituencies.","title":"REU SITES PANEL: Undergraduate Research Experience in Computer Science","awardID":"0453392","effectiveDate":"2005-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[268843],"PO":["381214"]},"102015":{"abstract":"The primary goal of this NSF REU site proposal is to systematically increase<br\/>the graduation rate of undergraduate students and the enrollment in graduate<br\/>school by involving undergraduate students in state-of-the-art Computer<br\/>Science and Engineering research activities. This project emphasizes the<br\/>participation of minority students belonging to groups with significant<br\/>growth rates, in particular, Hispanic students from the University of Puerto<br\/>Rico Mayaguez, students from USF and other minority universities in Florida,<br\/>and students from Latin American countries. During a 10-week summer session,<br\/>participating students will learn to use tools and techniques to solve<br\/>current research problems in Artificial Intelligence, Robotics, Computer<br\/>Networks, and Digital Image Processing, as well as work on other research<br\/>projects in collaboration with the H. Lee Moffitt Cancer Center & Research<br\/>Institute, the Center for Urban Transportation and Research, and the Center<br\/>for Robot-Assisted Search and Rescue. After an initial week of formal<br\/>orientation on the topics of research methodology, literature searching,<br\/>research writing and presentation skills, participating students will spend<br\/>nine continuous weeks with a faculty mentor working to solve a well defined<br\/>problem in a selected area of interest. Formal and informal interactions<br\/>with other students, faculty members and industry members will also be<br\/>included in as students work on projects and attend social events.","title":"A Computer Science and Engineering REU Site for Florida, Puerto Rico and Latin America","awardID":"0453463","effectiveDate":"2005-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["473743","473744"],"PO":["317663"]},"100861":{"abstract":"Abstract: This project is concerned with the study and development of seeing machines capable of recognizing actions in dynamically changing environments with a minimal level of supervision. The emphasis will be on the recognition of face, hand and arm gestures, human gaits, changes in individual behaviors in a crowd (e.g., a person in the middle of a walking crowd starts running), and changes in crowd behavior (e.g., a group of individuals in a walking crowd suddenly start running) occurring in a dynamically changing environment due to camera motion, dynamic backgrounds (e.g., water, fog, fire, smoke, steam) and multiple moving objects and people. The intellectual merit of the proposed research will be a unifying theoretical framework for the recognition of human and crowd activities that combines geometry, dynamics and clustering. The recognition task will be viewed as the inference of a mixture of dynamical models (e.g., rigid motions, non-rigid motions, linear dynamical models) exhibiting abrupt changes both in space (due to multiple activities occurring in a single frame) and in time (due to multiple activities occurring over a period of time). The development of this framework will require significant advances on dynamic scene reconstruction, spatio-temporal video analysis, clustering on geometric spaces, and kernels on dynamical systems. The broad impact of the proposed research includes applications in computer vision, machine learning, control theory, robotics, and biomedical engineering. Techniques for recognition of human and crowd activities are directly applicable to surveillance and security. Techniques for dynamic scene reconstruction and spatio-temporal modeling are useful in traffic monitoring, sports coverage\/broadcast, human-computer interaction, image retrieval and search, video motion capture, and image-based rendering. Techniques for clustering on geometric spaces can be applied to identification of hybrid systems in control theory, reconnaissance and mapping problems in multiple robot systems, and modeling of gene expression data and biological networks in biomedical engineering.","title":"CAREER: Recognition of Dynamic Activities in Unstructured Environments","awardID":"0447739","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["555788"],"PO":["564316"]},"105503":{"abstract":"It is proposed to develop two new algorithms for predicting the global minimum of energy surface functions in Rn arising in computational biology. Such functions are characterized by having a very large number of local minima, where the number typically grows exponentially with n. Energy surfaces of this type arise, for example, in protein-ligand docking in computational drug design. The location of the global minimum determines the most likely location of the docked ligand (drug) on the protein surface.<br\/>This research is based on earlier results where it is assumed that the energy surface is basin-shaped, with many local minima. The energy surface was approximated by a convex quadratic function which underestimated a large number of local minima of the energy surface, and minimized the error in the<br\/>L1 norm. It was shown that in many cases the unique minimum of this convex function was a good predictor of the global minimum of the energy surface.<br\/>Intellectual Merit: We propose to build on this earlier work by developing two new and more efficient algorithms. The first will determine a quadratic underestimating function where the eigenvalues of the function Hessian satisfy specified lower and upper bounds. This includes the convex quadratic<br\/>as a special case. In some important cases the energy surface, rather than being basin-shaped, contains a relatively small number of pronounced local minima, in addition to a large number relatively shallow local minima. The location of the pronounced local minima is not known, but one of them is the global minimum. The second proposed new algorithm will determine an underestimating function which consists of the sum of a small number of negative Gaussians. The location and shape of all Gaussians will be determined,<br\/>as with the quadratic function, by minimizing the approximation error at a large number of local minima. The predicted global minimum point of the energy surface is then given by the location of that Gaussian with the minimum function value at its center.<br\/>Impact: These two algorithms will be developed, implemented and tested on realistic computational models of protein-ligand docking energy surfaces, and made available, in accordance with University policy, to be used as one of the key components of a computer-aided drug design software package.","title":"SGER: Global Minimum Determination by Underestimation: Application to Protein-Ligand Docking","awardID":"0513121","effectiveDate":"2005-02-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[278441],"PO":["499399"]},"94937":{"abstract":"Reinforcement learning (RL) applies to any task that involves an agent taking a sequence of actions where the effects of one action influence the long-term utility of subsequent actions. How should such a learning agent represent its knowledge about its environment? Traditional models typically capture the agent's state as composed of objects and events in the environment and relations among them. Since these relations cannot be directly observed by the agent through its sensors, they have meaning only in the mind of the human designer of the agent. Recently, the PI and colleagues have instead proposed modeling the agent's state as composed of a set of predictions of observable outcomes of tests or experiments that the agent could perform in its environment. Such representations, called predictive state representations (PSRs), are composed entirely of observable quantities and therein lies much of their promise for efficient and scalable planning and learning in RL tasks. In this project many foundational questions about PSRs are being explored. These include: (1) How can an agent discover what predictions it should keep to capture the state of its environment?; (2) How can the long-term action-conditional predictions that are part of PSR state representations be used to speed up planning that is about evaluating long-term effects of actions?; (3) How can memory of past observations be combined with PSR predictions of future observations for computational benefit?; and (4) How can the flexible temporally abstract representations of state -- specifically PSRs -- be combined with similarly temporally abstract representations of actions? This project is developing the nascent idea of PSRs into a full-fledged theory of learning and planning. If successful, this research will result in a dramatic increase in the applicability of RL for building learning agents in large-scale domains in AI, operations research, control, and dynamical systems. This project also plans to construct and make publically available a set of benchmark RL tasks. This will help remediate the lack of such widely available test beds in the RL community.","title":"Flexible State Representations in Reinforcement Learning","awardID":"0413004","effectiveDate":"2005-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550371"],"PO":["564316"]},"100972":{"abstract":"CAREER: A Framework for Early-Stage Computer Architecture Design Space Exploration and Optimization <br\/><br\/>Abstract<br\/><br\/>Future advances in high-performance, consumer, and embedded computing will be limited by power and thermal issues. As we seek to develop novel computing devices for these domains, it is critical to understand the power requirements at the earliest stages of the design and development process. This project will develop an accurate and flexible modeling infrastructure that can be used to quantify power, performance, and design complexity and will utilize this infrastructure to explore future power-aware computing design decisions.<br\/><br\/>This project seeks to develop novel technical solutions to architectural power and cycle-time modeling and to the problem of quantifying design complexity. The proposed models combine the flexibility advantages of analytical models with the superior accuracy that fully-empirical models provide. In this methodology, detailed empirical characterization of active power, leakage power, and delay is performed on building blocks and analytical models are then developed to chain them appropriately to model microarchitectural structures. These models will be applied to study architectural design tradeoffs between power, performance, and design complexity. In particular, this project seeks to understand the relative power-performance efficiency and design complexity of embedded and high-performance architectures and methods for extracting parallelism at the instruction and thread-level.","title":"CAREER: A Framework for Early-Stage Computer Architecture Design Space Exploration and Optimization","awardID":"0448313","effectiveDate":"2005-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["518229"],"PO":["559883"]},"100920":{"abstract":"Spatial localization is a prerequisite for a range of sensor network tasks, such as monitoring, tracking, routing and security services. Currently, a variety of approaches are employed in providing critical positioning information to sensor nodes. Although these approaches provide a rich environment for innovation, their diversified strategies introduce problems of standardization and inefficient resource use. For example, many techniques require unique infrastructures, and among different localization technologies, little is understood about cost performance tradeoffs in the presence of systematic distortions and noise. This research addresses the need to construct a scalable, unified family of localization services over a variety of sensor node types. The algorithmic methodology centers on Bayesian networks. These networks allow for a systematic way to manage signal distortion and noise and enable the integration of the spectrum of current sensor network positioning modalities: signal strength to distance, angle of arrival, time difference of arrival, and fingerprinting. This research will result in a universal localization infrastructure capable of integrating location information into any computing device and provide new benchmarks that describe the limits of localization performance in the presence of distortion and noise.<br\/><br\/>These findings will allow designers to select the localization modalities that maximize their application's performance goals given their cost constraints and will promote the ubiquitous use of low-cost sensor nodes. Through dissemination of the results in both archival publications and new curricula, this project will advance the development of sensor applications by enabling scalable localization services for a diverse range of sensor networks.","title":"CAREER: Unified Probabilistic Localization for Sensor Networks: Theoretic and Practical Foundations","awardID":"0448062","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["559843"],"PO":["564993"]},"100843":{"abstract":"This project develops an incrementally scalable and self-managing <br\/>platform for profuse media capture and storage using a distributed <br\/>architecture. The storage is tuned to exploratory environments where <br\/>video sensors and storage bricks are quickly deployed to profusely <br\/>capture the environment. The goal of this work is to balance the <br\/>storage robustness requirements, brick and network capacity. To this <br\/>end, this work addresses three important research areas: i) <br\/>self-contained lifetime abstraction that lets the sensors and storage <br\/>bricks to independently prune and manage the storage without <br\/>coordination with other system components ii) self-organizing overlay <br\/>mechanisms to locate candidate storage bricks for storing segments such <br\/>that the system can be incrementally scalable, and iii) self-management <br\/>mechanisms using storage replication, migration and rejuvenation to <br\/>provide the distributed storage. The impact of this research will be to <br\/>leverage the easy availability of multimedia sensors and extend the <br\/>relevancy of high fidelity multimedia capture in remote locations <br\/>without the associated management costs.","title":"CAREER: Scalable Self Managing Multimedia Storage","awardID":"0447671","effectiveDate":"2005-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["279941"],"PO":["493916"]},"100986":{"abstract":"Conformal structure is a natural structure associated with Riemann surfaces (General surfaces are Riemann surfaces) and plays fundamental roles in geometry and physics. Conformal structure has proven useful in graphics and vision, for example, conformal parameterization provides high-quality texture mapping without local distortion, and it is used in surface matching and morphing with applications such as brain mapping.<br\/><br\/>The investigator explores the potential of conformal geometry in computer graphics and vision and ultimately makes the interdisciplinary field of computational conformal geometry accessible and useful to the society. With respect to its direct impacts, the investigator applies conformal geometry to geometric modeling and shape analysis. Specifically,<br\/> 1.Construct shape spaces based on Teichmuller space theory, where the space of all surfaces is modeled as a finite dimensional manifold, each point represents a conformal equivalence class of surfaces (a Riemann surface), and the metric of the shape space measures the deviation of conformal structures of the two shapes. An additional related goal is to build a geometric search engine.<br\/> 2. Find a systematic way to generalize geometric constructions defined on planar domains to manifolds, such as manifold triangular BSplines and manifold Powell- Sabin surfaces. Design new surface subdivision schemes by inserting knots into manifold BSpline surfaces. With aspect to education, the investigator finds an effective way to teach conformal geometry (Riemann surface theory) to non-math majors by implementing practical algorithms to visualize the abstract concepts and establish the understanding of the profound theories.<br\/><br\/>Conformal geometry theory is fully developed but very abstract. The investigator builds and disseminates a concrete set of software tools to compute and visualize the conformal structure of arbitrary real surfaces, which makes the theory accessible to students and its practical applications useful to the broader community. Manifold BSpline tools based on conformal geometry bridge the gap between traditional polygonal meshes in graphics and spline surfaces in CAGD. The generic geometric search engine is applied to a geometric database and an Internet search engine. The investigator complements the software development with a systematic development of the classic material in a context that permits integration into the curriculum of non-math majors. The fields of computer graphics, vision, scientific computing, medical imaging, mathematics and physics all benefit from the research and education of computational conformal geometry directly. Computational conformal geometry has already made impacts on the graphics industry and will be more broadly applied in the future.","title":"CAREER: Conformal Geometry Applied to Shape Analysis and Geometric Modeling","awardID":"0448399","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["519258"],"PO":["565157"]},"100887":{"abstract":"The inherent non-determinism and dynamism and the communicational limitations of wireless ad hoc and sensor networks force a reexamination of the assumptions and models used for classical networks. There is a need for sound mathematical models to explore the complexities induced by the probabilistic and dynamic interaction of the physical and information processes. Hence, this project focuses on modeling and managing uncertainty in such systems, with the goals of achieving an improved understanding, deriving performance bounds, and developing innovative strategies and guidelines for protocol design, as well as providing cutting-edge research opportunities for both undergraduate and graduate students. The two-pronged research approach includes a theoretical and an experimental component. The multidisciplinary theoretical part combines methodologies from information and communication theory, and random graph theory and stochastic geometry, whereas the experiments are based on a sensor network testbed with mobile elements.<br\/><br\/>This project will contribute significantly to the ability to analyze and design robust and resource-efficient static and mobile ad hoc and sensor networks, and it is expected that the broader networking community will benefit from the models and design guidelines. Some models will hopefully be incorporated into standard simulation tools. The research findings are disseminated not only through the traditional channels but also via an educational outreach component, and their broader impact will be felt through the application to other important classes of networks, including multi-hop cellular networks that may soon become significant for a major part of our society.","title":"CAREER: Modeling and Managing Uncertainty in Wireless Ad Hoc and Sensor Networks","awardID":"0447869","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["540624"],"PO":["557315"]},"101008":{"abstract":"As the Internet grows larger and more complex, it becomes exceedingly difficult to reason about its structural properties because there exists no scalable method to map the Internet's crucial structural properties such as connectivity, delay and bandwidth. The lack of such structural information in efficiently accessible form leads to poorly functioning and excessively complex network software and protocols. The Internet Geometry project aims to develop geometric models of the Internet's crucial structural properties, much like their geometric longitudes and latitudes can represent distances between locations on the Earth. Geometric models are inherently simple and scalable, and thus can enable a wide variety of scalable performance-aware protocols and applications. The expected contributions of this CAREER research project include new fundamental understanding of the geometric properties of the Internet by studying extensive Internet structural data and new methods to generate accurate network geometric models. The PI will work towards a public global-scale distributed system that enables all Internet nodes to independently compute their network geometric properties, and simple and scalable protocols and systems for network routing and distributed system self-organization enabled by network geometric models.","title":"CAREER: Internet Geometry","awardID":"0448546","effectiveDate":"2005-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["543600"],"PO":["535244"]},"101019":{"abstract":"CAREER: Algorithms for Nonrigid Structure from Motion<br\/>PI: Serge Belongie<br\/><br\/>This proposal targets the problem of non-rigid structure from motion (NRSFM). This is a badly ill posed problem, as none of the usual multiple view geometric constraints hold, and additional constraints are necessary. The PI presents a research agenda to solve this problem. The first approach is based on a temporal relaxation of rigidity, and finding the solution that minimizes the total variation in scene structure over time. The second approach instead regards a video of a non-rigid object as a sequence of images of rigid shapes under varying pose, leading to a joint clustering and SFM problem.<br\/><br\/>Intellectual merit. For the SFM enterprise to realize its full utility, it must account for important non-rigid cases. Apart from being an important and challenging open problem, the estimation of NRSFM has characteristics that place it at the cutting edge of research in computer vision: (1) it requires a deep understanding of statistical modeling of shape deformation, and (2) the underlying math is at the intersection of variational methods, graph theory, optimization, differential geometry, and numerical linear algebra. Progress in this area will involve technical advances that will benefit a wide range of problems in computer vision.<br\/><br\/>Broad impact. Scientific: Practical applications of NRSFM include nonrigid object recognition, motion capture of humans and animals, gesture recognition (e.g., for American Sign Language), and medical imaging (e.g., contraction of a heart ventricle). Educational: The PI presents plans to provide the supporting educational infrastructure at the undergraduate and graduate levels in coordination with UCSD's NSF IGERT training program in Vision & Learning. This consists of new courses covering image processing, computer vision, and machine learning, and an outreach effort for underrepresented students through the UCSD Summer Training Academy for Research in the Sciences (STARS) program.","title":"CAREER: Algorithms for Nonrigid Structure from Motion","awardID":"0448615","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["426631"],"PO":["564316"]},"100976":{"abstract":"The future of wireless networking will be heterogeneous, making use of various air interfaces with a wide variety of capabilities and constraints. It will empower people through a digital environment that is aware of their presence and context and sensitive to their needs. Unfortunately, today's air interfaces merely co-exist, and very little has been achieved in making them co-operate to provide robust, secure, and scalable networks. Two main issues hinder the successful deployment of such networks: limitation of resources and vulnerability of robustness and security of communications among heterogeneous devices. The complexity and criticality of these issues increase with the size of the network and the variety of the devices that compose it. This project investigates the design and prototyping of cross-layer communication protocols and resource-management strategies to accommodate variations in the environment (traffic characteristics, channel quality, topology and mobility, energy, and adversary attacks). The approach is based on theoretical concepts such as generalized conflict-graphs, linear programming, coding and information theory, but also heuristic techniques for cross-layer resources cost-metrics, adaptive physical-layer, and contention-aware routing. The project considers a cross-layer approach to robustness against adversaries. The outcomes of the project are two fold: cross-layer algorithms and protocols for robust, scalable and secure communication, and evaluation tools including simulators and prototypes. The development of an innovative networking technology for \"ambient intelligence\" will be a significant enabling factor in the development of a vibrant, inclusive, safe, and productive society where access to services and information is cheap, transparent, and, most importantly, secure.","title":"CAREER: Cross-Layer Protocols for Robust and Scalable Heterogeneous Wireless Networks","awardID":"0448330","effectiveDate":"2005-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["518182"],"PO":["434241"]},"100900":{"abstract":"Image segmentation, shape detection and object recognition are three tightly coupled and intertwined visual processes. Only by integrating them together into a coherent, unified system can there be hope for achieving the long-standing goal of large-scale visual recognition. This proposal puts forward a learning-based unified graph formulation providing a principled and workable framework for attacking this extremely difficult problem. <br\/><br\/>The proposed research efforts are directed along three fronts: 1) complete inference of object information by constructing multi-layer graph for shape detection, object recognition and segmentation; 2) unbiased integration of bottom-up low level cues with top-down knowledge of object shape; and 3) direct learning of the object recognition graph with supervised spectral graph cuts learning technique. The proposed 100- and 1000- Object Recognition Challenge will provide a highly objective and rigorous evaluation its success. <br\/><br\/>This research draws upon ideas from a diverse set of disciplines: computer vision, machine learning, numerical analysis, and theory of computation. PI will continue to promote inter-disciplinary researches through graduate courses, conference tutorials and workshops, internships and research experience for undergraduates, as well as web page resources offering tutorial and open source code.","title":"CAREER: Learning to See - A Unified Segmentation and Recognition Approach","awardID":"0447953","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["426074"],"PO":["564316"]},"100856":{"abstract":"Despite advances in the design of smaller and more powerful tablet-like computers, the often-touted \"paperless office\" remains elusive. On the contrary, consumption of paper is on the rise and, with only few exceptions, office work still relies heavily on this medium. At the root of this apparent paradox is the wide gap between paper affordances, (e.g., ease of navigation and annotation, and high information density display), and digital document affordances, (e.g., ease of distribution, archiving, and search). In this research the PI will investigate how to bridge this gap, by focusing on combining the affordances of paper on the one hand and digital document on the other, with respect to navigation, annotation, displaying large quantities of information, and information processing. To do so, the PI will adopt a 3-pronged approach:<br\/><br\/>Paper track. Paper is an inexpensive static medium well adapted for navigating and annotating large quantities of information, but it lacks information processing capability. The PI's Paper Augmented Digital Document system will study how new technology such as the Anoto digital pen system can bring digital affordances to paper. This track will focus on cohabitation between the digital and the paper world, using paper as transient support for digital documents when paper affordances are needed.<br\/><br\/>Tablet computer track. The PI's Next Generation Tablet PC project will provide paper-like document navigation techniques on tablet computers using tangible and haptic interfaces. It will also address the inherent lack of screen real estate on tablet computers, by exploring how small clusters of tablet computers that can be created on the fly may serve as portals to different documents.<br\/><br\/>Interactive surfaces track. Interactive surfaces provide large display areas and can tap into large computational resources such as computational clusters. Unfortunately, they typically lack efficient document navigation tools. Using the Maryland Interactive Table as a testbed for his experiments, the PI will explore how new tracking technology can deliver better document navigation on horizontal interactive surfaces.<br\/><br\/>For each track, the PI's goal is to build a prototype advanced enough to serve one common task: supporting a small group of people in creating and improving a document, such as the proposal on which this award is based! Integrating data from the different tracks will provide a unique opportunity to analyze the differences and similarities among the approaches. The PI believes that such side-by-side comparisons are the key to a sound, scientific exploration of the design parameters relevant for providing efficient navigation, access to large quantities of information, and access to computational resources. In particular, he expects this research to provide answers to questions such as the following: What are the relative advantages and disadvantages of paper-based vs. digital interactions? What are the patterns of paper use in real-life settings, and how do they compare with findings from ethnographic studies? What are the best ways to reproduce paper navigation affordances on portable devices and interactive surfaces? How does the introduction of digital equivalents of paper influence information foraging pattern as well as social patterns (e.g., in small groups)?<br\/><br\/>Broader Impacts: This project will impact how people perform numerous common tasks such as proofreading documents, making notes on large format documents such as blueprints, navigating through digital documents, and conducting meetings using interactive surfaces. The techniques developed in this project will also impact the field of human computer interaction in general, by providing valuable insights into how to design efficient tangible interfaces and better two-handed interfaces for interactive surfaces. Graduate students will be involved in all aspects of this work, and will be encouraged to explore interdisciplinary projects combining hardware and software design, interaction design, and methodical comparison between different design","title":"CAREER: People, Paper and Computers","awardID":"0447703","effectiveDate":"2005-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["475376"],"PO":["565227"]},"100625":{"abstract":"TITLE: CAREER: Reliable Peer-to-Peer Data Preservation<br\/>INSTITUTION: Harvard University<br\/>PRINCIPAL INVESTIGATOR: Roussopoulos, Mema<br\/>PROPOSAL NUMBER: CNS-0447075<br\/><br\/><br\/>ABSTRACT FOR AWARD:<br\/>The amount and variety of content being published online is growing at an exceptional rate. Online publishing enables content to reach a much larger audience than paper publishing but offers no guarantee of long-term access to the content. This work investigates techniques for building a large, reliable peer-to-peer system for the preservation of online published material. The system consists of a large number of low-cost, persistent web caches (peers) that cooperate to detect and repair damage by voting in \"opinion polls\" on the content of their cached documents. The peers are autonomous and mutually suspicious. Project activities include: 1) investigating defenses against adversaries whose goal is to modify content without detection or to disrupt the preservation process; 2) performing a foundational study of the interconnections between identity, trust, and reputation models in peer-to-peer systems; and 3) developing, analyzing, implementing, and testing new protocols that address the high frequency of updates of online government documents, the large volumes of scientific data, and the privacy concerns of sensitive medical data. This work is being evaluated using a real testbed being deployed at 100 libraries around the world with the support of publishers representing over 2000 titles. The broader impact of the work is that all electronic material preserved through the system including academic journals, government documents, and scientific and medical data will remain accessible to generations of citizens. An important component involves the development of new courses that incorporate this research and the development of the Women in Computer Science Organization at Harvard.","title":"CAREER: Reliable Peer-to-Peer Data Preservation","awardID":"0446522","effectiveDate":"2005-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["335831"],"PO":["535244"]},"100988":{"abstract":"The goal of this research is therefore to develop modular middleware and programming technology to address these challenges of grid computing: decentralized coordination, resource optimization, and programmability.<br\/><br\/>The project will pursue research in the following: (1) it will provide efficient highly-customizable (easily programmable) decentralized coordination of pervasive information and computational services and agents, (2) it will investigate the use of physical and computational agents that are heterogeneous, both in terms of computation and communication capabilities, (3) it will fully explore resource optimization techniques considering the dynamic nature of grid environments, in which nodes can arbitrarily join and leave, and (4) it will apply developed techniques and software to scientific problems in large-scale and open grid computing environments. The proposed middleware will achieve decentralized coordination through efficient peer-to-peer communication protocols, global resource optimization through work-stealing and static and dynamic program analyses, and programmability through highly expressive programming and coordination abstractions and enabling easier and more effective applicability of grid computing technology to solve complex scientific problems executing on scalable high-performance computing or grid computing environments.<br\/><br\/> The project also includes a comprehensive integrated education and outreach plan, such as the development of a special exhibit at the Troy Junior Museum to introduce high-performance computing to pre-college students from a largely low-income minority community, and the creation of a hands-on laboratory for grid computing, open source software development efforts, and curricular development of undergraduate and graduate courses on distributed computing over the Internet.","title":"CAREER: Middleware and Programming Technology for Grid Computing","awardID":"0448407","effectiveDate":"2005-02-15","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["307820"],"PO":["493916"]},"100889":{"abstract":"Personal computing is currently undergoing a major revolution: the growth of mobile computing. The number of mobile devices is on a rapidly increasing trajectory, including millions of Bluetooth and WiFi enabled devices such as cameras, PDA, cell-phones, and music players. Although each device has a specific purpose, they are all used to create, store, and share vasts amounts of personal data. Along with this growth comes a data management nightmare: systems frustrate users with the lack of availability of data, complications in transferring data from one device to another, and limited battery lifetime.<br\/><br\/>This CAREER research is designing and building mobile systems that address power management, variable connectivity, and usability concerns. A variety of techniques are employed, from unique combinations of hardware and software, to innovative techniques in measurement in modeling. The research includes building real systems, in order to demonstrate the benefits of these approaches to end-users.<br\/><br\/>The first issue to be addressed is power management in always-on devices. Through a hierarchy of connected low-power embedded subsystems, the mobile devices efficiently enter low-power modes to provide data transfer opportunities. Second, because many devices frequently disconnect from their peers, it is necessary to use third party devices to transfer data updates. Using techniques from Distributed File Systems, as well as Disruption Tolerant Networking, the research is building systems that take advantage of mobility to transfer data between normally disconnected devices. Third, efficiently transferring data using mobile devices requires efficient operating support for storing data.<br\/><br\/>This CAREER grant funds these research activities, as well as ongoing collaborations with four other colleges in the Western Massachusetts area. Through interactions with two highly-ranked all-women's colleges, the PI is encouraging more female students to pursue graduate school in Computer Science.","title":"CAREER: Systems Support for Data Management in Mobile Devices","awardID":"0447877","effectiveDate":"2005-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["309222"],"PO":["561889"]},"100912":{"abstract":"IIS-0448042<br\/>CAREER: Nano-Robotic Manipulation Systems<br\/>using Atomic Force Microscope Probes<br\/><br\/>Nano-robotics has recently emerged as a new robotics field that encompasses the programmable manipulation of nano-scale objects where the manipulation dynamics is dominated by nano-scale physics, chemistry, and scaling effects. This career development program is aimed to advance nano-robotics science and engineering related research and educational activities with novel approaches. The research activities in this program will be focused on developing theories and methodologies for analyzing, designing, building, and controlling Atomic Force Microscope (AFM) based nano-robotic manipulation systems. The primary educational goal of this program is to train undergraduate, graduate level, and underrepresented students to be near future intellectual leaders and workforce for newly emerging nano-robotics and nanotechnology areas. To achieve this goal: a new interdisciplinary undergraduate level nanotechnology minor program will be initiated, novel, interdisciplinary and fundamental nanotechnology related engineering courses will be developed, and novel educational tools for remote and interactive nanotechnology training will be introduced. As scientific merits of this work, the understanding of nano-scale physics and dynamics for reliable nano-robot design, prototyping, and control by modeling will be improved, AFM based novel three-dimensional, autonomous, miniature, and massively parallel nano-robotic manipulation systems will be investigated for high volume nano-manufacturing applications, and advanced human-machine user interfaces for intuitive nano- robotic interactions will be proposed. As broader impacts, in addition to training undergraduate and graduate students, the developed research and educational activities will include underrepresented groups such as black and women minorities in Pennsylvania through the CMU summer internship program. Moreover, this program will create a 'cyberinfrastructure' using an internet based remotely controlled AFM system to enable students and researchers from institutions with limited resources remote access to advanced nanotechnology equipment. Finally, the products such as nano-material characterization workstation, nano-wire bonder, and nano-fiber puller resulting from the research activities of this program will have a significant industrial impact.","title":"CAREER: Nano-Robotic Manipulation Systems using Atomic Force Microscope Probes","awardID":"0448042","effectiveDate":"2005-02-01","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["549509"],"PO":["429182"]},"100978":{"abstract":"As systems are increasingly integrated within a global computing environment, a crucial challenge is how to manage the resulting software complexity. Metaprogramming can help meet this challenge. To reconcile the gap between language\/compiler efforts and systems practice, this work will explore the following research questions: how can an unsafe and low-level programming language, C, be safely extended, including with new definitional constructs, such as objects, and new kinds of types, such as classes and how can language and compiler extensions be factored to maximize reuse, and what support is necessary for managing and composing the resulting fine-grained extensions . The project will develop and build a macro system for C, called xtc for eXTensible C, but unlike the C preprocessor, xtc macros are specified and implemented as transformations on a program's abstract syntax tree (AST) and preserve macro hygiene . The project will also explore methods such as a tree querying language that supports complex AST transformations, an extensible type system, which supports the introduction of new kinds of types, and will investigate how to disable select language features, such as pointers, and how to express domain-specific compiler optimizations. Software built with xtc will be more reliable and secure, which is of critical importance as business and government increasingly depend on IT for their livelihood. Furthermore, by opening up C, the proposed work enables language and compiler researchers to have more impact and educators to more easily explore new approaches to teaching computer science. To emphasize the last point, the project will leverage xtc in all appropriate courses, including the graduate-level compilers and will also develop a new undergraduate courseon object-oriented programming and the corresponding textbook, which explore not only the relevant concepts but also their underlying implementation (as xtc macros).","title":"CAREER: Better Systems With Extensible C","awardID":"0448349","effectiveDate":"2005-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["508475"],"PO":["493916"]},"100913":{"abstract":"It is estimated that by the year 2010 more than 10 billion wireless sensors will be deployed for use in applications as diverse as environmental monitoring, surveillance, and medical monitoring. For these sensor networks to last for years unattended, it is vital to make them energy-efficient while ensuring they provide the data necessary to meet application needs. While much research has focused on the design of individual protocols to meet these goals, much less attention has been paid to the optimization of network operation at the system level. One such approach is a cross-layer system design that integrates many of the protocol functions into a high level sensor management protocol that assigns roles to each sensor; these roles include sensing the environment, routing other sensors' data, fusing the data locally, and controlling neighboring nodes. This project develops models that allow for global optimization of sensor management, and it develops distributed techniques that jointly optimize the use of sensor and network resources in all possible roles. The optimization models highlight the potential limitations of existing techniques, the distributed architecture provides a feasible solution for long lifetime sensor networks, and a sensor network testbed implementation shows the efficacy of this cross-layer architecture for real systems. The potential of this research for high societal impact combined with the innovative techniques being employed provide ample opportunities for attracting students, from junior high school up through graduate school, to the field and for training the next generation of engineers in this exciting area.","title":"CAREER: Cross-layer Design for Sensor Management in Wireless Sensor Networks","awardID":"0448046","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["527036"],"PO":["557315"]},"100924":{"abstract":"Autonomous self-configuration is an essential component for the deployment of scalable wireless sensor networks. Despite the significant progress of network services, experience with even modest sized testbeds has shown that the per-node configuration is a significant barrier for large scale deployments. To address this issue this research will consider three main components of self-configuration in distributed sensor networks: location calibration, grouping and mobility. The emphasis will be on the careful design of distributed self-organization algorithms drawing from multiple disciplines in engineering and computer science and their integration with the state-of-the-art technologies in wireless communication, processing and sensing. The results will be applied to the development of a set of application constructs that will serve as an \"alphabet\" for understanding mobility patterns and orchestrating behaviors using wireless microsensors. <br\/><br\/>The proposed application constructs will be pursued through the design and implementation of a game application that will interpret the behavior of its users and generate responses aiming to change the player's behavior. The impact of this work will arise from the rigorous exercise of the developed concepts in the context of the game and the actual deployment of the game variants in everyday life environments, where intelligent sensors will seamlessly interact with their users. The results of this work will be published in conferences, taught in a new course on sensor networks and will be posted on the web for other institutions interested in adopting it. The hardware and software developed under this project will be made available to the community so that they can be applied in other sensor network applications.","title":"CAREER: Self-Organization Services and Application Support Constructs for Sensor Networks","awardID":"0448082","effectiveDate":"2005-02-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["399674"],"PO":["557315"]},"100935":{"abstract":"Within the last decade, probabilistic methods have delivered successful analyses of natural language texts that, in turn, have enabled a broad range of valuable and practical applications, such as machine translation, question answering, and summarization. Despite this success, existing methods suffer from a fundamental limitation: they process each document with little or no ability to take advantage of its global structure. All too often, this results in suboptimal performance for the task at hand.<br\/><br\/>The goal of this project is to develop probabilistic models for two fundamental, orthogonal dimensions of text, content and cohesion. A model based on the first dimension, content, describes the topics present in a text and their organization. The second dimension, cohesion, is concerned with how information is realized in a given text. Development of these models requires new unsupervised techniques able to capture complex text properties and novel algorithms for topical discretization and discourse grammar induction.<br\/><br\/>Gaining a computational measure of what constitutes a good text will open new research avenues on the edge of humanities and computer science. Probabilistic text models will form a basis for novel approaches to text summarization and generation that will make on-line information much more accessible than is currently the case. This will substantially affect the way people experience the many forms of textual on-line information, including news reports, consumer health information, and government documents. Students will become involved in this research through hands-on projects, outreach programs, and courses at both the undergraduate and graduate level.","title":"CAREER: Content and Cohesion Models, with Applications to Text Summarization and Natural Language Generation","awardID":"0448168","effectiveDate":"2005-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["401949"],"PO":["565215"]},"100836":{"abstract":"The proposed research seeks to identify factors that lead to success and failure of Open Source (OS) software projects and to understand how these factors relate to more generic, open content (OC) projects. There are two specific research objectives: (1) To develop a theory of success and failure of OS programming projects seen from the point of view of an open commons; and (2) to undertake a longitudinal study of open content projects to see if they exhibit similar success\/failure characteristics. The goal of both will be to develop design principles for the organization of future OS or OC projects. To achieve these objectives, an empirical study of the institutional designs of OS and OC projects will be undertaken. An expected contribution of the work will be to connect the rich body of theoretical and empirical research on the governance of \"environmental commons\" to the recent research related to OS found largely in the field of information systems. The teaching objective is to take the knowledge gained from the research program to create a Geographic Information Systems (GIS) curriculum based entirely on OS GIS software. In addition, students will be taught about participation in OS\/OC GIS projects. The online teaching component of this project, which embraces the open access principles of OS and OC, has the potential to reach a broad GIS community worldwide and could make an important impact, especially in developing world contexts. But perhaps more importantly, through the identification of OS\/OC commons design principles, the proposed work could provide new insights on how to organize Internet-based collaborative scientific research in the future.","title":"CAREER: The Open Source\/Content Commons as a New Paradigm for Collaborative Scientific Research: A Research and Teaching Agenda","awardID":"0447623","effectiveDate":"2005-02-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["493835"],"PO":["564456"]},"100726":{"abstract":"TITLE: CAREER: Models of Cryptographic Protocols for Unstructured, Decentralized Systems<br\/>INSTITUTION: University of Maryland, College Park<br\/>PRINCIPAL INVESTIGATOR: Katz, Jonathan<br\/>PROPOSAL NUMBER: CNS-0447075<br\/><br\/><br\/> ABSTRACT FOR AWARD<br\/><br\/>Unstructured, decentralized systems --- including ad-hoc\/sensor networks and peer-to-peer networks --- are emerging as a central focus of computer science research. Methods for securing these systems are critical; however, these systems differ markedly from classical distributed systems (which are, in comparison, more ``structured'' and well-organized) and thus current cryptographic models and mechanisms are simply not sufficient for addressing the full range of security requirements.<br\/><br\/>This work aims to provide solid theoretical foundations as well as novel cryptographic protocols and primitives for this new area. In particular, research focuses on (1) new models for formally reasoning about, and rigorously proving the security of, various applications within unstructured, decentralized systems; (2) issues of ``trust'' and ``reputation'' within such systems; and (3) new cryptographic protocols emphasizing both efficiency (for potential use by resource-limited devices within, e.g., ad-hoc networks) as well as new security concerns (such as anonymity) arising in multi-user distributed environments.<br\/><br\/>The models and techniques developed as part of this work are expected to be broadly applicable to security problems arising in many distributed systems, and it is hoped that this work will serve as an impetus for future research in this area, while providing suitable tools and frameworks within which such research can be performed. Results will be incorporated into graduate-level courses and presented at a ``crypto reading group'' being organized at the University of Maryland; they will be further disseminated to a wide audience at conferences and via publicly-available lecture notes.","title":"CAREER: Models and Cryptographic Protocols for Unstructured, Decentralized Systems","awardID":"0447075","effectiveDate":"2005-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["519626"],"PO":["565264"]},"100748":{"abstract":"This CAREER project aims to develop a research and education program to foster positive and healthy youth development through the use of multi-user, virtual environments called identity construction environments (ICEs), which are hypothesized to foster new kinds of communities of learning and care. One context where such technologies may have the most impact is in situations where youth might otherwise be isolated and in danger of developing mental health-related problems. The PI will work with youth at the Boston Children's Hospital that have suffered severe renal and cardiac failure and who wouldn't otherwise survive without medical interventions such as heart and kidney transplants. An applied developmental model provides a framework to design ICEs. It also provides a model for doing research in complex real world settings. It is hypothesized that ICEs will 1) promote positive youth development (measured as competence, connection, character, confidence, caring and contribution to civil society), 2) complement and augment face-to-face psychosocial interventions, and 3) that the positive effects are due to design features and the nature of online activities that engage youth in cognitive, social and emotional development. Educational activities include research opportunities for undergraduate and graduate students in an interdisciplinary research group, service learning in healthcare and community-based settings, new courses and curricula for students from a variety of disciplines: education, mental health, engineering and computer science.","title":"CAREER: Virtual communities of learning and care: multi-user virtual environments that promote positive youth development","awardID":"0447166","effectiveDate":"2005-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["487120"],"PO":["564456"]},"100859":{"abstract":"The project will develop a novel integrated approach for improvement of reliability, availability, security, and performance of Web-based systems. In order to handle the intrinsic complexity of Web-based systems, the proposed approach will be scalable and allow measurements and models with different level of details and abstraction to be combined together. The project will focus on the following lines of inquiry: Empirical characterization of reliability, availability, security, and performance attributes; Development of performance and reliability\/availability models ; Combining multiple quality attributes based on clustering analysis and hierarchical modeling; Evaluation based on both real-life case studies, as well as on controlled experiments conducted in a test bed environment.What makes the proposed research unique and different from existing research work in the literature, in addition to addressing the fundamental limitations for quantitative assessment of each quality attribute treated in isolation, is the aspect of combining individual quality attributes within an integrated framework aimed at analyzing their interactions and tradeoffs.","title":"CAREER: Improving Web Quality through an Integrated Approach","awardID":"0447715","effectiveDate":"2005-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["409382"],"PO":["535244"]},"105909":{"abstract":"The proposed research will investigate new representation, state estimation, and data association techniques to enable sustained, full 6-DOF motion simultaneous localization and mapping (SLAM) in diverse, large-scale environments. The driving vision is to realize an autonomous robot (and sensor suite) capable of sustained exploration of an arbitrarily large environment mixing indoor and outdoor elements, and human-built and natural scene structure. The work combines (1) a basic science component that will investigate fundamental issues of data representation, generality of environments, and algorithmic scaling behavior; (2) a development component with long-duration excursions with real sensors in a variety of environments using both robotic and human platforms; and (3) a validation and assessment component that will formulate and apply objective assessment metrics. The intellectual merits of the proposed research stem from the scientific challenges of developing persistent, autonomous, large-scale mobile robot navigation and mapping systems. Autonomous navigation is a compelling research goal because it embodies key issues that underlie many difficult problems, including choosing a representation, modeling sensor physics, managing uncertainty, detecting features, and selecting actions in real-time. The broader impacts of achieving a sustained, broad-area SLAM method will form the basis of a number of fundamentally useful capabilities, both from technical and societal standpoints. An enormous number of civil, commercial and military applications use maps, and gain greater utility from maps that are accurate and current with respect to the actual state of the world. Among these applications are vehicle and pedestrian navigation aids, accessibility studies for the disabled, urban planning, rapid emergency response, search and rescue operations, equitable taxation and land-use reform, zoning compliance, geographical information systems, and military planning, training and rehearsal. Autonomous operations, including navigation, mapping, and path planning, are vitally important to mobile robots operating on land, in air, space, underground, and underwater environments. Beyond SLAM, the proposed research can have broad impact on the large class of problems facing the challenge of performing real-time state estimation with highly uncertain data","title":"SGER: Persistent, Autonomous Localization and Mapping of Unstructured Environments","awardID":"0514639","effectiveDate":"2005-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["549887",279427],"PO":["335186"]},"98270":{"abstract":"ABSTRACT<br\/><br\/>While biological databases are well-curated and richly interconnected, data integration remains a manual, time-intensive, and error-prone process. The proposal develops a computational infrastructure that exploits biologists' domain expertise to express and execute data integration protocols for biological pipelines. Several challenges to be addressed include: (1) an exploration interface that can express high-level complex queries that in turn are translated into lower-level data manipulation operators, (2) the specification and population of an alternative splice protein analysis pipeline, and (3) a mediation testbed that is implemented using XML based wrapper technology and mediator technology (IBM DB2 II).<br\/><br\/>The metrics of links and paths existing between integrated databases may be used to characterize query results in ways that are useful to biologists and data administrators and this proposal develops models to predict these metrics. Navigational queries require traversing multiple paths that differ in cost and benefit (result cardinality). Cost models and domain and task specific semantics are used to choose the best path or set of paths for a biological pipeline. <br\/><br\/>The research addresses many of the SEIII challenges of large scale data sharing. The project addresses the exploration of databases by biologists; captures and exploits domain specific knowledge; develops efficient methodology to compute results and designs and populates a publicly accessible pipeline and website. The broader impact beyond the specific biological resources and protein pipeline is the development of a methodology and evaluation platform that can be applied to any task that requires access to, and analysis of, multiple inter-connected heterogeneous resources.","title":"Collaborative Proposal: II+SEI Mediation Technology for Biological Pipeline Analysis","awardID":"0430915","effectiveDate":"2005-02-01","expirationDate":"2009-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["543580","518332"],"PO":["565136"]},"67031":{"abstract":"Over the past several decades, particle accelerators have contributed greatly to our understanding of the nature of the universe. Further, their use in research programs world-wide has had a major impact on many sciences. <br\/><br\/> The societal benefits of particle accelerators are especially evident in material science, nuclear medicine, molecular biology and in many other fields. Charged particles or the radiation they produce enable doctors to treat many forms of cancer; an application that is experiencing significant growth. Accelerators are now a major presence in the semiconductor and pharmaceutical industries. <br\/><br\/>As can be seen from the number of advertisements that appear monthly in such Journals as Physics Today and the CERN Courier, there is a dearth of personnel trained in accelerator physics and related technology. The nation's need for advances in the areas mentioned above requires the training of next-generation accelerator physicists, to carry out accelerator R & D on the cutting-edge.<br\/><br\/>One such cutting edge project is based on the interest in using superconducting electron linacs with energy recovery as synchrotron radiation sources. Such energy recovery linacs (ERLs) would open new regimes of X-ray science because they are capable of producing ultra-brilliant X-ray beams, maintaining a very small source size suitable for micro X-ray beams, and making very intense fast X-ray pulses. Each of these characteristics would permit the execution of experiments that are not feasible with existing synchrotron sources. Many technical issues must be satisfactorily resolved before the potential of a full-scale ERL can be realised, including the generation of high average current, high-brightness electron beams; acceleration of these beams to suitable energies without unacceptable emittance degradation; stable and efficient operation of superconducting linear accelerators at very high gradients etc. Cornell University has proposed to resolve these issues by the construction of a prototype ERL. The intention is to then utilize the information that is learned from the prototype to propose the construction of a full-scale ERL light source. The purpose of this interdisciplinary proposal is to construct the first phase of that prototype.","title":"Phase I Energy Recovery Linac (ERL) Synchrotron Light Source at Cornell University","awardID":"0131508","effectiveDate":"2005-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1221","name":"ELEMENTARY PARTICLE ACCEL USER"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"7282","name":"ACC PHYSICS & PHYSICS INSTRUM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1750","name":"MPS DMR INSTRUMENTATION"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1978","name":"PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1938","name":"CHEMICAL INSTRUMENTATION"}}],"PIcoPI":["442988","476942","424371","441762"],"PO":["397635"]},"99430":{"abstract":"ABSTRACT<br\/>0438923<br\/>PI: Jeff, Carver Victor R. Basili<br\/><br\/>SoD: Flexible High Quality Design for Software Intensive Systems<br\/><br\/>Responding to late software changes is one of the key areas of risk in software development, but is often unavoidable. The major way to deal with the problem is during software design, making the architecture flexible, which is too often not achieved. This research addresses this problem by studying the relationship between changes and software architecture. The project involves the mining of existing change and defect data<br\/>from our collaborators to formulate representative taxonomies of changes, and defects, and to understand how effective various QA strategies are for dealing with them, running of classroom studies to test specific hypotheses resulting from the data mining, and the analysis of the changes and defects encountered on industrial projects; recommendation of a suite of QA strategies for the expected defect profile; and controlled observation of the effectiveness of recommendations.<br\/><br\/>The research will contribute to Science of Design by producing a model that allows software developers to reason about proposed changes and their impact on system quality; a method for evaluating technique composability; increased understanding of the relations between faults, changes and architecture; and increased understanding of the relationship between design process and the quality of the","title":"SoD: Collaborative Research: Flexible High Quality Design for Software Intensive Systems","awardID":"0438923","effectiveDate":"2005-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["425802","551799"],"PO":["564388"]},"98320":{"abstract":"ABSTRACT<br\/><br\/>While biological databases are well-curated and richly interconnected, data integration remains a manual, time-intensive, and error-prone process. The proposal develops a computational infrastructure that exploits biologists' domain expertise to express and execute data integration protocols for biological pipelines. Several challenges to be addressed include: (1) an exploration interface that can express high-level complex queries that in turn are translated into lower-level data manipulation operators, (2) the specification and population of an alternative splice protein analysis pipeline, and (3) a mediation testbed that is implemented using XML based wrapper technology and mediator technology (IBM DB2 II).<br\/><br\/>The metrics of links and paths existing between integrated databases may be used to characterize query results in ways that are useful to biologists and data administrators and this proposal develops models to predict these metrics. Navigational queries require traversing multiple paths that differ in cost and benefit (result cardinality). Cost models and domain and task specific semantics are used to choose the best path or set of paths for a biological pipeline. <br\/><br\/>The research addresses many of the SEIII challenges of large scale data sharing. The project addresses the exploration of databases by biologists; captures and exploits domain specific knowledge; develops efficient methodology to compute results and designs and populates a publicly accessible pipeline and website. The broader impact beyond the specific biological resources and protein pipeline is the development of a methodology and evaluation platform that can be applied to any task that requires access to, and analysis of, multiple inter-connected heterogeneous resources.","title":"Collaborative Proposal: II+SEI Mediation Technology for Biological Pipeline Analysis","awardID":"0431174","effectiveDate":"2005-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["427973"],"PO":["565136"]},"99433":{"abstract":"ABSTRACT<br\/>0438933<br\/>PI: Victor R. Basili, Jeff Carver<br\/><br\/>SoD: Flexible High Quality Design for Software Intensive Systems<br\/><br\/>Responding to late software changes is one of the key areas of risk in software development, but is often unavoidable. The major way to deal with the problem is during software design, making the architecture flexible, which is too often not achieved. This research addresses this problem by studying the relationship between changes and software architecture. The project involves the mining of existing change and defect data<br\/>from our collaborators to formulate representative taxonomies of changes, and defects, and to understand how effective various QA strategies are for dealing with them, running of classroom studies to test specific hypotheses resulting from the data mining, and the analysis of the changes and defects encountered on industrial projects; recommendation of a suite of QA strategies for the expected defect profile; and controlled observation of the effectiveness of recommendations.<br\/><br\/>The research will contribute to Science of Design by producing a model that allows software developers to reason about proposed changes and their impact on system quality; a method for evaluating technique composability; increased understanding of the relations between faults, changes and architecture; and increased understanding of the relationship between design process and the quality of the resulting product.","title":"SoD: Collaborative Research: Flexible High Quality Design for Software Intensive Systems","awardID":"0438933","effectiveDate":"2005-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":[262266],"PO":["564388"]},"99425":{"abstract":"This project builds tools supporting user expression and the collection and use of this information by software designers. The design exploration process provides users and other stakeholders a construction kit where they create annotated partial designs. A design repository collects partial designs and performs automatic analysis, including textual analysis of annotations and spatial analysis of graphical designs, to help identify interesting examples and patterns within the collection. Finally, an exploration interface is provided to software designers that provides for searching and browsing within the collection in order to better understand the task domain and user expectations and work practices. The design repository includes algorithms combining the analysis of text and the analysis of graphical layouts to index, cluster, and associate the user responses. Based on these results the exploration interface provides a variety of search and navigation features to the software designer. This approach leaves the software designer in control of deciding what to see and when to see it but supports these decisions. Additionally, combining search and browse options allows for a variety of work practices based on the software designers' understanding of the collection, their prior access to associated\/related items, the focus of their current activity, and their preferences. This combination is prevalent today on the Web. The results of this project will have an impact on the design process by enabling the inclusion of a greater number of users and stakeholders in design and will facilitate communication about different perspectives on issues surrounding the design of software. The project Web site (http:\/\/www.csdl.tamu.edu\/DesignExploration\/) will be used to disseminate the research results, including the tools developed in this project that will be freely distributed for use in software development efforts.","title":"SoD: Design Exploration -- Supporting A Design Process for Engaging Users","awardID":"0438887","effectiveDate":"2005-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["467562"],"PO":["565227"]},"102050":{"abstract":"The overall goal of this research is to demonstrate new architectural solutions for the converged information and communication networks of the next century in nontraditional applications.<br\/><br\/>Intellectual Merit<br\/>This project focuses on the societal impact of engineering systems and technologies. We have developed various collaborative technologies (tele-immersive laboratory, experimental economics), to explore how humanists and social scientists may take advantage of the vast digital information and interactive capabilities that the Internet offers in communication.<br\/><br\/>Broader Impact<br\/>Students will be able to do research in every area of CS-IT: algorithms, complexity theory, computer graphics and vision, artificial intelligence, robotics, networks, wireless communications, software engineering, operating systems, human computer interaction, computational biology, programming languages, and computer architecture, under the supervision of faculty with outstanding qualifications, who are committed to undergraduate research.","title":"SUPERB (Summer Undergraduate Progam in Engineering Research at Berkeley)","awardID":"0453604","effectiveDate":"2005-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["515703","71498"],"PO":["381214"]},"101094":{"abstract":"Many biomedical processes and targets involve membrane proteins (MPs) which constitute approximately 25% of the genes in typical genomes. Since MPs are in part accessible through the outside of cells, they form an important group of proteins for potential bioengineering applications. Advancing the fundamental understanding of folding and function of MPs required for such applications is a challenge that has lagged behind that of soluble proteins for many years. <br\/><br\/>Intellectual Merit.<br\/>The PI proposes that microbial sensory rhodopsin has evolved into eukaryotic rhodopsin through gradual replacement of the importance of helix-helix contacts with long-range contacts to form the folded receptor in order to achieve signaling capabilities within a single receptor. It is the goal of this proposal to test this hypothesis.<br\/>The PI proposes that tertiary contacts between amino acids from both helical and loop regions take place during the very early stages before the helices have formed and possibly during their association. The two-stage hypothesis was based on experimental studies of bacteriorhodopsin. <br\/><br\/><br\/>Broader Impact. <br\/>Advancing the understanding of signaling mechanisms in membrane receptors may provide novel ways to engineer their function.<br\/>This would be important for potential uses such as:<br\/><br\/>-nanobiotechnology,bioengineering or medical intervention.<br\/>-useful framework to integrate study of the fundamental processes folding and signal transduction <br\/>-support education of and collaboration between researchers and students with disparate backgrounds in existing courses at the University of Pittsburgh<br\/>-undergraduate student and (3) with high-school students summer camp in the PIs laboratory <br\/>-Create a module for SAMS (Summer Academy for Minority Students) at Carnegie Mellon University where I hold a secondary appointment. <br\/>-As the Chair of the Young Protein Scientists Committee of the Protein Society, I will be able to encourage future student chapters at Universities throughout the United States and Europe to engage in similar outreach activities.","title":"CAREER: Evolution of Signaling Mechanisms in Membrane Receptors","awardID":"0449117","effectiveDate":"2005-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["499671"],"PO":["565223"]},"106022":{"abstract":"The PI requests financial support for the Bionanotechnology section in Polymetric Materials, Sciences, and Engineering (PMSE) division at CUNY - Hunter College. <br\/>The attendees: Hiroshi Matsui (CUNY), Kimberly Hamad-Schifferli (MIT), and Rajesh Naik (Air Force LabWright Patterson) are also presenting at this symposium.<br\/><br\/>Intellectual Merit<br\/><br\/>The ACS National meeting is the largest meeting in the fields of Chemistry and related<br\/>engineering. In the presentations being organized by Dr. Matsui's group, the topics are centered around bionanotechnology. Specifically, the group plans to explore biomaterials applications as they relate to computers, sensors and data storage, as well as relevant research applications such as tissue engineering and drug delivery.<br\/><br\/>The symposium as a whole, will have 3 sessions focused on nanomaterials in biology, the interface between biology and nanoscale systems, and biological polymers. This<br\/>symposium will focus on how to utilize biological macromolecules as building blocks to<br\/>synthesize inorganic nanomaterials, the interface between the biological world and<br\/>nanoscale systems, and use of biological macromolecules as building blocks for<br\/>polymers.<br\/><br\/>Broader Impact<br\/><br\/>The goal of the symposium is to provide a forum for direct interaction between polymer, materials, and biological researchers in order to explore new interdisciplinary research activities in nanoscience.<br\/><br\/>The invited speakers include a diverse array of intellectual backgrounds, to include<br\/>industrial, academic and government laboratories, male and female researchers, and<br\/>established as well as young investigators.","title":"Financial Support: American Chemical Society (ACS) National Meeting; San Diego, CA; March 13-17, 2005","awardID":"0515171","effectiveDate":"2005-02-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["377652"],"PO":["381214"]},"99438":{"abstract":"The success of the World Wide Web has motivated many designers to examine and adopt the architectural style underlying the Web's interactions. This style, REpresentational State Transfer, or REST, excels at providing design guidance on how components (or nodes) should interact. REST provides little direct guidance, however, on how these nodes should be constructed. Without the necessary direction, designers frequently violate critical constraints of the REST style, such as stateless interactions and the critical resource\/representation abstraction, when building their applications. The negative effects of these violations may only come into focus after application deployment.<br\/><br\/>The initial focus of this research project, therefore, is on identifying and articulating teachable principles, practices, and supporting tools that enable the systematic and effective application of proven architectural styles, beginning with REST. The research broadens from this base to identify and provide design principles, architectural styles, and tools applicable to a wide category of decentralized and distributed applications. Through increasing levels of community involvement and assessment, particularly involving open-source software projects, this research enables a broad set of developers to effectively employ key design practices.","title":"SoD: Designing Architectures for Networked Applications: A REST-ful Approach","awardID":"0438996","effectiveDate":"2005-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["533779"],"PO":["551712"]},"95348":{"abstract":"Since the rise of personal computers with bitmapped displays in the 1970's and 1980's, the model of one display or monitor per computer has been the dominant paradigm for desktop computing. The PI argues that this constraint has strongly influenced the visual interfaces built for software applications and how people have interacted with computers, and in many cases has limited productivity and innovation. As LCD monitors that require far less desk space have become more popular and less expensive, the use of multiple monitors per computer is becoming more common. In order for computers with large pixel-spaces to be of most benefit, however, new interaction methods and space management operations are needed. Furthermore, large pixel-space computers will enable new forms of software systems (e.g., the extra screen area will be available for new styles of peripheral awareness tools that allow people to monitor important information in their work and personal lives). Consequently, personal computers will become information control centers that facilitate data-intensive tasks and analysis activities. To implement this vision, the PI will explore research in three related areas. First, he will study existing practices in window and space management, particularly how current methods do or do not succeed on multiple monitor machines, and he will develop new space management operations more specifically focused on easing navigation and task management when the display area is so large that standard direct manipulation techniques become slow and limiting. Second, the PI will examine whether the increased screen area is beneficial for and will lead to new capabilities in multi-window, information-rich software systems such as Integrated Development Environments and Information Visualization systems. Third, the PI will explore how the extra screen real estate can be used to provide the user with peripheral awareness of important information such as the progress of work projects, communications from colleagues or friends, and current news and events, while not being disruptive distractions. All of these research threads will combine to build an understanding of the capabilities and potential benefits, the strengths and weaknesses, of multi-monitor and large pixel-space computers.<br\/><br\/>Broader Impacts: If large pixel-space computers do become commonplace, people will need easier and better methods for managing the screen space and the tasks being performed there. Even relatively modest improvements in space and window management can provide huge cumulative benefits, because computers are so pervasive in society. Concretely identifying the advantages of machines like this, if the advantages do exist, can serve to inform people who are considering a change to a multi-monitor machine and are seeking to understand the benefits that can result. This research has the potential to develop new and fundamentally different ways of managing tasks and interacting with user interfaces for everyone, so that they become more productive. Furthermore, the project will create new forms of information visualization and peripheral awareness systems that will help transform personal computers into information control centers.","title":"Expanding the Desktop: Transforming Personal Computing through Large Pixel-Space Displays","awardID":"0414667","effectiveDate":"2005-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550876"],"PO":["565227"]},"105661":{"abstract":"Abstract<br\/><br\/>IIS-0513521<br\/>Soatto, Stefano<br\/>University of California-Los Angeles<br\/>Frontiers of Vision: A collaborative workshop on Computer Vision and its role in application with broad societal impact<br\/><br\/>Computer Vision is a relatively young but rapidly evolving field. The academic community is growing rapidly, as measured for instance by the number of submissions to the Computer Vision and Pattern Recognition conferences, which more than tripled since 1998 (submission was 453 in 1998, 466 in 2000, 920 in 2001, 1100 in 2003, 1300 in 2004, and 1500 in 2005). Such a growth is partly fueled by an increased demand for the use of vision in security and monitoring applications, medical imaging, robotics, persistent ISR, etc. A key stepping-stone was also achieved in the mid nineties with the availability of commercial off-the-shelf hardware to acquire and process imaging data in real time, thus enabling an entire new host of applications where vision is to be used as a sensor in the loop of real-time control applications. Vision is coming to play a key role in problems of broad societal and scientific impact from transportation to space, to entertainment, to environmental monitoring, to medicine, and to security. The increasing role that vision plays in applications is also documented by the increased investment by large industrial groups in vision research, from Microsoft to Siemens, General Electric, Mitsubishi, Honda etc.<br\/><br\/>Despite such a booming trend, the academic and research community remains heavily fragmented. Researchers come to vision from different backgrounds (mathematics, physics, engineering, computer science, neuroscience) and speak different technical languages (from graph theory to partial differential equations to information theory to dynamical systems and control theory). The community is also heavily segmented into sub-areas with few successful attempts to vertically integrate different approaches. Unlike other disciplines that have a common set of analytical tools and speak a unified language or that have a common set of benchmark tasks, Computer Vision remains a collection of separate approaches to separate problems, with no unifying theory, or even rational comparison between different approaches or common experimental benchmarks. <br\/><br\/>The goal of this workshop is to provide a venue for leading researchers to share their views on the future directions in Computer Vision, draw connections from different areas, and propose ways to help improve the impact of the community in applications that have broad societal consequences.","title":"Frontiers of Vision: A collaborative workshop on Computer Vision and its role in application with broad societal impact","awardID":"0513521","effectiveDate":"2005-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["461021"],"PO":["317663"]},"103187":{"abstract":"A one-day meeting, called the East Coast Computer Algebra Day (ECCAD'2005) is being held at Ashland University in Ashland, Ohio on Saturday, March 12, 2005. The purpose of the meeting is to stimulate interest in and understanding of the technical aspects of computer algebra. Its format provides a forum for those in the region who are active or interested in becoming more active in computer algebra to participate, interact, and meet with each other in an inexpensive and easily accessible way. This meeting is less informal than the annual meetings of the ACM sponsored International Symposium on Symbolic and Algebraic Computation (ISSAC), with ample time for unstructured interaction. Participation by the region's graduate students and junior faculty will be particularly encouraged through special invitation to contribute to the poster sessions, and through travel support. <br\/><br\/>The invited talks and poster sessions contributed by the community are expected to cover the breadth of computer algebra: algorithms, systems, and applications. The contributed posters and software demo sessions will enable researchers, especially junior faculty and graduate students, to publicize their recent findings and to make new contacts.<br\/><br\/>The ECCAD conference always precedes ISSAC for the same year. ECCAD thus provides participants an excellent opportunity to preview and review important research before a major international meeting. As a result of this conference, there is increased research activity in symbolic computation with better representation at ISSAC from the United States, as well as a wider appreciation, interest, and classroom use of computer algebra systems. As has been for past meetings, ECCAD 2005 will be held without any registration fee.","title":"The 2005 East Coast Computer Algebra Day (ECCAD'2005)","awardID":"0501401","effectiveDate":"2005-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[272087],"PO":["321058"]},"94920":{"abstract":"Collaborative Research: Coordinating Robot Teams using Market-Based Mechanisms<br\/><br\/>In the near future, teams of robots will take on tasks in initially unknown environments where human presence is not possible due to safety or cost reasons, including applications where robots have to visit or cover areas in initially unknown terrain, such as mine sweeping and de-mining, search and rescue operations after earthquakes, the exploration of distant planets, and hazardous material cleaning. The efficient and robust coordination of the robots is imperative for all of these scenarios. This project develops and implements methods for the dynamic assignment and re-assignment of tasks to robot teams through the use of combinatorial auctions in the context of exploration tasks in initially unknown environments. Previous work has demonstrated the use of single-item auctions for multi-robot task allocation, in which robots bid on tasks that are auctioned off one at a time. Unfortunately, single-item auctions do not take synergies between tasks into account, which can result in suboptimal task allocations and poor team performance. This project studies more complex auctions, including combinatorial auctions, where robots bid on bundles of tasks. Initial feasibility studies show that combinatorial auctions generally lead to significantly superior team performance compared to single-item auctions, and generate very good results compared to optimal centralized methods. The project focuses on combinatorial bidding strategies which result in team behavior that is efficient, effective, adaptable to dynamic environments, and robust in the presence of error conditions. It also studies alternative winner determination methods for various objective functions, such as minimizing the total travel distance (or energy consumption) and the total time to task completion. This interdisciplinary project between robotics and auction researchers will produce both theoretical and experimental results, in particular, new methods with theoretical analyses of their correctness and efficiency and their demonstration on both simple and complex multi-robot exploration scenarios with real-time requirements. The students involved in this research will learn to work as part of an interdisciplinary team and will deepen their understanding of two usually separate areas of research.","title":"Collaborative Research: Coordinating Robot Teams Using Market-Based Mechanisms","awardID":"0412912","effectiveDate":"2005-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["459792"],"PO":["564316"]},"101020":{"abstract":"Existing solutions for streaming on overlay networks adopt the idea of application level multicast, where participating peers form a topologically aware tree structure to minimize overall delay. These approaches are unable to maximize quality of delivered stream to individual peers because of the inherent bandwidth limitation of the tree structure. This project designs, develops and evaluates a receiver-driven framework to construct \"bandwidth-aware\" overlays for streaming in Peer-to-Peer (P2P) networks, called PALS. PALS departs from the common tree-based approach to overlay construction and allows each peer to independently and selfishly determine the best way to connect to the overlay in order to maximize its own delivered quality. Similar to a group of competing TCP flows, independent and selfishly competing peers in an overlay reach an ``equilibrium'' in which not only delivered bandwidth to each peer is maximized to its fair share of available bandwidth, but also the resulting unstructured overlay is globally efficient. This project investigates three broad areas: (i) techniques for adaptive streaming from multiple congestion controlled senders, (ii) techniques for scalable resource discovery and adaptive resource selection, and (iii) distributed multimedia caching schemes for seamless support of asynchronous peers. Furthermore, this project delivers a prototyped implementation of PALS framework as an open-source modular middleware that will be made publicly available. The prototype enables researchers to conduct Internet-wide experiments and investigate interactions between PALS and various encoding schemes. The prototype also serves as an educational tool in the classroom to bring hands-on experience with P2P streaming technology to students.","title":"CAREER: A Receiver-Driven Framework for Scalable and Adaptive Peer-to-Peer Streaming","awardID":"0448639","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["551080"],"PO":["565090"]},"102012":{"abstract":"The proposed REU site is in the area of Medical Informatics and will address<br\/>issues related to the workflow driven acquisition of image data in an<br\/>electronic medical record environment, and the subsequent post-processing of<br\/>the image information to improve the accuracy and efficiency of the<br\/>consumers of this information, notably radiologists. In particular,<br\/>segmentation, texture analysis, classification and annotation of computed<br\/>tomography (CT) images using computer vision and data mining techniques will<br\/>be emphasized.<br\/><br\/>Since many racial minorities are significantly underrepresented in computer<br\/>science (CS) departments, the primary educational objective is to promote<br\/>graduate studies for bright, talented undergraduates - especially<br\/>first-generation college students and undergraduates from groups<br\/>historically underrepresented in exact sciences. Furthermore, since the<br\/>demand for individuals who see their career opportunities at the<br\/>intersection between Medical Informatics and CS far outstrips the current<br\/>supply, the second educational objective is to promote and encourage<br\/>interdisciplinary undergraduate studies in computer science and medical<br\/>informatics.<br\/><br\/>The MedIX (MEDical Informatics eXperiences in undergraduate research) REU<br\/>site will run for three summers, with eight student participants spending 10<br\/>weeks each summer doing research both at DePaul University, Intelligent<br\/>Multimedia Processing Laboratory and Northwestern University, Feinberg<br\/>School of Medicine, Imaging Informatics Laboratory.","title":"MedIX: MEDical Informatics eXperiences in Undergraduate Research","awardID":"0453456","effectiveDate":"2005-02-01","expirationDate":"2008-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["474244","474245"],"PO":["564316"]},"100880":{"abstract":"Pattern classification is a broad research area with numerous applications ranging from science, engineering, target marketing, medical diagnosis and electronic commerce to weather forecasting. While pattern classification has shown promise in many areas of practical significance, it faces difficult challenges posed by real world problems, of which the most pronounced is the so-called curse of dimensionality: that is, the fact that the sample size required to perform accurate prediction on problems with high dimensionality is beyond feasibility. The goal of this project is to develop novel classification and clustering techniques to mitigate the curse of dimensionality and to reduce bias by estimating feature relevance and selecting features accordingly. In particular, this project has the following specific, measurable objectives: (1) to develop non-linear and flexible metrics for distance-based classifiers via kernel methods; (2) to construct effective ensembles by exploiting local feature relevance to perform adaptive sampling in feature space, and (3) to develop adaptive metrics for subspace clustering by measuring local correlation of data with respect to different dimensions.<br\/><br\/>Given that so many problems of practical interest are high dimensional, this research will have significant impact in fields and applications as diverse as bioinformatics, security and intrusion detection, information and image retrieval. The PI's collaborative effort with biologists for the analysis of microarray data has the potential to contribute new data mining techniques to the HIV genomic knowledge domain, which in turn could eventually contribute to the customized diagnosis and treatment of AIDS.<br\/><br\/>This project involves the training of both undergraduate and graduate students and includes a joint seminar course with the Department of Molecular Biology at George Mason University. The PI aims to facilitate the involvement of underrepresented groups in the science and engineering fields through her active participation in training activities and workshops in cooperation with the Multicultural Research Center at George Mason University.","title":"CAREER: Learning Local Feature Relevance for Pattern Classification and Clustering","awardID":"0447814","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["521348"],"PO":["491702"]},"94967":{"abstract":"Collaborative Research: Coordinating Robot Teams using Market-Based Mechanisms<br\/><br\/>In the near future, teams of robots will take on tasks in initially unknown environments where human presence is not possible due to safety or cost reasons, including applications where robots have to visit or cover areas in initially unknown terrain, such as mine sweeping and de-mining, search and rescue operations after earthquakes, the exploration of distant planets, and hazardous material cleaning. The efficient and robust coordination of the robots is imperative for all of these scenarios. This project develops and implements methods for the dynamic assignment and re-assignment of tasks to robot teams through the use of combinatorial auctions in the context of exploration tasks in initially unknown environments. Previous work has demonstrated the use of single-item auctions for multi-robot task allocation, in which robots bid on tasks that are auctioned off one at a time. Unfortunately, single-item auctions do not take synergies between tasks into account, which can result in suboptimal task allocations and poor team performance. This project studies more complex auctions, including combinatorial auctions, where robots bid on bundles of tasks. Initial feasibility studies show that combinatorial auctions generally lead to significantly superior team performance compared to single-item auctions, and generate very good results compared to optimal centralized methods. The project focuses on combinatorial bidding strategies which result in team behavior that is efficient, effective, adaptable to dynamic environments, and robust in the presence of error conditions. It also studies alternative winner determination methods for various objective functions, such as minimizing the total travel distance (or energy consumption) and the total time to task completion. This interdisciplinary project between robotics and auction researchers will produce both theoretical and experimental results, in particular, new methods with theoretical analyses of their correctness and efficiency and their demonstration on both simple and complex multi-robot exploration scenarios with real-time requirements. The students involved in this research will learn to work as part of an interdisciplinary team and will deepen their understanding of two usually separate areas of research.","title":"Collaborative Research: Coordinating Robot Teams Using Market-Based Mechanisms","awardID":"0413196","effectiveDate":"2005-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["460643","483541"],"PO":["565227"]},"102035":{"abstract":"Computing systems are embedded throughout our environment - in<br\/>applications including \"smart\" appliances, environmental control<br\/>systems, traffic and weather monitoring systems, and medical<br\/>monitoring. Current techniques for controlling these devices employ<br\/>fixed algorithms for sensory processing and for taking subsequent<br\/>action. However, as these devices increase in their complexity,<br\/>computing power, and sensory capabilities, it becomes possible to<br\/>design systems that can automatically adapt their behavior to the<br\/>specific environment and task in which they are embedded.<br\/><br\/>Undergraduate students involved in this multidisciplinary REU Site<br\/>will investigate the use of machine learning techniques in the<br\/>development of a variety of embedded systems. Application areas of<br\/>focus include robot control; assistive, wearable computing systems;<br\/>computer intrusion detection; and on-line weather prediction.<br\/>Students will receive training in a variety of areas, including<br\/>embedded system design, empirical methods for system evaluation,<br\/>statistical machine learning techniques (including supervised and<br\/>reinforcement learning, Bayesian methods, genetic algorithms and data<br\/>mining), sensor processing, control, embedded interfaces, technical<br\/>writing and oral presentation.","title":"REU Site: Embedded Machine Learning Systems","awardID":"0453545","effectiveDate":"2005-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["513358","395382"],"PO":["317663"]}}