{"163780":{"abstract":"Detection, identification, and tracking of CBRNE (Chemical, Biological, Radiological, Nuclear, and Explosive) plumes can be accomplished by combining the modalities of sensor and cyber networks. The sensor network provides information about physical-space activities, e.g., locations and movements of the plume sources. The cyber network provides storage and computational resources to analyze and infer where the plume originated, the trajectory of its movement, and the prediction of its future movement. The challenges in realizing such a sensor cyber network include intelligent sensing (intelligent sensor selection and coverage) and the capability to deal with uncertainties (uncertainty in measurement as well as in modeling). This project proposes to leverage the convergence between the sensor and the cyber networks to achieve these goals. In particular, the plan is to carry out three synergistic research tasks: 1) network formation by sensor selection, placement, and coverage; 2) sensor tasking protocol with temporal\/spatial uncertainty management; 3) protocols for reliable sensor-cyber communication supporting the above two tasks. The PIs will prototype the research results and integrate the prototypes for different components to build the sensor cyber network for plume detection, identification and tracking. They will also evaluate the sensor cyber network using various test scenarios in collaboration with Oak Ridge National Lab. If successful, the project will provide technology for building detection and tracking sensor networks that can give great protection to people and the environment against harmful plumes.","title":"NeTS: Medium: Collaborative Research: Building an Intelligent, Uncertainty-Resilient Detection and Tracking Sensor Network","awardID":"0964086","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["438434","550639",438434],"PO":["565303"]},"163692":{"abstract":"Traditional security authorization decisions are black and white: a user either satisfies a particular access policy or does not. This rigidity is a handicap in our complex and unpredictable world. As a result, even security-conscious organizations typically grossly overprovision principals with access rights and\/or underconstrain access policies to ensure that principals can always carry out the organization's mission effectively and respond to unexpected opportunities and challenges. This project focuses on developing dynamic and risk-aware approaches to access control that allow organizations to make security-critical decisions in the face of incomplete information and unexpected circumstances. This is accomplished by combining proof-theoretic access controls with economic models of risk. In the event that the expected proof of authorization for an action cannot be generated, the systems developed in this project carry out an efficient search for similar proofs of authorization that minimize the overall risk incurred by deviating from the expected. This approach allows policies to adapt dynamically to the changing context of the systems in which they are deployed. This research will have several benefits, including increased system availability during disasters or other uncommon cases not explicitly modeled by policies; reduced instances of permission creep, as overprovisioning users is no longer required to ensure that an organization's business needs are met; a quantifiable means of assessing how policies are actually used and how they might be changed to better reflect the evolution of organizations; and the development of metrics for assessing access control risks.","title":"TC:Medium: Collaborative Research: Towards Formal, Risk Aware Authorization","awardID":"0963715","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["438434","438434","548254"],"PO":["565264"]},"164495":{"abstract":"The objective of this project is to develop in-depth understanding of the nature, underlying models, and dynamics of Social Network Services (SNS) with millions and even billions of users. Methods for the analysis of massive SNS graphs using signal processing and information-theoretic techniques are being designed to answer fundamental questions regarding SNS. The goal is to develop new approaches for (i) identifying influential nodes in SNS networks, and understanding how these nodes evolve and interact over time, (ii) inferring people?s social graphs from SNS graphs, and (iii) inferring properties of an SNS network from analyzing another SNS graph. To achieve these objectives, signal-processing inspired and information\/graph theoretic approaches are being employed for: (a) projecting information contained in massive SNS graphs onto compact representations; and (b) understanding how different graphs (e.g., representing different time-instances of a social network service or representing different services) relate to each other.<br\/><br\/>This research enables a spectrum of novel applications that are currently impossible. A deeper understanding of the structure of social networks and how that structure evolves can be applied to a variety of social issues. The project is interdisciplinary in nature and it bridges several different communities including electrical engineering, computer science, and social science; and it fosters interaction and communication among them. To promote education and learning, this project actively engages high school, undergraduate, and graduate students, especially students from under-represented minorities.","title":"SoCS: Signal Processing and Information Theoretic Approaches to Denoising and Demystifying Social Network Services","awardID":"0968495","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7953","name":"SOCIAL-COMPUTATIONAL SYSTEMS"}}],"PIcoPI":["529586","562296","554511"],"PO":["565342"]},"162680":{"abstract":"This proposal supports the acquisition of an Azul Vega 3 compute appliance<br\/>for research on developing an open-source general-purpose transactional<br\/>infrastructure for high-level managed languages. This appliance is equipped<br\/>with hundreds of processor cores, substantial memory, and bandwidth<br\/>availability. The cores compute in a flat SMP configuration, simplifying<br\/>programmability and management. The appliance has a number of novel<br\/>features including hardware support for concurrent garbage collection, and<br\/>optimistic lock elision that provide critical building blocks for efficient<br\/>transactional memory (TM) support. The project's research agenda is to<br\/>explore new approaches to scalable parallel program construction that<br\/>exploits underlying hardware primitives that mask or mitigate critical<br\/>bottlenecks that have thus far hampered effective scalable software<br\/>transactional memory systems.<br\/><br\/>The project will use the novel features of the Azul appliance to (i) explore<br\/>new language abstractions with special focus on scalability of transactional<br\/>applications; (ii) understand how primitive support for garbage collection<br\/>and transactions influence algorithm and application development built using<br\/>these abstractions; (iii) examine the impact of these mechanisms on<br\/>compiler and runtime design; and (iv) develop a large number of benchmarks<br\/>and workloads to better understand TM performance characteristics.<br\/><br\/>This project is part of a larger NSF-funded effort to catalyze TM research,<br\/>which in turn is a key technique to improving software development for<br\/>general-purpose parallel computers. Widespread adoption of new scalable<br\/>concurrency abstractions such as transactional memory is an essential<br\/>component in the technology roadmap of major industry players, and the focus<br\/>of much attention in academia.","title":"II-New: A Computational Infrastructure for Scalable Transactional Memory Abstractions in Managed Languages","awardID":"0958465","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["549800","549800","558390"],"PO":["565272"]},"169765":{"abstract":"This proposal requests funds to help support travel and meeting costs for students and early career scientists at U.S. institutions to the 28th International Conference on Mathematical Geophysics ?Modelling Earth Dynamics: Complexity, Uncertainty and Validation? to be held in June 7-11, 2010 in Pisa, Italy. The conference website is http:\/\/cmg2010.pi.ingv.it\/index.html. <br\/><br\/>This conference brings together Earth scientists from across the disciplines with physicists, applied mathematicians, and computational scientists to discuss advances in mathematical and computational techniques for understanding properties and processes in the Earth. This year?s meeting emphasizes aspects of the mathematical modeling of the Earth dynamics, with particular enphasis on the use and effectiveness of models in predicting environmental phenomena. This meeting provides a single multi-disciplinary forum for the exchange of ideas and techniques across the disciplinary boundaries in the Earth Sciences. Funds are requested to support travel and lodging costs for 9 students, post-docs, and early career scientists which is approximately one third of the number attending past meetings. <br\/><br\/>This meting is highly interdisciplinary and international in nature and provides an important opportunity for U.S. students and early career scientists from across the earth sciences and applied mathematics to interact with senior scientists in a small informal setting. We will directly contact faculty members in Geophysics in universities and colleges that have a large number of students from under-represented groups, to encourage their students and collegues to apply for a travel and lodging grant to attend the conference. This year there will also be an increased emphasis on the use and effectiveness of mathematical models in predicting environmental phenomena. This topic is of great interest not only to the scientific community but to the whole humanity, as the outcome of Earth models impacts the decisions of governments regarding the human induced changes on landscapes and climate.","title":"28th Conference on Mathematical Geophysics: Request for Student and Early Career Scientist Support","awardID":"1023675","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1574","name":"GEOPHYSICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}}],"PIcoPI":[454370],"PO":["565374"]},"172340":{"abstract":"This travel grant requests funds to support graduate student travel to the Symposium on Programming Language Design and Implementation (PLDI). This is a top conference in Computer Science for research and education in the core areas of Software and Hardware Foundations program. The funds enables students to hear the latest results in the field, meet established researchers, and build community with the next generation of researchers.","title":"Funding to Support Student Attendees to Programming Language Design and Implementation (PLDI) 2010 Conference","awardID":"1038326","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":[461768],"PO":["564388"]},"163881":{"abstract":"The centerpiece of this project is the design, development, and evaluation of computational representations and algorithms for making software agents that are organizationally adept. An organizationally-adept agent is not only aware of its role(s) in an organization, but can also monitor how well it is fulfilling its organizational responsibilities and can proactively adapt its behaviors to meet organizational needs better. Organizationally adept agents evaluate their behaviors based not on their (agent-centric) self-interests but rather on their (organization-centric) responsibilities to each other, and autonomously adapt to achieve organizational objectives emergently. <br\/><br\/>Elaboration and adaptation by organizationally adept agents means that the ultimate organization design is formed by a combination of top-down design (to produce a \"ballpark\" organization) and emergent refinement processes. Further, this combination can be iterative and ongoing, where organizationally adept agents can detect tension between top-down and emergent influences, and inform the design processes of runtime interaction patterns and environmental tendencies that suggest useful top-down organization restructurings. <br\/><br\/>The intellectual problems being pursued are central to practical issues in scaling multi-agent systems to help solve complex, long-term, global problems. Many critical challenges facing society including climate change, health care, and sustainable energy|require a prolonged commitment to monitoring and managing distributed activities. Networked computer systems populated by software agents, which can be constantly measuring, comparing, and interpreting information to understand and respond to wide-scale phenomena, promise to address such challenges, but need the kinds of innovations proposed in this project. Second, while the project is specifically looking at organizations for computational agents, our results will inform, and be informed by, research on human organizations. To stimulate sharing insights and results, the investigators will organize a multi-disciplinary symposium on organization-centric reasoning, and will train an inter-disciplinary cohort of graduate students.","title":"RI: Medium: Collaborative Research: Creating Organizationally Adept Software Agents and their Organizations","awardID":"0964590","effectiveDate":"2010-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["485591",438712],"PO":["565035"]},"166005":{"abstract":"This CISE REU Site award provides funding to Texas A&M University-Corpus Christi, a Hispanic Serving Institution on the Texas Gulf Coast, to offer research experience in applied computing to 24 undergraduate students of primarily Hispanic descent. The students will participate in deriving solutions for technological challenges faced by researchers in the collection, storage, and analysis of data from marine and aquatic environments of the coastal region. The primary objective of the program is to provide participants unique research experiences in a stimulating environment that will involve designing, developing, adapting, and testing wireless sensor networks for data gathering operations from marine and aquatic environments. Activities include training sessions and social events designed to enhance group cohesiveness and to hone technical writing, communication, and leadership skills. Primary research activities will occur in the areas of design of marine sensor networks, reliability and security of marine sensor networks, and integration of marine sensor data from a variety of domains on the Gulf of Mexico. The participants will write and present research papers on their work in local, regional, and national symposiums. <br\/><br\/>The intellectual merit comes from student participation in a unique marine-based research program that seeks solutions for survivable, secured, and reliable design of sensor networks for marine environment; energy-efficient sensor data gathering for marine applications; and integration of marine sensor data from a variety of domains on the Gulf of Mexico. The students participate in projects that have the potential to impact the field and to make a contribution to the university's efforts to become a global leader in research on the Gulf of Mexico and its resources. <br\/><br\/>The broader impacts of the proposed program will extend beyond the project in a number of ways. These experiences should instill in the students a passion for research in applied computing for environmental applications and should motivate them for further learning and discovery in the computing disciplines. The project has the potential to increase retention rates of science, technology, engineering, and mathematics (STEM) majors. The project should also broaden inter-institutional collaboration, particularly among Hispanic serving institutions nationwide and will advance science and technical knowledge on sustainable marine resource utilization and preservation globally.","title":"REU Site: Applied Computing Research in Wireless Sensing of Marine Data","awardID":"1004902","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":[444744,"559273",444746],"PO":["564181"]},"168249":{"abstract":"US-China Workshop on High Performance Computing Application Acceleration<br\/>The Arctic Region Supercomputing Center (ARSC) at the University of Alaska Fairbanks and Chinese colleagues will organize a US-China workshop on application acceleration for high performance computing (HPC) applications. This workshop, to be held in Beijing in October 2010, will address challenges for achieving efficient application performance on HPC systems. These challenges have grown, mainly due to the prevalence of multicore processors and acceleration hardware such as GPUs and the Cell processor. The common interests of Chinese and American scientists in responding to issues of application acceleration have been confirmed through collaborative workshop planning, and some face-to-face visits, but there are few regular opportunities for scholarly communication between US and China researchers on these topics. The workshop will bring US leaders in acceleration technologies to China for three days of scholarly communication and collaboration, with a specific goal of identifying mutually interesting topics for ongoing collaborative research projects. The workshop will include faculty, students, junior researchers, and senior researchers, with participants from underrepresented groups.<br\/>Application acceleration in high performance computing is not a solved problem. Some of the same acceleration technologies used in new high performance computing (HPC) systems are found in today?s desktop and notebook computers, including GPUs and multicore processors. However, HPC systems are thousands of times larger, and the programs that run on them need more effective communication among the various components and methods for dividing the computation across the system, and other issues such as dealing with very large output and the potential for individual components to fail need to be addressed. The workshop will bring together experts from the two countries to share their views on the state of the art in application acceleration, with the goal of enhancing scientific discovery and analysis through high performance computing. After the workshop, the US and China participants will pursue joint research projects and scientific collaborations. This workshop is supported by the NSF Office of International Science and Engineering with co-funding from the Computing and Communication Foundations Program of the Computer and Information Science and Engineering Directorate.","title":"US-China Workshop on Acceleration of High Performance Computing Applications","awardID":"1015931","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["543243"],"PO":["399099"]},"167964":{"abstract":"This project synthesizes and advances understanding about the impacts of copyright policy in the digital environment, particularly on innovation. There is a particular focus on identifying what empirical studies could shed light on some of the most contentious issues in copyright policy. Copyright directly impacts a broader range of industries than patents -- publishing, recording, films, games, and software among others -- as well as virtually all activity on the Internet.<br\/><br\/>Four sets of outcomes are generated. The first is a set of commissioned papers on topics including a review of existing literature, an estimation and categorization of the scope of economic activity affected by copyright and its exception, a theoretical analysis of how copyright may stimulate or inhibit innovation, and at least one case study of the role of copyright and digital media in an industry undergoing disruptive change. The second is a public workshop on the topic of the impact of copyright policy on innovation. The third is the development of an online discussion forum. The final is a peer-reviewed report with recommendations for public and private funding agencies and institutions. <br\/><br\/>Intellectual Merit: In contrast to scholarship on some other elements of the innovation system, theoretical analysis of and empirical research on the impact of copyright policy has been very limited. Research in the area is urgently needed, since copyright policy affects a large and diverse range of economic activity. <br\/><br\/>It is critically important that we learn more, since the rules of copyright evolved for the most part in a pre-1990 era when the number of authors and publishers was small relative to the entire population, each instance of a creative work had a physical manifestation, the uses to which works could be put were known and relatively narrow, collaboration to produce a work generally required physical co-location or the repeated exchange of physical objects, and infringing copies were somewhat difficult to produce and distribute. As a result of the Internet, the number of authors approaches the size of the population, most works exist in non-physical form as a collection of bits, works can be readily excerpted, altered, and combined in limitless variety, reproduction and distribution are essentially cost-free, and collaboration can occur on a vast scale across differences of time and location.<br\/><br\/>The project stimulates such research by convening a community of interested scholars and potential funders to evaluate recent and ongoing work, identify policy relevant topics for future research, and explore the potential for developing new datasources, such as the creation of a new litigation database, and new methods. <br\/><br\/>Broader Impacts : The approach should stimulate the emergence of a multi-disciplinary community of scholars. A similar effort led to the growth of a community of patent scholars who are now very active participants in the patent reform debate. The result should be to create a better informed, more empirically and theoretically grounded, policymaking in the area of copyright law in the United States and globally.","title":"The Impact of Copyright Policy on Innovation in the Digital Era","awardID":"1014801","effectiveDate":"2010-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0401","name":"Division of SBE Off of Multidisciplinary A","abbr":"SMA"},"pgm":{"id":"7626","name":"SCIENCE OF SCIENCE POLICY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["452484"],"PO":["565013"]},"166798":{"abstract":"Abstract<br\/><br\/>IIS - 1008285 <br\/>Digitization and Virtual Restoration of Deteriorating Photographic Materials <br\/>Eastern Kentucky University<br\/>Landon, George V. <br\/><br\/>The goal of this project is to develop a novel method to digitize and virtually restore rapidly deteriorating cellulose acetate film negatives. Working in close collaboration with the University of Kentucky?s Center for Visualization, the Principle Investigator at this primarily undergraduate institution will conduct research in to develop advanced computational models for deteriorating images on unstable and disintegrating media. A successful solution will produce a framework to non-destructively acquire and preserve vast collections of photographic records created from the early 1900s to the 1950s. At the same time, it will provide economic alternatives to memory institutions and research institutions that rely upon the content of the photographs for a variety of scholarly purposes.","title":"EAGER: Digitization and Virtual Restoration of Deteriorating Photographic Negatives","awardID":"1008285","effectiveDate":"2010-06-15","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[446712],"PO":["565227"]},"159637":{"abstract":"Computing - Other (35)<br\/>Due to rapid technological advances in the sciences, software is becoming a 'black box' to the scientist. However, it is essential for scientists to understand the benefits and limitations of the technology that supports their work. This knowledge is not currently taught in typical technology courses. The goal of this project is to make future scientists more intelligent users of computing technology in their practice of science. This is achieved by introducing students to computational thinking in the areas of algorithms, data representation, abstraction, performance issues and database concepts. <br\/><br\/>Expected outcomes include fifteen learning modules designed for students in a variety of disciplines including computer science, biology, mathematics, chemistry, engineering and geology. The modules can be delivered in three ways: 1) as part of a comprehensive and interdisciplinary course, 2) as stand-alone modules suitable for use in existing science courses, and 3) as self-paced web tutorials to support student exploration. Materials can be adopted by many institutions with undergraduate programs in the sciences. The project has the potential to improve undergraduate science education by promoting the integration of computing concepts and science pedagogy.","title":"Computing Foundations for the Scientist","awardID":"0942362","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1536","name":"S-STEM:SCHLR SCI TECH ENG&MATH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7494","name":"CCLI-Type 1 (Exploratory)"}}],"PIcoPI":[426961,426962,426963,"503777",426965,426966],"PO":["543064"]},"162970":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009(Public Law 111-5).\"<br\/>Proposal #: 09-59985<br\/>PI(s): Adjouadi, Malek; Barreto, Armando B.; Gaillard,William; Jayakar,Prasanna; Rishe, Naphtali D.<br\/>Institution: Florida International University <br\/>Title: MRI-R2\/Dev: Instrument for Information Science and Computing in Neuroscience<br\/>This project, developing an instrument for information processing and computing that enables cohesive study of the brain, involves the new concept of a 5-D brain processing platform while addressing the challenge of finding the best way to put together five dimensions to provide a complete picture of brain dynamics. This unified approach brings together fields of Computer Engineering, Computer Science, Electrical Engineering, and Bioengineering to create an instrument for precisely measuring and visualizing significant information and results across the five dimensions, three from spatial data, time, and an imaging modality that serves as the fifth dimension. Accomplishing this mission involves advanced designs, hardware-software integration mechanisms, and novel interfaces that bring competing, and sometimes diverging, technologies into a unified brain research platform. Combining a Multi-site Data Repository, Modality Integration and Computational, Visualization, and Operation Support Units, this new instrument is expected to bring:<br\/>- New insights into brain structure, functional correlations and dynamics, both in its normal state and under specific pathological conditions,<br\/>- Far improved mapping of patterns of brain activity,<br\/>- Integration of multimodal technologies in order to augment their capabilities with new insights while consolidating high spatial resolution with high temporal resolution,<br\/>- Database design and management augmented with mechanisms for fast user interaction and visualization to meet the challenge of managing complex spatio-temporal datasets, posing complex queries, and establishing effective methods for data representation and visualization, and<br\/>- Resolution of those paradigms that confront heavy computational requirements and compatibility problems that arise from the use of different recording modalities and diverse software platforms.<br\/>The project aims to collectively overcome the primary barriers in identifying the different factors that influence the functional organization of the brain and its underlying pathology. As an example, it delves in the epileptic seizure that can be mapped over time as it moves along specific fiber tracts that may enable better identification of specific areas of treatment and consequently protect functionally important parts of the brain during surgery that may lead to better and safer outcomes.<br\/>Broader Impacts: <br\/>Fostering an environment that supports cross disciplinary initiatives, joint collaboration and programs, the instrument establishes a research platform that enables academic institutions and hospitals to investigate multi-site collaborative studies in accordance to systematically administered standardize protocols to a database of common assessments and measures. The project extends the breadth and depth of multidisciplinary efforts including new paradigms and findings. Moreover, the project advances the education, research, and training of many students in a minority serving university.","title":"MRI-R2: Development of an Instrument for Information Science and Computing in Neuroscience","awardID":"0959985","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["558108","558105",435839,435840,435841],"PO":["557609"]},"172694":{"abstract":"Humans, animals and insects have an innate ability to perceive and take <br\/>advantage of symmetry, which is a pervasive phenomenon presenting itself <br\/>in all forms and scales in natural and man-made environments. Although <br\/>our understanding of repeated patterns is generalized by the mathematical concept of symmetries and group theory, perception and recognition of symmetry has yet to be fully explored in machine intelligence and computer vision, and few effective computational methods are available today. <br\/><br\/>In response to a resurging interest in computational symmetry with the vision community, this timely and unique workshop\/tutorial\/competition is organized to investigate this potentially powerful intermediate level tool.<br\/><br\/>The event has three main parts:<br\/>(1) a multidisciplinary perspective on the importance and lasting impact of symmetry, presented by a worldwide group of distinguished speakers;<br\/><br\/>(2) a detailed summary of the mathematical theory, state of the art algorithms and a diverse set of applications (successes and failures); and<br\/><br\/>(3) the algorithms and the outcome of the symmetry detection competition, presented by the top three performers on the benchmarked symmetry detection algorithm competition.<br\/><br\/>Active participations by computer vision researchers, especially graduate students, in this event are expected, leading to broadened understanding and appreciation of symmetry in all participants, as well as an acute and lasting impact to their research and their use of computational symmetry tools. A website with the content of the workshop\/tutorial, the competition process and final results is set up before and augmented after the workshop, for public access.","title":"Workshop\/Tutorial\/Competition: Computational Symmetry in Computer Vision","awardID":"1040711","effectiveDate":"2010-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["531866"],"PO":["564316"]},"163872":{"abstract":"This project focuses on the design of an infrastructureless<br\/>communication system that makes it easy for people without expertise<br\/>in computer security to safely communicate with friends and family<br\/>members without being subjected to third-party surveillance,<br\/>censorship, propaganda, or reprisal. The primary goals of this work<br\/>are to (1) further open access to information people require to<br\/>educate themselves and (2) make sharing information easier.<br\/>Particular attention is paid to designing protocols that do not rely<br\/>on centralized control points, which are subject to attack. The<br\/>influence of patterns in human behavior on communication system<br\/>performance, energy efficiency, and security are being studied, and<br\/>the findings used to guide the development of better, user-aware,<br\/>communication protocols. Design and analysis of communication<br\/>protocols; defenses against side-channel attacks on portable<br\/>communication devices; distributed system architecture; and<br\/>energy-efficient software systems play central roles in the work.","title":"TC: Medium: Collaborative Research: WHISPER - Wireless, Handheld, Infrastructureless, Secure Communication System for the Prevention of Eavesdropping and Reprisal","awardID":"0964545","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["550572","549845"],"PO":["565239"]},"163894":{"abstract":"Pay-as-you-Go investigates security and privacy for Integrated Transportation Payment Systems (ITPS). The research addresses integrated payments for trains, subways, buses, ferries, and recharging of electric cars, as well as toll collection for roads, bridges, and tunnels. Multi-disciplinary aspects include novel cryptographic protocols and lightweight implementations of privacy-preserving payment systems. Challenges include providing security and privacy in a low-cost, usable, and reliable manner. Payments for transportation differ significantly from general-purpose e-commerce in terms of both security and engineering constraints. For instance, transportation operators wish to observe user behavior to improve the overall performance of the system---seemingly contradicting privacy. Moreover, payment devices must be extremely cheap, mass produced, and tolerant of a wide range of passenger demands.<br\/>The expected results and activities include: (1) design of novel cryptographic algorithms achieving privacy at low cost while retaining the benefits of meaningful data collection for ITPS; (2) implementation of hardware and software to perform modern cryptographic operations on low-cost devices; and (3) testing of human factors and performance under realistic conditions that must balance security and privacy with cost and usability. The broader impacts are extensive as transportation systems are a critical part of most aspects of society, from the economy, to defense, to public safety. Moreover, information gathered from ITPS applications can facilitate advanced traffic management, travel time estimation, emergency management, congestion pricing, carbon emissions control, and environmental justice assessments. A substantial outreach plan builds on the research team?s significant experience working with transportation professionals in industry and government.","title":"TC: Medium: Collaborative Research: Pay-as-you-Go: Security and Privacy for Integrated Transportation Payment Systems","awardID":"0964641","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["549951",438749,438750,"554404"],"PO":["565264"]},"164511":{"abstract":"The Internet makes possible a different kind of design, based on a new phenomenon: crowdsourcing creativity, where many individuals perform small design tasks for fun, nominal compensation, or both. What if the iterative application of a crowd's energy is used to generate, combine and refine ideas and possible solutions to social and technical problems? If the sequential application of crowdsourcing to idea generation works well, then many difficult design challenges might be addressed. If crowdsourcing has limits, then finding these limits will provide a more focused path for the growth of peer production. During the course of this project, participants, drawn from the general public, will generate initial ideas, then combine the many different ideas of their peers, seeking to solve difficult and open-ended design problem through a large scale process of combination, evaluation, selection, and combination again, cycling through these steps until a solution is converged upon. <br\/><br\/>The Intellectual Merit of this research lies in the design and results of experiments that study crowdsourcing in the idea discovery process. The Broader Impact of this research lies in its potential harnessing of human intellectual power to attack challenging problems whose solution will affect every one of us. The project is potentially transformative, in that the crowdsourcing of important problems might accelerate by orders of magnitude our progress on pressing social and technological issues.","title":"SoCS: Crowdsourcing Creativity: Experiments in Design","awardID":"0968561","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7953","name":"SOCIAL-COMPUTATIONAL SYSTEMS"}}],"PIcoPI":["514875","529981"],"PO":["565227"]},"168933":{"abstract":"The North American Summer School in Logic, Language, and Information (NASSLLI) will be held June 21-26, 2010 at Indiana University, Bloomington. NASSLLI is a week-long event including thirteen five-hour graduate-level courses given in parallel sessions, two associated workshops, and a session for student papers. The school has run several times in the past and aims to establish itself as a biannual event. The general areas of emphasis for the school are at the intersection of linguistics, philosophy, and computer science, specifically applied logic, computational linguistics, as well as broader themes from cognitive science.<br\/><br\/>NASSLLI is an interdisciplinary event, designed to foster interactions and provide instruction in ways that would be difficult in traditional academic departments. Most of its topics are not standardly taught at many colleges and universities in the USA and smaller institutions frequently do not have faculty with multi-disciplinary research experience. The summer school will give post-doctoral students, graduate students, and even advanced undergraduates the chance to interact with faculty who are active researchers and leaders in their fields. The school aims to expose the next generation of researchers in linguistics, philosophy, and computer science to a vibrant interdisciplinary research atmosphere, at the same time as it gives them the tools to advance their learning.","title":"North American Summer School in Logic, Language and Information (NASSLLI) at Indiana University","awardID":"1019206","effectiveDate":"2010-06-15","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1268","name":"FOUNDATIONS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["505436","520487"],"PO":["564343"]},"171881":{"abstract":"The fact that 6 vehicles completed a recent Urban Challenge competition, autonomous driving on city streets, clearly demonstrated that autonomous vehicles that can be built to deal with the complexities of driving. The technologies showcased, impressive as they were, need to be significantly enhanced to work dependably in the real world. Vehicles controlled by ever-vigilant cyber-physical systems can lead to significant declines in accidents and resulting deaths\/injuries; compensate for human error, distraction, or reduced reaction rates; reduce hours spent in traffic congestion and improve traffic flow; and thereby increase productivity and independence for many segments of the population. However, these platforms and technologies must be deemed robust before widespread adoption can even begin to take place.<br\/><br\/>This EAGER research grant enables a direct and timely interaction between the Carnegie Mellon University research team and the U.S. automotive industry to explore challenges that must be overcome before autonomous and highly-automated vehicles can be safely deployed in real-world driving situations. Challenges include (a) cyber-physical interactions inside the automobile such as ensuring the timely, safe and reliable operations of sensors, actuators, computers, communication buses\/networks, electrical power, and cabling interfaces, necessitating a dependable, real-time cyber-physical platform, (b) real-time communications to\/from the automobile, using vehicle-to-vehicle (V2V) and vehicle-to-infrastructure (V2I) networks to coordinate behaviors with other vehicles when necessary and to obtain\/react to information about traffic or accident conditions, traffic lights, and signs, (c) safe behaviors with built-in recovery and safety-enhancement mechanisms to deal with unforeseen road conditions. The research pursues contributions in sensor fusion with dynamic object detection\/recognition, safe dynamic behaviors under ever-changing operating conditions, vehicular networks, joint cyber-physical system modeling, analysis\/simulation tools, dynamic map-building, end-to-end resource management, and safety-critical real-time fault-tolerant distributed cyber-physical platforms.","title":"EAGER: Core Capabilities for Smart Cars","awardID":"1035452","effectiveDate":"2010-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["461012"],"PO":["565255"]},"170253":{"abstract":"The objective of this planning visit is to explore and identify potential collaborations in robotics with specific emphasis on rehabilitation robotics, humanoids and medical robotics, in the United Arab Emirates, Saudi Arabia and Qatar, and to meet with the researchers, administrators and government officials there to discuss future research collaborations. Rehabilitation and assistive robotics are active research fields that can significantly change the lives of the elderly and individuals with physical disabilities. A U.S. team of 4 faculty members has been assembled. The team is well qualified to address the objective and has expertise in broad robotics areas including rehabilitation robotics, assistive technology, kinematic and dynamic synthesis, smart and intelligent systems, computer vision and sensing, robotic control, and mechanism design. Immediate outcome of this Planning Visit will be a report summarizing the findings and recommendations for potential collaborations. We anticipate proposal submissions (e.g. NSF PIRE) aimed toward long-term goals to continue international collaborations. Our visit is expected to be \"ambassador-like\" and not just purely academic. It is a ?fact finding\" mission to potentially pave the way for increased US-Gulf collaborations in areas of NSF CISE interest. This planning visit is funded jointly by IIS and the Office of International Science and Engineering (OISE).","title":"Middle East Robotics Research Collaboration Planning","awardID":"1026141","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["522399","563997"],"PO":["543539"]},"162630":{"abstract":"Software testing techniques are fundamental to the development of dependable software. Computer scientists studying testing techniques must be able to evaluate and compare them empirically, and this requires access to a wide range of infrastructure support including programs, program versions, test suites, and fault data. <br\/>This project provides that support, focusing on test generation and on software domains that are increasingly important: concurrent and distributed systems, software product lines, and web services. The PIs are collecting and constructing systems, specifications, version attributes, test attributes and fault attributes relevant to these domains, and organizing them in formats that allow computer scientists to utilize them efficiently in controlled experiments. <br\/>Th PIs are embedding these artifacts in the existing Software-artifact Infrastructure Repository (SIR), a repository established under prior NSF support to facilitate experimentation with deterministic C and Java systems. They are also enhancing SIR's support for community contributions, by providing moderated write access to the repository; this will be expanded in the latter years of the project, following the spirit of open-source models for system management. The infrastructure being assembled enables several <br\/>specific research and educational projects related to software testing, by the project researchers themselves and by the software engineering research community as a whole.","title":"Collaborative Research: II-EN: Infrastructure Support for Software Testing Research","awardID":"0958231","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["550525"],"PO":["565272"]},"162872":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59382<br\/>PI(s): Fisher, Robert T.; Cowles, Geoffrey; W., Gottlieb; Sigal, Khanna, Gaurav; Wang, Cheng<br\/>Institution: University of Massachusetts-Dartmouth <br\/> North Dartmouth, MA 02727-2300<br\/>Title: MRI-R2: Acquisition of a Heterogeneous Terascale Shared Campus Computing Facility<br\/>Project Proposed :<br\/>This project, acquiring a heterogeneous terascale parallel computer cluster incorporating graphics processing units (GPUs), services an inter- and multi-disciplinary group of mathematicians and computational scientists and engineers, and their undergraduate and graduate students. This shared campus research instrument leverages an existing small-scale cluster without GPUs at UMass-Dartmouth resulting in a combined system of more than four times the size. <br\/>Specifically, the proposed cluster contains 32 8-way nodes (256 cores) plus one NVIDIA Tesla GPU per node for a total of 32 GPUs. The cluster is not intended to be a general computing resource, but rather highly specialized instrument necessary for the development of high-performance algorithms for scientific computation by the group of researchers in the proposal. Researchers will take advantage of the incorporation of the GPUs in each node to develop hybrid parallel and many-core-architecture-based computing. The investigators will abstract out these GPU-accelerated solvers into an open source GPU Scientific Library (GPUSL), which will be cleanly separated from the overlying simulation codes through a set of well-defined interfaces. <br\/>Faculty members from the Physics, Mathematics, Marine Science and Civil Engineering departments at UMass-Dartmouth have formed a scientific computing group that will become the core management and user group of the shared computational resources. The research foci of the group range from Evolution of Giant Molecular Clouds (using the FLASH code) to Coastal Ocean Modeling (using the FVCOM code) to the Simulation of an Incompressible Turbulent Convective Fluid. Activities of this group include research collaborations, weekly team meetings for the sharing of expertise on numerical algorithms, co-advising of students, and a development of a multi-disciplinary doctoral program. <br\/>The cluster will be housed in the Campus Information Technology Services (CITS) data center at UMass-Dartmouth, and directly supported by the CITS Enterprise Systems Administration Team. This team will be responsible for preventive maintenance session backup and recovery of user disk space. The access to the machine and its allocation will be handled by a Research User Group Committee which will be responsible for soliciting proposals from faculty members seeking computer time and will also be responsible for balancing the research needs of the faculty, graduate, and undergraduate students in the user base.<br\/>Broader Impacts: <br\/>The availability of this cluster allows for the training of the next generation of high performance computing experts, and supports a new interdisciplinary Ph.D. program in computational science, currently in development. Graduate students benefit from the opportunity to develop cutting-edge parallel and GPU-accelerated algorithms for a variety of challenging physical problems, in a multi-disciplinary setting. The cluster also directly benefits undergraduate education, as part of the NSF-funded Computational Science for Undergraduate Mathematics Students (CSUMS) project, which aims to prepare undergraduate students for, and engage them in, a sustained research experience in computational mathematics. The approach is to recruit promising high school seniors, then guide freshman and sophomores students through research topics in computational science, and culminate by mentoring seniors through carefully selected research projects.<br\/>In addition, UMass-Dartmouth has a successful tradition of broadening higher-education access to underrepresented students through its College Now Steps Toward Abstract Reasoning and Thinking (START) program. Over its 40-year history, the program has played a significant role in broadening STEM access to disadvantaged students to women and underrepresented minorities; in particular, approximately 25% - 30% of START students in recent semesters are underrepresented minority persons of color. For the scientific community, all computer codes developed on this enabling cluster, including the GPU Software Library, will be released via a dedicated website, immediately impacting more than 2500 researchers worldwide who use the community codes FLASH and FVCOM.","title":"MRI-R2 : Acquisition of a Heterogenous Terascale Shared Campus Computing Facility","awardID":"0959382","effectiveDate":"2010-06-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["463149","542646","190556","556162","474415"],"PO":["557609"]},"162663":{"abstract":"Natural language processing, information extraction, information<br\/>integration and other text processing solutions are central components<br\/>of computer science, and key tools for addressing the ever-increasing<br\/>problems in information overload. Issues of information overload are<br\/>not only personal problems, but critical for business productivity,<br\/>national defense, and increasingly government decision-making and<br\/>transparency.<br\/><br\/>State-of-the-art natural language processing is increasingly based on<br\/>machine learning. However, the methodologies can be complex, and<br\/>software infrastructure necessary for such systems is generally<br\/>difficult to develop from scratch. To address this need we have<br\/>created MALLET (MAchine Learning for LanguagE) and FACTORIE (Factor<br\/>graphs, Imperative, Extensible), open-source software toolkit that run<br\/>in the Java virtual machine. They provide many modern<br\/>state-of-the-art machine learning methods, specially tuned to be<br\/>scalable for the idiosyncrasies of natural language data, while also<br\/>applying well to many other discrete non- language tasks.<br\/><br\/>The project will fill three critical gaps: (1) broadening these<br\/>toolkits' applicability to new data and tasks (with better end-user<br\/>interfaces for labeling, training and diagnostics), (2) greatly<br\/>enhancing their research-support capabilities (with infrastructure for<br\/>flexibly specifying model structures), and (3) improving their<br\/>understandability and support (with new documentation, examples,<br\/>online community support).<br\/><br\/>The project will have a direct positive impact on NLP and other<br\/>machine learning research, on teaching, and on collaborative research<br\/>activities. Well-designed toolkits not only help researchers avoid<br\/>duplicate implementation effort, but (a) they encourage sharing of<br\/>algorithms and code, and thus also cultivate increased collaboration<br\/>and intellectual flow of ideas; (b) they foster the communication of<br\/>detailed clarity of algorithms and scientific reproducibility; (c)<br\/>they help \"level the playing field\" by providing state-of-the-art<br\/>implementations of foundational building blocks and recent methods to<br\/>top-tier and small institutions alike; (d) they supply a teaching<br\/>tool, not only by making it easy for students to experiment with the<br\/>supplied research methodologies. Furthermore, by providing multiple<br\/>ready-to-use systems, non-programmers will have access to modern,<br\/>scalable implementations of text processing tools that will spread<br\/>knowledge and use of these techniques across fields, to the social<br\/>sciences, humanities, and bio-medical fields.<br\/><br\/>For further information see the project web site at the URL:<br\/>http:\/\/www.cs.umass.edu\/~mccallum\/nsf-mallet","title":"CI-ADDO-EN: Flexible Machine Learning for Natural Language in the MALLET Toolkit","awardID":"0958392","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["460641"],"PO":["562974"]},"163786":{"abstract":"This project is conducting fundamental research in statistical language modeling to improve human language technologies, including automatic speech recognition (ASR) and machine translation (MT).<br\/><br\/>A language model (LM) is conventionally optimized, using text in the target language, to assign high probability to well-formed sentences. This method has a fundamental shortcoming: the optimization does not explicitly target the kinds of distinctions necessary to accomplish the task at hand, such as discriminating (for ASR) between different words that are acoustically confusable or (for MT) between different target-language words that express the multiple meanings of a polysemous source-language word.<br\/><br\/>Discriminative optimization of the LM, which would overcome this shortcoming, requires large quantities of paired input-output sequences: speech and its reference transcription for ASR or source-language (e.g. Chinese) sentences and their translations into the target language (say, English) for MT. Such resources are expensive, and limit the efficacy of discriminative training methods.<br\/><br\/>In a radical departure from convention, this project is investigating discriminative training using easily available, *unpaired* input and output sequences: un-transcribed speech or monolingual source-language text and unpaired target-language text. Two key ideas are being pursued: (i) unlabeled input sequences (e.g. speech or Chinese text) are processed to learn likely confusions encountered by the ASR or MT system; (ii) unpaired output sequences (English text) are leveraged to discriminate between these well-formed sentences from the (supposed) ill-formed sentences the system could potentially confuse them with.<br\/><br\/>This self-supervised discriminative training, if successful, will advance machine intelligence in fundamental ways that impact many other applications.","title":"RI: Medium: Collaborative Research: Semi-Supervised Discriminative Training of Language Models","awardID":"0964102","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["456647","456647","467639","467640"],"PO":["565215"]},"162697":{"abstract":"Hardware trust has become important and has seen major growth over the last several years. There is a large and active group of academic and industry researchers working on various aspects of the hardware trust problem. However, most research in this area is currently carried out in an ad-hoc fashion and results are reported using figures of merit that prevent objective cross-field comparisons of Trojan detection schemes. <br\/><br\/>A few benchmark circuits infected with hardware Trojans (called trust benchmarks) are developed. The trust benchmarks pass a thorough test procedure and several detection techniques. To support further validation of the trust benchmarks, hardware platforms are developed to validate trust benchmarks and a web portal is set up to make the benchmarks and hardware platforms available to help accelerate research in hardware security and trust. Technical meetings are scheduled to collect feedbacks from experts in the community about the benchmarks and hardware platforms. <br\/><br\/>The intellectual merit of this proposal include development of (i) a detailed taxonomy for Trojans, (ii) a set of static trust benchmarks, (iii) a number of hard-to-detect Trojans, (iv) hardware platforms for hardware emulation and validation of Trojan detection methods, and (v) a repository called Trust-Hub. A trust benchmark is selected for fabrication using the MOSIS program.","title":"Collaborative Research: CI-ADDO-NEW: TrustHub: Design of Trust Benchmarks, Hardware Validation Platforms and a Web-based Dissemination Portal","awardID":"0958533","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["560771"],"PO":["565272"]},"173268":{"abstract":"Abstract:<br\/>Indiana University proposes to hold an International Research Network Connections (IRNC) Program Workshop in Washington, DC. The Workshop will be held on July 13, 2010. The current planned location is the Ballston Hilton Hotel in Washington, DC. The workshop will bring together key international research and education network service providers and the IRNC Principal Investigators. The group will discuss current and future network developments, future science activities and collaborations and how to work together to ensure that global network cyberinfrastructure is available to support and encourage existing and proposed science collaborations.<br\/><br\/>Intellectual Merit<br\/>The intellectual merit of this workshop proposal is to develop a roadmap for project interoperation within the IRNC program and to expand this roadmap to the US interoperation with national research and education networks worldwide. The workshop will bring together network cyberinfrastructure practitioners with key science communities dependent on that infrastructure in a way that will lead to ongoing, sustainable global scale interactions.<br\/><br\/>Broader Impact<br\/>The workshop will set the initial agenda for US international networking efforts for the IRNC funded networks and will help insure smooth inter-operation among the funded projects and with the auxiliary services.","title":"IRNC Kickoff Workshop","awardID":"1043507","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["547713"],"PO":["564246"]},"173048":{"abstract":"This award will support student travel for participation in the 2010 International Conference on Dependable Systems and Networks. Traveling to this conference and participating in the conference activities will foster development of skilled researchers in this field which is of national interest.","title":"IEEE Dependable Systems and Networks Conference: Student Travel Support","awardID":"1042515","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[464147,"553725","553725"],"PO":["497499"]},"165557":{"abstract":"Application workflows typically involve large-scale simulations, applications, and subsequent analysis, verification and validation. One of the most important requirements shared by various applications running on petascale systems is fast, portable, scalable I\/O which is componentized, metadata rich and easy to use. The Adaptable I\/O System (ADIOS) serves as a high-level I\/O interface for an application to select which I\/O libraries and formats to use without changing the application program. Codes such as GTC generate hundreds of TBs of data on hundreds of thousands of cores in a twenty four hour period. One must therefore optimize the I\/O both for fast output in the generation phase and for fast input in the analysis phase. Both the writing and reading efficiency of I\/O are critical for knowledge discovery. Development of a high level software infrastructure to allow optimization of I\/O for entire workflows (including High-Performance I\/O when reading data with different patterns) would greatly improve end-to-end performance in the knowledge discovery cycle. <br\/>This project plans to develop efficient I\/O methods which will enable application scientists to optimize data for writing, and which will be able to re-organize the data to obtain optimal performance for common reading patterns used by scientists. This project directly impacts the I\/O performance of many petascale applications, including the GTC, GTS, XGC-1, Chimera, and S3D codes, and work directly with these teams to optimize the I\/O in all stages of their scientific workflow.","title":"An Application Driven I\/O Optimization Approach for PetaScale Systems and Scientific Discoveries","awardID":"1003228","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["530745","540170"],"PO":["565272"]},"168967":{"abstract":"CNS - 1019343 <br\/>Abstract: <br\/><br\/>The nation's universities and industrial research labs are facing continuing budget pressure as part of the international financial crisis. The result is a significant shortage of computing research and teaching positions. Moreover, as our society faces challenges in energy, healthcare, education, and a host of other IT-reliant areas, the need for new talent grows. With fewer opportunities to obtain the intellectual renewal and diversity that promising new scholars can inject into institutions engaged in research and teaching, we risk creating a \"hole\" in the talent pool that will last for decades. This, in turn, puts at risk our nation's ability to use technological innovation for remaining globally competitive. Hundreds of our brightest and best-trained computing researchers are suddenly unable to find adequate opportunities to do advanced research and teach future generations. As a nation, we have invested time, energy, and funding in the training of these Ph.D.s. It is absolutely essential that we find ways to realize a payoff for that investment. <br\/><br\/>The Second NSF Computing Innovation Fellows (CIFellows) project will enable newly graduated computing Ph.D.s to obtain one-to-two year positions at academic institutions and industrial research organizations. It will support a new cohort of Fellows as well as second-year funding for many of the Fellows funded under the NSF Computing Innovation Fellows project last year. The aim is to forestall a permanent loss of research talent that is likely to occur if new Ph.D. graduates are forced to seek employment outside of the field due to the sharp cuts brought about by the continuing budget crisis. It will also allow new Ph.D.s to develop experience to make them more effective researchers and\/or teachers.","title":"The Second CI Fellows Project","awardID":"1019343","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["495935","241298","530092","209556"],"PO":["565264"]},"170991":{"abstract":"Leveraging Thought Leadership For Computational Thinking in the K-12 Curriculum<br\/>Phase II<br\/>Submitted by ISTE and CSTA<br\/>Project Summary<br\/>The Computer Science Teachers Association (CSTA) and International Society for Technology in Education (ISTE) are seeking support from the National Science Foundation for Phase II of a project to develop common language surrounding computational thinking and strategies for integrating computational thinking within K-12 education. Project participants will articulate the challenges and opportunities for integrating computational thinking throughout K-12 education and create pathways for bringing computational thinking into the mainstream. This proposal provides evidence of the pressing need for consensus and unified effort around key definitions, concepts, and strategies for implementing computational thinking into K-12 classrooms.<br\/>In the first phase, we convened a small Steering Committee to plan the steps needed to accomplish our goal. Phase II of this project will include a meeting of thought leaders charged with building a shared understanding of computational thinking and prioritizing the strategies and resources that need to be developed to implement computational thinking in K-12 education. This will be followed by a workshop of practitioners and leaders who will begin drafting the resources required to bring about real and sustained changes to K-12 education. A Leadership Work Group will be responsible for taking the preliminary resources developed at the workshop and expand, enhance, and refine them for digital and print publication.<br\/><br\/>Intellectual Merit: Jeannette Wing published a germinal paper (Wing, 2006) where she posited that computational thinking encompasses a diverse set of skills that enable us to systematically and efficiently process information and solve complex problems. Grounded in the core activities of problem definition, abstractions, and solution development, Wing further argued that computational thinking could be directly applied, not just to computer science problems, but to the problems in virtually any discipline or field of human engagement. This project will seek to contribute to the advancement of computational thinking throughout K-12 education through the following strategies:<br\/>-Developing a better understanding of computational thinking through creating a shared working definition of \"computational thinking\" as it applies across disciplines K-12.<br\/>- Strengthen the teaching of computational thinking skills in K-12 education through supporting the development and dissemination of classroom resources such as model curriculum and assessments.<br\/>- Create broad scale dissemination of examples of computational thinking across the curriculum through working collaboratively with subject area specialists across the disciplines.<br\/><br\/>Broader Impact: The drive to embed computational thinking concepts across disciplines and subject areas will require the entire education community to grapple with core issues relating to developing precise and yet generalized definitions of concepts and practices. To achieve this, we must move beyond the limitations of our individual disciplines to a more cohesive and shared understanding of the ways in which computation underlies all problem definition and solution and improve our understanding of the ways in which computational thinking can enrich understanding and practice.<br\/>This project will therefore address the pressing need to create a more inclusive language to facilitate the identification and sharing of key concepts, challenges, strategies, and best practices and provide a mechanism for convening the larger community in the implementation of these powerful concepts and ideas across K-12 education.","title":"Leveraging Thought Leadership for Computational Thinking in the K-12 Curriculum--Phase II","awardID":"1030054","effectiveDate":"2010-06-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":["463404",457775],"PO":["564181"]},"171673":{"abstract":"This project funds student travel for the ACM SIGMETRICS 2010 conference to be held at Columbia University in New York, on June 14-18, 2010. SIGMETRICS is the key conference in the performance modeling area and it is critical that students attend this conference so that they are inspired to look into formal modeling techniques. The the total amount of $10K will be used to support 20 student travel grants. Each supported student will receive $500 USD to cover travel cost and lodging expenses and will receive free conference registration. The support requested in this proposal will make possible the participation of students who would otherwise be unable to attend. Particular attention will be paid to directing support towards under-represented minorities including women.","title":"CSR: Student Travel Support for SIGMETRICS 2010","awardID":"1034690","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["562296"],"PO":["551712"]},"163830":{"abstract":"Sensor networks enable real-time gathering of large amounts of data that can be mined and analyzed for taking critical actions. As such, sensor networks are a key component of decision-making infrastructures. A critical issue in this context is the trustworthiness of the data being collected. Data integrity and quality decide the trustworthiness of data. Data integrity can be undermined not only because of errors by users, measurement devices and applications, but also because of malicious subjects who may inject inaccurate data with the goal of deceiving the data users. A fundamental tradeoff exists between data quality and the cost to gather and protect this data, e.g., in terms of sensor node energy. This project focuses on a multi-faceted solution to the problem of assessing integrity of data streams in sensor networks, taking into account cost and energy constraints. Key elements of the solution are: (a) a cyclic framework supporting the assessment of sensor data trustworthiness based on provenance, and sensor trustworthiness based on data that sensors provide; (b) strategies for continuously updating trust scores of sensor data and nodes; (c) a game-theoretic model to analyze and mitigate the risks due to active adversaries that try to undermine data integrity; (d) protocols for sensor network sleep\/wake scheduling and routing that balance the data quality and energy efficiency tradeoff. The project also includes the development of tools for assessing data trustworthiness, and experimental evaluation of the system performance. The research has impact on healthcare, homeland security, and applications in several other domains.","title":"NeTS: Medium: Collaborative Research: A Comprehensive Approach for Data Quality and Provenance in Sensor Networks","awardID":"0964350","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["558641"],"PO":["565303"]},"161784":{"abstract":"To better articulate privacy as a dynamic and dialectic phenomenon in a Web 2.0 world, this project proposes a set of basic empirical research activities to investigate three aspects of privacy in online social networks: conceptualization, intervention, and awareness. The goals of this CAREER award are to: 1) improve the theoretical understanding of information privacy in the context of online social networks in an interdisciplinary manner; 2) assess the efficacy of various privacy intervention strategies developed or proposed by the technologists and regulators; and 3) develop and enhance the persuasiveness of privacy and security awareness and training programs. The main contribution of this research is the generation of an interdisciplinary privacy research framework, with extensive grounding in a range of multidisciplinary privacy literatures in behavioral sciences, computer science, information systems, communication, and social psychology. This research takes a holistic view of privacy compared to the large amount of work focusing strictly on data privacy aspects. Thus, it recognizes the critical importance of user perceptions and behaviors when evaluating and developing privacy protection approaches. The proposed three tasks are greatly needed to better connect the social analysis of user privacy behaviors with the technical design of privacy enhancing technologies. The work should contribute to basic science-the underpinnings of user perceptions and actions around privacy management-as well as the findings generated for informing the design of privacy enhancing techniques. The research findings can enable technology-oriented researchers to develop more feasible privacy enhancing techniques that are embedded into the design specifications of systems, as well as aligned with organizational practices and user behaviors. This project will adopt various empirical research methods (experiments, large-scale survey, focus group and social network analysis) to test the behavioral hypotheses underlying user privacy behaviors in the context of online social networks. Well executed surveys and field experiments will contribute substantially to our understanding of how the actual users of online social networks behave and what interventions (in terms of technologies, regulations and trainings) may change their privacy decisions and behaviors.<br\/><br\/>One of the three major research thrusts is to develop a privacy awareness and training program for users of online social networks. The findings could potentially have a large impact on promoting privacy and security awareness in the user community. The project also has impacts on guideline creation for industry regulators and government agencies. The PI aims to transform the repository of knowledge on the dynamic and dialectic nature of privacy assurance into a number of educational activities in her academic home at Penn State. The educational plan describes the development of new courses and course modules on privacy assurance at both undergraduate and graduate levels, bringing research into classrooms, outreach to students in underrepresented groups, and training of undergraduate and graduate student researchers in interdisciplinary methods. The PI has transformed her science into a privacy workshop for high-school girls and their parents to teach about on-line privacy issues and practices. She proposes to continue such efforts to promote privacy and security awareness among high-school girls, as well as to attract more female students into the program of security and risk analysis at Penn State. The PI will also work with a professional society, the Association for Information Systems, to create a privacy research chapter and a privacy pedagogy section to extend the Information Systems research agenda and curriculum into this important area nationally.","title":"CAREER: Examining Users' Collective Privacy Management for Online Social Networks","awardID":"0953749","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["277956","550223"],"PO":["557315"]},"162631":{"abstract":"Software testing techniques are fundamental to the development of dependable software. Computer scientists studying testing techniques must be able to evaluate and compare them empirically, and this requires access to a wide range of infrastructure support including programs, program versions, test suites, and fault data. <br\/>This project provides that support, focusing on test generation and on software domains that are increasingly important: concurrent and distributed systems, software product lines, and web services. The PIs are collecting and constructing systems, specifications, version attributes, test attributes and fault attributes relevant to these domains, and organizing them in formats that allow computer scientists to utilize them efficiently in controlled experiments. <br\/>Th PIs are embedding these artifacts in the existing Software-artifact Infrastructure Repository (SIR), a repository established under prior NSF support to facilitate experimentation with deterministic C and Java systems. They are also enhancing SIR's support for community contributions, by providing moderated write access to the repository; this will be expanded in the latter years of the project, following the spirit of open-source models for system management. The infrastructure being assembled enables several <br\/>specific research and educational projects related to software testing, by the project researchers themselves and by the software engineering research community as a whole.","title":"Collaborative Research: II-EN: Infrastructure Support for Software Testing Research","awardID":"0958235","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["562727"],"PO":["565272"]},"162653":{"abstract":"Software testing techniques are fundamental to the development of dependable software. Computer scientists studying testing techniques must be able to evaluate and compare them empirically, and this requires access to a wide range of infrastructure support including programs, program versions, test suites, and fault data.<br\/>This project provides that support, focusing on test generation and on software domains that are increasingly important: concurrent and distributed systems, software product lines, and web services. The PIs are collecting and constructing systems, specifications, version attributes, test attributes and fault attributes relevant to these domains, and organizing them in formats that allow computer scientists to utilize them efficiently in controlled experiments. <br\/>Th PIs are embedding these artifacts in the existing Software-artifact Infrastructure Repository (SIR), a repository established under prior NSF support to facilitate experimentation with deterministic C and Java systems. They are also enhancing SIR's support for community contributions, by providing moderated write access to the repository; this will be expanded in the latter years of the project, following the spirit of open-source models for system management. The infrastructure being assembled enables several <br\/>specific research and educational projects related to software testing, by the project researchers themselves and by the software engineering research community as a whole.","title":"Collaborative Research: II-EN: Infrastructure Support for Software Testing Research","awardID":"0958346","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["548132"],"PO":["565272"]},"163787":{"abstract":"Multicore chips with hundreds of cores will likely be available soon. Current trends suggest that cores will be relatively simple, that on-chip memory will be partitioned into per-core caches, and that each cache will be relatively small. Furthermore, chips will continue to be pin-limited and therefore DRAM bandwidth won't scale with the number of cores.<br\/><br\/>Parallel software that is data intensive has the potential to run well on multicore processors due to the large total amount of on-chip cache, but requires effective use of the distributed on-chip caches. The dangers are that data used by many cores will be duplicated in many cores' caches, decreasing the total amount of distinct data that can be cached; and that some cores may incur DRAM loads trying to access more data than fits in their caches, while other cores have spare cache space.<br\/><br\/>As the number of cores per DRAM interface and the latencies between caches on a chip increase, it is important for software to manage the distributed caches well. A collaborative approach that involves architects and systems researchers to extend the memory interface to provide control over data placement and enable on-chip efficient data movement provides a holistic solution. Specifically, this work proposes data-movement control (DMC) interface, which includes support for cache-to-cache transfers, batching of several cache lines, sending a message to a core that is close to a cache that holds a particular data item, and data monitoring. The proposal also includes techniques to route data over the interconnect that will provide high performance for the DMC interface.<br\/><br\/>If successful, DMC will help data-intensive applications avoid memory bottlenecks and allow them to run well on future multicore processors. A full-system simulator will allow other researchers to explore intelligent and efficient data management and enable research projects in MIT's graduate computer architecture class, educating students about the challenges of multicore computing.","title":"SHF: Medium: Intelligent and Efficient Data Movement for Multicore Systems","awardID":"0964106","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["561979","562011","541752","562012"],"PO":["366560"]},"176503":{"abstract":"Future integrated circuits will contain tens, hundreds, or possibly even a thousand cores per chip. However, the scaling techniques that will make this possible also make the underlying circuit fabric less reliable-leading to increased wearout and defects that cannot be detected at manufacturing. In response, the PI proposes fundamental research for generating new test sets on-chip to identify failing cores. The tests will be created \"on-the-fly\" and dynamically targeted to the most critical areas of a core. Some key portions of the proposed research involve the creation and verification of hardware monitors for determining which faults are most important for the user's applications, the diagnostic use of online error detection hardware to pinpoint locations that caused previous failures, and the analysis and development of protocols to efficiently create and transport tests in a network-on-chip environment.<br\/><br\/>The great performance advantages of future multi-core devices will remain unrealized if the reliability of those devices cannot be trusted. The proposed research investigates critical tools for promoting that reliability. The integrated education plan provides research opportunities for students at multiple levels?from high school to graduate school?including students from underrepresented groups. In addition to recruiting undergraduates from Brown, the PI plans to work with the CRA-W DREU (Distributed Research Experiences for Undergraduates) program to host visiting female undergraduates for summer research. The PI will also recruit high school students from the Providence Public Schools, many of whom are members of underrepresented groups, for summer research through the Brown GK-12 program.","title":"CAREER: Enhancing Quality through Probabilistic On-Chip Test","awardID":"1061164","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["482799"],"PO":["562984"]},"172147":{"abstract":"ATIP requests support for a US-China Workshop on High-Performance Computing (HPC) emphasizing specialized hardware. The Workshop will include a significant set of presentations, posters, and panels from a delegation of Chinese academic, research laboratory, and industry experts as well as graduate students. Participants will address topics that include Government support for the research, development, and utilization of special purpose hardware, including GPU and self-developed processors; in addition, applications will also be stressed. Speakers from industry will provide perspectives of the importance of such hardware for real applications.<br\/>In addition, a special effort will be made to include HPC R&D developments in Hong Kong. Another important component will be a panel in which panelists and the audience identify topics that are suitable for collaborative (US-China) research and the mechanisms for developing those collaborations. A key aspect of the proposed Workshop will be the unique opportunity for members of the US research community to interact and have direct discussions with top Chinese scientists who will travel to the US to participate. A specific goal of the Workshop is to motivate the preparation of joint research proposals with researchers from both US and China.","title":"ATIP US-China Workshop on High-Performance Computing (HPC): Specialized Hardware Challenges and Advantages","awardID":"1036707","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["496762"],"PO":["565272"]},"161686":{"abstract":"Understanding and enhancing human learning are important challenges in the 21st century. Existing human category learning models cannot quantify important capacities such as people's (in)ability to generalize from training to test, to learn from imperfect data, or to learn by actively asking questions. <br\/><br\/>This research project studies human learning using machine learning. It first develops machine learning theory and algorithms to quantify these human learning capacities: It establishes learning-theoretic error bounds on human generalization performance; It models human learning from an imperfect teacher with non-parametric Bayesian methods; It models human's ability to ask informative questions with active learning theory. The project then studies computational approaches to enhance human learning: It develops \"machine teaching\" algorithms when the computer knows the target concept, and selects the optimal training examples to teach a human learner; It develops \"human machine co-learning\" algorithms when the computer does not know the target concept, but instead learns alongside the human and suggests better learning strategies to her. Each topic is verified by human experiments.<br\/><br\/>The project advances machine learning with new learning theory and algorithms on tasks where humans excel. It advances cognitive psychology with new models of human learning. It has broader impacts in understanding human intelligence, and in benefiting students with new educational tools. This research project is integrated with an educational plan that incorporates undergraduate and graduate teaching and mentoring, developing a new course and a book on machine and human learning, organizing seminars, tutorials and workshops, and sharing all results on a website.","title":"CAREER: Using Machine Learning to Understand and Enhance Human Learning Capacity","awardID":"0953219","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["560208"],"PO":["562760"]},"163501":{"abstract":"TransPAC3 is a continuing project building on the existing TransPAC2 cross-organization project. It will provide multi-gigabit bandwidth and services connecting researchers in the US with their counterparts in Asia and utilizing the current technological advances in those areas. <br\/><br\/>The research and education networks included in the TransPAC3 collaboration cover all of Asia excluding only North Korea, Brunei, Myanmar, and Mongolia. Indiana University will lead the TransPAC3 Collaboration in a cooperative partnership with the Asia Pacific Advanced Network (APAN), Delivery of Advanced Network Technology to Europe (DANTE), and in coordination with Internet2 and other research and education networks that are interconnected through the project. The collaboration in Asia will connect to the APAN XP in Tokyo directly, and from there to 15 countries in Asia. TransPAC3 will connect to China via Hong Kong and the CNHI Exchange Point and to the Trans-Eurasian Information Network (TEIN3) network via Singapore. The TEIN3 network currently provides connectivity to 12 Asian countries and Europe with 7 additional countries soon to be connected. DANTE is the operator of the TEIN3 network in North, South East, and South Asia and connects almost all countries in those parts of Asia.<br\/><br\/>TransPAC3 will initially deploy 20 Gbps of bandwidth between Asia and the US using 10G carrier service offerings. TransPAC3 will deploy one 10 Gbps link between Pacific Wave and Tokyo in years 1 and 2. A second 10 Gbps link will be provided by NICT, Japan, at no cost to NSF. In Year 3 of the award this will be expanded as demand and pricing evolve. As 40Gbps and 100Gbps become available and affordable at trans-Pacific distance they will become part of the provided service.<br\/><br\/>Intellectual Merit<br\/>This proposal rests well within the guidelines of the IRNC solicitation and will expand and enhance services in security, identity management, measurement, and operational integration. US ? Asia connectivity requires close cooperation between the participants, and this project will consist of a collaborative team. Security is a major issue for all concerned and is a focus of the proposal. The PI has proposed and intends to provide deployment of accurate and useful measurement technology as well as leading edge circuit services to meet high bandwidth applications. Eliminating duplication of expensive links should decrease overall costs.<br\/><br\/>Broader Impact<br\/>As with the previous IRNC award, it is expected that the awardee?s TransPAC3 collaboration will provide highly expanded opportunities for US researchers to interact and collaborate with their fellow researchers in Asia. The PI?s recent cooperation in connecting Pakistan to the global R&E infrastructure continues to show fruitful results. <br\/><br\/>Integrating diversity in research and education is a strong component in this proposal. The PI has plans to partner with the Gerald L. Bepko Internship Program at Indiana University to extend educational outreach and integrate diversity into the TransPAC3 project, with the goal to identify, connect, and work with underserved students and advance their knowledge and ability in information technology.","title":"IRNC:ProNet: TransPAC3 - Asia-US High Performance International Networking","awardID":"0962968","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":["547712","547713","437390"],"PO":["564246"]},"161565":{"abstract":"Partial differential algebraic equations (PDAEs) have many important applications, such as those in cellular biology, chemistry, mathematical physics, mechanics and dynamical systems, control theory, differential geometry, and analysis. Algorithms on PDAEs have been instrumental in simplifying and solving practical problems but are increasingly taxed as the size of problems increases. Improvements in efficiency will reduce the time for scientists to find properties, and perhaps solutions, to the systems they are working on. <br\/><br\/>The research consists of developing a computational theory for systems of PDAEs, including those with parameters, and to design algorithms that provide efficient descriptions of their solutions. For non-parameterized systems, the PI will first obtain complexity estimates for existing differential elimination algorithms. For systems with parameters, he will study the structure of their differential Galois groups, which are linear groups consisting of solutions to PDAEs themselves, via representation theory. Better understanding of them can then be applied to improve the efficiency of existing algorithms or create new ones. <br\/><br\/>Despite over a century of numerous studies on PDAEs, as pioneered by Holder, Janet, Riquer, Ritt, Kolchin, and recently furthered by Singer, Boulier, and Hubert, among many others, there do not yet exist methods computationally efficient enough to explore and understand the differential algebraic behavior of solutions of these systems. As a result of the proposed research activities, new improved complexity upper bounds will highlight some bottlenecks of existing algorithms, allowing deeper exploration of designs for more efficient algorithms. The research activities will further develop the theory of radical differential ideals which is essential for any substantial progress in theoretical and algorithmic developments. Among the open problems this project will investigate is the Ritt Problem, which if solved, would provide unique, irredundant, and effective representations of radical differential ideals.","title":"CAREER: CISE-CCF-AF-Algebra: DMS-Algebra: Computational Differential Algebra","awardID":"0952591","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["438881"],"PO":["565251"]},"163897":{"abstract":"Enterprise Information Systems (EIS) continually face attacks ranging from data leaks to the spread of malware; these attacks cost companies billions of dollars annually and can result in critical loss or leakage of data. Existing defenses typically either attempt to secure the hosts within the enterprise or add a security perimeter to the network. These conventional defenses are ineffective in the face of compromised hosts, mobile devices, and insider threats. Dynamic Information-Flow Tracking (DIFT) techniques maintain data provenance information about objects within the system and control information flow by defining and implementing policies that dictate how that information should be allowed to flow. Although powerful, existing DIFT approaches are limited by the fact of targeting only a single layer on a single physical host, which limits their effectiveness and practical applicability.<br\/><br\/>This research will develop MEDITA, a multi-layer DIFT mechanism that can precisely, securely, and efficiently track data flowing within a networked EIS and across layers, and control the flow of such data based on the data provenance and the security policy in place. Multi-layer DIFT holds great promise for controlling information flow within an enterprise in many real-world scenarios. Despite its appeal, however, realizing a system that could implement such DIFT policies in practice is extremely challenging because of the wide variety of attacks that can be mounted, ranging from copying and pasting the sensitive data to writing the document to removable storage or a mobile device. To address these and other challenges, this research will (1) refine existing techniques for performing DIFT within the individual layers of an EIS, (2) design and implement the integration and inter-operation of DIFT techniques between layers, (3) define a language that can be used to express multi-layer security policies for the EIS and mechanisms for translating those policies to tainting and enforcement mechanisms; and (4) Develop a prototype implementation of MEDITA and perform experiments by using the prototype to apply MEDITA to realistic information-flow tracking control scenarios.","title":"SHF: Medium: MEDITA - Multi-Layer Enterprise-Wide Dynamic Information-Flow Tracking and Assurance","awardID":"0964647","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["550974","550999","561756"],"PO":["564388"]},"172940":{"abstract":"The International Symposium on Computer Architecture (ISCA) is a premier forum for presenting, discussing and debating new and innovative architectural ideas and techniques for advanced computing and communication systems. This symposium brings together researchers in fields related to processor architecture, compilers, chips and systems, for technical exchange on current areas of architectural challenge. This proposal aims to support this highly regarded conference by obtaining travel support for up to 25 from US-based students in order to defray the costs of attending and participating in the ISCA conference in June, 2010 in San Malo, France.","title":"Support for the 37th International Symposium on Computer Architecture (ISCA 2010)","awardID":"1041971","effectiveDate":"2010-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["557272"],"PO":["565272"]},"172500":{"abstract":"This project intends to organize a summit on education in secure software. metropolitan area. The summit brings together a multi-disciplinary group of experts in secure coding to develop a comprehensive agenda focused on the challenges of secure software education. Summit participants include representatives from academia and professional organizations across the public and private sectors; as well as policy makers and government representatives. This multi-disciplinary group advances the current state of education on trustworthy computing and a final project report summarizes the key discussions of the summit and the action items resulting from those discussions for stakeholder groups to consider.<br\/><br\/>Intellectual Merit: The summit provides a forum to address three specific objectives: (1) to engage a multi-disciplinary group of cyber security stakeholders (educators, industry representatives, and professional certification and training organizations) in a comprehensive dialogue about the current state of education in secure software; (2) to use this dialogue as the basis of a collaborative effort to develop creative approaches that enhance the quality of trustworthy computing education; and (3) to outline the core elements of a comprehensive agenda for secure software education.<br\/><br\/>Broader Impacts: PIs assemble a diverse group of approximately 60 invited participants representing several cyber security stakeholders (educators, professional certification and training organizations, and industry representatives). The PIs produce a white paper based on the summit that is disseminated through publication in a journal such as IEEE Security and Privacy, distributed to appropriate professional associate special interest groups, and circulated with summit participants. The Virtual Community of Practice is designed to support continued dialogue among summit participants.","title":"Summit on Education in Secure Software","awardID":"1039564","effectiveDate":"2010-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1668","name":"FED CYBER SERV: SCHLAR FOR SER"}}],"PIcoPI":["560876","251075"],"PO":["564264"]},"161753":{"abstract":"Career: Multiscale Stochastic Simulation for Complex Biochemical Systems with Visualization Tools<br\/><br\/>This project aims to develop efficient simulation techniques for stochastic biochemical models, particularly the cell cycle model. Cell cycle is the sequence of events whereby a living cell replicates its components and divides them between two daughter cells, so that each daughter has the information and machinery necessary to repeat the process. Cell cycle is related to many diseases such as cardiovascular diseases and cancer. Understanding the molecular mechanisms regulating cell cycle is a major challenge of contemporary cell biology. Biologists have developed complex mathematical models of cell-cycle control in budding yeast, fission yeast, and mammalian cells. These systems are so complex that its simulation and analysis present great challenges to computational science. The career goal of the PI is to address these challenges by developing innovative computational methods and rigorous mathematical theories to integrate the full gamut of continuous, discrete, deterministic, and stochastic models, and support dynamic, seamless and automatic switching between different models and algorithms as dictated by the scales of underlying problems. <br\/><br\/>This project focuses on three specific aims in this project. The primary aim is to develop innovative computational algorithms and mathematical theories about a critical multiscale challenge: stiffness. This project will develop the theory of the stiffness in discrete stochastic simulation of chemically reacting systems and an automatic stiffness detection algorithm through a running-time profile analysis. The second aim is to develop hybrid algorithms to simulate biological systems with multistate species, a special challenge in biological systems with multiple binding sites. This project will develop hybrid methods to combine particle-based methods, designed for multistate species, and population-based methods, designed for general chemical reactions. The third aim of this project is to develop algorithm and model visualization tools to introduce the algorithms and model development in computational biology to graduate and undergraduate students. <br\/><br\/>The algorithms developed in this project will enable biologists to efficiently model and simulate multiscale systems and will directly benefit the whole research discipline of systems biology. Moreover, the techniques about the stiffness are also applicable to multiscale simulation of complex systems in other areas. This research project also provides learning opportunities and training for students across the disciplines of computer science, mathematics, and biology. The biological models and simulation methods will be introduced in graduate courses on computational cell biology. The algorithm visualization tool will help students understand the important computational concept of stiffness. The model visualization tool and results related to the cell cycle model will be used in undergraduate research and education in Virginia Tech and Radford University, through collaboration with a professor in the Mathematics department at Radford University. This collaboration will help to attract more women and minority students into computational science areas.","title":"Career: Multiscale Stochastic Simulation for Complex Biochemical Systems with Visualization Tools","awardID":"0953590","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7731","name":"OTHER GLOBAL LEARNING & TRNING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["560196"],"PO":["565223"]},"163700":{"abstract":"Computing today is at a critical juncture as processors move away from uniprocessors to multicore processors. Without innovations in how to writeprograms to make use of multiple processing cores, software vendors will no longer have access to increasing processing performance, a phenomenon that has driven the growth of the computer industry for over four decades. Realizing the enormity of the situation many leaders have put parallel computing high on their list of critical research issues and many researchers are trying to build on four decades of knowledge to make progress in this critical area. <br\/><br\/>This research is investigating a novel approach to attacking this critical problem, one that is counter to much of the prevailing wisdom on parallel execution. The approach couples widely used sequential programrepresentations with a novel dynamic parallel execution model to achieve parallel execution. Initial experience with this new approach has been very promising: it can achieve parallelism comparable to, and sometimes better than, applications parallelized with traditional techniques, but can do so without the drawbacks of the traditional techniques. This work investigates the applicability and effectiveness of this new approach for a variety of problem areas, including database, networking, and embedded applications. The work will also investigate the impact of the novel parallel execution model on the design of processors and chip multiprocessors. Broader impacts include a potential transformation in how a variety of important application programs are written for parallel execution on multicore processors and the consequent design of such processors.","title":"Rethinking Parallel Execution, Architecture, and Software","awardID":"0963737","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":[438221],"PO":["565272"]},"163821":{"abstract":"Pay-as-you-Go investigates security and privacy for Integrated Transportation Payment Systems (ITPS). The research addresses integrated payments for trains, subways, buses, ferries, and recharging of electric cars, as well as toll collection for roads, bridges, and tunnels. Multi-disciplinary aspects include novel cryptographic protocols and lightweight implementations of privacy-preserving payment systems. Challenges include providing security and privacy in a low-cost, usable, and reliable manner. Payments for transportation differ significantly from general-purpose e-commerce in terms of both security and engineering constraints. For instance, transportation operators wish to observe user behavior to improve the overall performance of the system---seemingly contradicting privacy. Moreover, payment devices must be extremely cheap, mass produced, and tolerant of a wide range of passenger demands.<br\/>The expected results and activities include: (1) design of novel cryptographic algorithms achieving privacy at low cost while retaining the benefits of meaningful data collection for ITPS; (2) implementation of hardware and software to perform modern cryptographic operations on low-cost devices; and (3) testing of human factors and performance under realistic conditions that must balance security and privacy with cost and usability. The broader impacts are extensive as transportation systems are a critical part of most aspects of society, from the economy, to defense, to public safety. Moreover, information gathered from ITPS applications can facilitate advanced traffic management, travel time estimation, emergency management, congestion pricing, carbon emissions control, and environmental justice assessments. A substantial outreach plan builds on the research team?s significant experience working with transportation professionals in industry and government.","title":"TC: Medium: Collaborative Research: Pay-as-you-Go Security and Privacy for Integrated Transportation Payment Systems","awardID":"0964292","effectiveDate":"2010-06-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[438549],"PO":["565264"]},"162622":{"abstract":"Deep language understanding involves mapping language to a formalism that captures its intended meaning in context, using concepts and relations in an ontology that supports reasoning. It is generally thought that deep understanding is too difficult to accomplish except in very limited domains. As a result, most of the field has shifted to studying so-called shallow methods. Work in shallow language processing has been greatly enhanced in recent years due to the availability of considerable annotated corpora and off-the-shelf software. If one had to build this infrastructure from scratch, then most current work in the field would not be feasible. Despite the successes of shallow language understanding, however, one cannot, for instance, build sophisticated dialogue systems or NL interfaces to intelligent systems, (e.g., humanrobot interaction) using off-the-shelf shallow components. For these and many other applications, we need deeper understanding. However, there are currently no resources or toolkits to support deep understanding. <br\/><br\/>This planning grant focuses on identifying the resources that the research community would find most useful and exploring what would be useful APIs to this resource (e.g., deep semantic parsers, semantic lexicons and ontologies, discourse processing capabilities such as ontology-based reference resolution, surface speech act interpretation). The interested communities fall into two broad camps. The first are what we might call technology users, people who want to use deep understanding capabilities but whose research interests are in some other area of intelligent systems (e.g., reasoning, learning, image interpretation, robotics). The second camp, technology developers, consist of researchers in NLP who are pushing research in NLP further. A critical subpart of this second group are students studying to become natural language researchers and technology developers. Through a series of case studies and a workshop, we explore the viability of different delivery mechanisms and needs for the different types of users and for different applications.","title":"CI-P: Deep Understanding Resources","awardID":"0958193","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["517044",434552],"PO":["565215"]},"163733":{"abstract":"Although the World-Wide-Web was initially conceived as a vehicle for delivering documents, it is now being used more and more for delivering sophisticated interactive applications. However, creating powerful Web applications is a difficult task and current development tools exacerbate the problems with a low-level approach that discourages modularity and code reuse. This project is exploring a new architecture for Web application development, where applications are created by assembling high-level reusable components rather than building from scratch. A component architecture can dramatically simplify the development of interactive Web applications by encouraging reusability and by hiding inside the components many of the complexities that bedevil Web developers today. This project is exploring three aspects of component architectures: new abstractions for higher-level Web components, including layout management; abstractions for layering data management components to simplify transformations, business rules, and aggregation; and the application of component architectures to mobile devices in order to manage differences in device form factors. We are exploring design choices, creating production-quality implementations for both framework elements and specific components, and evaluating the implementations. In addition, we are releasing the framework in open-source form for others to use. Overall, this project will increase our understanding of component-based architectures and Web application development.","title":"CSR: Medium: A Component Architecture for Web Applications","awardID":"0963859","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[438313],"PO":["565255"]},"162644":{"abstract":"Testing represents one of the major manufacturing costs in the semiconductor industry. Designing circuits with testability features significantly reduces testing costs and time. Thus, it is important for designers to be exposed to the concepts in testing which can help them design better and reliable products.<br\/>In this collaborative project between the University of Toledo (UT) and Ohio Northern University (ONU), a \"Digital\/VLSI Test and Reliable Computing Research Laboratory\" is being established for the development of computationally intensive algorithms and use of commercial CAD tools for testing digital, VLSI, and advanced semiconductor devices.<br\/><br\/>Some of the research projects being carried out include: Novel Testing Techniques for Quantum Cellular Automata (QCA) circuits; Built In Self Test (BIST) for Embedded SRAMS in System on Chips; Testing Look-Up-Table (LUT) Delay Aliasing Faults in SRAM Based FPGAs Using Half-Frequencies; Analysis and Testing of Electromigration Failures; Testing and Modeling Soft Errors in FPGAs; Reliability Analysis and Device Failures in Advanced Semiconductor Devices; Reliability Issues Related to Power Consumption in VLSI Chips during Test; and Small Delay Defects and Test Generation.<br\/><br\/>Educational modules developed from the research carried out in this project are integrated into a number of graduate and undergraduate courses at ONU and UT. Since applications of semiconductor chips are far and wide, many different industries including auto, aerospace, defense and healthcare may benefit from this project.","title":"Collaborative Research:II-NEW: A Digital\/VLSI Test and Reliable Computing Research Laboratory","awardID":"0958298","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["532060",434606,"534592"],"PO":["565272"]},"163865":{"abstract":"The centerpiece of this project is the design, development, and evaluation of computational representations and algorithms for making software agents that are organizationally adept. An organizationally-adept agent is not only aware of its role(s) in an organization, but can also monitor how well it is fulfilling its organizational responsibilities and can proactively adapt its behaviors to meet organizational needs better. Organizationally adept agents evaluate their behaviors based not on their (agent-centric) self-interests but rather on their (organization-centric) responsibilities to each other, and autonomously adapt to achieve organizational objectives emergently.<br\/><br\/>Elaboration and adaptation by organizationally adept agents means that the ultimate organization design is formed by a combination of top-down design (to produce a \"ballpark\" organization) and emergent refinement processes. Further, this combination can be iterative and ongoing, where organizationally adept agents can detect tension between top-down and emergent influences, and inform the design processes of runtime interaction patterns and environmental tendencies that suggest useful top-down organization restructurings.<br\/><br\/>The intellectual problems being pursued are central to practical issues in scaling multi-agent systems to help solve complex, long-term, global problems. Many critical challenges facing society including climate change, health care, and sustainable energy|require a prolonged commitment to monitoring and managing distributed activities. Networked computer systems populated by software agents, which can be constantly measuring, comparing, and interpreting information to understand and respond to wide-scale phenomena, promise to address such challenges, but need the kinds of innovations proposed in this project. Second, while the project is specifically looking at organizations for computational agents, our results will inform, and be informed by, research on human organizations. To stimulate sharing insights and results, the investigators will organize a multi-disciplinary symposium on organization-centric reasoning, and will train an inter-disciplinary cohort of graduate students.","title":"RI:Medium: Collaborative Research: Creating Organizationally Adept Software Agents and their Organizations","awardID":"0964512","effectiveDate":"2010-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[438665],"PO":["565035"]},"162688":{"abstract":"This institutional infrastructure project will build on two previous CRI grants in order to significantly enhance the current shared high performance computing infrastructure in order to keep up with rapidly increasing research demands. The resulting world-class computing facilities will be shared with all Computer Science (CS) faculty researchers, Binghamton collaborators, external collaborators, and students. Specifically, the requested infrastructure consists of high-end PowerEdge Blade servers along with a robust and high performance storage subsystem. These systems address the computational and storage needs common to research projects in microarchitectural-level power and performance assessment tool design, data center energy optimization techniques, parallel discrete event simulation, multimedia senor networks, Grid and cloud scheduling, data reduction of scientific datasets, large scale web database integration systems projects, virtualization, real-time data services, and I\/O intensive simulation projects.<br\/><br\/>The resulting world-class computing facilities will benefit students, faculty, and collaborators. It will be used to enhance a wide variety of courses, and the project includes a coordinated education and research program that enhances the department's instruction and student training efforts. Results will be disseminated to a wide audience through research publications and also on a Web page devoted to the project to advertise how the facility is being used.<br\/><br\/>The CS Department where the equipment is housed is committed to increasing the enrollment of women and students from traditionally underrepresented groups, and its involvement of undergraduates in research (as evidenced, e.g., by a current CISE REU Site). This equipment will help the department to advance these efforts by driving research that will be attractive to the best students from these groups.","title":"II-EN: Infrastructure for Computer Systems Research","awardID":"0958501","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[434747,"494776","553586",434750,"451774"],"PO":["563661"]},"172017":{"abstract":"This proposal aims to secure student travel support for the sixth ACM\/IEEE Symposium on Architectures for Networking and Communications Systems (ANCS), to be held in San Diego, CA (Oct. 25 - 26, 2010). The PI proposes providing travel support totaling $12,000. This will permit support of about 20 U.S.-based graduate students at about approximately $600 per student. Priority will be granted to those students without existing travel support that would not otherwise be able to attend. This will include students who are not presenting papers at the conference, but are doing research on ANCS relevant topics.","title":"Travel Support for the Symposium on Architectures for Networking and Communications Systems","awardID":"1036214","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["511555"],"PO":["565272"]},"171522":{"abstract":"The main goal of this project is to build a team of<br\/>undergraduate students in Linguistics and Computer Science to<br\/>work on the research project collaboratively. Through this<br\/>experience, the students will be able to learn about each<br\/>other's disciplines, linguistic properties of many interesting<br\/>languages, tagset design, various supervised\/unsupervised<br\/>approaches to morphosyntactic tagging as well as acquire<br\/>mathematical modeling and algorithmic skills -- all while<br\/>working as part of the research team.<br\/><br\/>In this research, the PI together with her students will<br\/>explore how cross-lingual correspondences can be used for<br\/>scientific and technological benefit, and provide a better<br\/>understanding of what linguistic properties are crucial for<br\/>morphosyntactic transfer.<br\/><br\/>This award will play a central role in expanding inquiry-based<br\/>learning, fostering student collaborations, and providing<br\/>valuable hands-on experience of highly practical work on<br\/>difficult, morphologically rich under-represented languages.<br\/>The impact of this project is expected to translate into<br\/>significant gains in recruitment of minority students through<br\/>research training in Computer Science and Linguistics. The<br\/>undergraduates who work on this project will collaborate on the<br\/>writing of research publications and present at national<br\/>meetings so that they can contribute to the research culture<br\/>while enhancing their research awareness.","title":"Undergraduate Research: Cross-Lingual Approaches to Morphosyntactic Tagging","awardID":"1033275","effectiveDate":"2010-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550607"],"PO":["565215"]},"163800":{"abstract":"Rule systems are increasingly used in areas ranging from Program Analysis,<br\/>Semantic Web, Security Frameworks, Sensor Networks, Cognitive Radio, and<br\/>Disruption-tolerant Networking, each with its own demands for efficiency<br\/>and scalability. Advances in these areas will lead to a new generation of<br\/>robust and secure applications that control devices on which human safety<br\/>and even lives depend, supply with critical information, and help people<br\/>make informed decisions by pulling together distributed Web-centric<br\/>resources, analyzing them, and automating complex information-bound tasks.<br\/>However, existing implementations of rule systems are not sufficiently<br\/>scalable and have been shown to vary widely in performance. To make the<br\/>above vision of next generation robust applications a reality, one must<br\/>understand the performance characteristics of rule systems and develop<br\/>scalable optimization and analysis techniques for them. Although advances<br\/>have been made in improving performance of rule systems, the problem<br\/>remained extremely challenging and poorly understood both theoretically and<br\/>implementation-wise.<br\/><br\/>This project will develop a comprehensive framework for rigorous<br\/>understanding and optimization of rule systems. The approach is based on<br\/>precise cost calculations and global program transformations, and it<br\/>combines and extends techniques from database query optimization, compiler<br\/>optimization, and recursive query processing. It includes: (1) techniques<br\/>for generating logically equivalent but more efficient programs; (2) cost<br\/>models and analysis for generating parameterized cost formulas for the<br\/>running time and space usage of rule programs; (3) techniques for<br\/>estimating parameters of the cost formulas; (4) heuristics for searching<br\/>the exponentially large space of logically equivalent rule programs to find<br\/>the ones with the best predicted time, space, and tradeoffs; and (5)<br\/>implementation of the strategy as an optimizer for the widely used,<br\/>open-source XSB Logic Programming System. The method and implementation<br\/>will be evaluated using applications in Program Analysis and Semantic Web.","title":"SHF: Medium:Performance Analysis and Optimization for Logic Rule Engines","awardID":"0964196","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["560897","509519","552012"],"PO":["564388"]},"162964":{"abstract":"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).<br\/><br\/>This project, developing a software traceability instrument, enables research in diverse, much needed, software-related research areas such as formal methods, human computer factors, software visualization, and project management. The work supports a critical research agenda of the software engineering community and facilitates technology transfer of traceability solutions to business and industry. Traceability refers to the ability to capture the relationships between different artifacts of a software-intensive system development project, including code, requirements, design, specifications, external regulations, and software architectures. Many software engineering activities involve tracing between interdependent artifacts, for example, finding software components that implement a given system requirement in order to assure that an as-built system meets its intended goals, or conversely, finding all the requirements that pertain to a code module to ensure that the system does not contain extraneous and potentially malicious features. The traceability instrument contains a library of reusable trace algorithms and utilities, a benchmarked repository of trace-related datasets, tasks, metrics, and experimental results, a plug-and-play environment for conducting trace-related experiments, and predefined experimental templates representing common types of empirical traceability experiments. The instrument facilitates the application of traceability solutions across a broad range of software engineering activities including requirements analysis, architectural design, maintenance, reverse engineering, and IV&V (independent verification and validation) or V&V activities. <br\/><br\/>Broader Impacts: Despite the criticality of software traceability, organizations have struggled to implement successful and cost-effective traceability due to the complexity and error-proneness of the task. Despite a compelling research agenda, traceability research has been impeded by the lack of shared instruments. The instrument will make state-of-the-art traceability results available to enable the next generation of customized traceability environments and will provide support for conducting empirical research. Results will be disseminated broadly through outreach endeavors by the Center of Excellence for Software Traceability. The project will provide multiple opportunities for participation by underrepresented minorities and undergraduate students, and will create three fulltime job positions. The long-term broader impacts of the project will be to improve software project productivity and to improve the reliability of software, as well as developing software engineering educational curriculum for training students and practitioners.","title":"MRI-R2: Development of a Software Traceability Instrument to Facilitate and Empower Traceability Research and Technology Transfer","awardID":"0959924","effectiveDate":"2010-06-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["550521","543540","534438"],"PO":["557609"]},"163822":{"abstract":"Sensor networks enable real-time gathering of large amounts of data that can be mined and analyzed for taking critical actions. As such, sensor networks are a key component of decision-making infrastructures. A critical issue in this context is the trustworthiness of the data being collected. Data integrity and quality decide the trustworthiness of data. Data integrity can be undermined not only because of errors by users, measurement devices and applications, but also because of malicious subjects who may inject inaccurate data with the goal of deceiving the data users. A fundamental tradeoff exists between data quality and the cost to gather and protect this data, e.g., in terms of sensor node energy. This project focuses on a multi-faceted solution to the problem of assessing integrity of data streams in sensor networks, taking into account cost and energy constraints. Key elements of the solution are: (a) a cyclic framework supporting the assessment of sensor data trustworthiness based on provenance, and sensor trustworthiness based on data that sensors provide; (b) strategies for continuously updating trust scores of sensor data and nodes; (c) a game-theoretic model to analyze and mitigate the risks due to active adversaries that try to undermine data integrity; (d) protocols for sensor network sleep\/wake scheduling and routing that balance the data quality and energy efficiency tradeoff. The project also includes the development of tools for assessing data trustworthiness, and experimental evaluation of the system performance. The research has impact on healthcare, homeland security, and applications in several other domains.","title":"NeTS: Medium: Collaborative Research: A Comprehensive Approach for Data Quality and Provenance in Sensor Networks","awardID":"0964294","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["529959","550639"],"PO":["565303"]},"172303":{"abstract":"The PIs and Co-PIs of grants supported through the NSF-NIH Collaborative Research in Computational Neuroscience (CRCNS) program meet annually. This will be the sixth meeting of CRCNS investigators. The meeting brings together a broad spectrum of computational neuroscience researchers supported by the program, and includes poster presentations, talks and plenary lectures. The meeting is scheduled for June 6-8, 2010 and will be held at Johns Hopkins University.","title":"Collaborative Research in Computational Neuroscience (CRCNS) 2010 Principal Investigator's Meeting in Baltimore","awardID":"1038119","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}}],"PIcoPI":[461610],"PO":["564318"]},"172325":{"abstract":"This proposal requests funding to assist approximately 10 US-based graduate <br\/>students to attend the Fifth Workshop on Hot Topics in Security (HotSec). <br\/>Participation in HotSec and similar conferences is a valuable and important part of the <br\/>graduate school experience. It provides students with the opportunity to interact with <br\/>more senior researchers in the field, and exposes students to leading edge work in the <br\/>field. The support requested in this proposal will enable the participation of students who <br\/>would otherwise be unable to attend HotSec.","title":"Student Travel Support for the Fifth Workshop on Hot Topics in Security (HotSec '10); August 2010; Washington, DC","awardID":"1038225","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["559051"],"PO":["565264"]},"171599":{"abstract":"Workshop on Knowledge Representation and Information Management for Financial Risk Management (KR-Financial Risk)<br\/><br\/>The credit crisis of 2008 and the ensuing Great Recession have shone a light into the hitherto esoteric world of investment data processing. The lack of consensus or acceptable best practices around standards, agreed upon definitions, procedures, metrics, and mathematical techniques have left supervisory agencies unable to ingest market information in either a timely manner that would permit a macro-prudential response, or even determine what information might be missing. This has resulted in the following unsatisfactory situation:<br\/> * Corporate managers are uncertain of the trustworthiness of<br\/> their internal risk and accounting numbers;<br\/> * The academic community is lacking the information required to<br\/> examine and analyze actual market operations and behavior;<br\/> * Regulators, analysts, and the financial press are denied an<br\/> understanding of capital market operations sufficient to<br\/> forge knowledgeable and prudent financial policy.<br\/><br\/>The purpose of this NSF-sponsored workshop is to help develop the underlying theory and framework that might unify the disparate ongoing and planned efforts at understanding and managing the enormous data and information flows in the financial services industry, and to develop a comprehensive list of the challenges in this domain with respect to robust risk assessment and management.<br\/><br\/>The workshop will draw upon an interdisciplinary team of experts from computer science (data management and mining and knowledge representation), finance, mathematics, economics and operations research. The workshop will generate a report which will develop a comprehensive list of the challenges in this domain including the fundamental forces and constraints and policies and models of information management that are critical for robust financial risk management.","title":"Workshop on Knowledge Representation and Information Management for Financial Risk Management","awardID":"1033927","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["543580",459411,459412],"PO":["560586"]},"163503":{"abstract":"Proposal Summary<br\/>ACE proposes to provide multi-gigabit bandwidth and services connecting researchers in the US with their counterparts in Europe that will continue to serve current needs well but also extend the transatlantic exchange into further scientific fields and disciplines. ACE will deploy several 10Gbps waves between Europe and the US, starting with 40 Gbps and growing over the lifetime of the award.<br\/><br\/>Indiana University (IU), as the lead institution, will function as a cooperative partnership with Delivery of Advanced Network Technology to Europe (DANTE), Trans-European Research and Education Networking Association (TERENA), New York State Education and Research Network (NYSERNet ), and Internet2. DANTE is the operator of the pan-European network GÉANT, which interconnects all of the national R&E networks in Europe, acts as the operating partner in several intercontinental research networking projects across Europe and Asia, and has long provisioned and operated multiple 10Gbps links across the Atlantic to interconnect its European partners with North American networks. NYSERNet is a partner in Manhattan Landing Exchange Point (MAN LAN) and is the optical terminus for many US telecommunications carriers and transatlantic cables. MAN LAN is owned and operated by Internet2 in partnership with NYSERNet and with NOC and engineering services from the IU Global NOC. Internet2 is the leading US research and education networking organization, representing 300 member institutions and connecting thousands of US educational, research, cultural, and related institutions, with partnership agreements with nearly 60 R&E networks around the world. Through cooperative partnership with NYSERNet and the DANET\/GÉANT community of more than 34 national R&E networks that will be reachable through these connections, the ACE award will provide the best economies of scale in transatlantic connectivity, supporting a very broad community of users.<br\/><br\/>One explicit goal of the ACE project is to develop tools and mechanisms to facilitate close operational integration among these network operators. IU and Internet2 have extensive experience in joint software development and deployment centered on the perfSONAR and dynamic circuit networking activities. As a part of DICE, the ACE project will immediately deploy, expand, and enhance services in security, measurement, identity management, and operational integration in coordination with ongoing DICE activities.<br\/><br\/>Intellectual merit<br\/>As part of the DICE collaboration, the ACE partners will expand and enhance services in security, measurement, identity management, and operational integration. Close cooperation among the DICE participants? efforts will maximize US-EU connectivity, increase collaborations (particularly with respect to security), ensure deployment of accurate and useful measurement technology, deploy dynamic circuit services to meet the needs of high-bandwidth applications, and decrease costs by eliminating duplication of effort.<br\/><br\/>Broader impact<br\/>This project will procure significant additional bandwidth between the US and EU to support a wide range of collaboration between scientists and engineers. In addition, it will support collaboration on technical, operational, and planning exercises that are critical in supporting science and engineering research. Through cooperative partnership with DANTE and the GÉANT community of more than 34 national research and education networks, the ACE project will provide the best economies of scale in transatlantic connectivity, supporting a very broad community of users.<br\/><br\/>Integrating diversity with research and education is a strong component of the proposal. IU will partner with the existing Gerald L. Bepko Internship Program at IU, which has as its goal of identifying, connecting and working with students in populations under-represented in information technology, to extend educational reach and integrate diversity into the ACE program.","title":"IRNC: ProNet: ACE - America Connects to Europe","awardID":"0962973","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["547712","547713",437390],"PO":["564246"]},"162656":{"abstract":"Testing represents one of the major manufacturing costs in the semiconductor industry. Designing circuits with testability features significantly reduces testing costs and time. Thus, it is important for designers to be exposed to the concepts in testing which can help them design better and reliable products.<br\/>In this collaborative project between the University of Toledo (UT) and Ohio Northern University (ONU), a \"Digital\/VLSI Test and Reliable Computing Research Laboratory\" is being established for the development of computationally intensive algorithms and use of commercial CAD tools for testing digital, VLSI, and advanced semiconductor devices.<br\/><br\/>Some of the research projects being carried out include: Novel Testing Techniques for Quantum Cellular Automata (QCA) circuits; Built In Self Test (BIST) for Embedded SRAMS in System on Chips; Testing Look-Up-Table (LUT) Delay Aliasing Faults in SRAM Based FPGAs Using Half-Frequencies; Analysis and Testing of Electromigration Failures; Testing and Modeling Soft Errors in FPGAs; Reliability Analysis and Device Failures in Advanced Semiconductor Devices; Reliability Issues Related to Power Consumption in VLSI Chips during Test; and Small Delay Defects and Test Generation.<br\/><br\/>Educational modules developed from the research carried out in this project are integrated into a number of graduate and undergraduate courses at ONU and UT. Since applications of semiconductor chips are far and wide, many different industries including auto, aerospace, defense and healthcare may benefit from this project.","title":"Collaborative Research: CRI-II (New) : A Digital\/VLSI Test and Reliable Computing Research Laboratory","awardID":"0958355","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["531768"],"PO":["565272"]},"163877":{"abstract":"This project focuses on the design of an infrastructureless communication system that makes it easy for people without expertise in computer security to safely communicate with friends and family members without being subjected to third-party surveillance, censorship, propaganda, or reprisal. The primary goals of this work are to (1) further open access to information people require to educate themselves and (2) make sharing information easier. Particular attention is paid to designing protocols that do not rely on centralized control points, which are subject to attack. The influence of patterns in human behavior on communication system performance, energy efficiency, and security are being studied, and the findings used to guide the development of better, user-aware, communication protocols. Design and analysis of communication protocols; defenses against side-channel attacks on portable communication devices; distributed system architecture; and energy-efficient software systems play central roles in the work.","title":"TC: Medium: Collaborative Research: WHISPER - Wireless, Handheld, Infrastructureless, Secure Communication System for the Prevention of Eavesdropping and Reprisal","awardID":"0964566","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["548177"],"PO":["565239"]},"161810":{"abstract":"In this CAREER project, the development of wireless underground sensor networks, which carries information through soil, is investigated. More specifically, the application of underground networking in agriculture is considered, where underground sensor networks promise significant reduction in water usage for irrigation. The objectives of this project are to establish the foundations of underground networking for the realization of underground sensor networks, develop hands-on educational tools, and provide experiences to facilitate the dissemination of these techniques to a larger audience including students and farmers. <br\/><br\/>Communication performance in underground settings is significantly affected by the variations in soil conditions. Hence, the research activities are focused on revisiting the concepts of connectivity and interference under the influence of environmental factors such as soil composition, soil moisture, and depth. Moreover, a theoretical framework is developed to capture the spatial and temporal correlations in soil moisture for underground sensor networks, enabling the development of environment-aware communication protocols. The insights from these analyses are exploited to develop event-based cross-layer communication platforms that adapt to the environment in an energy efficient manner. Finally, an agricultural underground sensor network testbed is developed to evaluate and highlight the outcomes of this research. The educational components include bringing wireless sensor networking to the class, developing an interactive cyber-physical networking lab, and providing hands-on experiences for \"little farmers\". <br\/><br\/>The realization of the underground networking techniques has the potential to transform the agriculture industry, as well as a broad range of applications including border patrol, perimeter surveillance, and toxic material monitoring.","title":"CAREER: Bringing Wireless Sensor Networks Underground","awardID":"0953900","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["554534"],"PO":["565303"]},"161711":{"abstract":"This project studies natural image statistics, and their applications in diverse fields such as computational neuroscience, image processing, computer vision, and graphics. The centerpiece of this project is a new image representation based on a simple nonlinear transform that is statistically justified and biologically inspired. This representation provides a new language to describe image signals, and forms the basis to build statistical models to more effectively capture statistical properties of natural image. Built upon this new image representation, this project explores new paradigms to model and interpret visual neural responses and high-level perceptual properties, and provides new tools for image restoration, analysis and synthesis. On the other hand, by applying natural image statistics to the forensic analysis of digital images, this project facilitates forensic practitioners in criminal investigations, and contributes to national security and public safety. Moreover, this project contributes to education by making the learning of Computer Science fun and useful for undergraduate students, promoting the participation of women and undergraduate students in research, and improving the early learning of mathematics and sciences for local high school students.","title":"CAREER: A New Statistical Framework for Natural Images with Applications in Vision","awardID":"0953373","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550584"],"PO":["564316"]},"163823":{"abstract":"Traditional security authorization decisions are black and white: a user either satisfies a particular access policy or does not. This rigidity is a handicap in our complex and unpredictable world. As a result, even security-conscious organizations typically grossly overprovision principals with access rights and\/or underconstrain access policies to ensure that principals can always carry out the organization's mission effectively and respond to unexpected opportunities and challenges. This project focuses on developing dynamic and risk-aware approaches to access control that allow organizations to make security-critical decisions in the face of incomplete information and unexpected circumstances. This is accomplished by combining proof-theoretic access controls with economic models of risk. In the event that the expected proof of authorization for an action cannot be generated, the systems developed in this project carry out an efficient search for similar proofs of authorization that minimize the overall risk incurred by deviating from the expected. This approach allows policies to adapt dynamically to the changing context of the systems in which they are deployed. This research will have several benefits, including increased system availability during disasters or other uncommon cases not explicitly modeled by policies; reduced instances of permission creep, as overprovisioning users is no longer required to ensure that an organization's business needs are met; a quantifiable means of assessing how policies are actually used and how they might be changed to better reflect the evolution of organizations; and the development of metrics for assessing access control risks.","title":"TC: Medium: Collaborative Research: Towards Formal, Risk-Aware Authorization","awardID":"0964295","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["534206"],"PO":["565264"]},"163834":{"abstract":"Pay-as-you-Go investigates security and privacy for Integrated Transportation Payment Systems (ITPS). The research addresses integrated payments for trains, subways, buses, ferries, and recharging of electric cars, as well as toll collection for roads, bridges, and tunnels. Multi-disciplinary aspects include novel cryptographic protocols and lightweight implementations of privacy-preserving payment systems. Challenges include providing security and privacy in a low-cost, usable, and reliable manner. Payments for transportation differ significantly from general-purpose e-commerce in terms of both security and engineering constraints. For instance, transportation operators wish to observe user behavior to improve the overall performance of the system---seemingly contradicting privacy. Moreover, payment devices must be extremely cheap, mass produced, and tolerant of a wide range of passenger demands.<br\/>The expected results and activities include: (1) design of novel cryptographic algorithms achieving privacy at low cost while retaining the benefits of meaningful data collection for ITPS; (2) implementation of hardware and software to perform modern cryptographic operations on low-cost devices; and (3) testing of human factors and performance under realistic conditions that must balance security and privacy with cost and usability. The broader impacts are extensive as transportation systems are a critical part of most aspects of society, from the economy, to defense, to public safety. Moreover, information gathered from ITPS applications can facilitate advanced traffic management, travel time estimation, emergency management, congestion pricing, carbon emissions control, and environmental justice assessments. A substantial outreach plan builds on the research team?s significant experience working with transportation professionals in industry and government.","title":"TC: Medium: Collaborative Research: Pay-as-you-Go: Security and Privacy for Integrated Transportation Payment Systems","awardID":"0964379","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["448713"],"PO":["565264"]},"162624":{"abstract":"Software testing techniques are fundamental to the development of dependable software. Computer scientists studying testing techniques must be able to evaluate and compare them empirically, and this requires access to a wide range of infrastructure support including programs, program versions, test suites, and fault data. <br\/>This project provides that support, focusing on test generation and on software domains that are increasingly important: concurrent and distributed systems, software product lines, and web services. The PIs are collecting and constructing systems, specifications, version attributes, test attributes and fault attributes relevant to these domains, and organizing them in formats that allow computer scientists to utilize them efficiently in controlled experiments. <br\/>Th PIs are embedding these artifacts in the existing Software-artifact Infrastructure Repository (SIR), a repository established under prior NSF support to facilitate experimentation with deterministic C and Java systems. They are also enhancing SIR's support for community contributions, by providing moderated write access to the repository; this will be expanded in the latter years of the project, following the spirit of open-source models for system management. The infrastructure being assembled enables several <br\/>specific research and educational projects related to software testing, by the project researchers themselves and by the software engineering research community as a whole.","title":"Collaborative Research: II-EN: Infrastructure Support for Software Testing Research","awardID":"0958199","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["518574"],"PO":["565272"]},"161799":{"abstract":"This Faculty Early Career Development (CAREER) grant provides funding for contributions to the foundations of hybrid systems through the anthropomorphically motivated study of dynamic walking of bipedal robots, with a special focus on behavior unique to hybrid systems and applications to prosthesis design.<br\/><br\/>Bipedal walking is a quintessential example of complex dynamically stable behavior. Hybrid systems---systems with both continuous and discrete behavior---provide a modeling paradigm in which to capture the behavior of highly complex systems, resulting in new phenomena not found in continuous and discrete systems. Bipedal walking robots are naturally modeled as hybrid systems, and it is the confluence of these two areas---bipedal walking and hybrid systems---that affords a unique opportunity to further the understanding of each of these areas. <br\/><br\/>This project uses studies of human walking to obtain accurate and anthropomorphic hybrid models of bipedal robots, designs control laws that yield human-like walking through the use of geometric reduction, formally studies the stability and robustness of the resulting hybrid systems, and uses this cumulative understanding of bipedal walking to design prosthesis devices. <br\/><br\/>The applications of the ideas underlying this project are far reaching, providing new research directions in hybrid systems and a new understanding of the fundamental mechanisms underlying walking. <br\/>Applying this understanding to the design of prosthesis devices could have a dramatic impact on the quality of life of the millions of lower body extremity amputees. Furthermore, the anthropomorphic nature of bipedal locomotion has wide appeal to people of all ages and demographics, greatly facilitating outreach and education.","title":"CAREER: Closing the Loop on Walking: From Hybrid Systems to Bipedal Robots to Prosthetic Devices and Back","awardID":"0953823","effectiveDate":"2010-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["526843"],"PO":["565255"]},"163735":{"abstract":"This project is conducting fundamental research in statistical language modeling to improve human language technologies, including automatic speech recognition (ASR) and machine translation (MT). <br\/><br\/>A language model (LM) is conventionally optimized, using text in the target language, to assign high probability to well-formed sentences. This method has a fundamental shortcoming: the optimization does not explicitly target the kinds of distinctions necessary to accomplish the task at hand, such as discriminating (for ASR) between different words that are acoustically confusable or (for MT) between different target-language words that express the multiple meanings of a polysemous source-language word. <br\/><br\/>Discriminative optimization of the LM, which would overcome this shortcoming, requires large quantities of paired input-output sequences: speech and its reference transcription for ASR or source-language (e.g. Chinese) sentences and their translations into the target language (say, English) for MT. Such resources are expensive, and limit the efficacy of discriminative training methods. <br\/><br\/>In a radical departure from convention, this project is investigating discriminative training using easily available, *unpaired* input and output sequences: un-transcribed speech or monolingual source-language text and unpaired target-language text. Two key ideas are being pursued: (i) unlabeled input sequences (e.g. speech or Chinese text) are processed to learn likely confusions encountered by the ASR or MT system; (ii) unpaired output sequences (English text) are leveraged to discriminate between these well-formed sentences from the (supposed) ill-formed sentences the system could potentially confuse them with. <br\/><br\/>This self-supervised discriminative training, if successful, will advance machine intelligence in fundamental ways that impact many other applications.","title":"RI: Medium: Collaborative Research: Semi-Supervised Discriminative Training of Language Models","awardID":"0963898","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["445173",438318,"532696"],"PO":["565215"]},"163746":{"abstract":"Traditional security authorization decisions are black and white: a user either satisfies a particular access policy or does not. This rigidity is a handicap in our complex and unpredictable world. As a result, even security-conscious organizations typically grossly overprovision principals with access rights and\/or underconstrain access policies to ensure that principals can always carry out the organization's mission effectively and respond to unexpected opportunities and challenges. This project focuses on developing dynamic and risk-aware approaches to access control that allow organizations to make security-critical decisions in the face of incomplete information and unexpected circumstances. This is accomplished by combining proof-theoretic access controls with economic models of risk. In the event that the expected proof of authorization for an action cannot be generated, the systems developed in this project carry out an efficient search for similar proofs of authorization that minimize the overall risk incurred by deviating from the expected. This approach allows policies to adapt dynamically to the changing context of the systems in which they are deployed. This research will have several benefits, including increased system availability during disasters or other uncommon cases not explicitly modeled by policies; reduced instances of permission creep, as overprovisioning users is no longer required to ensure that an organization's business needs are met; a quantifiable means of assessing how policies are actually used and how they might be changed to better reflect the evolution of organizations; and the development of metrics for assessing access control risks.","title":"TC: Medium: Collaborative Research: Towards Formal, Risk-Aware Authorization","awardID":"0963943","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[438346],"PO":["565264"]},"162679":{"abstract":"Parallel computing is in the midst of exciting changes. Virtually all new processors have multiple cores exposing all applications to parallelism. GPUs are processors of choice for many compute intensive applications, making heterogeneity another reality of the HPC landscape. These characteristics pose tough challenges to application developers as well as system level software architects. This project plans to develop the infrastructure to support research into programming models, tools and runtime systems for emerging HPC systems.<br\/>The project creates a heterogeneous compute cluster with core aspects of emerging high-end systems. The system will have a high degree of parallelism distributed on a modest number of nodes by maximizing the cores per node up to 32. It utilizes multiple heterogeneous CPU architectures and deploy compute accelerators. The storage system is based on solid-state disks (SSDs), an emerging technology that allows two orders of magnitude lower latencies than magnetic hard drives. <br\/>The research conducted on this system focuses on various aspects of the execution tool chain. Specific research projects supported include: OpenMP compiler and run-time system for multi-core architectures and accelerators; automatic optimization of compute and communication operations in heterogeneous environments; highly fault-tolerant execution in heterogeneous and volunteer environments; and optimization of parallel I\/O operations for low latency storage devices. Furthermore, collaborative work with applications scientists is expected to lead to the development of advanced parallelization strategies for various application domains.","title":"II-NEW: A Heterogeneous Testbed for Exploring Emerging HPC Tools, Programming Languages, and Applications","awardID":"0958464","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[434716,"506602","558507"],"PO":["565272"]},"163779":{"abstract":"Emerging trends suggest that a significant share of Internet traffic will be due to real-time streaming applications. However, given the unpredictable nature of popularity of any content and the significant swings seen in user demand, provisioning a centralized content distribution system that can guarantee the strict quality of service constraints needed for real-time streaming is a very difficult task. Therefore, this project studies modeling paradigms and systems design for utilizing end-user resources for real-time streaming in a peer-to-peer (P2P) fashion. The rationale is that P2P networks can dynamically adapt to changing network conditions and service requirements more easily than centralized content distribution systems.<br\/><br\/>This research effort takes a holistic approach in which, on one hand, we study fundamental performance limits of peer-to-peer streaming and design distributed algorithms to achieve these limits. On the other hand, we use these algorithms as building blocks to construct practical protocols that are implemented and validated on an emulation testbed. We bring together a rich set of analytical tools drawn from stochastic processes, optimization and control theory to merge them with real-life multimedia issues of video coding, frame dropping and trans-coding as well as practical implementation issues. Besides the technological impact of developing viable video-streaming ideas for an increasingly networked world, our project also informs and educates both students and the broader society with curriculum development, outreach and integration of under-represented groups.","title":"NeTS: Medium: Collaborative Research: Modeling, Design and Emulation of P2P Real-Time Streaming Networks","awardID":"0964081","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["509442","561784"],"PO":["565090"]},"171359":{"abstract":"One of the core design principles of the Internet is the idea that it is sufficient for networks to implement a minimal set of functionality (the IP protocol) to allow networks to interoperate and any two nodes to communicate. However, many recent network technologies (e.g. wireless, long-latency and frequently-disrupted links) have been difficult to integrate into the Internet for this reason. This project explores two core techniques that enable better support for unusual links: explicit path queries and end-to-end adaptation. Internet support for explicit path queries would allow end-points to learn key properties of the links used for their communication. The i-Path system from Waseda University and AIST in Japan provides the foundation for this path query mechanism. New end-to-end adaptation mechanisms would allow end-points to adapt their behavior to the capabilities or quirks of the communication path. In particular, the project is modifying two end-point systems to react to path query results: 1) TCP congestion control and retransmission and 2) multimedia streaming applications. This effort is expected to show how such systems should adapt to the path properties, such as latency, bandwidth, loss rate, router buffering and in-network compression support. The broader impact of this work comes from showing that explicit path querying is critical for simplifying the addition of new technologies to the Internet. By lowering the bar for supporting link new technologies, this research enables a number of systems that will have significant social impact, such as sensors for elderly homecare, and delay-tolerant links to underdeveloped regions.","title":"Accommodating Network Evolution and Heterogeneity by Improving Network Transparency","awardID":"1032226","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[458795],"PO":["564993"]},"163879":{"abstract":"While game theory has traditionally been used as a thinking tool to analyze small stylized versions of real situations, this project is developing operational tools for analyzing real large-scale settings in full detail. To ensure true scalability, the techniques will be benchmarked on very-large-scale games of negotiation, auctions, and poker. This work is on a path toward a vision where software agents conduct commerce on behalf of humans, or at least advise them to act more intelligently. This will lead to increased social welfare through better decision making. This will also enable broader and fairer access because it will help put less experienced\/educated people\/companies on an equal footing with expert market participants. Broader access will, in turn, increase the benefits of (electronic) commerce further, and the benefits will be distributed more fairly across segments of society. The paradigm will also yield a form of increased security because strategies generated by the proposed techniques cannot be taken advantage of (at least not by much and not easily). <br\/><br\/>The projects particular contributions to computational game theory include the development of (lossless and lossy) game-abstraction methods to allow scale-up to larger 'games' of societal import, techniques for settings with more than two agents, techniques for dealing with less-than-rational opponents robustly, and derivation of worst-case guarantees on approximate solutions via nemesis computation.","title":"RI: Mediuim: Abstraction, Equilibrium Finding, Safe Opponent Exploitation, and Robust Strategies for Imperfect-Information Games","awardID":"0964579","effectiveDate":"2010-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["561267"],"PO":["562760"]},"174319":{"abstract":"This project intends to explore generic data models for provenance metadata. The first stages of the work involves investigating the provenance requirements of different applications domains.. The next stage attempts to generalize these data requirements into a single generic model for that group of applications. The generic model then is used as a basis for investigating issues on effective management of the metadata. Domain experts can express issues about their requirements without considering the details of the system implementation. If successful, the project will explore the efficiency of the provenance management within specific applications areas. The proposal will also explore optimization strategies and opportunities provenance metadata management which would include optimizations of storage requirements and operations, such as recursive queries.","title":"SGER: Towards a Generic Provenance Metadata Management System","awardID":"1049339","effectiveDate":"2010-06-15","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[467660],"PO":["563727"]},"161603":{"abstract":"Today's commodity software is ignorant of users' motor abilities. This places the burden of adaptation on people rather than on technology, and forces users either to struggle with off-the-shelf input devices or to procure specialized assistive devices that are expensive, hard to acquire, and infused with social stigmas. Recent approaches like universal design, inclusive design, and design for all acknowledge this problem, but promote an unachievable \"one size fits all\" ideal. Universal solutions are not the answer! Rather, the answer is the opposite, that is to say highly individualized user interfaces aware of and adapted to users' motor abilities. Such interfaces can enable people to use cheap readily-available everyday input devices like mice, touch pads, and trackballs when controlling desktop software. Creating software that matches users' abilities is the focus of the PI's concept of ability-based design, and this research extends the PI's prior work on ability-based design with new software tools for advancing this nascent methodology. These tools will focus on measuring and modeling target acquisition and text entry, two fundamentals of computer input that demand fine motor control, making them key challenges for people with motor impairments. The work will consist of multiple stages. The PI will investigate standard and custom psychomotor movement models for people with motor impairments. He will create and validate a Mouse Perturber tool that injects kinetic noise into an unimpaired movement stream to create simulated motor-impaired performance, making early-stage testing of ability-based prototypes easier. And he will create an Input Observer tool that can rigorously quantify users' performance \"in the wild,\" which requires the inferring of intention outside directed laboratory tasks. He will then develop CAMA, a tool for motor-ability assessment that uses off-the-shelf input devices, and TASK, a tool for quickly creating task models from real user interfaces. Finally, he will integrate CAMA and TASK into a package for assistive technology providers to perform assessment, prediction, and the creation of accessible \"proxy targets.\" Project outcomes will include a scientific investigation of standard and custom psychomotor movement models for people with motor disabilities, discovery of how to rigorously measure target acquisition and text entry behavior outside the lab, the invention and validation of a simulation tool for motor-impaired performance, and the creation, validation, and deployment of a low-cost computer-based motor-ability assessment tool for use in a University of Washington assistive technology clinic.<br\/><br\/>Broader Impacts: This research will enable people with certain types of disabilities to enjoy more usable software matched to their abilities. It will also lead to a new design methodology predicated on a shift in focus from disability to ability, along with four downloadable software tools for improving laboratory, field, and clinical human motor performance evaluations. As an integral part of this research, the PI plans to organize an undergraduate summer workshop that brings informatics and computer science students together with computer users with disabilities to collectively brainstorm new access solutions. He will also develop an educational unit for middle and high school science classes that enables young students to experience simulated disabilities and learn about the roles of scientists and engineers in creating a barrier-free society.","title":"CAREER: Advancing Accessible Computing with Tools for Ability-Based Design","awardID":"0952786","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["522921"],"PO":["565227"]},"173824":{"abstract":"Embedded systems, from automobiles and aircraft to autonomous robots for space exploration, are becoming ubiquitous. A future is envisioned in which large networks of increasingly autonomous embedded systems operate robustly and reliably. Increased levels of automation will require to on-line represent and process huge amounts of data for the design of control schemes that guarantee safety while maintaining performance. A bottleneck in advancement in this direction is complexity. Complexity is established by the natural scale of the system and by the interaction of the physical devices with logic-based control, which create a large number of system behaviors. Current methods in the control synthesis in embedded and hybrid systems usually assume small system size and perfect state measurements. While in some cases such assumptions are satisfied, several realistic applications have large system size and imperfect or partial measurements. <br\/><br\/>To address these problems, this NSF CAREER project is developing a dynamic feedback approach (state estimation plus control) for the monitoring and recovery of multi-agent systems modeled as infinite state transition systems with logic and timed transitions. This approach relies on partial order theory as a key enabler to overcome computational difficulties arising from large system size and from the interaction of continuous evolution and logic. By exploiting partial order structures on the set of states and inputs, this method provides an efficient alternative to enumeration approaches and exhaustive searches, which are common practice in embedded programming. This research is expected to extend our current ability to build provably safe and reliable large-scale multi-agent systems, with potential impact on railway and air traffic control systems, intelligent transportation systems, and large robot teams in adversarial environments","title":"CAREER: A Partial Order Approach to Dynamic Feedback in Multi-agent Decision and Control Systems","awardID":"1046733","effectiveDate":"2010-06-01","expirationDate":"2013-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["526914"],"PO":["565274"]},"161845":{"abstract":"This CAREER project will investigate future memory systems that are scalable with processor technologies and application demands. It identifies memory architecture as a key issue in developing next-generation memory systems that are scalable in terms of performance, power-efficiency and cost, and support heterogeneous memory devices. A Scalable and Universal Memory Architecture (SUMA) is proposed to replace the overly restrictive and homogeneous memory architecture in current computer systems. The project will further investigate a set of innovative techniques to improve memory scalability, including adaptive memory organization, heterogeneous memory management, proactive memory power and thermal management, and flexible memory error protection schemes. <br\/><br\/>With a scalable and universal architecture, computer memory may scale cost-effectively and power-efficiently from gigabytes now to hundreds of terabytes in the future. Many memory-bounded computing problems will be solved at a much larger scale, and many previously intractable problems will become solvable. The proposed education component will expose undergraduate students to the complex performance, power, and thermal issues in the multi-core era, with a focus on memory systems.","title":"CAREER: Scalable and Universal Architecture for Next-Generation Memory Systems","awardID":"0954111","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":[432712],"PO":["366560"]},"161735":{"abstract":"The research focus of this project is to develop a novel evolutionary computation-based approach for identifying candidate modules in non-coding DNA that respond to environmental toxins (such as arsenic) and that alter gene expression. These modules are composed of short pieces of DNA that are binding sites for proteins; the cooperative and combinatorial interactions are believed to contribute to the inducibility and specificity of environmentally responsive genes. Since each gene has an enormous number of possible modules, searching for them in the laboratory is untenable; even an exhaustive computational search for candidate modules is impractical, given the large space. Thus, the development of artificial intelligence techniques is called for.<br\/><br\/>This is an interdisciplinary proposal that makes contributions in both computer science and biology. The computational contributions include designing an effective search through the large and complex space of possible modules. While a few existing tools have been designed to search the thousand base pair region immediately upstream of the gene, the work here is designed to search significantly longer sections, 1 million base pairs and longer in length. The existing approaches cannot be expected to scale to the larger search, requiring the development of a novel approach.<br\/><br\/>The PI has plans for introducing undergraduates to research, both through coursework and in supervised research projects. This proposal will support and encourage the creation of a new upper-level course in informatics as well as the development of informatics-themed exercises to be incorporated at the introductory level. The project will further directly support undergraduate researchers who will contribute to the core research project.<br\/>This project will result in a well integrated program of research and teaching for the PI, contribute to the available tools and our understanding of evolutionary computation approaches for informatics work, and introduce scores of students to this work.","title":"CAREER: Evolutionary Computation and Bioinformatics","awardID":"0953495","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["530489"],"PO":["565136"]},"161867":{"abstract":"This project explores shape models that unite human shape perception, computational tractability and mathematical rigor. In particular, it establishes geometry-based selection criteria for skeletal models, defining the best model to be the one that requires the fewest bits to approximate within a specified error tolerance. The goals of the project are to develop theoretical results establishing selection criteria for skeletal models and to apply those results to shape-dependent industrial projects.<br\/><br\/>Skeletal shape models are attractive for shape-based applications because they decompose shapes into salient parts that can be manipulated independently. Their primary downfall for practical applications, a lack of robustness to noises in the shape boundary, has only recently been addressed. In the classical definition of the skeletal model, each shape has a unique skeleton. That uniqueness creates a geometric rigidity that in turn leads to the lack of robustness. A recent generalized skeletal definition relaxes the uniqueness constraint, allowing multiple skeletal models for each shape. Multiple models provide the flexibility to accommodate noisy shape boundaries, but introduce a new problem in selecting the best skeletal model for a given shape.<br\/><br\/>The project engages capable but disadvantaged students who would otherwise be unaware of research as a career in exciting and relevant research. Broader impacts include extensive collaboration between research students and future teachers to develop learning activities for K-12 classrooms, development of course modules to incorporate concepts from digital image analysis into standard sophomore-level mathematics courses, and development of industrial applications in collaboration with students and industrial partners.","title":"CAREER: Shape Model Selection: Theory and Practice","awardID":"0954256","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["543880"],"PO":["564316"]},"171668":{"abstract":"The ACM SIGCOMM Conference will be held in India for the first time in its history. The conference will be held between August 30 and September 3, 2010, in New Delhi, India. ACM SIGCOMM is the flagship annual conference of the Special Interest Group on Data Communications, a special interest group of the Association for Computing Machinery. This award financially assists approximately 12 graduate students and 3 postdoctoral students from US institutions to attend this conference. Participation in conferences such as SIGCOMM is an extremely important part of the graduate school experience, provides students with an opportunity to interact with more senior researchers and exposes them to leading edge research in the field. The award will enable people in the above categories to attend the main SIGCOMM 2010 conference, who would be otherwise unable to do so. The travel grant chairs are committed to encouraging the participation of women and under-represented minorities.<br\/><br\/>Intellectual Merit: This project proposes to provide travel support for US-based graduate and postdoctoral students to attend the main SIGCOMM 2010 conference. SIGCOMM is the flagship conference in the networking community and a highly competitive venue (with acceptance rate around 10%). Its rich program exposes participants to new ideas and cutting-edge research and allows for interaction between researchers from all over the world.<br\/><br\/>Broader Impact: First, this project integrates research and education of students through exposure to a premier technical meeting in computer networks and communications. Students will have the opportunity to observe high-quality presentations and interact with senior researchers in the field. The proposed student participation is expected to have a positive impact on the students' research interests and quality. Second, the project will promote diversity by encouraging and enabling women and other under-represented minorities to participate. Furthermore, the truly international flavor of SIGCOMM as an annual conference is well-known and reflected in the composition of the Technical Program Committee (TPC) as well as in the authors of the submitted and accepted papers. As such, it cultivates international research interactions and presents a tremendous opportunity to students to increase their breadth of ideas, research approaches, and technical perspectives. Third, as part of this student travel grants program, the PIs are developing an online submission system, based on the widely successful hotcrp, which they will make publicly available for use in the community.","title":"Student Travel Support for the SIGCOMM 2010 Conference","awardID":"1034678","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["552796"],"PO":["565090"]},"163726":{"abstract":"Future computer architectures will execute critical applications ranging from climate modeling to bioinformatics to simulations of new materials. Emerging chip multiprocessors are novel architectures that provide high performance and low power consumption. When multiple applications share the same chip multiprocessor, proper management of architectural resources becomes a critical problem. This research targets inter-application management of different types of resources found in a chip multiprocessor using robust and resilient techniques drawn from formal feedback control theory. It enables applications to satisfy their performance requirements and, at the same time, maximizes the utilization of hardware resources. <br\/><br\/>This research helps to make the transition from conventional architectures to chip multiprocessors smoother, and as a result, maximizes the number of critical applications that can take advantage of these emerging architectures. The transfer of the technology being developed to IBM and HP Labs allows serious testing of the proposed strategies in large-scale architectures built from chip multiprocessors. The results from this project not only present an accurate assessment of feedback control theory in a new domain, but also get integrated into two important software infrastructures, Singularity and Xen, both used extensively by large research communities. This research also accommodates two efforts in broadening participation, CISE Visit in Engineering Weekends (VIEW) and NASA-Aerospace Education Services Project (NASA-AESP) at the Center for Science and the Schools (CSATS).","title":"SHF: Medium: Automatic Control Driven Resource Management in Chip Multiprocessors","awardID":"0963839","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550407","542016","396478"],"PO":["366560"]},"162704":{"abstract":"This research is motivated by the need for robust and intelligent clinical procedure of 'catheterization' which is widely used in medical communities. In this research, the fundamental framework to develop active catheters using an electro-active polymer called Ionic Polymer-Metal Composite (IPMC). The research work includes the design and fabrication methodologies of robotically controlled IPMC catheters as well as shape controls needed for use in complex passages. The research results will be disseminated in technical conferences and workshops as well as prototype demonstration. Knowing that the catheter based medical therapy\/diagnosis is one of important medical technologies and all existing catheters in the market are based upon human operations, this active catheter technology will pave the way to a new biorobotic medical tool that can significantly contribute to improving quality of life.","title":"II-NEW: Collaborative Research: Robotic Catheterization Using Ionic Polymer-Metal Composite Actuator","awardID":"0958565","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[434794],"PO":["543539"]},"170239":{"abstract":"The past two decades have witnessed the exploration of a range of grammatical formalisms by computational, theoretical, and psycho linguists, for their utility in building natural language interfaces and machine translation systems, characterizing the nature of human linguistic knowledge, and constructing models of language processing. Because many of these formalisms share important formal and linguistic properties (most prominently, mild context-sensitivity and lexicalization), there are many potential synergies, computational, theoretical and psychological, that can be gotten by considering ideas that stem from work outside of particular formalism. Moreover, though theoreticians, computationalists, and psychologists are concerned with solving different problems, ideas that derive from one community often turn out to have a significant consequences for the others. <br\/><br\/>The goal of this NSF-sponsored workshop, which will take place at Yale University on June 10-12, 2010, is to foster both of these types of connections: across the formalism divide and the theoretical-computational-psycho divide. The Tree-Adjoining Grammar community has a history of exploring these connections, and this workshop aims to expand the community of researchers involved in such cross-pollination even further. The workshop will bring together researchers from the Tree-Adjoining Grammar, Minimalism, Categorial Grammar, Dependency Grammar, HPSG, and LFG communities to look at the similarities and differences of the formalisms, with the goals of developing shared, broad-coverage grammars, transferring parsing and machine learning algorithms from one formalism to another. and gaining new insights into the properties of different formalisms and their capacity for linguistic and psycholinguistic explanation. <br\/><br\/>This award provides support crucial to attract to the workshop not only prominent researchers, who will give invited presentations and tutorial lectures, but also, and perhaps even more importantly, PhD students. By introducing junior researchers to the fruitfulness of cross-framework and cross-disciplinary interactions at an early stage in their careers, our hope is that the award will have a transformative effect on the kind of work they will engage in during their entire careers, potentially leading to a broader, more integrated perspective in the field at large.","title":"Workshop: 10th International Workshop on Tree Adjoining Grammars and Related Formalisms (TAG+10)","awardID":"1026078","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["484584"],"PO":["565215"]},"172825":{"abstract":"One of the primary uses of interpersonal communication channels such as texting, instant messaging and mobile phone conversations is to coordinate social activities, such as the planning of a future face-to-face meeting. The PI has coined the term \"outeraction\" to refer to the communicative processes used by people to manage future interactions (interactions about future interactions). Yet while outeraction is often primarily conducted through mobile communication, existing mobile applications provide limited or ineffective outeraction-support. This results in people investing a lot of effort into coordinating everyday activities using unstructured serial communication between relevant parties, thereby wasting a significant amount of time. The PI argues that the potential for the ever increasing adoption of \"smart phones\" to transform everyday social coordination through the systematic development of mobile outeraction-support systems is hampered, because to date outeraction-support system building has lacked a firm foundation. There are few conceptual frameworks, little empirical knowledge of user requirements and attitudes, and the efficacy of system designs has not been established. Thus, despite more than 20 years of CSCW research into coordination processes, researchers have yet to instantiate a mobile outeraction-support system that demonstrates a systematic understanding of the overall design space and provides outeraction-support by complementing existing group norms for coordination. The broad goal of this EAGER is to lay the foundation, through the instantiation of innovative software that embodies lessons learned from studies into everyday social coordination practices, for future work that will significantly expand our knowledge of how to design mobile outeraction-support systems. A particular focus will be to address people's desire for a shared view of the status of the activity planning process (e.g., knowing who can come to an event at a particular time). As part of the research plan, the PI will conduct a series of laboratory and field studies in which he will explore issues such as the importance of reachablity and locatablity of actors and resources to the social activity coordination and negotiation process, the extent to which negotiations \/ conversations regarding key components of a social activity (its 'what', 'where', 'when', 'why', and 'how') can be scaffolded or require open discourse between actors, and the types of group interaction management (floor) controls individuals often use to organize social activities (current event management software often assumes a single event organizer and provides floor controls that match that assumption, even though everyday experience suggests that social coordination is often far more democratic and ad hoc). Each of the studies will be associated with extensive software application development, which will exploit and build upon the hardware resources made available at the PI's institution through the NSF-sponsored SmartCampus mobile social computing system testbed.<br\/><br\/>Broader Impacts: Using computer technology to improve people's ability to engage in social activities of interest and coordinate with others is a simple way to increase our social connectivity. This is important, because individuals embedded in richly connected social environments are better able to handle personal setbacks such as financial failures and illness, and to provide social support for others. Therefore, developing mechanisms for the deployment of mobile outeraction-support systems, so that we are able to more effectively coordinate with one another, is important for society as a whole.","title":"EAGER: Transforming Everyday Social Activity Coordination Through Mobile Outeraction-Support Systems","awardID":"1041476","effectiveDate":"2010-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["538322"],"PO":["565227"]},"163717":{"abstract":"Detection, identification, and tracking of CBRNE (Chemical, Biological, Radiological, Nuclear, and Explosive) plumes can be accomplished by combining the modalities of sensor and cyber networks. The sensor network provides information about physical-space activities, e.g., locations and movements of the plume sources. The cyber network provides storage and computational resources to analyze and infer where the plume originated, the trajectory of its movement, and the prediction of its future movement. The challenges in realizing such a sensor cyber network include intelligent sensing (intelligent sensor selection and coverage) and the capability to deal with uncertainties (uncertainty in measurement as well as in modeling). This project proposes to leverage the convergence between the sensor and the cyber networks to achieve these goals. In particular, the plan is to carry out three synergistic research tasks: 1) network formation by sensor selection, placement, and coverage; 2) sensor tasking protocol with temporal\/spatial uncertainty management; 3) protocols for reliable sensor-cyber communication supporting the above two tasks. The PIs will prototype the research results and integrate the prototypes for different components to build the sensor cyber network for plume detection, identification and tracking. They will also evaluate the sensor cyber network using various test scenarios in collaboration with Oak Ridge National Lab. If successful, the project will provide technology for building detection and tracking sensor networks that can give great protection to people and the environment against harmful plumes.","title":"NeTS: Medium: Collaborative Research: Building an Intelligent, Uncertainty-Resilient Detection and Tracking Sensor Network","awardID":"0963812","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["485106"],"PO":["565303"]},"171649":{"abstract":"This proposal is to support a workshop on Applications of Computer Vision in Archaeology. The workshop will bring together about 100 archaeologists, cultural heritage preservationists, computer vision, visualization, graphics, and new media research and practitioners to discuss the state-of-the art in current research. The event will also provide a forum for planning and coordination of future efforts. Since the first workshop on Applications of Computer Vision in Archaeology was held in June 2003 the domain of research interest has broadened significantly to include research in graphics and visualization. At present, nearly all phases of archaeological practice, from discovery in the field, through artifact analysis and conservation, to the presentation of new findings to the public are in a period of radical change. Computer vision research combined with graphics, visualization and computational methods have made available to archaeology and other interdisciplinary research dealing visual artifacts a rich set of tools and methods to extend research capabilities. New efforts range from the creation of virtual libraries (digital publishing of field records) to computer-assisted artifact mending technologies to 3D presentations of historical site interpretations.","title":"Workshop on Applications of Computer Vision in Archaeology ACVA?10 -- Vision, Visualization, and Computational Methods to Cultural Heritage Needs.","awardID":"1034594","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[459566],"PO":["564456"]},"161838":{"abstract":"One of the goals of computer vision is to build a system that can see people and recognize their activities. Human actions are rarely performed in isolation -- the surrounding environment, nearby objects, and nearby humans affect the nature of the performed activity.<br\/>Examples include actions such as \"eating\" and \"shaking hands.\" The research goal of this project is to approach human performance in understanding videos of activities defined by human-object and human-human interactions.<br\/><br\/>This project makes use of structured, contextual representations to make predictions given spatiotemporal data. It does so by extending recent successful work on object recognition to the space-time domain, introducing extensions for spatiotemporal grouping and contextual modeling. Video enables the extraction of additional dynamic cues absent in static images, but this poses additional computational burdens that are addressed through algorithmic innovations for approximate parsing and large-scale discriminative learning.<br\/><br\/>To place activity recognition on firm quantitative ground, the proposed models are evaluated using concrete metrics based on activities of daily living (ADL) and human proxemic models from the medical and anthropological communities. Examples include systems for automated monitoring of stroke patients interacting with everyday objects and automated analysis of crisis response team interactions during emergency drills. This project produces non-scripted, real-world, labeled action recognition datasets, of benefit to the research community as a whole.","title":"CAREER: Discriminative Spatiotemporal Models for Recognizing Humans, Objects, and their Interactions","awardID":"0954083","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[432698],"PO":["564316"]},"163906":{"abstract":"Partial synchrony refers to computing environments where timing bounds exist for communication delays and processing speeds, but knowledge of these bounds may be limited or unknown. Although such bounds are only implicit, they can still be used to advantage for building reliable distributed systems in the presence of message loss and crashed processors. The central problem however, is how timing parameters for partial synchrony should be modeled, measured, and denominated.<br\/><br\/>Since its inception some 25 years ago, the prevailing paradigm of chronometry-based models has invoked real-time as a formal basis for modeling temporal bounds on message delays and process speeds. Unfortunately, such models are intrinsically limited (and even flawed) as descriptions of empirical distributed systems, because the characteristic property of partial synchrony is not chronometric timeliness, but rather chronological fairness.<br\/><br\/>This project is developing a fundamental theory of partial synchrony based on the notion of chronological fairness. The key technical innovation is that system failures can be detected in executions that are unfair, rather than untimely. This approach leads to greater generality because many untimely executions are still fair. Theoretical results codify a hierarchy of fairness properties, including technical limitations, expressivity, and reducibility to oracular models. Practical results extract fairness models from empirical systems. An integrated critique of chronometric models helps to initiate a broader shift in research trends to focus on fairness-based paradigms of partial synchrony.","title":"AF: Medium: A Fair Prescription for Partial Synchrony","awardID":"0964696","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7934","name":"PARAL\/DISTRIBUTED ALGORITHMS"}}],"PIcoPI":[438784,438785],"PO":["565251"]},"163719":{"abstract":"Emerging trends suggest that a significant share of Internet traffic will be due to real-time streaming applications. However, given the unpredictable nature of popularity of any content and the significant swings seen in user demand, provisioning a centralized content distribution system that can guarantee the strict quality of service constraints needed for real-time streaming is a very difficult task. Therefore, this project studies modeling paradigms and systems design for utilizing end-user resources for real-time streaming in a peer-to-peer (P2P) fashion. The rationale is that P2P networks can dynamically adapt to changing network conditions and service requirements more easily than centralized content distribution systems.<br\/><br\/>This research effort takes a holistic approach in which, on one hand, we study fundamental performance limits of peer-to-peer streaming and design distributed algorithms to achieve these limits. On the other hand, we use these algorithms as building blocks to construct practical protocols that are implemented and validated on an emulation testbed. We bring together a rich set of analytical tools drawn from stochastic processes, optimization and control theory to merge them with real-life multimedia issues of video coding, frame dropping and trans-coding as well as practical implementation issues. Besides the technological impact of developing viable video-streaming ideas for an increasingly networked world, our project also informs and educates both students and the broader society with curriculum development, outreach and integration of under-represented groups.","title":"NeTS: Medium: Collaborative Research: Modeling, Design and Emulation of P2P Real-Time Streaming Networks","awardID":"0963818","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["525195"],"PO":["565090"]},"171959":{"abstract":"The goal of this workshop is to bring together researchers interested in running novel network experiments at scale and under realistic conditions with the designers and developers of the current suite of infrastructure available through GENI, which is rapidly taking shape in prototype form across the US. GENI has the goal of becoming the first laboratory for exploring networks of the future through innovatations in network science, security, technology, services and applications.<br\/><br\/>The workshop attendees will consist of 20 to 30 two-person teams, typically, a researcher and his or her graduate student, selected through a white paper competition. They will be given technical tutorials on the various GENI components and resources and how to launch experiments that span more than one part of the infrastructure (e.g., bridging PlanetLab, Proto-GENI and OpenFlow.) The researchers will also have opportunities to propose experiments and describe the associated operational, workflow, instrumentation, measurement, and security requirements for that experiment. <br\/><br\/>This workshop will develop a common understanding of the GENI network infrastructure and build a community of researchers using GENI for their experiments. It is expected that some of these teams will propose their experiments to NSF, which will result in the demonstration of new research ideas and experiments not possible on any other network testbed.","title":"Workshop for GENI Experiments","awardID":"1035969","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["531675"],"PO":["468236"]},"161729":{"abstract":"Reliable operation of wireless embedded systems is a crucial requirement due to their increasing use in a variety of mission-critical application domains. One of the biggest impediments to ensuring reliable operation is the fact that, post deployment, designers have very little visibility and control over (and hence understanding of) the behavior and operational state of remotely deployed embedded systems. This project addresses the above challenge and is based on the premise that, especially for remotely deployed embedded systems, visibility and control cannot be treated as mere afterthoughts, but should be treated as prime considerations throughout the hardware and software design process.<br\/><br\/>In terms of intellectual merit, the project is pursuing two complementary research thrusts: (i) The project is investigating the design of new embedded hardware platforms that feature explicit hardware hooks to provide enhanced visibility and control over the functioning of the platform, and (ii) The project is exploring new embedded software architectures that provide fine-grained remote visibility and control over the execution of embedded software in a lightweight, easy to use, and non-intrusive manner, without disrupting normal software execution on the system.<br\/><br\/>In terms of broader impact, the project has the potential to positively impact the adoption and acceptance of wireless embedded systems in a variety of consumer and mission-critical applications. In addition to enhancing graduate and undergraduate courses on embedded systems at Purdue, results from the project are impacting the broader community through unique programs at Purdue such as the Engineering Projects In Community Service.","title":"CAREER: A Hardware-Software Approach to Enabling In-Situ Visibility and Control in Wireless Embedded Systems","awardID":"0953468","effectiveDate":"2010-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["451692"],"PO":["565255"]},"163909":{"abstract":"The perceived quality of a software product depends strongly on field failures viz., defects experienced by users after the software is released to the field. Software managers work to constantly improve quality control processes, seeking to reduce the number of field failures. Static analysis is a powerful and elegant technique that finds defects without running code, by reasoning about what the program does when executed. It has been incubating in academia and is now emerging in industry. This research asks this question: How can the performance and practical use of static analysis tools be improved ? The goal of the research is to find ways to improve the performance of static analysis tools, as well as the quality-control processes that use them. This will help commercial and open-source organizations make more effective use static analysis tools, and substantially reduce field failures.<br\/><br\/>Using historical data from several open-source and commercial exemplars, the research will retrospectively evaluate the association of field failures with static analysis warnings. The research will evaluate the impact of factors such as experience of the developer, the complexity of the code, and the type of static analysis warning on failure properties such criticality, and defect latency (time until a defect becomes a failure). A wide variety of projects will be studied, including both commercial and open-source. The resulting data will be analyzed using statistical modeling to determine the factors that influence the success of static analysis tools in preventing field failures. Some field failures may have no associated static analysis warnings. This research will identify and characterize these failures, paving the way for new static analysis research. An integrated educational initiative in this proposal is the training of undergraduates by using bug fixes as pedagogical material; undergraduates will also help annotate the corpus of field failures with information relevant to our analysis. An important byproduct of this research, is a large, diverse, annotated corpus of field failures of use to other educators and researchers in empirical software engineering, testing, and static analysis.","title":"SHF: Medium: How Do Static Analysis Tools Affect End-User Quality","awardID":"0964703","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["531418","562712",438795,"562714"],"PO":["564388"]},"158185":{"abstract":"This project maintains and enhances existing community software <br\/>infrastructure, and creates new community data infrastructure to <br\/>enable the information retrieval research community and related <br\/>research communities to conduct research on a \"web scale\", <br\/>meaning datasets of a billion or more web pages together with <br\/>large query logs. The software infrastructure is based on the <br\/>Lemur Toolkit and the associated Indri search engine, which are <br\/>used by many information retrieval researchers due to the support <br\/>for multiple retrieval models, multiple forms of evidence, and a <br\/>powerful probabilistic query language. The enhancements to Lemur <br\/>include support for the popular MapReduce style of distributed <br\/>processing and other efficiency improvements to make it practical <br\/>to do research on large web datasets 'out of the box' in common <br\/>computer hardware environments. <br\/><br\/>The new data infrastructure consists of maintenance and <br\/>distribution of a newly created billion-page dataset, another new <br\/>web dataset, and large, anonymized search logs that match the <br\/>datasets. The combination of large datasets and corresponding <br\/>large search logs enable a broad community to conduct research <br\/>with more realistic data resources than were available <br\/>previously. This research will lead to further advances in the <br\/>understanding of the underlying issues for large-scale, <br\/>personalized search, which will be an important part of the next <br\/>generation of search engines. <br\/><br\/>For further information, see the project web site at the URL: <br\/>http:\/\/www.lemurproject.org.","title":"CI-ADDO-EN: Collaborative Proposal: Supporting Web-Scale Experimentation Using the Lemur Toolkit","awardID":"0934358","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["541869"],"PO":["560586"]},"172092":{"abstract":"Cyber Physical Systems (CPS) are ones that integrate computation, communication and storage capabilities with the monitoring and\/or control of the physical and engineering systems. Such systems must be operated safely, dependably, securely, efficiently and in real-time. CPS research is expected to have significant technical, economic and societal <br\/>impacts in the near future in multiple sectors including transportation systems, smart grids, energy-aware buildings, agriculture, water\/sewage treatment, environmental management and manufacturing systems. A core aspect of CPS is its multidisciplinary nature requiring the teamwork, cooperation and collaboration of experts including computer scientists, hardware engineers, control experts, software engineers, network specialists, computer architects, sensor experts, electrical engineers, material engineers, and structural engineers.<br\/><br\/>The award is for support for student travel to CPS Week 2010 and the First International Conference on Cyber-Physical Systems (ICCPS) to be held April 12-16, 2010 in Stockholm, SWEDEN and some start-up activities for the inaugural ICCPS.<br\/><br\/>More specifically, the goals are three-fold: <br\/>1. Encourage attendance at CPS Week 2010 by students based in the US to listen to and learn from the keynote speeches, presentations, posters and demos on cutting-edge topics on cyber-physical systems. <br\/>2. Promote the robust growth of a research community in the nascent area of cyber-physical systems. <br\/>3. Support activities of the inaugural ACM\/IEEE International Conference on Cyber-Physical Systems, whose aim is to become a main forum for hosting original research which targets the inter-disciplinary nature of cyber-physical systems. The specific areas of interactions across embedded systems, hybrid systems, real-time systems and sensor networks are of interest in this forum.","title":"Support for CPS Week 2010 and ICCPS 2010 Conference Travel and Activities","awardID":"1036440","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[461012],"PO":["561889"]},"158167":{"abstract":"This project maintains and enhances existing community software<br\/>infrastructure, and creates new community data infrastructure to<br\/>enable the information retrieval research community and related<br\/>research communities to conduct research on a \"web scale\",<br\/>meaning datasets of a billion or more web pages together with<br\/>large query logs. The software infrastructure is based on the<br\/>Lemur Toolkit and the associated Indri search engine, which are<br\/>used by many information retrieval researchers due to the support<br\/>for multiple retrieval models, multiple forms of evidence, and a<br\/>powerful probabilistic query language. The enhancements to Lemur<br\/>include support for the popular MapReduce style of distributed<br\/>processing and other efficiency improvements to make it practical<br\/>to do research on large web datasets 'out of the box' in common<br\/>computer hardware environments.<br\/><br\/>The new data infrastructure consists of maintenance and<br\/>distribution of a newly created billion-page dataset, another new<br\/>web dataset, and large, anonymized search logs that match the<br\/>datasets. The combination of large datasets and corresponding<br\/>large search logs enable a broad community to conduct research<br\/>with more realistic data resources than were available<br\/>previously. This research will lead to further advances in the<br\/>understanding of the underlying issues for large-scale,<br\/>personalized search, which will be an important part of the next<br\/>generation of search engines.<br\/><br\/>For further information, see the project web site at the URL:<br\/>http:\/\/www.lemurproject.org.","title":"CI-ADDO-EN: Collaborative Proposal: Supporting Web-Scale Experimentation using the Lemur Toolkit","awardID":"0934322","effectiveDate":"2010-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["507668"],"PO":["560586"]},"172270":{"abstract":"The rapid deployment of cloud computing services and their attraction for small and medium businesses requires a thorough examination of security issues. Indeed cloud computing brings a host of new security issues that have not been addressed in the past research, namely the lack of trust between the infrastructure provider and customers (e.g., service providers) and potential for misuse of cloud computing resources for data exposure or service disruption. In this research, the PI addresses major security issues brought about by cloud computing. In particular, it plans to investigate underlying hardware\/architectural mechanisms for three main issues related to cloud computing security: (a) simultaneous encryption and access control to protect service provider's data from infrastructure provider, (b) securing cloud resident data by scattering the data, meta-data, or encryption keys in the cloud, and (c) coordinated monitoring of both incoming and outgoing traffic of VMs in the cloud in order to detect any spyware installed in the cloud. <br\/>The research could have a significant impact on providing security for cloud computing. The other broader impacts of the research include graduate student training and integration of the research findings into graduate courses. The scholarly discovery of this project will be disseminated broadly through publications and, where appropriate, technology transfer to industry.","title":"SHF: Small: EAGER: Architectural Support for Improving Cloud Computing Security","awardID":"1037987","effectiveDate":"2010-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7683","name":"SOFTWARE DEVELOPEMENT FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["540637"],"PO":["366560"]},"172160":{"abstract":"Computational sustainability is an emerging field, developing and applying computational methods, notably of articial intelligence, to difficult problems of long-term environmental and societal sustainability. This award supports the travel and subsistence of graduate students, postdoctoral fellows, and other junior researchers for participation at the 2nd International Conference on Computational Sustainability (June 28-30, 2010, Cambridge, MA).","title":"Second International Conference on Computational Sustainability","awardID":"1036816","effectiveDate":"2010-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[461208],"PO":["491702"]}}