{"47571":{"abstract":"This research focuses on some fundamental problems in pattern\/object recognition\/classification, such as gleaning geometric information from images\/signals. The investigator proposes to develop nonlinear estimation and filtering techniques capable of coping with noise while preserving the features<br\/>of interest. Starting with the celebrated Perona-Malik partial differential equation, the investigator proposes to develop a fully probabilistic approach naturally compatible with the presence of the perturbation noise as well as with the underlying geometry typically crucial in this class of problems. Nonlinear diffusions techniques may then be formulated by way of nonlinear stochastic differential equations which in turn, lead to nonhomogeneous Markov chains. In addition to the education goal of motivating and improving the classroom experience, this research has four main objectives:<br\/> 1. To construct a stochastic framework for interpreting and analyzing Nonlinear Scale Space Analysis. They intend to apply the Stochastic Differential Equations (SDE) mathematical machinery and intuition to advance the understanding of nonlinear scale space analysis.<br\/> 2. To recast the variational formulation usually corresponding to a nonlinear evolution equation in a ``{\\em controlled diffusion}'' setting, and thereby facilitate the choice of evolution and impose constraints for a desired solution.<br\/> 3. To fully use the above insights to construct a unifying framework that embraces the multiscale wavelet-based and the scale space analyses, and by the same token provide an analytical track to facilitate performance assessment as well as exploit the respective strengths of the two frameworks. The interplay and expected synergy will in addition provide a mechanism for analyzing\/extracting other features in an image, such as texture, shapes, specific junctions and others.<br\/> 4. Apply their theoretical\/algorithmic results to specific tasks <br\/>in pattern classification and recognition problems (in particular shape recognition for wood lumber applications) which have recently been posed to them <br\/>by some industrial partners.","title":"Nonlinear Smart Diffusion: A Probabilistic Approach","awardID":"9984067","effectiveDate":"2000-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["518008"],"PO":["562984"]},"47483":{"abstract":"One of the best methods of presenting large scientific data sets to users is visualization. Over the past ten years, our ability to create useful visualizations has undergone a revolution due to advances in 3D graphics hardware and software technology. However, we still face endless challenges as the complexity and scale of the data, whether from physical experiments or computer simulation, continue to grow. In many cases, visualization of large-scale data sets is very expensive, sometimes even more expensive than the supercomputer simulation that produced the data in the first place. This project will perform a comprehensive study aimed at two questions that arise from this situation. First, can we use parallel supercomputers to generate data and for visualization calculations in an optimal fashion? Second, are there mechanisms and methodologies to enhance the productivity of scientists doing exploratory and production visualization? <br\/><br\/>The project will develop a fully parallel visualization system to maximize the overall throughput of the system. This system will emphasize computing on clusters of PCs. Four major sub-themes of this part of the project will be parallel preprocessing algorithms to prepare data for visualization, parallel rendering algorithms to produce the graphics, parallel image compression and transport to efficiently manage the graphics, and application-controlled parallel I\/O to store the data for visualization. The project will particularly focus on parallel feature-enhanced visualization algorithms and parallel subsetting of the visualized data. Complementing the research component of this project is an educational component, directed at undergraduate and graduate students, aimed at inspiring interest and fostering creativity through hands-on experiences. One aspect of this education is an applied visualization course to non-CS graduate students, which should foster greater interaction and cross-fertilization of ideas from the students' home departments.","title":"PECASE: Parallel Visualization and Interaction Techniques for Exploring Large Scale Volume Data","awardID":"9983641","effectiveDate":"2000-02-01","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["552243"],"PO":["565272"]},"48011":{"abstract":"EIA-9985971<br\/>Constantine Katsinis<br\/>Drexel University<br\/><br\/>CISE Research Instrumentation: Prototype Development of the Simultaneous Optical Multiprocessor Exchange Bus Computer<br\/><br\/>The Department of Electrical and Computer Engineering at Drexel University will purchase digital design and test equipment, optical design and test equipment processor boards, programmable logic design equipment, software, and personal computers to support programming, designing, testing and debugging activities. The focus of this research is on the Simultaneous Optical Multiprocessor Exchange Bus (SOME-Bus) computer network architecture. Work on the SOME-Bus involves multidisciplinary research in computer architecture and networks, optoelectronic devices, fault tolerance, performance analysis (mathematical modeling and simulation), and VLSI design. Its purpose is to create an optoelectronic prototype of the SOME-Bus, a research platform that will demonstrate the enhanced performance necessary to support current and future data processing and scientific processing requirements. The equipment will be used for several research projects, in particular:<br\/><br\/>1. Prototype development of the SOME-Bus computer network architecture.<br\/>2. High-sensitivity high-bandwidth detectors based on heterodimensional contacts.","title":"CISE Research Instrumentation: Prototype development of the Simultaneous Optical Multiprocessor Exchange Bus computer","awardID":"9985971","effectiveDate":"2000-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["528361","543562"],"PO":["309350"]},"47991":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for an OC-3 connection. Applications include remote operation of scientific instrumentation, visualization and imaging, environmental studies that focus on the U.S. - Mexico border region around El Paso, regional water resource management, and storage and transmission of massive datasets. Collaborating institutions include but are not limited to the Stanford Synchrotron Radiation Laboratory, UT- Austin, Texas A&M, Purdue University, Rice University, UCLA, the University of Wisconsin, Los Alamos National Laboratory, the National Institutes of Health, and several Mexican institutions of learning.","title":"Access To The Next Generation Internet","awardID":"9985906","effectiveDate":"2000-02-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[122633],"PO":["182196"]},"46168":{"abstract":"This project will extend global visual display techniques with local visualization<br\/>methods, which combine graphics with haptic (force feedback) displays in three areas:<br\/><br\/>1. Allow users to apply well-known local techniques (e.g. streamlines or<br\/> releasing colored dyes) within a globally visualized display (created by line integral<br\/> convolution (LIC), volume rendering, or feature extraction).<br\/>2. Develop haptic interfaces to complement the local visual methods for<br\/> representing vector fields. These interfaces will be tested and compared with each other and with visual methods.<br\/>3. Integrate haptic and visual algorithms into a computational steering environment. This will allow for fast feedback upon changing visualization parameters, such as the location of a 3D, stream line advection widget or the method of haptic interaction.<br\/><br\/>The project will use a co-registered, semi-immersive environment consisting of a Fakespace Immersive Workbench and a large SenseAble Phantom 3.0 haptic device; other haptic devices may be added later. By co-registering haptics in the semi-immersive workspace, the user will have the ability to both see and feel the field under study.","title":"Interactive Flow Visualization Using Haptics","awardID":"9978063","effectiveDate":"2000-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["513354","496204","558600"],"PO":["551992"]},"45014":{"abstract":"EIA-9972889<br\/>Jack J. Dongarra<br\/>Micah D. Beck<br\/>Michael W. Berry<br\/>Jens Gregor<br\/>Michael A. Langston<br\/>University of Tennessee<br\/><br\/>CISE Research Infrastructure: The Scalable Intracampus Research Grid for Computer Science Research<br\/><br\/>The University of Tennessee (Knoxville) will build a computational grid at the University that will support their research in grid computing systems as well as advance applications that the grid will eventually support. The campus grid will consist of several grid service clusters - cycle servers linked in an advanced network. Grid research will address middleware to support performance based management that can seek out most appropriate software and other services, support distributed data management, process migration, load balancing, scheduling and fault-tolerance. Middleware will be based on their existing NetSolve project. Other systems supporting the grid include the Internet Backplane Protocol for fine-grained naming and distributed storage, checkpointing research, and the Network Weather Service for performance monitoring. Applications to be supported with the developing grid include medical imaging, materials design (such as lubricants), computational ecology, and machine design. Applications will benefit from the full capabilities of several clusters as well as provide challenging applications to push the grid programming interface and technology.","title":"Research Infrastructure: The Scalable Intracampus Research Grid for Computer Science Research","awardID":"9972889","effectiveDate":"2000-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["558550","364563","398611","530745",114423],"PO":["539087"]},"39745":{"abstract":"Many signal-processing systems operate at least partly in the digital domain on signals that originate in analog form. In implementing the required digital-signal-processing (DSP) circuits for such systems, CMOS technologies have become dominant because of their high densities and low power dissipations. To reduce system cost and increases portability, both increased levels of integration and reduced power dissipations are required, forcing the associated analog interface circuits to use CMOS compatible technologies. When implemented in CMOS technologies, however, such interface circuitry often limits the performance of the overall signal-processing systems.<br\/><br\/>Therefore, the theme of this research is to study techniques that can overcome the accuracy and speed limitations in CMOS analog interface circuits. In particular, this research will focus on techniques to overcome the mismatches in high-speed, parallel, time-interleaved analog-to-digital converters and to improve linearity of analog-to-digital converters. Specific objectives of the proposed research are:<br\/>1. to develop background-calibration techniques that can overcome the accuracy, linearity and\/or conversion-rate limitations of analog interface circuits and<br\/>2. to demonstrate these techniques by fabricating prototypes.","title":"High Performance Analog-to-Digital Interfaces in CMOS Technologies","awardID":"9901925","effectiveDate":"2000-02-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[100779,"450892"],"PO":["564898"]},"48039":{"abstract":"EIA-9986042<br\/>George Karypis<br\/>University of Minnesota<br\/><br\/>CISE Research Instrumentation: Cluster Computing for Knowledge Discovery in Diverse Data Sets<br\/><br\/>The Department of Computer Science & Engineering at the University of Minnesota will purchase the following equipment which will be dedicated to support research in computer and information science and engineering. The requested instrumentation consists of 10 dual processor Dell 410 workstations with a total of 10GB of main memory, a CISCO Catalyst 4000 Gigabit switch, and a Hitachi 5750 E RAID system with a total of 360GB storage. This equipment will be used to form a computer cluster suited for data-and compute-intensive applications.<br\/><br\/>The equipment will be primarily used by four research projects which address research problems in the area of knowledge discovery, including in particular: data mining of genomic and scientific data sets, spatial data mining, next-generation recommender systems, and bid evaluation in multi-agent contracting. For several of these projects, the currently available equipment are either inadequate or obsolete for supporting their core needs. For other projects, the availability of this equipment will make a significant increment to their capabilities. The collective needs of these projects are for a tightly-coupled, high-performance, large-memory cluster of computers with a high-performance high-capacity storage server attached to it.","title":"CISE Research Instrumentation: Cluster Computing for Knowledge Discovery in Diverse Data Sets","awardID":"9986042","effectiveDate":"2000-02-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["561562","550903","483488","550380","531622"],"PO":["557609"]},"58643":{"abstract":"","title":"An Effective Framework for Realizing Derivation Systems","awardID":"0096322","effectiveDate":"2000-02-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["499410"],"PO":["564388"]},"47865":{"abstract":"CAREER: Software Frameworks to Enable Parallel, Adaptive, Multiscale Simulation of Turbulence<br\/><br\/>Computational Fluid Dynamics (CFD) is the numerical simulation of the behavior of fluids, such as the flow of air over a car body or airplane wing or the flow of water past a ship. This is a classic problem in computational science, with great implications for both science (understanding the fluids) and industry (improving performance of land, air, and sea vehicles). Important cases of CFD - particularly turbulence, where a broad range of scales interact - are still unsolved problems. This project will attack those problems using modern multiscale computational methods.<br\/><br\/>The goal of this project is the development of computational frameworks necessary to efficiently simulate turbulent flows at different approximation and resolution levels. It will integrate existing physics-based turbulence models with modern multiscale methods, where subgrid-scale models are based on mathematical analyses of the discrete methods used to solve the underlying partial diffential equations. The project will develop a parallel and adaptive computational environment that automatically combines mesh refinement and coarsening with method-order variation to achieve high efficiency. The resulting framework will also support dynamic load-balancing, new a posteriori error estimation procedures, and appropriate data structures for high performance on a variety of modern computer architectures. Lessons learned from this framework will provide insight into frameworks for other complex phenomena. The framework will also enable rich educational rewards. Young children are fascinated by interactive computer simulations of the world (e.g. why do airplanes fly, or baseballs curve); the framework can be packaged to let them play with these concepts, and eventually attract them into a career in science and engineering. At the college level, the framework can be used to explain fluid mechanics concepts to engineering students, let CS students analyze communication behavior in a real application, and illustrate numerical analysis to undergraduate and graduate students.","title":"CAREER: Software Frameworks to Enable Parallel, Adaptive, Multiscale Simulation of Turbulence","awardID":"9985340","effectiveDate":"2000-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["380297"],"PO":["551992"]},"50000":{"abstract":"The recent advances in computer and network technologies and storage, and the vast increase in data availability from sources such as the Internet and satellites present a new challenge to the ways data and information are used and managed. The objective of the workshop is to bring together the PIs and Co-PIs currently funded by the Information and Data Management Program (IDM) of the National Science Foundation to: (1) cooperatively identify the problems that are fundamental in making progress toward this new challenge, specify areas where major breakthroughs appear possible, identify needed collaborations, and identify research initiatives and facilities needed to meet the challenge; (2) provide demonstrations and interact with each other on the objectives, contributions and challenges of major research activities funded by the IDM; and (3) provide an opportunity to program officers from NSF and other government agencies, and industry representatives to learn more about the current research efforts and successes of projects funded by IDM, and for such officers to share their program highlights and concerns. The workshop will generate a report on all projects currently funded by IDM in both hard copy and electronic form. It will help in formulating future directions of research and will suggest promising modalities of research with an aim to foster innovation and technology transfer. The proceedings will provide project information searchable by different criteria and provide connections between discoveries and their use to society.","title":"2000 NSF Information and Data Management Program Workshop to be held March 5-7, 2000 in Chicago, Illinois","awardID":"0001534","effectiveDate":"2000-02-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["389044"],"PO":["563751"]},"41697":{"abstract":"The foundations for governance in an information age are developing through the World Wide Web, as it becomes the principal electronic gateway for the public into government organizations, and a key element in administrative structures and functioning. A key information technology-related attribute of public bureaucracies, openness, provides a novel way to measure the change in administrative arrangements vital to democratic governance. This project is testing three hypotheses: Increases in web technology diffusion into public organizations produce increases in organizational openness, which exists to the extent that an organization provides comprehensive information about its attributes and maintains timely communications directly to all key public audiences. Increases in openness in public organizations produce an expansion of web-oriented \"new knowledge management\" practices that are likely to result in consolidation of managerial authority. Organizational openness to individual citizens via the Web is only indirectly associated with democracy due to the variety of possible institutional arrangements. The project builds on the unique database begun in 1996 by the Cyberspace Policy Research Group (CyPRG). CyPRG scans the Web annually to track national level public agency sites across 192 nations and 26 sectors, creating a longitudinal dataset for comparative studies of technological and organizational change. In order to test these hypotheses, the present proposal plans two main activities. The first is to monitor and analyze the evolution of web-based openness by continuing and expanding the established annual comprehensive identification and evaluation of national-level government agencies' Web operations. This effort will also review and calibrate the Website Attribute Evaluation System (WAES) as needed. WAES measures agency transparency (the extent of data about the agency presented on the Web) and agency interactivity (the extent to which the agency is open to electronic interactions with the website visitor) using 39 specific indicators. The second is the in-depth investigation of effectiveness in electronic governance using targeted cross-national interviews. Both activities contribute to the subsequent quantitative and qualitative analyses that combine data for reciprocal validation. The first activity is critical to understanding the phenomenon; the data collected in identifying sites and then evaluating them systematically is at the heart of investigations into the implications for public agencies and openness of the diffusion of web technologies. The second activity helps practitioners and scholars interested in more micro levels of analysis. Interviews with webmasters and other organizational members provide the best access to charting internal changes due to adoption of web technologies. Together the two activities can provide robust foundations for explaining this remarkable change. Lessons then can be drawn for successfully integrating the Web into public agency operations and enhancing both openness and effectiveness.","title":"COLLABORATIVE RESEARCH: Hotlinked Governance: Openness, Effectiveness and the World Wide Web in Public Organizations","awardID":"9907996","effectiveDate":"2000-02-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[105560],"PO":["288903"]},"47615":{"abstract":"The work conducted in this project focuses on both research and education in computer security. The research effort is geared towards providing security on the Internet. In particular, the research focuses on providing security for web servers and wireless handheld devices. The education effort is aimed at increasing awareness of computer security and training computer security experts at both the undergraduate and Ph.D. levels. The research conducted in this project covers the following topics: <br\/><br\/> Security for handheld devices. Handheld devices (e.g. cell phones, PalmPilots, pagers, digital cameras, etc.) are a fast growing market with clear security concerns. The project studies how security solutions apply in a low power, wireless, handheld environment. For example, the investigators are studying how to use a low power wireless handheld for E-commerce; how to perform encryption and authentication on a low power handheld; and other related questions. New cryptographic techniques. New cryptographic techniques are required for new Internet applications. In this project the investigators are designing new cryptographic techniques for authenticating streamed audio and streamed video and techniques for preserving user anonymity. In addition, the investigators are studying new cryptographic systems for providing improved security guarantees for digital signatures and encryption. The goal is to develop efficient systems for both handhelds and smartcards. <br\/><br\/> Scalable web server security. Security operations, such as SSL, are typically a performance bottleneck when used on a heavily loaded web server. As the web continues to grow it will become essential to improve SSL's performance on the server. The project studies methods for improving SSL's server performance using two techniques: batching and offline preprocessing. The investigators are also developing mechanisms to protect a web site's content integrity. This work ensures that hackers cannot break into a web site and install their own content.","title":"CAREER: Security for handheld devices and the web environment","awardID":"9984259","effectiveDate":"2000-02-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["521488"],"PO":["223414"]},"47758":{"abstract":"This research involves processing of multimodal signals, including speech, image, and video signals. The investigator studies such signal-processing techniques for multimedia applications, ranging from videoconferencing to immersive collaborative environments. While the research in this project covers several interdisciplinary topics, the result of the project is a platform for future research and education where concepts like collaboratories and virtual universities become reality. In this platform, the teacher can interact freely with the students and the students can collaborate remotely on projects. As a result of the interdisciplinary nature of this research, a new signal-processing curriculum is formed by the investigator, which emphasizes the interaction among several traditional courses including image processing, speech processing, image analysis, computer graphics, human-computer interaction, and communication networks.<br\/><br\/>This research covers a number of interdisciplinary topics. In the area of media conversion and integration, the investigator studies audio-to-visual mapping, audio-visual speech recognition, and audio-visual person authentication. Audio-visual speech data are collected to support these tasks. In the area of image analysis and synthesis, the research focuses on facial feature tracking and face animation. In the area of geometry and texture processing of 3D objects, new algorithms for progressively representing, transmitting, indexing and retrieving 3D objects are studied. Integrating these technologies into a smart terminal that interacts with the user, and connecting these terminals to support interaction between users from anywhere at anytime, the investigator builds a networked collaborative environment. While much existing network research focuses on increasing the bandwidth and reducing the delay, this research goes one step further to add functionalities to the network to support remote collaboration. While there is much study done on human-computer interfaces, the investigator strives to put these together to create human-to-human interfaces. The goal of this research is to show that, with multimodal signal-processing technologies, it is possible to create an immersive environment in which the physical terminals and networks become invisible to the users, so that the users can concentrate on the task at hand.","title":"CAREER: Multimodal and Multimedia Signal Processing","awardID":"9984858","effectiveDate":"2000-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["309009"],"PO":["564898"]},"41478":{"abstract":"The foundations for governance in an information age are developing through the World Wide Web, as it becomes the principal electronic gateway for the public into government organizations, and a key element in administrative structures and functioning. A key information technology-related attribute of public bureaucracies, openness, provides a novel way to measure the change in administrative arrangements vital to democratic governance. This project is testing three hypotheses: Increases in web technology diffusion into public organizations produce increases in organizational openness, which exists to the extent that an organization provides comprehensive information about its attributes and maintains timely communications directly to all key public audiences. Increases in openness in public organizations produce an expansion of web-oriented \"new knowledge management\" practices that are likely to result in consolidation of managerial authority. Organizational openness to individual citizens via the Web is only indirectly associated with democracy due to the variety of possible institutional arrangements. The project builds on the unique database begun in 1996 by the Cyberspace Policy Research Group (CyPRG). CyPRG scans the Web annually to track national level public agency sites across 192 nations and 26 sectors, creating a longitudinal dataset for comparative studies of technological and organizational change. In order to test these hypotheses, the present proposal plans two main activities. The first is to monitor and analyze the evolution of web-based openness by continuing and expanding the established annual comprehensive identification and evaluation of national-level government agencies' Web operations. This effort will also review and calibrate the Website Attribute Evaluation System (WAES) as needed. WAES measures agency transparency (the extent of data about the agency presented on the Web) and agency interactivity (the extent to which the agency is open to electronic interactions with the website visitor) using 39 specific indicators. The second is the in-depth investigation of effectiveness in electronic governance using targeted cross-national interviews. Both activities contribute to the subsequent quantitative and qualitative analyses that combine data for reciprocal validation. The first activity is critical to understanding the phenomenon; the data collected in identifying sites and then evaluating them systematically is at the heart of investigations into the implications for public agencies and openness of the diffusion of web technologies. The second activity helps practitioners and scholars interested in more micro levels of analysis. Interviews with webmasters and other organizational members provide the best access to charting internal changes due to adoption of web technologies. Together the two activities can provide robust foundations for explaining this remarkable change. Lessons then can be drawn for successfully integrating the Web into public agency operations and enhancing both openness and effectiveness.","title":"Collaborative Research: Hotlinked Governance: Openness, Effectiveness and the World Wide Web in Public Organizations","awardID":"9907364","effectiveDate":"2000-02-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["207227"],"PO":["471668"]},"41944":{"abstract":"Abstract: The IEEE International Symposium on Information Theory is held approximately every eighteen months at sites alternating between North America and abroad. The 2000 Symposium will be held at Sorrento Palace Hotel, Sorrento, Italy on June 25-30, 2000. This proposal requests support for the travel expenses of U. S. participants, particularly graduate students and young faculty members, whose papers have been selected for presentation at the Symposium, but who lack funds and might not be able to attend without travel support. The co-chairs of the symposium, Ezio Biglieri and Sergio Verdu, will determine who is awarded a travel grant. The average travel grant will be $750.","title":"Group Travel for U.S. Participants for 2000 IEEE International Symposium on Information Theory","awardID":"9908665","effectiveDate":"2000-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["550344"],"PO":["150411"]}}