{"90414":{"abstract":"PROPOSAL NO: 0347649<br\/>INSTITUTION: Cornell University-Endowed<br\/>PRINCIPAL INVESTIGATOR: Apsel, Alyssa<br\/>TITLE: Designing with Light: Comparative Analysis and Design of Optical Interconnects for Chip-to-Chip Communication<br\/><br\/><br\/>Abstract:<br\/>CMOS electronics have become ubiquitous in modern society, continuing to create both technological and economic opportunities in such areas as portable computing and handheld devices. In the past, the capabilities of CMOS processors have been limited internally by transistor density, power consumption, and speed. All of these characteristics have improved consistently with transistor scaling, governed empirically by Moore's Law. However, as CMOS feature sizes decrease into the sub-micron regime, electrical signaling and interconnect problems promise to become the ultimate limit of high performance systems at both the board and chip levels. Integration of optical interconnects into high-performance computing offers a promising and necessary approach to solving the inter-chip communication bottleneck.<br\/><br\/>The goal of this project is to provide a framework for design of short distance chip-to-chip optical interconnects that addresses the unique problems and requirements of these microelectronic systems. Through research in the field of chip-to-chip optical interconnect design, I have found that existing models for optical interconnects in large scale networks fail when applied to small chip-scale networks. By performing analysis tailored to smaller chip scales and integrating these new approaches with usable modeling tools, we will enable optical interconnects to be added into the design catalog of mainstream CMOS designers. In order to achieve this we propose a two-pronged research plan composed of both investigation and development of feasible high speed interconnects. A goal of the first part of the proposed research is to develop a methodology for interconnect optimization by performing a comparative analysis and testing of various interconnect architectures, as they would be applied in a multi-chip module (MCM). In the second segment of this project, we will develop the framework for CAD supportable models of short distance optical interconnects, standard CMOS cell libraries for optical interconnect, and a set of simple design rules applicable to optimized short distance interconnect design. The results of this work with be both a better understanding of use of hybrid technologies to solve scaling problems in CMOS systems as well as a demonstrated physical means of carrying out this type of design within a computational CMOS architecture.<br\/><br\/>The educational aspect of this project focuses on integrating research into teaching and other educational activities at the high school, undergraduate, and graduate levels. A crucial step in removing barriers to innovation by students and future designers is to educate them in hands-on interdisciplinary research and allow them to develop and test novel design methodologies. In following with this idea, a third goal of this work is to engage students at all levels by providing them with \"hands on\" design experiences and exposure to research that develops both critical thinking and laboratory skills. This project provides many opportunities for students of VLSI design to practice hands on learning and develop critical thinking skills both in the laboratory and in the classroom environments.","title":"CAREER: Designing with Light: Comparative Analysis and Design of Optical Interconnects for Chip-to-Chip Communication","awardID":"0347649","effectiveDate":"2004-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["383969"],"PO":["562984"]},"91338":{"abstract":"The two-fold goal of the research activities described in this proposal is to assess readiness and lay the groundwork for a novel e-government initiative among Montana local governments. The introduction of the new forms and technology of e-government in cities and counties with small populations, few resources, and slight Internet experience will likely encounter a variety of obstacles. The initiative, by adopting a simple and flexible customer service approach to providing information and communicating with constituents, aims to ease the transition while providing mechanisms to strengthen government-citizen interaction and sense of community. <br\/> The research questions to be studied under the main initiative concern the effect of introducing e-government information services on the attitudes, perceptions, and practices of both government agencies and citizens. Is there a change in openness or responsiveness on the part of government? How are public trust, engagement, and understanding of issues affected? How are actual practices altered, including the processes by which citizen queries or complaints are made and responded to, and by which dissemination of information to the public is managed? These questions will be investigated via surveys, interviews, ethnographic observation, and web site usage analysis. Studies will cover both government personnel and the public, and will be carried out before, during, and after implementation of the initiative. <br\/> Assessment and preparation activities to be undertaken under the current proposal include: identification of potential city and county participants and evaluation of their readiness; examination of related literature and current local e-government practices; design and testing of survey instruments and protocols; and creation of a demonstration web site. <br\/> The proposed activity will advance the knowledge and understanding of local government officials of the effects of implementing technological methods of interacting with constituents, and will provide a broader impact by developing a model of e-government services that can be replicated by other local governments. <br\/> As a collaboration among Montana State University, the Local Government Center, local government units and the private sector, this project offers a unique opportunity to advance the development of local e-government in sparsely populated, fiscally limited","title":"SGER: E-Government in Rural Communities: Developing a Customer Service Approach to Enhancing Civic Engagement","awardID":"0352382","effectiveDate":"2004-01-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1353","name":"Hist & Philosophy of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["294712",239241,239242],"PO":["264525"]},"88809":{"abstract":"The proposed work will investigate the present occupancy of, use of, and noise levels in selected portions of the radio spectrum. The instrumentation described in the proposal body provides a fully calibrated time-history view of emissions in any desired band over the frequency range of 10 MHz up to 8 GHz. In addition, the temporal and spectral structure of all emissions or of any single emission as received by an operational antenna or any other antenna can be provided. Since existing instrumentation will be used during the first year, it will be possible to initiate field measurements very rapidly.. It is anticipated that more advanced instrumentation will be usedl after the first year to better define the properties of noise generated by new wireless devices.","title":"SP: Interference and Noise Measurements in Portions of the Radio Spectrum","awardID":"0338860","effectiveDate":"2004-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":[233007],"PO":["434241"]},"90439":{"abstract":"ABSTRACT<br\/>0347791<br\/>Robert M. Kirby<br\/>University of Utah<br\/><br\/>Heart disorders are a malady, which affect many Americans each year. Although techniques such as electrocardiography allow physicians to postulate as the probable cause of patient discomfort, cardiac source localization cannot currently provide the physician with the precise location within the heart of a bioelectric abnormality, nor can current techniques provide the physician with confidence measures based upon the numerical (discretization) errors, modeling errors and variability\/uncertainty errors which exist in the inverse problem. This research involves the development of methods for quantifying and controlling error and uncertainty in computational inverse problems. The specific driving application is to make the computational source localization procedure a viable tool for diagnosing cardiac bioelectric field problems. This research is valuable for both its multi-disciplinary influence and its expansion of computational science and engineering (CS&E) techniques beyond the original applications for which they were designed. The academic merit of this research is its fundamental contribution to the solution of computational inverse problems and its practical contribution to the bioengineering problem of cardiac source localization. In the true spirit of CS&E, this research is the synergy of a domain specific task and computational science tools. The broader impact of this research results from its extendibility to a much larger class of computational inverse problems. The educational objectives of this proposal are focused on training young scientists to properly view simulation science as a tool in the validation of and extension of scientific inquiry. <br\/><br\/>Specifically, this research is partitioned into two aims: (1) to quantify and minimize the effects of numerical modeling errors in the ECG source localization computation through the judicious use of high-order methods and the discontinuous Galerkin method; and (2) to quantify and minimize the effects of uncertainty and variability in the source localization process through the exploration of the polynomial chaos methodology for uncertainty quantification.","title":"CAREER: Quantifying and Controlling Error and Uncertainty in Computational Inverse Problems","awardID":"0347791","effectiveDate":"2004-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["552996"],"PO":["565272"]},"90419":{"abstract":"This project involves the development of a scalable framework for mining large, dynamic, biomedical and scientific datasets. This project has two research goals. The first research goal involves the development of novel methods to accurately model the relevant spatial or structural relationships embedded in such data, in particular the use of graph-based methods to model structure and geometric orthogonal polynomials to model shape. The second research goal involves the development of parallel and incremental algorithms, in conjunction with novel cluster file system support, to effectively and efficiently mine such data. A key feature of this work is the use of real-life large scale datasets as testbeds, specifically, data produced by molecular dynamics simulations to study the evolution of defects in materials, bio-molecular structure data to study structure-activity relationships, and clinical eye disease data to study the onset and progression of Keratoconus and Glaucoma disease patterns. <br\/><br\/>The educational component of this project seeks to foster, and promote a new inter-disciplinary graduate and undergraduate curriculum in data mining at the Ohio State University. Co-learning, a novel method by which students across disciplines can learn from one another and leverage each other's strengths, will be employed through the design of suitable inter-disciplinary large-scale exploratory data mining class projects. <br\/><br\/>This project will have a significant impact on how large biomedical and scientific datasets are efficiently explored and analyzed, and will enable scientists and clinicians to gain an effective understanding of the underlying scientific process involved, thereby extending the state-of-the-art in these domains.","title":"CAREER: A Scalable Framework for Mining Scientific and Biomedical Data","awardID":"0347662","effectiveDate":"2004-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["527873"],"PO":["565136"]},"86381":{"abstract":"Current technologies for radiationbased treatment of cancerous tumors rely almost exclusively on diagnostic<br\/>images such as MRI and PET scans to enable a careful targeting of multiple high-intensity beams.<br\/>However, the very complex nature of the penetration of radiation energy into the biological tissue makes such targeting difficult and error-prone, possibly even prohibiting radiative treatment due to the risk of damaging essential tissue in close proximity to the cancerous areas. Such issues are naturally of particular concern in relation to treatment of brain cancer.<br\/><br\/>This project will conduct research on the development of a simulation environment which eventually will provide a virtual patient-specific model of the area of interest and an ability to accurately and efficiently model wave-propagation within such an environment, with the potential to ultimately provide the radiation specialist with an online tool for fine tuning the targeting of radiation energy and, at a future stage, perhaps even model the impact of the energy deposition and heat release on the tissue.<br\/><br\/>The project will develop an environment comprising of (a) the cleaning and segmentation of MRI data, including data with noise sensitivity, (b) extraction of material data and construction of a patient-specific volume model of the target of interest, (c) the generation of high-order, curvilinear, finite elements grids, (d) full as well as reduced order modeling of the penetration\/refraction of electromagnetic energy into the volume model, and (e) visualization and extraction of physiological data of interest. These different elements will be integrated into a flexible, stand-alone environment and will, as part of the development, be tested extensively on phantom data as well as real MRI data, possibly with added artificial noise<br\/>to explore robustness.<br\/><br\/>The key developments will include new image segmentation and cleaning algorithms, improved material models, the development of efficient high-order accurate computational schemes for wave-propagation, efficient methods for domain truncation, and tools for visualization and data extraction. These are all problems of generic importance with potential for impact well beyond the particular application being considered.","title":"Collaborative Research ITR\/NGS: An Integrated Simulation Environment for High-Resolution Computational Methods in Electromagnetics with Biomedical Applications","awardID":"0325110","effectiveDate":"2004-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["505630"],"PO":["551712"]},"88155":{"abstract":"The radio frequency (RF) spectrum is a significant national, natural, and renewable resource.<br\/>Recently, a number of themes have converged to cause significant reconsideration of how radio<br\/>frequency spectrum is managed in the United States and elsewhere. The important themes are:<br\/>advances in radio system engineering; end-user interest in mobile access to information;<br\/>requirements of national defense and homeland security; recognition that spectrum is woefully<br\/>under-utilized; and proposals to dramatically re-architect the modes and mechanisms for using<br\/>radio frequency. While for many decades building radios has been relegated to radio engineers,<br\/>new ways to communicate while on the move and new mobile services are emerging. Building<br\/>mobile networking devices and services requires integrating multiple disciplines including:<br\/>electromagnetics, circuit design, signal processing, network protocols, and service development.<br\/>The emergence of multiple mobile communication devices and the urge to always be connected<br\/>is driving research and investment in new communications services and devices.<br\/><br\/>The researcher proposes to establish a National Radio Network Research Testbed (NTNRT) to support<br\/>research and development of new radio devices, services, and architectures and to provide a<br\/>facility for the research community to test and evaluate their systems. The NRNRT consists of<br\/>(1) a field deployed measurement and evaluation system for long term radio frequency data<br\/>collection and experimental facility for testing and evaluating new radios, (2) an accurate<br\/>emulation\/simulation system incorporating long-term field measurement for evaluating new<br\/>wireless network architectures, policies, and network protocols, and (3) experiments with<br\/>innovative wireless networks that integrate analysis, emulation\/simulation, and field<br\/>measurements.<br\/><br\/>1.1 Intellectual Merit<br\/><br\/>Good systems result from a balanced combination of innovation, solid design and analysis, and<br\/>test and evaluation. The proposed effort seeks this balance. The fielded measurement and<br\/>evaluation system will provide a comprehensive dataset for future design and analysis as well as<br\/>a place to test prototype systems. The accurate emulation system will utilize the collected data to<br\/>improve analysis of innovative radio devices, protocols, and services. Finally, the wireless<br\/>networking experiments will demonstrate innovative services and validate the testbed.<br\/><br\/>1.2 Broader Impact<br\/><br\/>The NTNRT will provide a significant resource to the wireless networking research and<br\/>development community. First, it will generate a database covering long-term utilization and<br\/>propagation characteristics of the RF spectrum that will further understanding of the resources<br\/>available for wireless networks. Second, it will provide a facility to test and evaluate new radio<br\/>networking devices and systems. And third, it will provide information and techniques necessary<br\/>to produce high quality emulation\/simulation of emerging wireless devices and systems.<br\/>The information gathered and systems demonstrated and evaluated during this project will<br\/>provide crucial input to discussions at the national level concerning the future spectrum<br\/>management and policies that are required for ubiquitous high performance wireless networks.","title":"NRT: National Radio Networking Research Testbed (NRNRT)","awardID":"0335272","effectiveDate":"2004-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["421842","537837"],"PO":["434241"]},"86364":{"abstract":"Current technologies for radiationbased treatment of cancerous tumors rely almost exclusively on diagnostic<br\/>images such as MRI and PET scans to enable a careful targeting of multiple high-intensity beams.<br\/>However, the very complex nature of the penetration of radiation energy into the biological tissue makes such targeting difficult and error-prone, possibly even prohibiting radiative treatment due to the risk of damaging essential tissue in close proximity to the cancerous areas. Such issues are naturally of particular concern in relation to treatment of brain cancer.<br\/><br\/>This project will conduct research on the development of a simulation environment which eventually will provide a virtual patient-specific model of the area of interest and an ability to accurately and efficiently model wave-propagation within such an environment, with the potential to ultimately provide the radiation specialist with an online tool for fine tuning the targeting of radiation energy and, at a future stage, perhaps even model the impact of the energy deposition and heat release on the tissue.<br\/><br\/>The project will develop an environment comprising of (a) the cleaning and segmentation of MRI data, including data with noise sensitivity, (b) extraction of material data and construction of a patient-specific volume model of the target of interest, (c) the generation of high-order, curvilinear, finite elements grids, (d) full as well as reduced order modeling of the penetration\/refraction of electromagnetic energy into the volume model, and (e) visualization and extraction of physiological data of interest. These different elements will be integrated into a flexible, stand-alone environment and will, as part of the development, be tested extensively on phantom data as well as real MRI data, possibly with added artificial noise<br\/>to explore robustness.<br\/><br\/>The key developments will include new image segmentation and cleaning algorithms, improved material models, the development of efficient high-order accurate computational schemes for wave-propagation, efficient methods for domain truncation, and tools for visualization and data extraction. These are all problems of generic importance with potential for impact well beyond the particular application being considered.","title":"ITR\/NGS: Collaborative Research: An Integrated Simulation Environment for High-Resolution Computational Methods in Electromagnetics with Biomedical Applications","awardID":"0325041","effectiveDate":"2004-01-15","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["562746"],"PO":["551712"]},"79018":{"abstract":"The Cornell University Library and the Gottingen State and University Library propose to create a distributed, interoperable system for the long-term preservation and dissemination of digital serial literature in the field of Mathematics and Statistics. Developing and implementing such a system will require the partners to bring the principles of the Open Archival Information System (OAIS) Reference Model to an operational level by establishing protocols for data ingest, data management, archival storage, archive administration, and access processes. Persistent access to distributed archives is an important goal for digital libraries research. Distributed archives will allow libraries and institutions to invest their resources in expanding content for targeted communities rather than in developing costly local infrastructure. Persistent access means that users can trust a digital archive will provide secure, reliable access to resources over time without constraints based upon geographic location, language preferences or requirements, or subject discipline. The OAIS reference model has received a great deal of positive attention in the archiving and preservation communities, and it has become a dominant and accepted model for planning and implementing digital archives. By creating an open digital archive of serial mathematics literature this joint US\/Germany project will make valuable content reliably accessible to a host of other disciplines for which mathematics is an enabling science.","title":"Ensuring Access to Mathematics over Time: Cooperative Management of Distributed Digital Archives","awardID":"0240450","effectiveDate":"2004-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[205770,205771],"PO":["565227"]},"86421":{"abstract":"This project seeks to create advanced hardware and software technologies for supporting dynamically extensible networks. Extensible Network Services Platforms (NSP) support the dynamic insertion of hardware and software plugins that serve as network-resident assists to distributed applications. To enable the greatest impact, extensible networks require sophisticated control mechanisms to enable application developers to specify how application sessions may be configured, while allowing the network the flexibility to map individual sessions onto available resources and to accommodate individual user preferences. This project will develop and demonstrate scalable, high performance NSPs and will create a software Network Extension System (NES) to automatically configure application sessions on demand. In addition to becoming more flexible, networks must become more robust, in order to support advanced mission-critical applications. It is no longer reasonable to assume that network routers operate in a benign environment where users cooperate for the larger social good. The growing challenges to the nation's cyber-infrastructure make it necessary to design systems that can operate reliably and deliver excellent performance, even in the presence of extreme traffic conditions. This project will develop practical designs for managing system resources to ensure robust network operation, even in the most demanding, high performance environments.","title":"ITR-M: Technologies for Dynamically Extensible Networks","awardID":"0325298","effectiveDate":"2004-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["522381","316262"],"PO":["564777"]},"88798":{"abstract":"Two rather different forms of wireless communications, one already established and showing dramatic growth and the other only on the horizon, have the potential to impact dramatically the nature of wireless communications in the home and workplace. One is the increasingly high-speed information link typified by 802.11x\/802.15, first applied to broadband internet access but moving toward video and audio entertainment distribution as well, and the other is the sensor network, which can offer security, medical monitoring, and a variety of other important services. Unfortunately these usages are largely incompatible. High-rate applications will generally have adequate power sources for both transmission and processing purposes. Service interruptions have the potential to be annoying, but they are not, in general, threatening to health or safety. Sensor networks, on the other hand, involve messages which are generally short and infrequent, but which may have a high level of importance (consider intrusion or fire alarms, or child<br\/>monitors). Moreover, such sensors (and less critical environmental sensors) often require placement that is independent of permanent power sources, and thus require energy efficient operation.<br\/><br\/>Normally, such disparate requirements would suggest the separation of these applications into different frequency bands, but the emergence of unlicensed bands suggests that designers will not have the option of such comfortable isolation. It is therefore important to consider how such applications may coexist within the same frequency space. In particular, one may speculate that the potential for such coexistence would be enhanced within the private space that we find in homes and businesses - a volume in which radio transmission may be beneficially controlled by a single entity, and in which intra-system interference dominates. It is the premise of this proposal that solutions exist that can allow a wide variety of disparate applications to coexist efficiently within such a constrained, but controlled space. In particular, the researchers believe that coordinated usage characterized by multiple antennas and multiple appliances (MAMA) represents a new type of network, and offers significant opportunities to interwork such disparate systems efficiently.<br\/><br\/>To accommodate this mixed set of bit-rate and energy requirements, the researchers propose a comprehensive approach that encompasses link layer, MAC layer and cross-layer techniques. At the link layer, the research proposes:<br\/>-Flexible bandwidth modulation formats and spatial multiplexing and diversity. With the device transmission rate set by the application, the signaling bandwidth of a device is optimized versus a power level determined either by interference avoidance considerations or by energy constraints. We will argue that this leads to ultra-wideband (UWB) modulation characterized by low-signal-to-noise-ratio (low-SNR).<br\/>-Multiple transmit and receive antennas to be utilized in several modes: (1) in multi-input multi-output (MIMO) mode, the channel is harnessed to increase bit-rate; (2) in diversity mode, spatial diversity enhances power efficiency; (3) in beamforming mode, transmitter antennas direct energy away from other devices and networks. Consistent with UWB signaling, our research will focus on the low-SNR regime for MIMO systems.<br\/><br\/>Since link layer techniques cannot address all the complex requirements of MAMA networks, the researchers propose a cross-layer approach that takes into account the distributed, non-cooperative nature of the networks to achieve a more efficient use of the network power and bandwidth resources. The cross-layer approach consists of two components:<br\/>-Game theoretic methods: based on utility functions that depend on transmitted power and throughput, users<br\/>adapt their transmitters and receivers to maximize their individual utilities.<br\/>-\"Thin\" MAC layer protocols: for given physical layer transmitters and receivers, incremental redundancy hybrid ARQ provides non-collaborative rate adaptation and spectrum resource sharing.<br\/><br\/>The proposed space-frequency-cross-layer approach to designing wireless networks is distinctly different from conventional network design where data rate is maximized for a given bandwidth and power, generally ignoring intra- and inter-network interference. The juxtaposition of UWB, MIMO and cross-layer techniques in MAMA networks spans a multidimensional signal space that will create a rich set of research problems and network architectures.<br\/><br\/>Broader Impact: The work proposed here (if successful) will make possible the coexistence of new high-speed<br\/>wireless applications with emerging sensor networks at home and in the workplace. Although the discussion focuses on the home and work environments, it should be understood that the applications are more widespread - to hospitals, factories, and some robotic scenarios. MAMA networks ","title":"SP: Collaborative Research: Multiple Antenna Multiple Appliances (MAMA) Wireless Networks: A pervasive Technology for the Home and Workplace","awardID":"0338788","effectiveDate":"2004-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["316235","560438","316236"],"PO":["7594"]},"86378":{"abstract":"Current technologies for radiationbased treatment of cancerous tumors rely almost exclusively on diagnostic<br\/>images such as MRI and PET scans to enable a careful targeting of multiple high-intensity beams.<br\/>However, the very complex nature of the penetration of radiation energy into the biological tissue makes such targeting difficult and error-prone, possibly even prohibiting radiative treatment due to the risk of damaging essential tissue in close proximity to the cancerous areas. Such issues are naturally of particular concern in relation to treatment of brain cancer.<br\/><br\/>This project will conduct research on the development of a simulation environment which eventually will provide a virtual patient-specific model of the area of interest and an ability to accurately and efficiently model wave-propagation within such an environment, with the potential to ultimately provide the radiation specialist with an online tool for fine tuning the targeting of radiation energy and, at a future stage, perhaps even model the impact of the energy deposition and heat release on the tissue.<br\/><br\/>The project will develop an environment comprising of (a) the cleaning and segmentation of MRI data, including data with noise sensitivity, (b) extraction of material data and construction of a patient-specific volume model of the target of interest, (c) the generation of high-order, curvilinear, finite elements grids, (d) full as well as reduced order modeling of the penetration\/refraction of electromagnetic energy into the volume model, and (e) visualization and extraction of physiological data of interest. These different elements will be integrated into a flexible, stand-alone environment and will, as part of the development, be tested extensively on phantom data as well as real MRI data, possibly with added artificial noise to explore robustness.<br\/><br\/>The key developments will include new image segmentation and cleaning algorithms, improved material models, the development of efficient high-order accurate computational schemes for wave-propagation, efficient methods for domain truncation, and tools for visualization and data extraction. These are all problems of generic importance with potential for impact well beyond the particular application being considered.","title":"Collaborative Research ITR\/NGS: An Integrated Simulation Environment for High-Resolution Computational Methods in Electromagnetics with Biomedical Applications","awardID":"0325097","effectiveDate":"2004-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["301926"],"PO":["551712"]},"90261":{"abstract":"We are in the midst of a new wireless revolution, brought on by<br\/>the adoption of wireless networks for consumer, military,<br\/>scientific, and wireless applications. This revolution presents exciting new<br\/>challenges due to the marked departure from the traditional<br\/>additive white Gaussian noise channel paradigm. Recently, antenna diversity techniques have<br\/>received considerable attention due to the significant information<br\/>theoretic gains promised for multi-input-multi-output (MIMO)<br\/>fading channels.<br\/><br\/>Our research can be broadly categorized in three main<br\/>thrusts: 1) Developing a unified algebraic coding theory for<br\/>point-to-point MIMO fading channels, 2) Developing joint coding and<br\/>scheduling algorithms for cellular MIMO channels, and 3)<br\/>Developing cooperative (i.e. antenna sharing) schemes for<br\/>ad-hoc MIMO channels. The first research thrust will<br\/>develop bridges between different branches in Algebra and<br\/>space-time coding. The cross fertilization between these two areas<br\/>is expected to introduce useful algebraic tools in space-time<br\/>coding research and formulate new problems of possible interest to<br\/>the mathematical research community. The second and third thrusts will<br\/>enhance the understanding of the information and coding theoretic foundations<br\/>of cellular and ad-hoc MIMO channels. The education<br\/>plan aims to expose students to the state of the art in wireless<br\/>communications and provide the well-rounded training needed for<br\/>both future academic jobs and leading-edge industrial positions.","title":"CAREER: MIMO Fading in Links, Cells, and Networks: Coding and Information Theoretic Challenges","awardID":"0346887","effectiveDate":"2004-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["347888"],"PO":["432103"]},"90460":{"abstract":"PROPOSAL NO: 0347891<br\/>INSTITUTION: U of Minnesota-Twin Cities<br\/>PRINCIPAL INVESTIGATOR: Bazargan, Kia<br\/>TITLE: Computer-Aided Design of Mixed ASIC \/ Reconfigurable Fabrics of the Nanometer Era<br\/><br\/>Abstract:<br\/>Improvements in the chip manufacturing technology have brought about astonishing growth of electronic systems, resulting in multi-gigahertz clock speeds and billion-gate chips. However, explosive complexities, rising manufacturing costs, shrinking time-to-market windows, and deep submicron effects are threatening the continuation of the growth in the electronics technology. New system complexities result in unreliability (even failure) and unpredictability of system behavior. Employing FPGA-like (Field Programmable Gate Array) reconfigurable blocks in SoC promotes flexibility and drives non-recurring engineering (NRE) costs down.<br\/><br\/>Embedded FPGA-like reconfigurable fabrics have emerged as part of todays SoC, and will inevitably be part of future designs because of the enormous advantages they provide. However, there are many challenging hurdles in way of employing reconfigurable fabrics within SoC. This proposal tackles a number of these challenges: 1) Statistical modeling and optimization at different levels of abstraction are proposed to take on the reliability and predictability concerns. 2) Architectural features for the reconfigurable fabrics are also investigated to reduce power and improve thermal conduction out of the fabric, while optimizing the flexibility, cost and performance. 3) CAD algorithms for mixed ASIC \/ reconfigurable fabric are proposed, and include hierarchical evaluation and estimation of uncertain designs, low power optimization and technology mapping.<br\/><br\/>The proposed algorithms and methodologies would consider flexibility, reliability and productivity as first-class citizens to be optimized along with other design quality metrics such as area, cost, and performance. We will incorporate some of the results of this research in the VLSI courses at the University of Minnesota, as well as an advanced course on reconfigurable computing. Furthermore, a web page will be developed that would host all course material, reconfigurable benchmarks and FPGA tools from our group and other researchers.","title":"CAREER: Computer-Aided Design of Mixed ASIC \/ Reconfigurable Fabrics of the Nanometer Era","awardID":"0347891","effectiveDate":"2004-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["528636"],"PO":["562984"]},"88800":{"abstract":"Two rather different forms of wireless communications, one already established and showing dramatic growth and the other only on the horizon, have the potential to impact dramatically the nature of wireless communications in the home and workplace. One is the increasingly high-speed information link typified by 802.11x\/802.15, first applied to broadband internet access but moving toward video and audio entertainment distribution as well, and the other is the sensor network, which can offer security, medical monitoring, and a variety of other important services. Unfortunately these usages are largely incompatible. High-rate applications will generally have adequate power sources for both transmission and processing purposes. Service interruptions have the potential to be annoying, but they are not, in general, threatening to health or safety. Sensor networks, on the other hand, involve messages which are generally short and infrequent, but which may have a high level of importance (consider intrusion or fire alarms, or child<br\/>monitors). Moreover, such sensors (and less critical environmental sensors) often require placement that is independent of permanent power sources, and thus require energy efficient operation.<br\/><br\/>Normally, such disparate requirements would suggest the separation of these applications into different frequency bands, but the emergence of unlicensed bands suggests that designers will not have the option of such comfortable isolation. It is therefore important to consider how such applications may coexist within the same frequency space. In particular, one may speculate that the potential for such coexistence would be enhanced within the private space that we find in homes and businesses - a volume in which radio transmission may be beneficially controlled by a single entity, and in which intra-system interference dominates. It is the premise of this proposal that solutions exist that can allow a wide variety of disparate applications to coexist efficiently within such a constrained, but controlled space. In particular, the researchers believe that coordinated usage characterized by multiple antennas and multiple appliances (MAMA) represents a new type of network, and offers significant opportunities to interwork such disparate systems efficiently.<br\/><br\/>To accommodate this mixed set of bit-rate and energy requirements, the researchers propose a comprehensive approach that encompasses link layer, MAC layer and cross-layer techniques. At the link layer, the research proposes:<br\/>-Flexible bandwidth modulation formats and spatial multiplexing and diversity. With the device transmission rate set by the application, the signaling bandwidth of a device is optimized versus a power level determined either by interference avoidance considerations or by energy constraints. We will argue that this leads to ultra-wideband (UWB) modulation characterized by low-signal-to-noise-ratio (low-SNR).<br\/>-Multiple transmit and receive antennas to be utilized in several modes: (1) in multi-input multi-output (MIMO) mode, the channel is harnessed to increase bit-rate; (2) in diversity mode, spatial diversity enhances power efficiency; (3) in beamforming mode, transmitter antennas direct energy away from other devices and networks. Consistent with UWB signaling, our research will focus on the low-SNR regime for MIMO systems.<br\/><br\/>Since link layer techniques cannot address all the complex requirements of MAMA networks, the researchers propose a cross-layer approach that takes into account the distributed, non-cooperative nature of the networks to achieve a more efficient use of the network power and bandwidth resources. The cross-layer approach consists of two components:<br\/>-Game theoretic methods: based on utility functions that depend on transmitted power and throughput, users<br\/>adapt their transmitters and receivers to maximize their individual utilities.<br\/>-\"Thin\" MAC layer protocols: for given physical layer transmitters and receivers, incremental redundancy hybrid ARQ provides non-collaborative rate adaptation and spectrum resource sharing.<br\/><br\/>The proposed space-frequency-cross-layer approach to designing wireless networks is distinctly different from conventional network design where data rate is maximized for a given bandwidth and power, generally ignoring intra- and inter-network interference. The juxtaposition of UWB, MIMO and cross-layer techniques in MAMA networks spans a multidimensional signal space that will create a rich set of research problems and network architectures.<br\/><br\/>Broader Impact: The work proposed here (if successful) will make possible the coexistence of new high-speed<br\/>wireless applications with emerging sensor networks at home and in the workplace. Although the discussion focuses on the home and work environments, it should be understood that the applications are more widespread - to hospitals, factories, and some robotic scenarios. MAMA networks ","title":"SP: Collaborative Research:MAMA (Multiple Antennas Multiple Appliances) Wideband Wireless Networks: A Pervasive Technology for the Home and Workplace","awardID":"0338805","effectiveDate":"2004-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["531727","463100","348167"],"PO":["565090"]},"86369":{"abstract":"It is widely acknowledged, both in academic studies and the marketplace, that the most effective form of education is the professional human tutor. A major difference between human tutors and computer tutors is that only human tutors understand unconstrained natural language input. Recently, a few tutoring systems have been developed that carry on a natural language (NL) dialogue with students. <br\/>Our research problem is to find ways to make NL-based tutoring systems more effective. Our basic approach is to derive new dialogue strategies from studies of human tutorial dialogues, incorporate them in an NL-based tutoring system, and determine if they make the tutoring system more effective. For instance, some studies are determining if learning increases when human tutors are constrained to follow certain strategies. In order to incorporate the new dialogue strategies into our existing text and spoken NL-based tutoring systems, two completely new modules are being developed. One new module will interpret student utterances using a large directed graph of propositions called an explanation network, which is halfway between the shallow and deep representations of knowledge that are currently used. The second new module uses machine learning to improve the selection of dialogue management strategies.<br\/>The research is thus a multidisciplinary effort whose intellectual merit lies in new results in the cognitive psychology of human tutoring, in the technology of NL processing, and in the design of effective tutoring systems. Improved NL-based tutoring systems could have a broad impact on education and society.","title":"ITR : Tutoring scientific explanations via natural language dialogue","awardID":"0325054","effectiveDate":"2004-01-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["488661","423487","554179","290834","498182"],"PO":["564318"]},"88801":{"abstract":"Two rather different forms of wireless communications, one already established and showing dramatic growth and the other only on the horizon, have the potential to impact dramatically the nature of wireless communications in the home and workplace. One is the increasingly high-speed information link typified by 802.11x\/802.15, first applied to broadband internet access but moving toward video and audio entertainment distribution as well, and the other is the sensor network, which can offer security, medical monitoring, and a variety of other important services. Unfortunately these usages are largely incompatible. High-rate applications will generally have adequate power sources for both transmission and processing purposes. Service interruptions have the potential to be annoying, but they are not, in general, threatening to health or safety. Sensor networks, on the other hand, involve messages which are generally short and infrequent, but which may have a high level of importance (consider intrusion or fire alarms, or child<br\/>monitors). Moreover, such sensors (and less critical environmental sensors) often require placement that is independent of permanent power sources, and thus require energy efficient operation.<br\/><br\/>Normally, such disparate requirements would suggest the separation of these applications into different frequency bands, but the emergence of unlicensed bands suggests that designers will not have the option of such comfortable isolation. It is therefore important to consider how such applications may coexist within the same frequency space. In particular, one may speculate that the potential for such coexistence would be enhanced within the private space that we find in homes and businesses - a volume in which radio transmission may be beneficially controlled by a single entity, and in which intra-system interference dominates. It is the premise of this proposal that solutions exist that can allow a wide variety of disparate applications to coexist efficiently within such a constrained, but controlled space. In particular, the researchers believe that coordinated usage characterized by multiple antennas and multiple appliances (MAMA) represents a new type of network, and offers significant opportunities to interwork such disparate systems efficiently.<br\/><br\/>To accommodate this mixed set of bit-rate and energy requirements, the researchers propose a comprehensive approach that encompasses link layer, MAC layer and cross-layer techniques. At the link layer, the research proposes:<br\/>-Flexible bandwidth modulation formats and spatial multiplexing and diversity. With the device transmission rate set by the application, the signaling bandwidth of a device is optimized versus a power level determined either by interference avoidance considerations or by energy constraints. We will argue that this leads to ultra-wideband (UWB) modulation characterized by low-signal-to-noise-ratio (low-SNR).<br\/>-Multiple transmit and receive antennas to be utilized in several modes: (1) in multi-input multi-output (MIMO) mode, the channel is harnessed to increase bit-rate; (2) in diversity mode, spatial diversity enhances power efficiency; (3) in beamforming mode, transmitter antennas direct energy away from other devices and networks. Consistent with UWB signaling, our research will focus on the low-SNR regime for MIMO systems.<br\/><br\/>Since link layer techniques cannot address all the complex requirements of MAMA networks, the researchers propose a cross-layer approach that takes into account the distributed, non-cooperative nature of the networks to achieve a more efficient use of the network power and bandwidth resources. The cross-layer approach consists of two components:<br\/>-Game theoretic methods: based on utility functions that depend on transmitted power and throughput, users<br\/>adapt their transmitters and receivers to maximize their individual utilities.<br\/>-\"Thin\" MAC layer protocols: for given physical layer transmitters and receivers, incremental redundancy hybrid ARQ provides non-collaborative rate adaptation and spectrum resource sharing.<br\/><br\/>The proposed space-frequency-cross-layer approach to designing wireless networks is distinctly different from conventional network design where data rate is maximized for a given bandwidth and power, generally ignoring intra- and inter-network interference. The juxtaposition of UWB, MIMO and cross-layer techniques in MAMA networks spans a multidimensional signal space that will create a rich set of research problems and network architectures.<br\/><br\/>Broader Impact: The work proposed here (if successful) will make possible the coexistence of new high-speed<br\/>wireless applications with emerging sensor networks at home and in the workplace. Although the discussion focuses on the home and work environments, it should be understood that the applications are more widespread - to hospitals, factories, and some robotic scenarios. MAMA networks ","title":"SP: COLLABORATIVE RESEARCH: MAMA (Multiple Antennas Multiple Appliances) Wideband Wireless Networks: A Pervasive Technology for the Home and Workplace","awardID":"0338807","effectiveDate":"2004-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["560130","424601"],"PO":["434241"]},"98778":{"abstract":"Game consoles, with price points below $300, performance rivaling or exceeding that of PCs, and graphics capabilities recently found only on high-end visualization supercomputers, are the vanguard of yet another computing generation . computing on toys. Moreover, market forces and fierce vendor competition (e.g., among Microsoft, Nintendo, and Sony) continue to fuel technical innovation and performance improvements on these game platforms, creating research and development incentives and deployment opportunities in new domains. <br\/> <br\/>This proposal outlines a research plan to assess the utility and performance of game systems for both scientific computing and high-resolution visualization. This assessment of game systems will be based on development of a suite of adaptive performance analysis tools that support both offline and online performance optimization and their application to a suite of scientific and visualization codes. This effort leverages proposed Red Hat and NCSA software enhancements to PlayStation2 Linux software. In addition we currently are negotiating with Sony to acquire and deploy a large PlayStation2 cluster at NCSA for experimental assessment and scientific visualization. <br\/> <br\/>Our computing on toys software research plan focuses on three areas: (a) offline, multilevel performance instrumentation of applications and system software, (b) online, adaptive selection of multi-version code execution, and (c) experimental assessment using large-scale scientific applications and visualization software. New hardware performance measurements, instrumented scientific and graphics libraries, and performance derivatives, all integrated with our SvPablo performance analysis infrastructure, will provide the requisite data to move iterative performance tuning from an ad hoc style to one based on intelligent feedback and suggestions. The offline version of this SvPablo extension will accept performance metrics from hardware, software, and library instrumentation and generates suggestions for tuning locations and options using a fuzzy logic rule base that embodies performance <br\/>tuning suggestions for the Sony PlayStation2.","title":"ITR: Intelligent High-Performance Computing on Toys","awardID":"0434286","effectiveDate":"2004-01-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}}],"PIcoPI":["562707"],"PO":["565272"]},"86337":{"abstract":"Current technologies for radiationbased treatment of cancerous tumors rely almost exclusively on diagnostic<br\/>images such as MRI and PET scans to enable a careful targeting of multiple high-intensity beams.<br\/>However, the very complex nature of the penetration of radiation energy into the biological tissue makes such targeting difficult and error-prone, possibly even prohibiting radiative treatment due to the risk of damaging essential tissue in close proximity to the cancerous areas. Such issues are naturally of particular concern in relation to treatment of brain cancer.<br\/><br\/>This project will conduct research on the development of a simulation environment which eventually will provide a virtual patient-specific model of the area of interest and an ability to accurately and efficiently model wave-propagation within such an environment, with the potential to ultimately provide the radiation specialist with an online tool for fine tuning the targeting of radiation energy and, at a future stage, perhaps even model the impact of the energy deposition and heat release on the tissue.<br\/><br\/>The project will develop an environment comprising of (a) the cleaning and segmentation of MRI data, including data with noise sensitivity, (b) extraction of material data and construction of a patient-specific volume model of the target of interest, (c) the generation of high-order, curvilinear, finite elements grids, (d) full as well as reduced order modeling of the penetration\/refraction of electromagnetic energy into the volume model, and (e) visualization and extraction of physiological data of interest. These different elements will be integrated into a flexible, stand-alone environment and will, as part of the development, be tested extensively on phantom data as well as real MRI data, possibly with added artificial noise to explore robustness.<br\/><br\/>The key developments will include new image segmentation and cleaning algorithms, improved material models, the development of efficient high-order accurate computational schemes for wave-propagation, efficient methods for domain truncation, and tools for visualization and data extraction. These are all problems of generic importance with potential for impact well beyond the particular application being considered.","title":"Collaborative Research ITR\/NGS: An Integrated Simulation Environment for High-Resolution Computational Methods in Electromagnetics with Biomedical Applications","awardID":"0324957","effectiveDate":"2004-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["559399","559400"],"PO":["551712"]},"86327":{"abstract":"Current technologies for radiationbased treatment of cancerous tumors rely almost exclusively on diagnostic<br\/>images such as MRI and PET scans to enable a careful targeting of multiple high-intensity beams.<br\/>However, the very complex nature of the penetration of radiation energy into the biological tissue makes such targeting difficult and error-prone, possibly even prohibiting radiative treatment due to the risk of damaging essential tissue in close proximity to the cancerous areas. Such issues are naturally of particular concern in relation to treatment of brain cancer.<br\/><br\/>This project will conduct research on the development of a simulation environment which eventually will provide a virtual patient-specific model of the area of interest and an ability to accurately and efficiently model wave-propagation within such an environment, with the potential to ultimately provide the radiation specialist with an online tool for fine tuning the targeting of radiation energy and, at a future stage, perhaps even model the impact of the energy deposition and heat release on the tissue.<br\/><br\/>The project will develop an environment comprising of (a) the cleaning and segmentation of MRI data, including data with noise sensitivity, (b) extraction of material data and construction of a patient-specific volume model of the target of interest, (c) the generation of high-order, curvilinear, finite elements grids, (d) full as well as reduced order modeling of the penetration\/refraction of electromagnetic energy into the volume model, and (e) visualization and extraction of physiological data of interest. These different elements will be integrated into a flexible, stand-alone environment and will, as part of the development, be tested extensively on phantom data as well as real MRI data, possibly with added artificial noise<br\/>to explore robustness.<br\/><br\/>The key developments will include new image segmentation and cleaning algorithms, improved material models, the development of efficient high-order accurate computational schemes for wave-propagation, efficient methods for domain truncation, and tools for visualization and data extraction. These are all problems of generic importance with potential for impact well beyond the particular application being considered.","title":"Collaborative Research ITR\/NGS: An Integrated Simulation Environment for High-Resolution Computational Methods in Electromagnetics with Biomedical Applications","awardID":"0324911","effectiveDate":"2004-01-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["419684","547082"],"PO":["301532"]},"90399":{"abstract":"CAREER: Microarchitecture Considerations for Soft-Error Tolerance in Future Microprocessors<br\/><br\/>Abstract<br\/><br\/>This project addresses the pressing issue of increasing susceptibility to soft errors in future deep-submicron microprocessor implementations. The study develops and evaluates three candidate approaches for detecting and recovering from soft errors. The three approaches are dynamic instruction re-executions in a superscalar processor, redundant executions over two mirrored processor cores facilitated by an efficient crosschecking mechanism, and an all-software approach for unmodified simultaneous multithreading (SMT) processors or chip-multiprocessors (CMP). The study evaluates the potential of each approach and analyzes their trade-off in terms of performance, fault coverage, design complexity and implementation cost. A goal of this research is to overcome the performance and implementation penalties associated with these approaches. An education component of this project applies executable and synthesizable high-level hardware description formalisms to improve the preciseness of in-class discussions and to enable more insightful out-of-class independent exercises.<br\/><br\/>Following decades of exclusive focus on performance, soft-error reliability is one of the key challenges in the continuing advances of microprocessor designs. The results of this research have direct bearing on the multi-billion-dollar microprocessor industry, which in turn will impact our daily experiences from professional to recreational. The results of this research will not only be applicable in the near term to deep-submicron VLSI microprocessors, but may also be extensible to address the reliability of emerging technologies such as quantum, molecular and nano-technologies.","title":"CAREER: Microarchitecture Considerations for Soft-Error Tolerance in Future Microprocessors","awardID":"0347568","effectiveDate":"2004-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["550978"],"PO":["550859"]},"88805":{"abstract":"Within little more than a decade, digital information and the Internet have assumed a critical role in virtually all sectors of society, including education, commerce, science, government, and entertainment. However, today's Internet is dependent on wired or cellular wireless infrastructure. This dependence limits the reach of digital communication to regions of the world where the required infrastructure is technically and economically feasible; at the same time, it renders the network vulnerable to disasters and attacks that threaten this fixed infrastructure. This proposal aims to develop technologies to reduce the dependence of digital communication on wired and cellular wireless infrastructure, thus extending its reach into underdeveloped parts of the world and economically disadvantaged part of society and increasing its resilience to natural disasters, acts of war, or terror attacks on its physical infrastructure.<br\/>The work exploits synergies between two areas of research that have enjoyed dramatic advances in recent years, but have to date mostly worked independently: (1) ad hoc networking, and (2) decentralized, self-organizing distributed systems. They have assembled a team of experts in each of these areas that will jointly tackle the major technical challenges towards a network architecture that exploits infrastructure when it is available but does not depend on it:<br\/>Self-organizing network hierarchy: Will develop a novel, self-organizing buoy protocol that recursively subdivides the network into an adaptive, proximity-based hierarchy of cells. The cell hierarchy provides the foundation for scalable routing and provides a low-overhead, proximity-based overlay structure that can be used to support network services. Periodic broadcasts from buoy nodes in each cell efficiently disseminate aggregated location, addressing, and routing information. Scalable ad hoc network routing: Based on the buoy protocol, they will develop an ad hoc network routing architecture for mobile and stationary devices that scales to at least tens of thousands of nodes. Nodes maintain only a small amount of routing state that is logarithmic in the size of the network, in exchange for a slightly longer route length. Nodes maintain their routing state passively by listening to buoy broadcasts, which results in very low routing overhead. The per-node space and message requirements of the protocol grow at most logarithmically with the size of the network. <br\/>Self-organizing network services: The proposers plan to develop self-organizing, robust, and secure network services that exploit the hierarchical overlay structure of the buoy protocol. Basic naming, host configuration and network time services will ensure the operation of the network in the absence of fixed infrastructure servers that provide conventional DNS, DHCP and NTP services. Other self-organizing services will provide email, instant messaging, storage, and content distribution in the absence of a server infrastructure, manual administration, high-capacity backbones or trusted entities. Our approach builds on foundations from p2p systems, but takes advantage of the hierarchical, proximity-based low overhead overlay structure provided by the buoy protocol to provide a solution suitable for ad hoc wireless environments.<br\/>Integrated ad hoc network architecture: The proposers plan to develop a network architecture that will integrate wired and wire-less networks, infrastructure-based, and self-organizing services. The architecture takes advantage of existing infrastructure when and where available, without depending on its presence. In the wake of a disaster, the architecture will allow remaining islands of surviving infrastructure to self-organize jointly with wireless, mobile components to recover and resume connectivity and emergency network services. Similarly, the architecture will allow the integration of islands of wired infrastructure via wireless ad hoc communication in developing countries.<br\/>The intellectual merits of this work include the development of the science and technology to meet these challenges; they will evaluate theoretical results, algorithms and protocols through analysis, simulation, and experimental evaluation of prototype implementations; disseminate the results via publications, industrial collaborations, and student training; and to distribute software artifacts for evaluation and use by industry and the research community. <br\/>The broader impacts of this work include the development of technologies that will substantially increase the<br\/>resilience of digital networks to physical disasters or attacks and that will extend its reach into economically disadvantaged parts of society and underdeveloped parts of the world. Educational impacts include the training of students and research personnel and outreach to educational institutions not historically involved in research.","title":"SP: Collaborative Research: Safari: A Scalable Architecture for Ad Hoc Networking and Services","awardID":"0338842","effectiveDate":"2004-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["550994"],"PO":["7594"]},"88807":{"abstract":"Within little more than a decade, digital information and the Internet have assumed a critical role in virtually all sectors of society, including education, commerce, science, government, and entertainment. However, today's Internet is dependent on wired or cellular wireless infrastructure. This dependence limits the reach of digital communication to regions of the world where the required infrastructure is technically and economically feasible; at the same time, it renders the network vulnerable to disasters and attacks that threaten this fixed infrastructure. This proposal aims to develop technologies to reduce the dependence of digital communication on wired and cellular wireless infrastructure, thus extending its reach into underdeveloped parts of the world and economically disadvantaged part of society and increasing its resilience to natural disasters, acts of war, or terror attacks on its physical infrastructure.<br\/>The work exploits synergies between two areas of research that have enjoyed dramatic advances in recent years, but have to date mostly worked independently: (1) ad hoc networking, and (2) decentralized, self-organizing distributed systems. They have assembled a team of experts in each of these areas that will jointly tackle the major technical challenges towards a network architecture that exploits infrastructure when it is available but does not depend on it:<br\/>Self-organizing network hierarchy: Will develop a novel, self-organizing buoy protocol that recursively subdivides the network into an adaptive, proximity-based hierarchy of cells. The cell hierarchy provides the foundation for scalable routing and provides a low-overhead, proximity-based overlay structure that can be used to support network services. Periodic broadcasts from buoy nodes in each cell efficiently disseminate aggregated location, addressing, and routing information. Scalable ad hoc network routing: Based on the buoy protocol, they will develop an ad hoc network routing architecture for mobile and stationary devices that scales to at least tens of thousands of nodes. Nodes maintain only a small amount of routing state that is logarithmic in the size of the network, in exchange for a slightly longer route length. Nodes maintain their routing state passively by listening to buoy broadcasts, which results in very low routing overhead. The per-node space and message requirements of the protocol grow at most logarithmically with the size of the network. <br\/>Self-organizing network services: The proposers plan to develop self-organizing, robust, and secure network services that exploit the hierarchical overlay structure of the buoy protocol. Basic naming, host configuration and network time services will ensure the operation of the network in the absence of fixed infrastructure servers that provide conventional DNS, DHCP and NTP services. Other self-organizing services will provide email, instant messaging, storage, and content distribution in the absence of a server infrastructure, manual administration, high-capacity backbones or trusted entities. Our approach builds on foundations from p2p systems, but takes advantage of the hierarchical, proximity-based low overhead overlay structure provided by the buoy protocol to provide a solution suitable for ad hoc wireless environments.<br\/>Integrated ad hoc network architecture: The proposers plan to develop a network architecture that will integrate wired and wire-less networks, infrastructure-based, and self-organizing services. The architecture takes advantage of existing infrastructure when and where available, without depending on its presence. In the wake of a disaster, the architecture will allow remaining islands of surviving infrastructure to self-organize jointly with wireless, mobile components to recover and resume connectivity and emergency network services. Similarly, the architecture will allow the integration of islands of wired infrastructure via wireless ad hoc communication in developing countries.<br\/>The intellectual merits of this work include the development of the science and technology to meet these challenges; they will evaluate theoretical results, algorithms and protocols through analysis, simulation, and experimental evaluation of prototype implementations; disseminate the results via publications, industrial collaborations, and student training; and to distribute software artifacts for evaluation and use by industry and the research community. <br\/>The broader impacts of this work include the development of technologies that will substantially increase the<br\/>resilience of digital networks to physical disasters or attacks and that will extend its reach into economically disadvantaged parts of society and underdeveloped parts of the world. Educational impacts include the training of students and research personnel and outreach to educational institutions not historically involved in research.","title":"SP: Collaborative Research: Safari: A Scalable Architecture for Ad Hoc Networking and Services","awardID":"0338856","effectiveDate":"2004-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":[233000,"497441","282239",233003],"PO":["402055"]},"90369":{"abstract":"CAREER: Compiler-directed Synthesis of Application Specific Processors<br\/><br\/><br\/>Application-specific instruction processors (ASIPs) have great potential to meet the challenging performance, cost, and power demands of the next generation pervasive computing platforms. Three critical issues with ASIPs are design time, design cost, and post-programmability. Automatic design is the key to simultaneously addressing these issues and enabling ASIPs to proliferate. The central vision of this research is to perform architecture synthesis based on compiler technology. Compilers employ sophisticated analyses that are adept at understanding, modeling, and transforming applications. These technologies will be reshaped from producing software customized for a predefined processor to producing hardware specialized to a software application. In this research, an automatic compiler-based synthesis system for ASIPs is being developed, including advances in architecture description technologies, instruction set, datapath, and memory synthesis techniques, and compiler scheduling and code generation algorithms.<br\/><br\/>The broad significance of this work is potentially reshaping the world of pervasive computers. Currently, a select few companies have the necessary resources, expertise, and ability to accomplish a completely designed and verified hardware solution. By creating the enabling technology to go from a software prototype to a specialized-programmable hardware solution, individuals without the necessary hardware expertise will gain the ability to innovate in the pervasive computing domain","title":"CAREER: Compiler-Directed Synthesis of Application Specific Processors","awardID":"0347411","effectiveDate":"2004-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["518034"],"PO":["550859"]}}