{"187330":{"abstract":"This project, developing models for complex swarming behaviors by incrementally starting from the properties of an individual agent, which includes noisy sensors and actuators and stochastic behavior, and validating the models by systematic experimentation with physical systems, will bridge the gap between analysis by simple primitives and their composition into complex swarming behaviors. Specifically, this research will consist of a comprehensive study of containment, partitioning, and re-configuration swarming primitives, and then show how they can be composed into complex swarming behaviors such as pattern recognition, sensor-based motion, and adaptive shape change. These primitives and behaviors have been chosen because they challenge existing modeling approaches and lead to independent contributions addressing grand challenge applications by themselves.<br\/><br\/>Inspired by the robust and scalable operation of bees, termites, ants and multi-cellular organisms, the funding of this proposed work will lead to a methodology to compose stochastic swarming behaviors in a principled way using probabilistic models. These models will be grounded in the probabilistic behavior of an individual agent's sensing, actuation, communication and computational properties by modeling the system at multiple levels of abstraction going back and forth from physical experimentation, kinematic models, and stochastic simulations to macroscopic difference equations. By grounding the models in physical experiments, models will be able to serve as design tool for not only the computational, but also the physical properties of an individual agent.<br\/><br\/>Broader Impacts: A principled methodology for modeling and designing swarming systems will create the foundation for designing and deploying swarm robotic systems for search and rescue, environmental response, precision agriculture, and surveillance, among others. At the same time, the ability to design swarms might also shed light on the workings of biological and chemical systems, such as social insects, multi-cellular systems, and self-assembly, enabling the design of complex multi-cellular systems with arbitrary functionality. Finally, algorithms and systems resulting from this research lend themselves to artistic installations, drawing a broad public into the fascination of swarming systems and nurture an understanding for the distributed nature that is common to all living systems. The proposed research will be deeply integrated with education. Specific offerings developed in this integrated research and education plan include: a modular robotic activity that introduces computational thinking to 4th graders, a crash-course on embedded systems geared at 1st year students from under-represented groups, a comprehensive robotics curriculum for upperclassmen, and an interdisciplinary graduate seminar on \"Swarm Intelligence\" and \"Self-Assembly\" that will actively involve students from other disciplines and encourage them to apply the proposed multi-level modeling methodology to their research.","title":"CAREER: Modeling and Design of Composite Swarming Behaviors","awardID":"1150223","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8013","name":"National Robotics Initiative"}}],"PIcoPI":["520181"],"PO":["564069"]},"188551":{"abstract":"This award funds a CISE REU program entitled Research on Biomedical Informatics at the University of Tennessee at Chattanooga. The objectives of this program are to expose students to the concepts, techniques, applications, excitement and rewards of Computer Science (CS) and Biomedical Informatics research, to stimulate the students interests in these fields, to improve students research and communication skills, and to encourage them to pursue a career in CS. The three year program will support the research activities of ten undergraduate students per year for a nine week period. Each student project is derived from on-going faculty-led research projects. The research activities in this proposal will contribute to the understanding of the fundamental theory, principles, and techniques in data mining, information retrieval, networking, security, and privacy. Immediate impacts of these research activities include: (1) enhanced and supported decision making and data mining for clinicians and biomedical researchers; (2) new computing resources for the biomedical network platform and telemedicine; and (3) new protections against potential security breaches leading to improved patient privacy and safety. The research areas in this program cover some of the most challenging research questions in Biomedical Informatics, and each project has the long-term potential to improve the quality of health care, reduce medical errors, provide safer care at a lower cost, and advanced biomedical research. This program helps prepare a workforce of young scientists in CS. This program also allows a diverse group of talented undergraduates to gain valuable research and communication skills and improve self-confidence, creative thinking, and independent problem solving.","title":"REU SITE: Research on Biomedical Informatics","awardID":"1156639","effectiveDate":"2012-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["543501","514674"],"PO":["563751"]},"187253":{"abstract":"This project, creating a novel class of magnetically-controlled, mobile microrobots with two-dimensional vision-based micro-force sensing end-effectors, has the potential to advance both the state of the art in microrobots and the state-of-the-art in biological cell micromanipulation. By combining advanced mobile manipulation microrobots with a MEMS-based micro-force sensor, a novel, transformative tool for future advancements in mechanobiology and automated biomanipulation will result.<br\/><br\/>The end-effectors of the proposed mobile microbots consist of micro-compliant mechanisms with custom-designed force-deflection characteristics whose deformations are observed with a camera attached to an optical microscope. The grippers will be fabricated along with a soft magnetic microrobot body and therefore controllable with external magnetic field gradients. These micro-force sensing mobile microrobots will have real-time micro-force-control manipulation capabilities specifically tailored for mechanobiology and automated biomanipulation tasks. A portable ìBio-Robotics test-bed, designed to fit comfortably around both inverted optical or confocal microscopes, is proposed to facilitate outreach and future collaborative research. Finally, a series of proof-of-concept application studies related to single cell and biomaterial adhesion and cell characterization will be conducted to showcase the efficacy of the system.<br\/><br\/>Broader Impacts: Advances in mechanobiology and automated biomanipulation enabled by this proposal will directly impact the healthcare of many. The research and educational\/outreach efforts of this proposal will impact students from the high school to the graduate levels. Student teams will participate in an international mobile microrobotic competition, as well as the ASME Student Mechanism and Robot Design Competition, to stimulate students' interests in undergraduate research. Local elementary and high school students will be enriched through the Stevens' Center for Innovation in Engineering and Science Education and the Stevens Exploring Career Options in Engineering and Science program.","title":"CAREER: Novel Wireless, Micro-Force Sensing Mobile Microrobots for Mechanobiology and Automated Biomanipulation","awardID":"1149827","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"7712","name":"ORGANIZATION"}}],"PIcoPI":["564068"],"PO":["564069"]},"187210":{"abstract":"Our society is becoming increasingly reliant on powerful and interconnected computing devices that store much of our personal information. These devices present an ever-growing tension between the desire for our personal information to be private, and the desire to put our personal information to good use for our own convenience. In cryptography, problems that involve requirements of useful computation and privacy are understood through the lens of secure multi-party computation (SMPC). Specifically, SMPC refers to the problem of how mutually distrusting parties can securely and collaboratively perform tasks that involve private information.<br\/><br\/>In this project, the PI will develop new techniques for understanding and overcoming the challenges and limitations posed by SMPC protocols. In particular, the following major themes will be explored: (1) is it possible in the real world to design protocols that remain secure regardless of other concurrently running protocols? (2) what security properties can be embedded into objects like ciphertexts and digital signatures? (3) how can shared data be maintained persistently while remaining private? The PI will develop new materials for undergraduate courses in cryptography and algorithms, based on principles of pedagogically sound visualization. The PI will also create resources for the cryptography research community, in the form of an online database of cryptographic constructions and primitives.","title":"CAREER: Getting the Most out of Secure Multi-Party Computation","awardID":"1149647","effectiveDate":"2012-03-15","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[502173],"PO":["565264"]},"187243":{"abstract":"This project develops a unified multimodal and multialgorithm fusion framework to recognize facial action units, which describe complex and rich facial behaviors. The information from voice is incorporated with visual observations to effectively improve facial activity understanding since voice and facial activity are intrinsically correlated. The developed framework systematically captures the inherent interactions between the visual and audio channels in a global context of human perception of facial behavior. Advanced machine learning techniques are developed to integrate these relationships together with uncertainties associated with various visual and audio measurements in the fusion framework to achieve a robust and accurate understanding of facial activity. It is these coordinated and consistent interactions that produce a meaningful facial display.<br\/><br\/>The research work from this project fosters computer vision and machine learning technologies with applications across a wide range of fields varying from psychiatry to human-computer interaction. The new audiovisual emotional database constructed in this research facilitates benchmark evaluations and promotes new research directions, especially, in human behavior analysis. An integration of research and education promotes cutting-edge training on human-computer interactions to K-12, undergraduate, and graduate students, especially encourages the participation of women in engineering and computing.","title":"CAREER: Multimodal and Multialgorithm Facial Activity Understanding by Audiovisual Information Fusion","awardID":"1149787","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["554387"],"PO":["564316"]},"187265":{"abstract":"Quantifying similarity is a fundamental challenge in artificial intelligence and machine learning which - if performed perfectly - would reduce many tasks to a trivial nearest neighbor search. For example, determining whether an email were spam would be as simple as searching a labeled database of emails and assigning it the same label (spam or not) as the email considered most similar to it. But how can one measure the similarity of two email messages? Does the same measurement still apply when comparing medical images? How does our understanding of similarity depend on the problem specification? Metric learning optimizes distance functions specifically for a given task, taking into account both the learning problem and the data. Initial successes with linear metrics show great improvements on many \"k-nearest neighbors\"-based learning tasks. <br\/><br\/>This project pursues four research directions that strengthen the theoretical understanding of metric learning within the research community, broaden its impact and significantly improve the current state-of-the-art: <br\/><br\/>1. Are there non-linear transformations that lead to equally elegant and efficient optimization problems as existing linear metrics? As data sets grow and become increasingly complex, linear metrics are no longer sufficient to capture similarity relations. By exploring the use of non-linear metrics, this research can substantially improve the impact of metric learning and the accuracy of similarity relations. <br\/><br\/>2. Can the impact of metric learning be extended to machine learning frameworks beyond nearest neighbors? Designing new metric learning algorithms that explicitly optimize distances for a broad variety of machine learning algorithms will significantly increase the number of applications and learning methods that can directly benefit from metric learning. <br\/><br\/>3. Can metrics be learned from weak supervision? Removing the dependency on labeled data will reduce the cost of metric learning and increase its applicability. <br\/><br\/>4. Can one develop a solid theoretical framework to explain preliminary empirical successes and to direct future research? This will strengthen the theoretical understanding of metric learning within the research community. <br\/><br\/>Successful resolution of the proposed problems will lead to novel learning methods which will be immediately applicable to ongoing high-impact medical research collaborations of the principal investigator. In conjunction with these research directions, the principal investigator will also pursue educational goals, including the co-development of a K-12 curriculum module estimated to impact 2,500 high-school students. Many topics in the proposed research plan have components ideal for introducing the research process to undergraduate and graduate students, and the principal investigator plans to use his research as a vehicle to instruct and inspire future computer scientists and next-generation researchers.","title":"CAREER: New Directions for Metric Learning","awardID":"1149882","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[502284],"PO":["562760"]},"187233":{"abstract":"This project seeks to transform the study of technology-mediated social participation through the human-centered computing equivalent of genetically targeted medicine. Just as advances in medicine enable us to use information about a person's genetic profile to target medical treatment to his needs, information about a user's personal attributes such as his motivations and personality traits can be used to target individually-tailored, theory-driven design aimed at increasing the user's participation in technology-mediated social efforts. The research focus is on technology-mediated citizen science, which offers an ideal laboratory for studying issues that are important in many other fields. The project will involve three citizen science modalities: distributed analysis, distributed data gathering, and volunteer computing. The research will test the effectiveness of design features informed by social psychology theory and human-computer interaction research, and develop a rigorous theoretical understanding of individually-tailored design.<br\/><br\/>The project seeks to advance human-centered computing theory and practice. The intellectual merits of the research therefore include: 1) advancing technology-mediated social participation theory by developing a theoretical framework that combines personal attributes and design; 2) developing and testing empirically a novel technique and specific design guidelines to enhance technology-mediated social participation, with application to citizen science projects.<br\/><br\/>The unique setting of this research within the citizen science domain promises long-term benefits to society and science. In particular, the broader impacts of the research include: 1) leveraging technology-mediated social participation and citizen science to engage members of the public in science and scientific work, and in particular, members of disadvantaged communities to whom traditional science-related activities may otherwise not be accessible; 2) enhancing the infrastructure for scientific research through effective citizen science; and 3) integrating technology-mediated citizen science in outreach programs.","title":"CAREER: Individual Attributes and Social Participation: Designing for Citizen Science","awardID":"1149745","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551771"],"PO":["564456"]},"188487":{"abstract":"This Research Experience for Undergraduates (REU) site provides a diverse group of promising students with a summer research experience in order to foster their intellectual growth as scientists and provide a stepping stone to a rewarding career at the intersection of social sciences and information technology, with a focus on incentive-centered design (ICD), an approach to designing systems in a way that aligns individual incentives with system goals. <br\/><br\/>Students will participate in research projects in several areas of ICD, including the design and implementation of trading agents for complex automated markets, behavioral experiments to understand the factors that motivate human behavior and test incentive mechanisms, the use of social motivators to promote healthy behaviors, and the analysis of strategic properties of all-pay auctions and crowdsourcing contests. REU students are fully integrated into a research group that matches their intellectual interests and work as independently as possible with faculty mentors who excel in supervising undergraduate research. <br\/><br\/>Broader Impact: This program aims to attract a diverse group of students to the newly emerging interdisciplinary field of incentive-centered design, thereby expanding the pool of students interested in research careers across multiple disciplines. The research work will be augmented by an extensive array of other educational and collegial activities that will allow students to view their research experience in a broader context, build a network of professional contacts, and develop professional skills in a scientific environment.","title":"REU Site: Incentive-Centered Design","awardID":"1156469","effectiveDate":"2012-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["529284",505391],"PO":["563751"]},"188631":{"abstract":"This funding renews a long-running and highly-successful CISE Research<br\/>Experiences for Undergraduates (REU) site at DePauw University. The<br\/>site exposes students to a range of topics in Computer Science, including<br\/>pen-based computing, computer-supported cooperative work, assistive<br\/>technology, natural language processing, functional programming<br\/>languages, wireless sensor networks, programming pedagogy, parallel<br\/>programming, and virtual reality. Students will work in small teams<br\/>with a mentor and will experience conducting research as part of a team,<br\/>disseminating research results, and participating in a community of<br\/>scholars.<br\/><br\/>This REU site will allow 24 students (over three years) to experience<br\/>research in a variety of areas in Computer Science. The site focuses<br\/>on recruiting students from undergraduate-only institutions, who do not<br\/>have as ready access to research opportunities as students at research<br\/>universities. The site?s primary objective is to encourage talented<br\/>students enrolled at undergraduate institutions to pursue graduate<br\/>studies and research careers in Computer Science.","title":"REU Site: Research Experiences in Computer Science for Students at Undergraduate Institutions","awardID":"1156893","effectiveDate":"2012-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505808,505809],"PO":["564588"]},"187113":{"abstract":"This project, developing a coarse\/fine approach to walking on unstructured terrain based on integrating 3D perception and compliant contact, addresses central challenges in robotic locomotion. Despite recent advances, unstructured tasks such as walking on rocks with sparse footfalls - a task that is easy for humans - remains very challenging for robots. This effort seeks to solve this type of problem with a coarse approach using 3-D perception that uses range sensing to find general curved surface patches in the environment that might be suitable for foot placement. Along with patches on the robot itself, these patches are placed into a novel dynamic spatial patch map with estimated uncertainty that mates robot patches with environmental patches. The fine alignment is handled by a compliant ankle that allows the patches to mesh naturally. This approach is applicable to dexterous manipulation, as well.<br\/><br\/>Broader Impacts: We are now at a transformative frontier where we must introduce robots to unstructured tasks -- in factories, hospitals, and labs; in outer space; and in the home -- where now only humans can manage the uncertainty. Through building robot analogues to the human process of uncertainty tolerance combining vision and compliance, this work will help enable a new science of high-uncertainty robotics. The proposed education plan is built around modules and open hardware that will be portable to mobile manipulation courses at other institutions, which will be actively promoted. It also aims for broader audiences with specific plans to engage younger students and adult self-learners.","title":"CAREER: Reliable Contact Under Uncertainty: Integrating 3D Perception and Compliance","awardID":"1149235","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[501974],"PO":["534411"]},"187245":{"abstract":"This project will develop web-based knowledge-building environments for the collaborative creation of information landscapes: interactive visualizations that support the sensemaking individuals engage in online, and capture their efforts for the benefit of others who come after them. To guide and motivate the design of these environments, the research builds on theories of sensemaking, which describe the nested and parallel loops through which individuals seek out, analyze, and understand information, grounded in a rich history from organizational behavior, social and cognitive psychology, and human-computer interaction. It will extend theories of individual sensemaking to the situation in which an individual's processing of information for themselves is consumed by others, whose processing in turns improves the sensemaking of those coming after them - what can be called the \"distributed sensemaking cycle.\" <br\/><br\/>Examining distributed sensemaking in a way that is both rigorous and environmentally valid is a challenging prospect, so this project will take a multi-stage approach involving laboratory studies to characterize the distributed sensemaking process and iteratively develop interfaces; \"virtual lab\" experiments harnessing crowdsourcing to evaluate these processes and interfaces at a larger scale while bootstrapping the system's value; and controlled field trials to test theories and interfaces in environmentally valid settings. <br\/><br\/>In order to capture the benefits and costs to both the producer and the consumer, the research will employ an experimental framework that elicits both of their perspectives. The general approach involves the producer using an interface for a sensemaking task and the consumer doing the same task but starting with the results of the producer's work. This approach will iteratively develop interfaces that help individuals forage for information, integrate the results of their foraging into information landscapes, and convey the judgments, decisions, and work they engaged in during the process to others. <br\/><br\/>The results of this research will advance scientific understanding across a variety of domains, including sensemaking, collaboration, schema induction, and interface design. The research has the potential to improve the efficiency of knowledge work, the training and practice of scientists, and the effectiveness of education. The tools developed in this research will be incorporated and evaluated in educational practice, and will become the center of a community linked to several existing knowledge bases.","title":"CAREER: Distributed Sensemaking: Making Sense of the Web Together","awardID":"1149797","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["517858"],"PO":["564456"]},"188488":{"abstract":"This funding establishes a new CISE Research Experiences for Undergraduates (REU) Site at Montana State University focused on networking and networks with applications for sustainability. Each summer a cohort of undergraduate students will participate in a ten-week summer research program at the host institution. The project includes mentoring by the experienced computer science faculty members, technical seminars and workshops, student presentations, and field trips and other professional development opportunities. The REU Site program will target high-quality undergraduate American Indian students, students from tribal colleges, and students from small colleges with limited resources. Recruitment efforts will focus on computer science and engineering students as well as students from environmental science and other related disciplines. This site is co-funded by the Experimental Program to Stimulate Competitive Research (EPSCoR).<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in research areas that are current and address national priorities such as networking and sensor networks. The students participate in a full range of research activities from preparing research literature reviews to production and dissemination of research results. The project has the potential to add to the research base of networking systems.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The project team is committed to including under-represented minority students in their research. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Research in Networking and Networks with Applications to Sustainability","awardID":"1156475","effectiveDate":"2012-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[505393,505394],"PO":["564181"]},"195397":{"abstract":"The grant will support student travel to the International Symposium<br\/>on Code Generation and Optimization (CGO 2012). CGO is a top<br\/>conference in the area of advanced compilation techniques, such as<br\/>feedback-directed optimizations and attuning. Supporting student<br\/>travel to attend professional conferences and workshops is a very<br\/>important mission of the NSF. Broader impacts include building the<br\/>next generation of researchers in this research area.","title":"Student Travel Support for the 2012 International Symposium on Code Generation and Optimization (CGO 2012)","awardID":"1232452","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["543957"],"PO":[523800]},"187213":{"abstract":"Future systems based on nanoscale transistors will offer significant boosts in information gathering and processing capabilities. However, the reliability and scalability challenges mandate a transformation in the system-level approaches. A number of fundamental assumptions will change with nanoscale transistors: the fabrication processes will be highly defective due to the random nature of nanoscale self-assembly; system reliability cannot be guaranteed in the field because nanoscale transistors are extremely susceptible to intermittent faults; system scalability demands the interconnection between components to be strictly localized. <br\/><br\/>This research aims at forming a new paradigm to construct reliable and scalable nanosystems, which will open up new application domains currently held back by the size and power limit. This research focuses on three life-span stages of future nanosystems: (1) defects discovered during manufacturing are treated through chip reconfiguration; (2) dynamic faults are treated in the field with built-in redundant elements under the strict constraint of local interconnections. The approaches and analysis for these two stages will provide guidance for the (3) system design stage. <br\/><br\/>This CAREER project includes a strong educational component for undergraduate students to participate in a number of competition projects to gain research experiences. These projects are also joined by graduate students to learn to convey research outcome to a general audience. Such an integrated research and educational effort aims at bridging the gaps between state-of-the-art research and the teaching of engineering approaches, many distinct knowledge bodies of EE, CE, and CS, and between systems research and device research in the academic community.","title":"CAREER: Towards the Future of Reliable and Scalable Nanoelectronic Systems","awardID":"1149661","effectiveDate":"2012-03-15","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[502179],"PO":["565255"]},"187224":{"abstract":"CAREER: 3D Stacked Systems for Energy-Efficient Computing: <br\/>Innovative Strategies in Modeling and Runtime Management<br\/>Ayse K. Coskun, Boston University<br\/><br\/>Abstract<br\/><br\/>Energy efficiency is a central issue in computing. In large-scale computing clusters, operational and cooling costs impose significant sustainability challenges. Embedded systems run increasingly complex, performance demanding workloads, making the well-known energy management policies inadequate. High power densities also cause high on-chip temperatures and large thermal variations, both of which degrade system reliability. <br\/><br\/>The research goal of this project is to demonstrate that 3D stacked systems, where multiple chips are vertically attached, can provide dramatic increases in energy efficiency. Realizing this ambitious energy efficiency goal requires novel analysis, design, and runtime management techniques. This project?s objective is creating these catalyst techniques to make 3D systems effective agents for attaining low-power, high-throughput computing in both embedded and large-scale computing domains. Specific research directions are: (1) developing a widely applicable methodology for jointly analyzing the performance, energy, and temperature characteristics of 3D multi-core systems; (2) designing runtime management policies to maximize performance under thermal or power constraints; (3) optimizing liquid-cooled 3D systems to push the performance bounds while maintaining reliable and low-energy operation. <br\/><br\/>A realizable target for this project in the next decade is a significant reduction in overall energy consumption for computing infrastructure, which translates into monetary savings and carbon footprint reduction. The project also has immediate impact on the system and software design practice. Relevance of the research topic to today?s fast growing computing paradigms such as embedded systems, high-performance computing, and cloud enables constructing a broad educational and outreach plan for K-12 and college students.","title":"CAREER: 3D Stacked Systems for Energy-Efficient Computing: Innovative Strategies in Modeling and Runtime Management","awardID":"1149703","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[502201],"PO":["565255"]},"188676":{"abstract":"This project renews a highly successful and long running REU site in the Department of Computer Science and Engineering at the University of Texas at Arlington with a research focus on national priorities in healthy living, care technologies, and aging in place. As the population ages and chronic health conditions become of increasing importance in health care, the use of intelligent environment technologies to improve health, reduce the need for institutionalization, and improve quality of life is becoming increasingly important as a health facilitator and a tool to help address spiraling care costs. The goal of this site is to offer unique training opportunities to eight undergraduate students per year to become involved in on-going, multidisciplinary research in these areas and to prepare them for successful graduate careers in this field. As part of the program, REU participants will be trained in the underlying areas by a group of faculty mentors from Computer Science and Nursing and will conduct independent research projects under the greater envelope of the interdisciplinary SmartCare research effort at the University of Texas at Arlington. <br\/><br\/>This program will provide new opportunities for highly talented and qualified upper division undergraduates, with a particular emphasis on women, minority, and disabled students. The goal is to augment the students? educational experience and to attract qualified undergraduates to graduate studies and careers in health technologies. The student participants will be recruited nationally, but with an emphasis on women and minority institutions as well as non-research institutions in the southwest region.","title":"REU Site: Research Experiences for Undergraduates in Intelligent Environments for Healthy Living and Aging in Place","awardID":"1157061","effectiveDate":"2012-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505936,"559680"],"PO":["563751"]},"186157":{"abstract":"The proposed activity involves a research environment and educational curriculum dedicated to dealing efficiently with the complexity and constraints that protein molecules pose to computational studies. The emphasis is on elucidating the motions that proteins employ for biological function. This is a fundamental issue in the understanding of proteins and biology due to the central role of proteins in cellular processes.<br\/><br\/>The research addresses fundamental issues in protein modeling. Understanding proteins in silico involves searching a vast high-dimensional conformational space of inherently flexible systems with numerous inter-related degrees of freedom, complex geometry, physical constraints, and continuous motion. Three core research directions are identified. (1) Geometric constraints underlying protein motion are not trivial to identify or address. The proposed research exploits mechanistic analogies between proteins and robot kinematic linkages and investigates inverse kinematics techniques to efficiently formulate and address complex geometric constraints arising in diverse protein studies. (2) The funnel-like protein energy landscape exposes physics-based energetic constraints that are often demanding to address in silico. The proposed research pursues a multiscale treatment of energetic constraints in the context of probabilistic search, supporting coarse- and fine-grained levels of protein representational detail and converting between them with information gathered during exploration. (3) The conformational ensemble view of the protein state relevant for function necessitates search algorithms capable of exploring the high-dimensional conformational space and its rugged energy landscape. A novel probabilistic search framework is proposed that gathers information about the space it explores and employs this information to advance towards promising unexplored regions of the space. Taken together, these research directions allow addressing complexity in proteins by formulating and exploiting geometric and energetic constraints, thus narrowing the search space of interest to regions where the constraints are satisfied, and by employing a novel probabilistic framework with enhanced sampling capability able to feasibly search the relevant regions of the space.<br\/><br\/>The proposed activity promises to advance discovery and understanding both in the computer science and protein biophysics communities. Since most problems of practical interest are high-dimensional and often exhibit complex non-linear spaces, the proposed research cuts across and spans multiple areas in computer science, such as robot motion planning, optimization in complex non-linear spaces, and modeling and simulation of complex physics-based systems. In particular, the research will reveal effective probabilistic search strategies for continuous high-dimensional search spaces. Analogies with articulated mechanisms will offer insight on how to generate valid robot configurations in the presence of constraints. On the biophysical side, the research promises to advance protein modeling and understanding across diverse applications. The proposed activity involves interdisciplinary collaborations with computer scientists, biophysicists, and chemists. Findings and data will be disseminated broadly to enhance scientific understanding across diverse communities. Specific educational objectives focusing on curriculum design and outreach activities are formulated to employ the proposed research for broadening the participation of college and pre-college students, with a particular emphasis on underrepresented groups.","title":"CAREER: Probabilistic Methods for Addressing Complexity and Constraints in Protein Systems","awardID":"1144106","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["565088"],"PO":["565136"]},"188656":{"abstract":"This funding renews a successful CISE Research Experiences for<br\/>Undergraduates (REU) site at the University of Texas at Dallas.<br\/>This site focuses on Software Engineering research related to<br\/>Software Safety. Students will evaluate the strengths and<br\/>weakness of existing methodologies and current practices for<br\/>safety assurance, as well as investigating issues such as how<br\/>the introduction of software safety requirements may affect<br\/>the software lifecycle and how software processes, methods<br\/>and tool support should be adjusted. In addition to research,<br\/>students will take field trips to industrial partners and attend<br\/>mentoring workshops on technical writing and oral presentation.<br\/><br\/>This REU site will allow students, especially those from<br\/>underrepresented groups or universities with limited research<br\/>opportunities, to experience cutting-edge research in software<br\/>safety --- critical to the prevention of catastrophic accidents<br\/>and safe operation of software-dependent systems. It will also<br\/>encourage these students to continue into graduate programs and<br\/>careers in science and technology research. Students will gain<br\/>proficiency in a broadly applicable skill set including oral<br\/>and written communication, research methods, critical thinking,<br\/>and problem solving.","title":"REU Site: Software Safety: Methodology, Practice and Research","awardID":"1156977","effectiveDate":"2012-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505879,505880],"PO":["564181"]},"187116":{"abstract":"Over the past 45 years, computer scientists and engineers have transformed plentiful transistors into computational capability. At present, energy costs jeopardize further capability scaling, especially in datacenters. Given constrained datacenter power budgets, which are already at megawatt scales, this project is developing new paradigms to design and deploy heterogeneous datacenter architectures to improve energy efficiency by an order of magnitude. Heterogeneity specializes hardware for particular applications and deploys a mix of hardware for a mix of application needs. Specialization improves efficiency as overheads from supporting general, arbitrary computation are reduced. To realize heterogeneous efficiency, this project is rethinking design and deployment. Rethinking design to reduce specialization costs, this project is parameterizing hardware designs to facilitate their re-use, applying statistical inference to explore design spaces, and clustering applications that have similar hardware needs to increase each design?s market volume. Rethinking deployment to reduce performance risk, this project is developing multi-agent systems that transparently manage and allocate heterogeneous resources to meet performance targets.<br\/><br\/>This project has the potential to impact the composition and management of datacenters that underpin cloud computing. As access to cloud computing is democratized, diverse users will seek computation. And this project is architecting energy-efficient infrastructure to provide that computation. The design and deployment of heterogeneous architectures requires a holistic view of computer systems. The project is integrating research with curricular development, broadening students? views of processor, memory, network, and storage. The project is engaging all students at all levels of education and from all backgrounds, preparing future generations for computer engineering and research.","title":"CAREER: Foundations for Heterogeneous Datacenter Design and Deployment","awardID":"1149252","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556683"],"PO":["366560"]},"187259":{"abstract":"Frequent subgraph mining is a core task in data mining which can be applied to various real-life problems related to graphs and networks. Presently, the research value of this task has been heightened by the increased availability of massive network data in the domains of life and social sciences. However, existing algorithms for subgraph mining suffer from various limitations; noteworthy among these are lack of scalability, lack of user interaction and the absence of a mechanism to mine dynamic graphs. This research aims to overcome the above limitations by accomplishing the following three related tasks: (1) use of Monte Carlo sampling mechanisms for designing scalable graph mining algorithms; (2) develop real-time interactive graph mining systems using subgraph sampling approaches; and (3) discover models for graph evolution that are based on sampling and driven by the principles of game theory and economics.<br\/><br\/>This research builds a novel paradigm for subgraph mining that is based on Monte Carlo sampling. This allows the development of algorithms that are scalable, by avoiding the need to enumerate all subgraph patterns. The resulting algorithms will be applied to subgraph mining problems in systems biology, e.g., predicting disease pathways by mining graphs from genomics and proteomics co-expression networks. A second outcome of this research is an interactive pattern mining framework using subgraph sampling where user feedback guides updates of the sampling distribution such that subsequent sampling prioritizes patterns that are considered \"interesting\" to the user. A third outcome is a subgraph sampling method that uses a game theoretic mechanism to design a subgraph evolution model for prediction tasks (such as link prediction) in dynamic networks. <br\/><br\/>Broader Impacts: Availability of tools for mining large graphs enables the opportunity to build network biomarkers, which are novel signatures for disease diagnosis and risk factor analysis. A sampling based interactive pattern system is instrumental to mine \"interesting\" associations between diseases and medicines from numerous hidden datasets that are currently unexplored in many hospitals and health clinics. Scalable graph mining algorithms are also likely to find use in search, e-commerce and social networks based industry. The educational goal of this research is to leverage the PI's industrial experience to develop a \"Large-scale data analysis\" course on methods needed to build data mining systems that work on industry-scale data.<br\/><br\/>Additional information about the project, including the findings, methods, open source implementations of algorithms, publications and data can be accessed through the project website at http:\/\/www.cs.iupui.edu\/~alhasan\/graph_mining.","title":"CAREER: A novel framework for mining graph patterns in large biological and social networks","awardID":"1149851","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[502271],"PO":["565136"]},"187149":{"abstract":"We live in a world of ubiquitous imagery, where the number of images at our fingertips is growing at a seemingly exponential rate. These images come from a wide variety of sources, including Internet mapping sites, webcams, surveillance and reconnaissance cameras, and millions of photographers around the world uploading billions and billions of images to photo-sharing websites. Taken together, these sources of photos can be thought of as constituting a distributed camera capturing the entire world at unprecedented scale, and continually documenting its cities, mountains, buildings, people, and events.<br\/><br\/>This research is creating the basic computational tools for \"calibrating\" this distributed camera, through use of a world-wide database of 3D models built from Internet photo collections using computer vision techniques. The focus is on creating faster, more robust algorithms for 3D reconstruction from unstructured photo collections, as well as techniques for world-scale pose estimation--computing precisely where in the world a photo was taken from image data alone. These tools are yielding large, world-wide databases of calibrated imagery that can help answer questions in science (e.g., finding all available photos of Central Park so as to track flowering times of different plants) and engineering (e.g., finding all of the photos ever taken of a particular bridge to help figure out why it collapsed), and have impact other areas including security, consumer photography, and multimedia search. This research is closely integrated with education and outreach, and includes plans for a summer workshop for high-school students to engage with 3D vision technologies.","title":"CAREER: Sensing the World with the Distributed Camera","awardID":"1149393","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[502048],"PO":["564316"]},"191681":{"abstract":"The 2012 IEEE INFOCOM Conference on Computer Communications will be held in in Orlando, Florida, USA from March 25 to March 30, 2012. This preeminent technical conference is the primary venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners in the field. Attending conferences such as INFOCOM is of paramount importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field.<br\/>Broader Impact: This proposal provides travel support for approximately fifteen graduate students in the United States to attend this premiere conference. The travel awards will target graduate students, in particular, women and under-represented minority students, since attending conferences is an important part of their educational experience, and they often have limited travel funds.","title":"Student Travel Support for IEEE INFOCOM 2012","awardID":"1209249","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["555021"],"PO":["565090"]},"194233":{"abstract":"This is funding to increase diversity of participation in the Social Computing, Behavioral-Cultural Modeling, and Prediction (SBP) 2012 conference, to be held at the University of Maryland, College Park, from April 2-5, 2012. The SBP conference provides an international platform for collaborative and exploratory research that advances the emerging interdisciplinary field of social computing. It attracts leading researchers in behavioral modeling and social computing from academia, industry and government, who address issues of behavior modeling, analysis, pattern mining, and prediction in domains such as healthcare, privacy, and organizations.<br\/><br\/>Analysis of attendance at previous SBP conferences has found substantial gender and racial inequalities in participation in the conference, and less disciplinary diversity than desired for this new interdisciplinary field. Project activities include (a) targeted outreach to female, Hispanic, African-American, Historically Black Colleges and Universities, and schools in EPSCoR (Experimental Program to Stimulate Competitive Research) states; (b) targeted outreach to underrepresented academic disciplines relevant to SPB;(c) special invitations to participate for authors in the same categories of schools and disciplines who have had a paper declined; (d) solicitations for student volunteers from the same categories of schools and disciplines; and (e) encouraging diversity in the selection of speakers for the panels held during the conference. Small travel grants and\/or conference fee waivers will be used to encourage participation.<br\/><br\/>Broader Impacts: By broadening participation in the SBP conference, this project will provide new opportunities for interaction across disciplinary boundaries, fostering creative new ways of thinking about problems in social computing and behavior modeling. In addition, the project will encourage members of disadvantaged groups to become involved in STEM research through training, professional development, and community building.","title":"SBP 2012 Outreach Efforts to Increase Diversity and Participation of Minorities","awardID":"1225981","effectiveDate":"2012-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[520192,"525556"],"PO":["564456"]},"195004":{"abstract":"This project supports a workshop entitled `` DATA-DRIVEN ENERGY SYSTEMS: From Data Collection to Information Technology for Sustainable Services?? to be held at Carnegie Mellon University on March 12-14, 2012. It is a part of the 8th Carnegie Mellon University Electricity Conference that provides a venue for structured brainstorming by the thought leaders in multiple communities. One of the key premises in this workshop is that IT-enabled flexible utilization of assets is key to sustainable energy services. However, the challenge is enormous as the industry paradigm shifts from the predictive, worst-case centralized data management to highly distributed interactive data and resource management. Invited talks by the academic, industry and government participants will be presented to pose these problems more formally, to assess state-of-the-art, and to investigate new approaches. The conference proceedings will provide a point of reference for future research and education.","title":"The 8th Annual CMU Electricity Conference: Data-Driven Energy Systems: From Data Collection to Information Technology for Sustainable Services","awardID":"1230039","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563201"],"PO":["535244"]},"185368":{"abstract":"This proposal seeks to support US graduate student participation in the 2012 annual meeting of the Cognitive Science Society in Sapporo Japan, along with research interchanges and collaborations with Japanese labs immediately subsequent to the conference.<br\/><br\/>For 33 years, the Cognitive Science Society has been the premiere international organization for research in Cognitive Science. The Society brings together researchers from many fields that hold a common goal: understanding the nature of cognition as it appears in biological organisms and finds its pinnacle in humans, and as it is simulated in artificial systems. In general, the meeting provides a forum for the first communication of state-of-the-art research in cognitive science, focusing on a broad range of disciplinary and interdisciplinary topics, with representation from psychology, computer science, neuroscience, linguistics, and anthropology.<br\/><br\/>Each year, the annual meeting includes a rich selection of tutorials and workshops available to students. Workshops and tutorials can be helpful in any academic discipline, but they are especially needed in cognitive science because it is very rare that students come from programs with expertise spanning the breadth of the field. Research in many areas of cognitive science has flourished over the past decade in Japan. The time is therefore ripe for fostering international, interdisciplinary research interchanges and collaborations.","title":"International Research and Education Opportunities for US Graduate Students in the Cognitive Sciences","awardID":"1139810","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["294423"],"PO":[497399]},"187205":{"abstract":"This project develops new techniques for visually interpreting an image in a way that specifically leverages large image collections, now common on the web and elsewhere. The research team uses an approach whose performance directly scales with the size of the dataset, unlike many existing approaches to image understanding. The basic approach is to build a copy of a query image by assembling pieces of image from a large set of training images, in the manner of a jigsaw. Each region in the query is classified by copying labels from the matched regions. The larger the training set, the more jigsaw pieces there are to choose from, thus the more accurate the match.<br\/><br\/>The initial work of the project focuses on developing efficient methods for performing the matching that allow the incorporating of various desirable constraints. The approach is then extended to handle training data with incomplete labels -- important since few datasets have labels for every region. The research plan also includes building better embeddings for the regions which place semantically similar regions closer together than current representations do, and developing efficient binary matching schemes along with further work on the region embeddings. <br\/><br\/>Robust techniques for visual recognition have widespread applicability, in such areas as image search, robotics and surveillance. The project also involves extensive outreach activities, including high-school internships and the organization of a NY-area vision day for students and researchers","title":"CAREER: Non-Parametric Image Parsing","awardID":"1149633","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[502163],"PO":["564316"]},"187326":{"abstract":"We are now in the midst of a technological revolution of massive data generation and processing. Equally massive data storage is required to support this technological boom. New solutions cognizant of operational constraints of storage systems must be invented to curb the skyrocketing cost of data storage. Fundamentally common to all storage technologies are channel coding schemes. Results from coding theory have been used with phenomenal success in storage systems. Practical coding schemes have helped make computer storage ubiquitous. However, currently available coding schemes have hit a performance wall: existing codes are designed for simple channels, and do not match the needs of new storage technologies where the data must be packed as densely as possible on increasingly adverse mediums. Such performance provisioning not only violates fundamental information-theoretic laws but directly increases the cost of a storage system.<br\/><br\/>This research fundamentally rethinks channel coding methods with applications to storage systems. This project creates a coding-theoretic foundation that embraces, rather than ignores, adverse physical and operating conditions to increase the capacity of the upcoming storage technologies. Rich combinatorial structure of non-binary channel codes is explored and exploited over four research thrusts: (a) analysis and design of structured non-binary low-density parity-check codes, (b) theory and practice of non-binary non-symmetric error correcting codes, (c) non-binary methodologies for overcoming synchronization errors, and (d) theory-based rapid code prototyping using novel algorithms for fast simulation, FPGA implementation, and publicly available on-line evaluation tool. This research project contributes to the development of a competitive American workforce through active and carefully tailored research engagement of high-school, undergraduate and graduate students.","title":"CAREER: Channel Coding Paradigms for Next-Generation Storage Systems","awardID":"1150212","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["508496"],"PO":["564924"]},"187249":{"abstract":"The pendulum in Artificial Intelligence (AI) research has periodically swung from so called \"neat\" or mathematically rigorous approaches, and \"scruffy\" or more adhoc approaches. In recent years, real-world data across varied fields of science and engineering are increasingly complex, and involve a large number of variables, which has resulted in a surge of scruffier methods. This proposal develops a general \"neat\" framework for such modern settings by leveraging state of the art developments in two of the most popular subfields of machine learning methods: graphical models and high-dimensional statistical methods. These developments have in common that a complex model parameter is expressed as a superposition of simple components, which is then leveraged for tractable inference and learning.<br\/><br\/>Our unified framework results not only in a unified picture of these developments but also provides newer methods to work with such high-dimensional data. The research thus impacts problems across science and engineering wherever statistical machine learning approaches are being used (such as genomics, natural language processing and image analysis, to name a few). The work on a unified framework for statistical machine learning problems is highly coupled with a push for imparting training to students on what we call \"comptastical\" thinking. This combines both computational and statistical thinking required for addressing the problems of limited computation and limited data inherent in modern statistical AI application domains. The proposal also develops an infrastructure for component-based courses with relationally organized lecture module components.","title":"CAREER: A New Neat Framework for Statistical Machine Learning","awardID":"1149803","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["551037"],"PO":["562760"]},"187206":{"abstract":"It is widely acknowledged that the physical universe is unpredictable. In computer science this unpredictability, modeled as access to randomness, turns out to be an enabling feature in algorithm design, cryptography and distributed computing. For example, known methods of encrypting sensitive information for transmission over the internet rely crucially on the ability of computers to generate random sequences, and many fast algorithms are randomized algorithms. So it is worthwhile to investigate exactly what can be done with and without randomness, and to identify the minimal assumptions on the randomness under which we can still get the benefits of randomized methods. This is the central question of the area of derandomization: To what extent can we do without the use of randomness in computation?<br\/><br\/>In this project, PI will investigate basic questions related to the theme of derandomization towards the goals of showing that (1) every randomized polynomial time algorithm can be simulated by a deterministic algorithm, that (2) every randomized algorithm with small memory can be simulated by a deterministic algorithm using small memory, and that (3) cryptography can be achieved even with defective sources of randomness. Besides being involved in graduate and undergraduate teaching around the subject of the proposal, the PI will organize reading groups, participate in efforts to recruit from underrepresented groups, and be involved in projects to increase graduate recruiting at education at the high school level.","title":"CAREER: Extractors, Pseudorandom Generators, and Other Explicit Constructions","awardID":"1149637","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[502165],"PO":["565157"]},"194642":{"abstract":"This award provides travel support to U.S.-based students to attend the 2012 IEEE International Conference on Data Engineering (ICDE 2012), and to enable them to participate in a career mentoring forum to be held as part of the main conference. The conference will be held in Washington (DC), USA from April 1-5, 2012 (http:\/\/www.icde12.org). This conference provides a venue for researchers who are addressing problems in designing, building, managing, and evaluating advanced data intensive systems and applications. It is a leading forum for researchers, practitioners, developers, and users to explore cutting-edge ideas and to exchange techniques, tools, and experiences. It provides an ideal setting for students to learn about the state-of-the-art research in the field by hearing outstanding invited speakers and attending tutorials. There are seven focused workshops and six topic-specific tutorials that will be held in conjunction with the main conference.<br\/><br\/>In the past decade, data has exploded in its availability. There has been a rise in the number of data-rich sciences and application domains, such as social network analysis, bioinformatics, computational biology, link analysis, counterterrorism and security. The attendance of ICDE 2012 will expose students to cutting-edge research and to relevant applications in a variety of domains. Participation in the premier research conferences ICDE is an integral component of the training of Ph.D. students in data engineering. The conference is aimed at providing an opportunity for Ph.D. candidates to present their work and receive constructive feedback and mentoring from established researchers in data engineering. Such feedback and mentoring is expected to improve the quality of the students thesis research. Similarly, students recipient of a travel award will be able to attend technical sessions, plenary talks, panels, tutorials and workshops. Participants will interact with peers who share similar interests from other universities, as well as hundreds of leading researchers from around the world. This experience will be fruitful towards the shaping of their future research endeavors. Both the student forum and travel awards will also help broaden the representation of women and members of underrepresented minority groups within the Data Engineering research community. Details of the student activities will be posted at http:\/\/www.icde12.org\/nsf-fellowships\/.","title":"Career Mentoring Forum and Student Travel Support for 2012 IEEE International Conference on Data Engineering (ICDE)","awardID":"1228466","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[521347,521348,"565089"],"PO":["563751"]},"188604":{"abstract":"The objective of the REU Site at UNC Charlotte is to implement effective practices to engage a diverse<br\/>group of undergraduate students in computing research. Undergraduate students will actively pursue<br\/>research that applies human-computer interaction (HCI) concepts to advance the state of the art in a<br\/>particular field, including pervasive computing, computer vision, data visualization, social networks, and<br\/>serious games. Each research project has a socially relevant theme, providing students with the<br\/>opportunity to apply and extend their computing knowledge to address problems that have a real-world<br\/>impact. The site emphasizes participation of promising students from underrepresented groups in<br\/>computing and from institutions that have limited research programs. To help students become rapidly<br\/>immersed in the culture of research and to prepare them for meaningful research experiences, the site<br\/>cultivates an authentic community of practice that values the contributions of REU students as<br\/>researchers, and provides REU participants with explicit, just-in-time training in research skills at a<br\/>weekly workshop.<br\/><br\/>The intellectual merit of this project lies in the REU students? contributions to the discovery and<br\/>evaluation of innovative, interactive computing solutions to address problems of interest in society;<br\/>specific projects may address open problems in the fields of computer vision, pervasive computing, data<br\/>visualization, social networks, and serious games. The broader impact of this project lies in the<br\/>opportunity to introduce talented students from underrepresented populations to computing research and<br\/>in the potential to increase the enrollment of domestic students in doctoral computing programs.","title":"REU Site: Exploring Human Centered and Socially Relevant Interactive Technologies in Computer Vision, Visualization, Pervasive Computing, Serious Games, and Social Networks","awardID":"1156822","effectiveDate":"2012-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}}],"PIcoPI":["530659","561854"],"PO":["563751"]},"187317":{"abstract":"Making contact with a person's body is critical to many of the most important caregiving tasks for people with physical disabilities. During these tasks, the forces applied by the robot to the body of the human client (care recipient) are of central importance. Yet robots are currently ignorant of what forces are appropriate for common tasks, and what forces are appropriate when making contact with different locations on the client's body. In this project, the PI's goal is to endow assistive robots with the ability to use appropriate forces when haptically interacting with people. To this end, he will capture and statistically model the forces applied when a person performs assistive tasks for him or herself, or provides care to another person. He will enable robots to intelligently regulate the forces they apply when performing assistive tasks, so that the applied forces are comparable to those used during human-human interactions. And he will enable clients to effectively control the forces applied by a robot during assistive tasks. Throughout the research, the PI will conduct experiments to test relevant hypotheses: That the type of task and the pose of the tool relative to the client's body are highly predictive of the force applied by a human caregiver; That when performing tasks on a mannequin, the robot will successfully emulate the forces observed during human-human interaction; That when the robot applies force to the client's body, the client will prefer that the robot use knowledge of the task and the pose of the tool to interpret user commands rather than a constant mapping. Because a person's ability to perform activities of daily living (ADLs) is highly predictive of his or her ability to live independently, the work will focus on four representative ADL tasks that require contact with the client's head: feeding a person yogurt, wiping a person's face, brushing a person's hair, and shaving a person with an electric razor. Project outcomes will include a system that enables a PR2 robot from Willow Garage to assist people with severe physical disabilities with these four tasks; the PR2 will be modified to have force-torque sensors at its wrists, specialized tools, and a Kinect 3D sensor on its head.<br\/><br\/>Broader Impacts: This research will begin to endow robots with a crucial form of \"common sense\" while quantitatively analyzing and synthesizing haptic interaction in the context of humans' most basic needs. It will also lead to a better understanding of human-robot interaction when the robot initiates contact with the user, and will contribute to data-driven methods for intelligent control. The PI will publish extensively and will release open source code, so that the work can catalyze progress towards robots that could empower millions of people to live more independently with a higher quality of life. The PI will directly involve people with disabilities in the research, and will actively engage the broader community by participating in events such as the RESNA conferences and the Atlanta Abilities Expo. In addition, he will incorporate research results in his biomechanics class and graduate course on haptics, and will then adapt the material to teach people around the world about these topics and robotics using the methods and tools of Khan Academy (http:\/\/www.khanacademy.org\/).","title":"CAREER: Haptic Interaction for Robotic Caregivers","awardID":"1150157","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[502390],"PO":["565227"]},"187229":{"abstract":"In the last ten years virtual machines (VMs) have been extensively used for security-related applications, such as intrusion detection systems, malicious software (malware) analyzers and secure logging and replay of system execution. A VM is high-level software designed to emulate a computer's hardware. In the traditional usage model, security solutions are placed in a VM layer, which has complete control of the system resources. The guest operating system (OS) is considered to be easily compromised by malware and runs unaware of virtualization. The cost of this approach is the semantic gap problem, which hinders the development and widespread deployment of virtualization-based security solutions: there is significant difference between the state observed by the guest OS (high level semantic information) and by the VM (low level semantic information). The guest OS works on abstractions such as processes and files, while the VM can only see lower-level abstractions, such as CPU and main memory. To obtain information about the guest OS state these virtualization solutions use a technique called introspection, by which the guest OS state is inspected from the outside (VM layer), usually by trying build a map of the OS layout to an area of memory where these solutions can analyze it. We propose a new way to perform introspection, by having the guest OS, traditionally unaware of virtualization, actively collaborate with a VM layer underneath it by requesting services and communicating data and information as equal peers in different levels of abstraction. Our approach allows for stronger and more fine-grained and flexible security approaches to be developed and it is no less secure than the traditional model, as introspection tools also depend on the OS data and code to be untampered to report correct results.<br\/><br\/><br\/>We will design, implement and make available to the research community this collaborative architecture between a guest OS and a VM layer and employ such architecture to counter various types of kernel-level malware. The goal is to increase the cost for attackers by refining trust\/integrity values for subjects and objects at OS\/VM layers by leveraging social trust. In this architecture guest OS and a VM actively collaborate requesting services and exchanging data and information through special instructions protected from tampering. This will open up possibilities for malware analysis and defense that are not currently possible (due to the semantic gap problem) including, preventing the actions from privacy-invasion malware like keyloggers, mitigating certain types of DoS attacks in the kernel and return-oriented rootkits, increasing the costs for attackers by leveraging social trust to refine integrity levels and restrict systems resources based on them, just to name a few. This research will also lead to the creation of a cyber security laboratory at Bowdoin, a liberal arts college located in Maine.","title":"CAREER: Bridging the Semantic Gap in Virtualization-based Security Solutions via Collaboration between Guest OS and Virtual Machine","awardID":"1149730","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[502211],"PO":["564388"]},"187900":{"abstract":"This project, investigating active building facades that proactively contribute to energy conservation by changing their opacity and air permeability as a function of environmental and user parameters, promises to contribute strongly to both the cyber and physical sciences. Often energy is wasted when parts of a building are heated or cooled, but are not actually used, or when they are actively cooled if simply opening a window would suffice. The proposed \"Self-Organizing Amorphous Facades\" (SOAF) consist of a large number of identical cells that can each change their opacity and air permeability, sense light, temperature, and occupancy, and communicate with each other in a distributed collective. For complex cyber physical systems, this promises to provide a novel design methodology that is potentially applicable to a large class of systems and, therefore, will result in foundational knowledge of use to the community at large. This high-risk, high-reward project integrates ideas from computer science and engineering, with a little human physiology and environmental science thrown in, to develop new theoretical foundations for the design, validation, and improvement of coordination strategies for multi-agent robotic systems.<br\/><br\/>The project's intellectual merit lies in novel algorithms that allow one to take advantage of distributed computation to drastically reduce the dimensionality of the data coming from the system, and novel algorithms that turn low-dimensional control data to the system into high-dimensional control signals. In particular, this research focuses on distributed algorithms that can identify regions that share similar spatio-temporal data, distributed algorithms that recognize patterns and gestures in spatio-temporal data sets, and distributed algorithms that automatically derive distributed policies for global control signals on temperature and light.<br\/><br\/>Broader Impacts: The direct impact of this project will be huge potential reduction in the energy footprint of modern buildings by active lighting and ventilation control. A related impact is the introduction of novel ways of using space using truly reconfigurable walls. Due to its interdisciplinary nature spanning computer science and civil engineering together with its positive environment implications, this project is likely to be attractive to students with a broad range of backgrounds and interests. It will lead to educational modules that let students explore energy, heat transfer and solar gains in a building using sensors, wireless technologies, and algorithms, and introduce students to the challenges of complex cyber-physical systems. The PI proposes outreach to women and minorities and suggests a novel mechanism of comic distribution via HowToons.com that will make technical results and environmental impact of CPS accessible to a wide audience.","title":"EAGER: Centralized Control of Large-Scale Distributed Sensor\/Actuator Networks: Self-organizing Amorphous Facades","awardID":"1153158","effectiveDate":"2012-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[503668,"520181"],"PO":["564069"]},"188517":{"abstract":"This funding renews a highly-successful CISE Research Experiences for<br\/>Undergraduates (REU) site at the University of Alabama Tuscaloosa. This<br\/>site focuses on empirical software engineering and its projects span<br\/>several exciting areas of inquiry, including text retrieval based<br\/>feature location, code clone evolution, software engineering techniques<br\/>and tools for computational science & engineering, and open-source<br\/>developer communities.<br\/><br\/>This REU site will allow 30 students (over three years) to experience<br\/>Software Engineering research. Participating students will attend<br\/>research training and professional development seminars. Students will<br\/>have the opportunity to submit their research to quality conferences and<br\/>to present their work, if accepted. The project team is committed to<br\/>including under-represented minority students in their research. Thus<br\/>this project has the potential to produce new computer science graduate<br\/>students and faculty members and to advance discovery and understanding<br\/>while promoting learning.","title":"REU Site: Empirical Software Engineering","awardID":"1156563","effectiveDate":"2012-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["551799","543615"],"PO":["564588"]},"194754":{"abstract":"This project initiates a collaboration between two labs at Carnegie Mellon University (the Manipulation Lab and the Personal Robotics Lab), and the Intelligent Autonomous Systems Laboratory at the Technische Universitat Munchen. (The German participant costs are supported by their own funds.) By sharing ideas and technology, and by exchange of visits between PIs and students, the project is accelerating progress in autonomous mobile manipulation in human environments. The labs have complementary strengths and the project is expected to benefit both sides.<br\/><br\/>This project aims to expand the applications of robotics to include autonomous manipulation in human environments. As this technology is refined and ultimately commercialized, it will expand the impact of robots, as well as transform the robotics industry. Likely applications include eldercare, assisting the disabled, and rehabilitation, which are of great significance both economically and in the quality of our lives.<br\/><br\/>The project directly supports the education of graduate students, and scientific communication and collaboration across the Atlantic. Recruiting and outreach associated with the project will continue the PIs' tradition of inclusion of underrepresented groups. When appropriate, results will be incorporated into course curricula and in the PIs' ongoing outreach efforts. Code will be distributed open-source.","title":"EAGER: Building Intelligent Mobile Manipulators for Assistive Care","awardID":"1228906","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":[521687,"560864"],"PO":["562760"]},"193711":{"abstract":"This award supports the participation (travel, lodging, registration) of doctoral students from U.S. universities in the Doctoral Consortium of the 22nd International Conference on Automated Planning and Scheduling (ICAPS-12) to be held June 25-29, 2012, in Sao Paulo, Brazil. The Doctoral Consortium will be comprised of two parts: (1) a one-day session the day before the conference begins that will include invited talks on research skills and career development, student presentations, and mentor-led focus groups; and (2) a poster session to be held during the conference. The objective of the Doctoral Consortium is to provide an opportunity for Ph.D. students who are doing dissertation research on topics related to AI Planning and Scheduling to present their research and to receive feedback on it from established researchers as well as other students and conference attendees. It is intended to give participants valuable exposure to outside perspectives at a critical time in their research and to provide a setting in which to explore career objectives. This award will support the participation of approximately 8 U.S.-based students. Participants will be selected through an application process that includes review of submitted materials including an extended dissertation abstract and CV; an assessment of the benefit of participation to the applicant; and the stage of the participant's doctoral research. The travel stipends will allow the selected students to present their research results and participate in valuable discussions that will likely shape the future of this critically important field. The technical program is complemented with an array of workshops, tutorials, and other events. The wide variety and significance of the topics typically presented at ICAPS, in the technical and other programs, provides opportunities for students to share, exchange, and learn from each other.","title":"IIS-RI: ICAPS-2012 Doctoral Consortium Travel Awards","awardID":"1219419","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563502"],"PO":["565035"]},"194624":{"abstract":"The Global Environment for Network Innovations 'GENI' is a suite of research infrastructure supported by the NSF that is rapidly emerging in prototype form across the United States. GENI aims to transform experimental research in networking and distributed systems, as well as emerging research into very large socio-technical systems, by providing a suite of infrastructure for 'at scale' experiments in future internets.<br\/><br\/>The GENI Project Office organizes three major GENI Engineering conferences (GEC) per year, in which the entire GENI community meets to review current status, and to decide on subsequent steps in GENI's evolution. These GECs include community-based working groups leading GENI's design and planning, and demonstrating progress with live experiments.<br\/><br\/>UCLA is hosting the thirteenth edition of the GENI Engineering conference. This project supports organizing the demo session to be held on the UCLA Campus. About 400 leading researchers and Ph.D. students from diverse US institutions will gather at UCLA to showcase their ideas and results. The Campus Technology Services will fit the venue to support high speed networking experiments both wired and wireless. In particular, a 10GB link will be enabled and each demo will be provided with 1G wired connection. The venue will be also connected to the National Lambda Rail (NLR) and Internet2 Interoperable On-demand Network (ION) network infrastructures thus enabling researchers and practitioners to access all the GENI sites nationwide. Each GEC 13th participant will be issued temporary campus-wide wireless credentials that will grant access to the campus wireless infrastructure and commodity Internet for the duration of the event. Furthermore, 4G wireless connectivity will be made available through the GENI-WiMax infrastructure.<br\/><br\/>Broader Impact: The GEC Demo sessions provide graduate students with both an opportunity to demonstrate and explain their work to the GENI community prior to formal publication. It helps new graduate students understand what is being done with GENI and encourages cross-university cooperation by providing a method for students and faculty to discover who amongst their peers at other institutions might be valuable resources. It also supports outreach to new community members, including the emerging US Ignite community.","title":"Participant Support and organization of the technical demonstrations for the NSF-GENI GEC13th at UCLA.","awardID":"1228390","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["558959","531473"],"PO":["564993"]},"194558":{"abstract":"This proposal is to develop a general representation framework that uses similarity to capture relationships in large scale image collections. The representation is not restricted to any specific distance function, feature, or learning model. It includes new methods to combine multiple kernels based on different cues, learn low-rank kernels, and improve indexing efficiency. In addition, new methods for nearest neighbor search and semi-supervised learning are proposed. It has relevance to machine learning and computer vision research agendas. Two major research problems addressed are: (1) defining and computing similarities between images' in vast, expanding, repositories, and representing those similarities in an efficient manner so the right pairs can be retrieved on demand; and (2) developing a system that can learn and predict similarities with 'sparse supervisory information and constantly evolving data.' The approach is notable in its embrace of the scale of web archives and its use of verbal and visual means of analysis.","title":"CAREER: Similarity-based Representation of Large-scale Image Collections","awardID":"1228082","effectiveDate":"2012-03-01","expirationDate":"2014-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["541984"],"PO":["563751"]},"186739":{"abstract":"In the real world, visual objects commonly block, or occlude, each other from view. Very little is known about how the brain makes up for the missing information about an occluded object and recognizes it nonetheless. This project will help elucidate the mechanisms by which the brain recognizes occluded objects using neurophysiological methods and will determine what individual cells in the relevant brain regions do when the brain recognizes an occluded object. The study will also help characterize which tell-tale features in the visible portions of an occluded object the brain uses for this purpose, and how it uses them. For example, someone's eyes may serve as a dead give-away for them, thus the brain may use this information about the eyes to recognize that person, even when the rest of the face is occluded. Given the ubiquity of occluded objects in the real world, understanding how one perceives occluded objects is critical to understanding, in a larger sense, how the brain works. This research will also facilitate the development of better machine-vision tools, so as to help computers better recognize objects of interest in the real world.<br\/><br\/>This project also has a significant educational component. For example, classroom courses and hands-on research experience opportunities will not only impart scientific knowledge, but also help students develop an active interest in pursuing careers in science and technology. Undergraduates and graduate students from the Investigator's institution as well as from many other local colleges and universities will participate in this project, providing additional opportunities for students. The results, resources, and tools generated by this project will be made publically available on the Investigator's website at http:\/\/www.georgiahealth.edu\/medicine\/discovery\/bbdi\/hegde.","title":"Recognition of Occluded Objects as Statistical Inference: A Neurophysiological Study in Awake, Behaving Monkeys","awardID":"1147097","effectiveDate":"2012-03-15","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"7713","name":"ACTIVATION"}}],"PIcoPI":[501039],"PO":["562694"]},"208188":{"abstract":"This potentially transformative study will investigate how players in a Massively Multi-player Online (MMO) game - specializing in social challenges, crafting, and trading - use trust in order to accomplish tasks and collaborate with other players. This is the first time a game of this kind has been evaluated. Most MMOs that have been studied, such as World of Warcraft and EverQuest, evaluate trust and collaboration of players engaged in battles or battle planning, rather than peaceful and constructive purposes. This research employs a well-established but rather unique game that primarily focuses on a wide array of social challenges and tests. It is called \"A Tale in the Desert\" (ATITD), in which each player controls the avatar of an ancient Egyptian. ATITD is the ideal choice for this research because of the strong social aspect inherent in the game. <br\/><br\/>Both because the game creators have agreed to cooperate, and because ATITD incorporates databases such as a constantly updated census and extensive information about all players and their overlapping group memberships, the research will have access to fine grained data of players' actions, chats, and memberships in guilds, marriages and bureaucracies. Starting with an initial set of hypotheses of what data will be analyzed, the research team will then able to iteratively choose more data on the basis of early discoveries. To address the issues involved in human-agent interaction, this study of trust and collaboration is very important. Information obtained in this study can be used in future work to create agents to interact with human players in ATITD and other virtual environments. <br\/><br\/>In addition to log data from the game, this research will also collect standard psychological measures of individual players, using a voluntary questionnaire, including the Extroversion scale from the Big Five Inventory, the Trust-Suspicion Scale, and the Empathy Quotient. Of particular interest will be to learn if the psychological factors predict how well individuals interact with other players in the game. Game play data will be analyzed to identify specific behavioral patterns related to the central themes of trust and collaboration, and, conversely, betrayal and competition. The research will also gather data from ATITD about how the players trust and collaborate with each other, using data mining techniques, interviews of players, and examination of wikis created by players. <br\/><br\/>Studying the nature of trust and collaboration in 3D virtual communities will be of great interest to game designers, as well as to the research community of computer-mediated environments. The information gained from this study we will be the basis for detailed suggestions on how to improve trust and collaboration in an MMO. Methods also will be developed to detect untrustworthy behavior happening in the game and flag it. Data gathered from ATITD will be useful for creating agents that interact with human players, and for designing educational activities that exploit the unique opportunities for student collaboration offered by virtual worlds like A Tale in the Desert.","title":"HCC: EAGER: Trust and Collaboration in 3D Virtual Communities","awardID":"1338580","effectiveDate":"2012-03-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[557889],"PO":["564456"]},"187280":{"abstract":"This project, developing a new motion planning framework for medical robots that combines automatic planning algorithms, robot control, and human oversight to enable new and safer robotic procedures that are beyond current clinical capabilities, will increase the autonomy of surgical robotic systems. This framework will result in improved speed, accuracy, and precision of existing procedures and enable entirely new classes of procedures that require dexterity and control beyond the capability of a human operator. <br\/><br\/>The funding of this proposed work will introduce and evaluate a new motion planning framework that simultaneously addresses the challenges of deformations, uncertainty, and optimality that arise in medical applications. The research will combine ideas from multiple areas of computer science and engineering, including robotics, computer graphics, finite element methods, optimization theory, Markov decision processes, stochastic modeling, and learning from demonstrations. Expected scientific contributions include new motion planning algorithms that efficiently integrate physically-based simulation, motion planning under uncertainty, and sensor placement, as well as new approaches to integrate user input into feedback-based motion planning. In the long term, these contributions may lead to new avenues of research at the intersection of motion planning, anatomy and biomechanical modeling, learning from demonstrations, and medical robotics.<br\/><br\/>Broader Impacts: A motion planning framework for medical robots will improve patient care and the resulting increased autonomy will reduce surgical errors -- which currently contribute to 1 in 10 post-surgical deaths -- by enabling physicians to focus on high-level tasks rather than low-level motion control. The application of this framework to prostate interventions, lung biopsies, and neurosurgery could affect hundreds of thousands of people annually and have broad societal impact. The ability of computer science to improve healthcare may attract new students to computer science who might previously not have been interested in the field, particularly women and underrepresented groups. The PI will develop new outreach activities centered around an interactive game-like simulation of medical procedures that highlights the impact that computer science can have on medicine, create a new undergraduate course for pre-meds to teach future physicians crucial computer science concepts, and revamp the robotics curriculum to create excitement through labs and provide students with the skills necessary to pursue a career in America's growing healthcare and service robotics industries.","title":"CAREER: Toward Automating Surgical Tasks","awardID":"1149965","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["562687"],"PO":["564069"]},"187192":{"abstract":"Rapid advances in transistor technology combined with innovations in computer architecture have led to manycore processors, which can deliver significantly higher software performance. Getting scalable performance (for example, eight times speedup in program execution time on an eight-core processor) is a challenging task even for experienced software developers. This is because parallel programs can suffer from performance problems that either do not exist in sequential applications or that are aggravated by parallel execution. Also, power consumption of manycore applications is a crucial factor limiting their widespread adoption. Unfortunately, analyzing manycore applications for performance and power using just software tools presents challenges due to programs written in multiple languages and source files, libraries in binary-only form, and so on. An efficient hardware-software framework, that can offer insight into performance and power profiles of software execution and subsequently facilitate remediation mechanisms to overcome the observed program bottlenecks, would be a valuable step toward realizing the promise of manycore computing. <br\/><br\/>This research project explores a transformative hardware-software cooperative solution, where the software receives an introspective look into the hardware behavior and dynamically deploys remediation mechanisms to boost performance and lower the power consumption in manycore applications. This hardware-software approach is drastically different from the conventional hardware-level optimization techniques that can no longer automatically guarantee performance scalability, given the increasing diversity and complexity of manycore applications. The outcomes of this project can be used both in software development and education to more precisely understand the manycore application behavior. On a broader level, this introspective framework can boost programmer productivity by offering fast and more accurate feedback about the program execution, and effectively improving the software development cycle.","title":"CAREER:An Introspective Architecture for Manycore Performance and Power Debugging","awardID":"1149557","effectiveDate":"2012-03-15","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[502137],"PO":["366560"]},"189282":{"abstract":"The University of Maryland, Baltimore County will gather data about the status of Computer Science education in Maryland high schools and build relationships among high school teachers, community college and university faculty, and state education administrators to facilitate and increase state-level support for lasting improvements to computing education. Despite the overall success of the K-12 education system in Maryland, opportunities to study computer science vary tremendously among the 24 school systems and approximately 200 high schools in the state. This disparity can be attributed to several factors, including the lack of a state-mandated computer science high school graduation requirement, the fact that there is no state-required teacher certification in the discipline, the absence of a standardized computer science curriculum, and barriers to entry for girls and underrepresented minorities.<br\/><br\/>In this CE21 Planning project, the interdisciplinary team at UMBC will focus on two main goals: (1) performing an assessment of the current state of high school computer science in each of the 24 Maryland school systems and (2) increasing knowledge about national issues associated with computer science education among high school and state administrators in Maryland, through state-wide summit meetings for teachers, administrators, and higher education faculty. The longer term objective of this work is to develop curriculum and teacher development programs that will improve the quality, breadth, and student diversity of computer science education in Maryland.","title":"Planning: CE21 Maryland - Building Community and Knowledge to Increase Statewide Support for Computing Education","awardID":"1160624","effectiveDate":"2012-03-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["557845","558297",507476],"PO":["560704"]},"188492":{"abstract":"This funding establishes a new CISE Research Experiences for Undergraduates<br\/>(REU) site at Utah State University. The project, called<br\/>Bug Wars, exposes students to research on software testing and AI<br\/>planning through both competition and collaboration. This project will<br\/>create new knowledge about user-session-based testing, model-based<br\/>testing with AI planning, and the combination of these two techniques<br\/>as applied to web applications. A novel feature of this REU is that<br\/>it encourages both competition and collaboration. The students initially<br\/>split into two teams that strive to find the most faults in web application<br\/>systems under test. One team collects, reduces, and prioritizes<br\/>user-session-based test suites. A second team uses machine learning to<br\/>build models of the software and AI planning to generate test suites.<br\/>Students compete to show the merits of their approach on the same systems<br\/>by considering the sizes and fault detection effectiveness of their<br\/>test suites. The students then critically discuss their work and propose<br\/>combining the different approaches to further improve effectiveness. <br\/><br\/>The broader impacts of this research are that twenty-four students over a<br\/>three-year period have the opportunity to participate in a supportive<br\/>environment that encourages them to pursue graduate studies in Computer<br\/>Science. The students are better prepared for graduate school as they gain<br\/>basic research skills, including the formulation of research questions,<br\/>design of experiments, critical evaluation, and written and oral<br\/>communication.","title":"REU Site: Bug Wars: A Collaborative Software Testing Research Experience for Undergraduates","awardID":"1156487","effectiveDate":"2012-03-01","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[505404,"538414"],"PO":["523800"]},"195280":{"abstract":"This award supports participation of U.S.-based doctoral students in the 16th SIGART\/AAAI Doctoral Consortium to be held July 22-23, 2012 in Toronto, Ontario, Canada in conjunction with the Twenty-Sixth Conference on Artificial Intelligence (AAAI-12), to be held July 22-26. This award provides travel stipends for 12 student participants as well as mentoring lunches, a group dinner, and a poster session. The participants will be selected on the basis of a packet of submitted materials that include a summary of thesis research; a curriculum vitae; and a letter of recommendation from the Ph.D. advisor.<br\/><br\/>The Doctoral Consortium will extend over two days and will include participant presentations, panel discussions, feedback to participants from assigned mentors, informal discussions (over lunch and during breaks), a group dinner for students and mentors, and a poster session. Each participant will give a 20-minute presentation that will be followed by 20 minutes of discussion led by an assigned mentor to provide feedback on the research and the presentation itself. To help the participants make the transition from being graduate students to launching a successful research program, there will be two panel discussions on relevant career issues: a panel of researchers who have completed their Ph.D.s within the last 5 years will focus on how to finish a dissertation and conduct a job search; and a panel of senior researchers from academia and industry will focus on establishing research funding and presenting oneself during the job search process. In addition, there will be a third panel that will further address issues on research, careers, and funding. All of these activities are in furtherance of the overarching goal of supporting the emerging next generation of researchers. The activities planned for the Doctoral Consortium have significant Intellectual Merit in that they strengthen the scientific quality of the participants' doctoral dissertation projects and provide valuable exposure to additional perspectives on their work at a critical time in their research endeavors and professional development. The Doctoral Consortium has potential for significant Broader Impact by furthering the education of the next generation of scientists, broadening participation in Robust Intelligence research, for instance, by including those from at institutions without strong programs in this area, and by fostering energetic scholarship and collaboration throughout all sectors of the community.","title":"AAAI\/SIGART 2012 Doctoral Consortium","awardID":"1231683","effectiveDate":"2012-03-15","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[523503],"PO":["565035"]},"195192":{"abstract":"This award supports participants to EAAI-12, the Third Symposium on Educational Advances in Artificial Intelligence. EAAI-12 will be collocated with the Twenty-sixth AAAI Conference on Artificial Intelligence (AAAI-12), to be held July 22-26, 2012, in Toronto. EAAI will be held on July 23 and 24. The goals of EAAI-12 are to expand the educational relevance of and benefits to researchers, educators, graduate students, and all others who may be interested within the field of Artificial Intelligence (AI). <br\/><br\/>EAAI-12 provides a venue for researchers and educators to discuss pedagogical issues and share resources related to teaching AI and using AI in education across a variety of curricular levels (K-12 through postgraduate training), with a natural emphasis on undergraduate and graduate teaching and learning. Materials to be presented, discussed, and shared by participants include: model AI assignments with innovative ready-to-adopt materials; syllabi, project ideas and pedagogical strategies related to teaching AI; multi-disciplinary curricula highlighting the use of AI in other contexts (e.g., computational biology, cognitive science, computational economics, philosophy); and resources for teaching specific subareas or topics within AI (e.g., machine learning, game playing, natural language processing, robotics, computer vision). There will be a keynote lecture discussing recent experience with on-line AI classes at Stanford University. The EAAI symposium will seek to make available contributions from the symposium. Intellectual Merit and Broader Impacts of EAAI-12 include enhancements to the teaching, learning, and understanding of AI, the fostering of stronger research in AI, and increased participation of talented researchers and teachers in AI and more widely those in Computer Science and STEM disciplines.","title":"EAAI-12: The Third Symposium on Educational Advances in AI","awardID":"1231124","effectiveDate":"2012-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["562335"],"PO":["565035"]},"187261":{"abstract":"The atomic force microscope (AFM) is an instrument that allows the interrogation and manipulation of matter at the atomic scale and has revolutionized science and engineering. AFM based nano-interrogation includes, topographic imaging where one is interested in recreating an image of a sample, and material characterization where one wishes to determine intrinsic material properties. The primary drawback of AFMs is their low speed especially when interrogating soft matter, e.g., polymers and biological samples. This research involves the study of advanced signal processing algorithms that will allow simultaneous topographic imaging and materials characterization at ultra-high speeds and high fidelity. This will significantly accelerate the knowledge discovery process in domains such as material science, where the focus is often on fast evaluation of new materials. The investigator will promote cross-fertilization of ideas between the signal processing and the AFM communities by organizing joint workshops. The findings will be integrated into the curriculum via lab components and modules.<br\/><br\/>The AFM uses a cantilever with a sharp tip that deflects based on inter-atomic forces; interrogation is performed by sensing and interpreting this deflection signal. This research focuses on the dynamic mode operation (the preferred mode for interrogating soft material), where the cantilever is typically excited sinusoidally and gently taps the medium. Current methods work by analyzing the steady state cantilever trajectory and are fundamentally limited in speed by the time-constants of the cantilever dynamics. This research will study order-of-magnitude improvements in speed by leveraging (a) the systems viewpoint and (b) newer AFM techniques such as multi-frequency excitation. Signal processing algorithms for simultaneously detecting topographic features and\/or material property changes will be studied and exhaustively tested on experimental data.","title":"CAREER: Joint Topographic Imaging and Materials Characterization using Atomic Force Microscopy - a Systems Approach","awardID":"1149860","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["550838"],"PO":["564898"]},"187196":{"abstract":"Scholars have observed that online news and political talk have the potential to promote belief in false or misleading factual claims, frequently attributing this to distinctive characteristics of the Internet such as the absence of gatekeepers, the freedom to screen out disagreeable evidence, and personalization systems that shield news consumers from uncomfortable truths. However, these mechanisms are largely speculative, and do not align well with existing data. This project moves toward a theoretically grounded and empirically tested understanding of political misperceptions in the Internet era. <br\/><br\/>Hypotheses focus both on broad effects associated with use of online news media, and on the mechanisms through which these effects occur. Specifically, a series of media-effects hypotheses address the prevalence and consequences (1) of partisan bias in media exposure decisions, (2) of the use of social media as a source of political news, and (3) of automated (and often invisible) personalization technologies that shape what online news consumers see. A second more nuanced set of predictions concerns how these technologies could lead individuals to be more likely to accept as true inaccurate political information. These hypotheses link the attributes of the technologies in question with established theoretical work on processing fluency, affect, and biased assimilation. <br\/><br\/>To test the hypotheses, the study will pair multi-wave surveys of representative samples of Americans with a series of controlled experiments designed to evaluate the specific mechanisms theorized. A three-wave survey will be conducted in year one, and a two-wave survey in year five, corresponding with U.S. Presidential elections. Measuring respondents' use of various online political news sources and services in early waves, and assessing respondents' store of political knowledge and misperceptions in later waves will provide clear evidence concerning the consequences of using these Internet technologies. The first survey will also include an embedded experiment in order to test the influence of processing fluency in the field. A series of interrelated experiments will be conducted in the intervening years. Year two will focus on testing the influence of metacognitive experiences, such as processing fluency, on the acceptance of false information and factual corrections. In year three the emphasis will be on affect, testing the influence of emotional responses to political claims on individuals' assessments. Year four experiments will focus on biased assimilation as it informs credibility effects, and on the relative importance of institutional trust and individual judgment on participants' beliefs. <br\/><br\/>The datasets will be shared with students and other scholars, further enhancing the impact of the research endeavor. A new undergraduate course, intended to help students become more informed consumers of political information, will be based on the theoretical and empirical work coming out of this research. Public outreach, communicating key lessons concerning the sources and remedies of political misperceptions to journalists and the broader public, as well as publications in scientific venues, will raise awareness of effective strategies for assessing political information.","title":"CAREER: Information Misperceptions in the Internet Era","awardID":"1149599","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["145884"],"PO":["564456"]},"187263":{"abstract":"The development of robots that work cooperatively with people is of critical importance for industries as diverse as manufacturing, medicine, healthcare, military, and consumer products. Key to this goal is the development of robotic technologies that are adaptable to changing task and user needs. As usability demands change - whether due to modifications in the manufacturing process, the introduction of a new patient, or the relocation to a new home - users with limited technical skills must have the ability to customize the functionality of robotic systems. This project will contribute new theoretical models, techniques and open source implementations that will enable users to effectively communicate high level task knowledge to robots without programming. <br\/><br\/>Intellectual merit: The project will leverage human-robot interaction to improve the efficiency of object recognition, feature selection and policy learning algorithms, as well as develop new techniques for data reuse and algorithm evaluation. Hypotheses will be validated through the development of an innovative dual-reality framework for Internet-scale rapid evaluation and testing. Theories will be tested in two robotic applications areas: home assistance and manufacturing. The outcome of this project will be a domain independent interactive learning framework capable of adaptive object recognition, feature selection and policy learning from brief interactions with a single, non-expert user. <br\/><br\/>Broader impact: The long term goal of this research is to one day make personal robots accessible to everyday people. This research will contribute new theoretical models, techniques and open source implementations that will accelerate the development and adoption of robots that work alongside people. The resulting theories and methodologies for adaptive interactive systems will have potential societal impact beyond robotics, in software systems such as personal computers and mobile devices. To promote research in this area, the investigator will make all developed software components available as open source. The research will also be integrated into courses at the undergraduate and graduate levels, as well as into outreach activities for middle and high school students. The web-based evaluation framework will provide a unique opportunity to educate the general public by providing access to cutting-edge robotic technology and empowering them to contribute to its development.","title":"CAREER: Towards Robots that Learn from Everyday Users","awardID":"1149876","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["549619"],"PO":["565227"]},"187285":{"abstract":"The objective of this project is to lay the foundation for comprehensive real-time monitoring of traffic conditions throughout our urban streets and highways. The end goal: a scalable, model-based sensor fusion system capable of merging data from a large number of heterogeneous and geographically diverse sensors, and maintaining a coherent view of sensed, and inferred, traffic conditions. <br\/>A city-wide, detailed and accurate view of current traffic conditions enables improvements in a wide range of applications in transportation. A key to achieving this goal affordabily is to find ways to extract more information from existing sensor infrastructure. Through collaborations with the City of Chicago, NAVTEQ, GCM Travel and the Chicago Transit Agency, the PI has access to Chicago-area data from sensing modalities including underground magnetic loops as well as bus, city-vehicle and crowd-sourced GPS traces. Complementing these sources are opportunistic video feeds from security, red-light and other traffic cameras, as well as vehicle re-identification based on radio frequency transmitters. <br\/><br\/>With increasing congestion, rising fuel prices, and the threat of global warming, the need for improving the efficiency of our transportation systems has never been greater. Comprehensive sensing and inference of traffic conditions will help travelers make better travel decisions and help traffic engineers identify and fix problems. This project combines research with public service and open-source software development. The PI is partnering with a local high-school to host traffic sensing research interns, and the results from this project are used in a graduate course on transportation sensing at UIC.","title":"CAREER: Sensor Fusion for Multi-Modal Traffic Sensing","awardID":"1149989","effectiveDate":"2012-03-01","expirationDate":"2017-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550764"],"PO":["564778"]}}